{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "408e459b",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "cd479ca3",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-df6ce197ae-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "01c750c8",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Literary Movements and physicists explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the literary movements and the poets. In particular, compare some physicists in terms of discovers, Nobel Prizes and education."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b105e0e3",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q43514`| theory of relativity | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2487b30",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q43514 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of the theory of relativity**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "1. Who invented the theory of relativity? (return the IRI and the label of the inventor).\n",
    "\n",
    "2. Identify the BGP for physicist\n",
    "\n",
    "3. Identify the BGP for Nobel Prize\n",
    "\n",
    "4. Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists).\n",
    "\n",
    "5. Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label). \n",
    "\n",
    "6. Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries ).\n",
    "\n",
    "7. Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "878e9931",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Who invented the theory of relativity? (return the IRI and the label of the inventor)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "12296d1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3847'), ('name', 'Open Library subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4466'), ('name', 'Unified Astronomy Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7305'), ('name', 'Online PWN Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7993'), ('name', \"Treccani's Dizionario di Filosofia ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# Query 1\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "919268d8-001f-4f56-8d36-8a043fd1825d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q937'), ('objName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Query 2\n",
    "\n",
    "# From previous query:\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q43514 => \"theory of relativity\"\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 wdt:P61 ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?obj sc:name ?objName .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e82f2d5",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "0322e579",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inventor', 'http://www.wikidata.org/entity/Q937'), ('inventorName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 3\n",
    "\n",
    "# wdt:P61 => \"discoverer or inventor\"\n",
    "# wd:Q43514 => \"theory of relativity\"\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inventor ?inventorName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 wdt:P61 ?inventor .\n",
    "   \n",
    "   # get the label\n",
    "   ?inventor sc:name ?inventorName .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75f16373",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for physicist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "27c921c2-a82c-43b5-ab08-c3b193795213",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q19350898'), ('oName', 'theoretical physicist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q169470'), ('oName', 'physicist')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 4\n",
    "\n",
    "# Finding anything similar to \"physicist\" related to Einstein.\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?pName,\"physicist\") || REGEX (?oName,\"physicist\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "2f86e401-8804-4e56-bb2e-20aff9d7ebff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('pName', 'field of work'), ('o', 'http://www.wikidata.org/entity/Q18362'), ('oName', 'theoretical physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q19350898'), ('oName', 'theoretical physicist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q169470'), ('oName', 'physicist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('pName', 'participant in'), ('o', 'http://www.wikidata.org/entity/Q63430342'), ('oName', '1. Solvay Conference on Physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('pName', 'participant in'), ('o', 'http://www.wikidata.org/entity/Q63430346'), ('oName', '5. Solvay Conference on Physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q38104'), ('oName', 'Nobel Prize in Physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q38104'), ('oName', 'Nobel Prize in Physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P512'), ('pName', 'academic degree'), ('o', 'http://www.wikidata.org/entity/Q19693354'), ('oName', 'Doctor of Philosophy in Physics')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 4-improved\n",
    "\n",
    "# In Query 4 I searched (FILTER) both prediction and object for 'physicist'.\n",
    "# But since it is supposed that the triple be somthing like \"Einstein is physicist\", searching prediction for 'physicist' is an unnecessary computation load.\n",
    "# Thus it is better to search just object. I improved the Query 4 as this one.\n",
    "# In addition, by changing 'physicist' to '[Pp]ysic]', I found 'Nobel Prize in Physics' that is needed for next task.\n",
    "\n",
    "# Finding anything similar to \"physicist\" related to Einstein.\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?oName,\"[Pp]hysic\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "a956ad43-ef84-4c47-9e87-effc1d2f4acf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q19350898'), ('oName', 'theoretical physicist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16389557'), ('oName', 'philosopher of science')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q121594'), ('oName', 'professor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1231865'), ('oName', 'pedagogue')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15980158'), ('oName', 'non-fiction writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1622272'), ('oName', 'university teacher')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q169470'), ('oName', 'physicist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q170790'), ('oName', 'mathematician')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q205375'), ('oName', 'inventor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('oName', 'writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q37226'), ('oName', 'teacher')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4964182'), ('oName', 'philosopher')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q901'), ('oName', 'scientist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3745071'), ('oName', 'science writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2896489'), ('oName', 'patent examiner')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# Query 5\n",
    "\n",
    "# From query 4 I found that:\n",
    "# wd:Q169470 => 'physicist'\n",
    "# Query 4 is not efficient. I found that Einestein's occupation is physicist, and I knew wdt:P106 as 'occupation' from given tabel. So a better way was ckecking occupation of Einestein.\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P106 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ce8be91d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "943e1534",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q169470'), ('oName', 'physicist')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 6\n",
    "\n",
    "# Note: Binding part of query (wd:Q937 wdt:P106 wd:Q169470 .) is not necessary.\n",
    "# By Query 5 it is founded that:\n",
    "# wd:Q169470 => \"physicist\"\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q169470 as ?IRI) ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P106 wd:Q169470 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q169470 sc:name ?oName .\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16d5c23a",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for Nobel Prize"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "5baff0b1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q38104'), ('oName', 'Nobel Prize in Physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q38104'), ('oName', 'Nobel Prize in Physics')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 7\n",
    "\n",
    "# Finding anything similar to \"Nobel\" related to Einstein.\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?pName,\"[Nn]obel\") || REGEX (?oName,\"[Nn]obel\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "86a519dd-8704-4bcb-bd44-175f1b296d92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q38104'), ('oName', 'Nobel Prize in Physics')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Query 7-improved\n",
    "\n",
    "# In Query 7 I searched (FILTER) both prediction and object for '[Nn]obel'.\n",
    "# But since it is supposed that the triple be somthing like \"Einstein awarded Nobel\", searching prediction for '[Nn]obel' is an unnecessary computation load.\n",
    "# Thus it is better to search just object. I improved the Query 7 as this one.\n",
    "\n",
    "# **** Note that by improving Query 4 (Query 4-improved) I found 'Nobel Prize in Physics', thus Query 7 and Query 7-improved is not necessary.\n",
    "\n",
    "# Finding anything similar to \"Nobel\" related to Einstein.\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?oName,\"[Nn]obel\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "21e8a7fd-b354-430a-a692-df1dcb63010d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q7191'), ('oName', 'Nobel Prize')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107494520'), ('oName', 'physics award')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Query 8\n",
    "\n",
    "# By query 7 I found that:\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# It should be an instance or subclass of Nobel Prize. Let check it.\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 wdt:P31 | wdt:P279 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .  \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d0265c0",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "225ac2be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q7191'), ('oName', 'Nobel Prize')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 9\n",
    "\n",
    "# By Query 8 it is founded that:\n",
    "# wd:Q7191 => \"Nobel Prize\"\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q7191 as ?IRI) ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 ?p wd:Q7191 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q7191 sc:name ?oName .\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "131e4ea8",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "a1771ea2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q39'), ('oName', 'Switzerland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41304'), ('oName', 'Weimar Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q43287'), ('oName', 'German Empire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7318'), ('oName', 'Nazi Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q533534'), ('oName', 'Cisleithania')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 10\n",
    "\n",
    "# wdt:P27 => 'nationality'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "# Let check if by 'nationality' I can find information needed for filtering European countries.\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P27 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "4a820a50-8c62-413d-ae15-bd1dd946cc4c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q3624078'), ('oName', 'sovereign state')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6256'), ('oName', 'country')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Query 11\n",
    "\n",
    "# I am looking for countries. So wd:Q39 ('Switzerland') could be an answer. Lets get sure.\n",
    "# wdt:P31 => instance of\n",
    "# wd:Q39 => 'Switzerland'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q39 wdt:P31 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "969c4944-81be-4a51-837f-d3aa036930b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('pName', \"topic's main Wikimedia portal\"), ('o', 'http://www.wikidata.org/entity/Q6988967'), ('oName', 'Portal:Countries')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pName', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q5621162'), ('oName', 'Template:Infobox country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q10864048'), ('oName', 'first-level administrative country subdivision')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pName', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P17'), ('oName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pName', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P495'), ('oName', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pName', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P1532'), ('oName', 'country for sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pName', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P27'), ('oName', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('o', 'http://www.wikidata.org/entity/Q7275'), ('oName', 'state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('o', 'http://www.wikidata.org/entity/Q231002'), ('oName', 'nationality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2046'), ('oName', 'area')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3067'), ('oName', 'GS1 country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P78'), ('oName', 'top-level Internet domain')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P935'), ('oName', 'Commons gallery')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P30'), ('oName', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2936'), ('oName', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P138'), ('oName', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2852'), ('oName', 'emergency telephone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P47'), ('oName', 'shares border with')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P610'), ('oName', 'highest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P17'), ('oName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P242'), ('oName', 'locator map image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P163'), ('oName', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P37'), ('oName', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P41'), ('oName', 'flag image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P421'), ('oName', 'located in time zone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P625'), ('oName', 'coordinate location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P85'), ('oName', 'anthem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P856'), ('oName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P150'), ('oName', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1465'), ('oName', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1792'), ('oName', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P6'), ('oName', 'head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P209'), ('oName', 'highest judicial authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3024'), ('oName', 'ITU letter code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P36'), ('oName', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P298'), ('oName', 'ISO 3166-1 alpha-3 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2979'), ('oName', 'maritime identification digits')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P474'), ('oName', 'country calling code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1082'), ('oName', 'population')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P38'), ('oName', 'currency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1464'), ('oName', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P463'), ('oName', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1791'), ('oName', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P443'), ('oName', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P297'), ('oName', 'ISO 3166-1 alpha-2 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P299'), ('oName', 'ISO 3166-1 numeric code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1566'), ('oName', 'GeoNames ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P194'), ('oName', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P35'), ('oName', 'head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1081'), ('oName', 'Human Development Index')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3221'), ('oName', 'New York Times topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1622'), ('oName', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3106'), ('oName', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P237'), ('oName', 'coat of arms')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1740'), ('oName', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P832'), ('oName', 'public holiday')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P94'), ('oName', 'coat of arms image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1332'), ('oName', 'coordinates of northernmost point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1333'), ('oName', 'coordinates of southernmost point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1334'), ('oName', 'coordinates of easternmost point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1335'), ('oName', 'coordinates of westernmost point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2853'), ('oName', 'electrical plug type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P402'), ('oName', 'OpenStreetMap relation ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P901'), ('oName', 'FIPS 10-4 (countries and regions)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P984'), ('oName', 'IOC country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P122'), ('oName', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1589'), ('oName', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1125'), ('oName', 'Gini coefficient')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1689'), ('oName', 'central government debt as a percent of GDP')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2988'), ('oName', 'GOST 7.67 cyrillic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pName', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P530'), ('oName', 'diplomatic relation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2670'), ('pName', 'has parts of the class'), ('o', 'http://www.wikidata.org/entity/Q1020994'), ('oName', 'citizen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pName', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1048835'), ('oName', 'political territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q104098715'), ('oName', 'territorial entity type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('pName', 'said to be the same as'), ('o', 'http://www.wikidata.org/entity/Q7275'), ('oName', 'state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pName', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oName', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('o', 'http://www.wikidata.org/entity/Q183366'), ('oName', 'territory')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pName', 'model item'), ('o', 'http://www.wikidata.org/entity/Q183'), ('oName', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('pName', 'maintained by WikiProject'), ('o', 'http://www.wikidata.org/entity/Q8503406'), ('oName', 'WikiProject Countries')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('pName', 'category for eponymous categories'), ('o', 'http://www.wikidata.org/entity/Q5641433'), ('oName', 'Category:Categories by country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q4026570'), ('oName', 'Category:Countries')]\n",
      "81\n"
     ]
    }
   ],
   "source": [
    "# Query 12\n",
    "\n",
    "# Now I am trying to finnd a way for filtering European countries\n",
    "# wd:Q6256 => 'country'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q6256 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   ?p sc:name ?pName .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "ee72aa79-a703-4c8d-a830-5ec514d86c9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q46'), ('oName', 'Europe')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Query 13\n",
    "\n",
    "# Let check if by 'continent' I can filter European countries.\n",
    "# wd:Q6256 => 'country'\n",
    "# wdt:P30 => 'continent'\n",
    "# wd:Q39 => 'Switzerland'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q39 wdt:P30 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   #?p sc:name ?pName .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "decd0327-fb25-415a-bddd-b22d2d8e08f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pName', 'place of birth'), ('o', 'http://www.wikidata.org/entity/Q3012'), ('oName', 'Ulm')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Query 14\n",
    "\n",
    "# It seems that now I have all information needed. \n",
    "# Unfortunately not! Task assignment needs physicist 'born' in Europe. Maybe it was better to find country from where people born. However it is done.\n",
    "# Now I need info for 'born', for example 'birthplace' or something similar.\n",
    "\n",
    "# wd:Q6256 => 'country'\n",
    "# wdt:P30 => 'continent'\n",
    "# wd:Q39 => 'Switzerland'\n",
    "# wdt:P27 => 'nationality'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'\n",
    "# wd:Q46 => 'Europe'\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "\n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   ?p sc:name ?pName .\n",
    "   \n",
    "   FILTER(REGEX(?pName,\"[Bb]irth\"))\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "cef0f8cc-19c0-4944-ab51-07cebf1d497d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q3012'), ('oName', 'Ulm')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Query 15\n",
    "\n",
    "# It seems that now I have all information needed. \n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P19 ?o .\n",
    "\n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   #?p sc:name ?pName .   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "8d14c9c1-be7a-4485-bcca-be13353f618d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('pName', 'located in the administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q8170'), ('oName', 'Tübingen Government Region')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q19180675'), ('oName', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4173137'), ('oName', 'Jewish Encyclopedia of Brockhaus and Efron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q602358'), ('oName', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q97879676'), ('oName', 'Regesta Imperii XIII')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1376'), ('pName', 'capital of'), ('o', 'http://www.wikidata.org/entity/Q8221'), ('oName', 'Alb-Donau-Kreis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1376'), ('pName', 'capital of'), ('o', 'http://www.wikidata.org/entity/Q760200'), ('oName', 'Oberdonaukreis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('pName', 'category for people born here'), ('o', 'http://www.wikidata.org/entity/Q8076649'), ('oName', 'Category:Born in Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('pName', 'category for people who died here'), ('o', 'http://www.wikidata.org/entity/Q9220239'), ('oName', 'Category:Deaths in Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q1713454'), ('oName', 'Jungingen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q2567354'), ('oName', 'Wiblingen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q972566'), ('oName', 'Mähringen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q1813353'), ('oName', 'Lehr')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q1559217'), ('oName', 'Gögglingen-Donaustetten')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q1367467'), ('oName', 'Eselsberg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pName', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q1355936'), ('oName', 'Ermingen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pName', 'country'), ('o', 'http://www.wikidata.org/entity/Q183'), ('oName', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('pName', 'category of associated people'), ('o', 'http://www.wikidata.org/entity/Q9077986'), ('oName', 'Category:People from Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('o', 'http://www.wikidata.org/entity/Q242966'), ('oName', 'Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P190'), ('pName', 'twinned administrative body'), ('o', 'http://www.wikidata.org/entity/Q178531'), ('oName', 'Vidin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P190'), ('pName', 'twinned administrative body'), ('o', 'http://www.wikidata.org/entity/Q1780'), ('oName', 'Bratislava')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P190'), ('pName', 'twinned administrative body'), ('o', 'http://www.wikidata.org/entity/Q1026296'), ('oName', 'Jinotega')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('pName', 'located in or next to body of water'), ('o', 'http://www.wikidata.org/entity/Q159467'), ('oName', 'Iller')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('pName', 'located in or next to body of water'), ('o', 'http://www.wikidata.org/entity/Q1653'), ('oName', 'Danube')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('pName', 'located in or next to body of water'), ('o', 'http://www.wikidata.org/entity/Q562302'), ('oName', 'Blau')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q1187811'), ('oName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q134626'), ('oName', 'district capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q1549591'), ('oName', 'big city')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q2327515'), ('oName', 'city district of Baden-Württemberg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q42744322'), ('oName', 'urban municipality of Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q515'), ('oName', 'city')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q19816359'), ('oName', 'doubled population centers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('pName', 'located in time zone'), ('o', 'http://www.wikidata.org/entity/Q6655'), ('oName', 'UTC+01:00')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('pName', 'located in time zone'), ('o', 'http://www.wikidata.org/entity/Q6723'), ('oName', 'UTC+02:00')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4552'), ('pName', 'mountain range'), ('o', 'http://www.wikidata.org/entity/Q159589'), ('oName', 'Swabian Jura')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q1691932'), ('oName', 'Kommunalverband für Jugend und Soziales Baden-Württemberg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q1768108'), ('oName', 'Climate Alliance')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q1780330'), ('oName', 'Kommunale Informationsverarbeitung Reutlingen-Ulm (KIRU)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q55473342'), ('oName', 'Zweckverband 4IT')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q747279'), ('oName', 'Mayors for Peace')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('o', 'http://www.wikidata.org/entity/Q5413854'), ('oName', 'Eurotowns network')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pName', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q503169'), ('oName', 'Elchingen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pName', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q8221'), ('oName', 'Alb-Donau-Kreis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pName', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q4120'), ('oName', 'Neu-Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pName', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q10410'), ('oName', 'Neu-Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pName', 'archives at'), ('o', 'http://www.wikidata.org/entity/Q28720387'), ('oName', 'Stadtarchiv Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6'), ('pName', 'head of government'), ('o', 'http://www.wikidata.org/entity/Q20770017'), ('oName', 'Gunter Czisch')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('pName', 'located in/on physical feature'), ('o', 'http://www.wikidata.org/entity/Q448881'), ('oName', 'Region Donau-Iller')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('pName', 'located in/on physical feature'), ('o', 'http://www.wikidata.org/entity/Q1622371'), ('oName', 'Hochsträß')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('pName', 'category for maps'), ('o', 'http://www.wikidata.org/entity/Q84130697'), ('oName', 'Category:Maps of Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8402'), ('pName', 'open data portal'), ('o', 'http://www.wikidata.org/entity/Q63429448'), ('oName', 'Open Data city of Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8989'), ('pName', 'category for the view of the item'), ('o', 'http://www.wikidata.org/entity/Q104596494'), ('oName', 'Category:Views of Ulm')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8857116'), ('oName', 'Category:Ulm')]\n",
      "53\n"
     ]
    }
   ],
   "source": [
    "# Query 16\n",
    "\n",
    "# It shows that wdt:P19 returns city. I should find a path from it to country. \n",
    "# wdt:P19 => 'place of birth'\n",
    "# wd:Q3012 => Ulm\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q3012 ?p ?o .\n",
    "\n",
    "   # get the label\n",
    "   ?o sc:name ?oName .\n",
    "   ?p sc:name ?pName .   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "8b7d98eb-2b3f-4aec-8cad-9b6b98ebecef",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q40'), ('country', 'Austria'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q227'), ('country', 'Azerbaijan'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q184'), ('country', 'Belarus'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q31'), ('country', 'Belgium'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q213'), ('country', 'Czech Republic'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q756617'), ('country', 'Danish Realm'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q142'), ('country', 'France'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q183'), ('country', 'Germany'), ('noOfPhysicists', '26')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q28'), ('country', 'Hungary'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q27'), ('country', 'Ireland'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38'), ('country', 'Italy'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q29999'), ('country', 'Kingdom of the Netherlands'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q32'), ('country', 'Luxembourg'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q55'), ('country', 'Netherlands'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q20'), ('country', 'Norway'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q36'), ('country', 'Poland'), ('noOfPhysicists', '7')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q159'), ('country', 'Russia'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q214'), ('country', 'Slovakia'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34'), ('country', 'Sweden'), ('noOfPhysicists', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q39'), ('country', 'Switzerland'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q212'), ('country', 'Ukraine'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q145'), ('country', 'United Kingdom'), ('noOfPhysicists', '22')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# Query 17\n",
    "\n",
    "# Task 4:\n",
    "# Consider physicists born in Europe.\n",
    "# For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists).\n",
    "\n",
    "# It is supposed that 'physicist' means that the 'occupation' of the winner should be 'physicist'.\n",
    "# I do not check if there is any person who won the Nobel Prize in Physics whos occupation is not physicist.\n",
    "# However, if there is any, they should be excluded from the result. Because task is: \"Consider physicists...\"\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wd:P106 => 'occupation'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "# wdt:P30 => 'continent'\n",
    "# wd:Q46 => 'Europe'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?c as ?countryIRI) (?cName as ?country) (count(?s) as ?noOfPhysicists)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth .\n",
    "  ?pBirth wdt:P17 ?c .\n",
    "  ?c wdt:P30 wd:Q46 .\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "29c44bc8-60cc-469c-b741-81a2688013ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q222'), ('country', 'Albania'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q228'), ('country', 'Andorra'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q40'), ('country', 'Austria'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q184'), ('country', 'Belarus'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q219'), ('country', 'Bulgaria'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q224'), ('country', 'Croatia'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q229'), ('country', 'Cyprus'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q213'), ('country', 'Czech Republic'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q756617'), ('country', 'Danish Realm'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q35'), ('country', 'Denmark'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q22880'), ('country', 'Electoral Palatinate'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q33'), ('country', 'Finland'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q528546'), ('country', 'First Hellenic Republic'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q142'), ('country', 'France'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q164819'), ('country', 'Gagauzia'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q41'), ('country', 'Greece'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q28'), ('country', 'Hungary'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q27'), ('country', 'Ireland'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38'), ('country', 'Italy'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q232'), ('country', 'Kazakhstan'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q29999'), ('country', 'Kingdom of the Netherlands'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q211'), ('country', 'Latvia'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q347'), ('country', 'Liechtenstein'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q233'), ('country', 'Malta'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q236'), ('country', 'Montenegro'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q55'), ('country', 'Netherlands'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q20'), ('country', 'Norway'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q36'), ('country', 'Poland'), ('noOfPhysicists', '7')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q45'), ('country', 'Portugal'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q218'), ('country', 'Romania'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q214'), ('country', 'Slovakia'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34'), ('country', 'Sweden'), ('noOfPhysicists', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q39'), ('country', 'Switzerland'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q907112'), ('country', 'Transnistria'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q43'), ('country', 'Turkey'), ('noOfPhysicists', '0')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q145'), ('country', 'United Kingdom'), ('noOfPhysicists', '22')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q25'), ('country', 'Wales'), ('noOfPhysicists', '0')]\n",
      "37\n"
     ]
    }
   ],
   "source": [
    "# Query 18\n",
    "\n",
    "# Query 17 is the result of Task 4, because it said: \"Consider physicists born in Europe...\".\n",
    "# If we should return 0 for countries they never won the 'Nobel Prize in Physics', this query is the result.\n",
    "\n",
    "# It is supposed that 'physicist' means that the 'occupation' of the winner should be 'physicist'. I do not check if there is any person who won the Nobel Prize in Physics whos occupation is not physicist.\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wd:P106 => 'occupation'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "# wdt:P30 => 'continent'\n",
    "# wd:Q46 => 'Europe'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?c as ?countryIRI) (?cName as ?country) (count(?s) as ?noOfPhysicists)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?c wdt:P30 wd:Q46 ;\n",
    "      wdt:P31 wd:Q6256 .\n",
    "   OPTIONAL\n",
    "   {\n",
    "       ?s wdt:P166 wd:Q38104 ;\n",
    "          wdt:P106 wd:Q169470 ;\n",
    "          wdt:P19 ?pBirth .\n",
    "      ?pBirth wdt:P17 ?c .\n",
    "  }\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1b6fcff1",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "c96b4556",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q40'), ('country', 'Austria'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q227'), ('country', 'Azerbaijan'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q184'), ('country', 'Belarus'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q31'), ('country', 'Belgium'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q213'), ('country', 'Czech Republic'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q756617'), ('country', 'Danish Realm'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q142'), ('country', 'France'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q183'), ('country', 'Germany'), ('noOfPhysicists', '26')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q28'), ('country', 'Hungary'), ('noOfPhysicists', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q27'), ('country', 'Ireland'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38'), ('country', 'Italy'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q29999'), ('country', 'Kingdom of the Netherlands'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q32'), ('country', 'Luxembourg'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q55'), ('country', 'Netherlands'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q20'), ('country', 'Norway'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q36'), ('country', 'Poland'), ('noOfPhysicists', '7')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q159'), ('country', 'Russia'), ('noOfPhysicists', '9')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q214'), ('country', 'Slovakia'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34'), ('country', 'Sweden'), ('noOfPhysicists', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q39'), ('country', 'Switzerland'), ('noOfPhysicists', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q212'), ('country', 'Ukraine'), ('noOfPhysicists', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q145'), ('country', 'United Kingdom'), ('noOfPhysicists', '22')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 19\n",
    "\n",
    "# Task 4:\n",
    "# Consider physicists born in Europe.\n",
    "# For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists).\n",
    "\n",
    "# It is supposed that 'physicist' means that the 'occupation' of the winner should be 'physicist'. I do not check if there is any person who won the Nobel Prize in Physics whos occupation is not physicist.\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wd:P106 => 'occupation'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "# wdt:P30 => 'continent'\n",
    "# wd:Q46 => 'Europe'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?c as ?countryIRI) (?cName as ?country) (count(?s) as ?noOfPhysicists)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth .\n",
    "  ?pBirth wdt:P17 ?c .\n",
    "  ?c wdt:P30 wd:Q46 .\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "519ec62b",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "27125bbc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q35637'), ('sName', 'Nobel Peace Prize')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37922'), ('sName', 'Nobel Prize in Literature')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38104'), ('sName', 'Nobel Prize in Physics')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q44585'), ('sName', 'Nobel Prize in Chemistry')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47170'), ('sName', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q80061'), ('sName', 'Nobel Prize in Physiology or Medicine')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 20\n",
    "\n",
    "# Finding all types of Nobel Prize\n",
    "# wd:Q7191 => \"Nobel Prize\"\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P279 wd:Q7191 .\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "4f625416-f28b-40fe-9534-2cb74a4e5137",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q262'), ('country', 'Algeria'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q414'), ('country', 'Argentina'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q408'), ('country', 'Australia'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q40'), ('country', 'Austria'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q28513'), ('country', 'Austria-Hungary'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q131964'), ('country', 'Austrian Empire'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q227'), ('country', 'Azerbaijan'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q902'), ('country', 'Bangladesh'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q184'), ('country', 'Belarus'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q31'), ('country', 'Belgium'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q225'), ('country', 'Bosnia and Herzegovina'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q155'), ('country', 'Brazil'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q219'), ('country', 'Bulgaria'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q16'), ('country', 'Canada'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q298'), ('country', 'Chile'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q739'), ('country', 'Colombia'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q800'), ('country', 'Costa Rica'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q224'), ('country', 'Croatia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q229'), ('country', 'Cyprus'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q213'), ('country', 'Czech Republic'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q756617'), ('country', 'Danish Realm'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q974'), ('country', 'Democratic Republic of the Congo'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q35'), ('country', 'Denmark'), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q574'), ('country', 'East Timor'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q79'), ('country', 'Egypt'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q188712'), ('country', 'Empire of Japan'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q115'), ('country', 'Ethiopia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q4628'), ('country', 'Faroe Islands'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q33'), ('country', 'Finland'), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q142'), ('country', 'France'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q43287'), ('country', 'German Empire'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q183'), ('country', 'Germany'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q117'), ('country', 'Ghana'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q41'), ('country', 'Greece'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q774'), ('country', 'Guatemala'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q28'), ('country', 'Hungary'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q189'), ('country', 'Iceland'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q668'), ('country', 'India'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q252'), ('country', 'Indonesia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q794'), ('country', 'Iran'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q796'), ('country', 'Iraq'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q27'), ('country', 'Ireland'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q801'), ('country', 'Israel'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38'), ('country', 'Italy'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q17'), ('country', 'Japan'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q810'), ('country', 'Jordan'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q114'), ('country', 'Kenya'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q29999'), ('country', 'Kingdom of the Netherlands'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q211'), ('country', 'Latvia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q1014'), ('country', 'Liberia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q37'), ('country', 'Lithuania'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q32'), ('country', 'Luxembourg'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q1019'), ('country', 'Madagascar'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q30623'), ('country', 'Manchukuo'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q96'), ('country', 'Mexico'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q1028'), ('country', 'Morocco'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q836'), ('country', 'Myanmar'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q7318'), ('country', 'Nazi Germany'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q55'), ('country', 'Netherlands'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q664'), ('country', 'New Zealand'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q1033'), ('country', 'Nigeria'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q221'), ('country', 'North Macedonia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q20'), ('country', 'Norway'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q843'), ('country', 'Pakistan'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q148'), ('country', \"People's Republic of China\"), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q419'), ('country', 'Peru'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q36'), ('country', 'Poland'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q45'), ('country', 'Portugal'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38872'), ('country', 'Prussia'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q13426199'), ('country', 'Republic of China 1912–1949'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q217169'), ('country', 'Rhodesia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q218'), ('country', 'Romania'), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q159'), ('country', 'Russia'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34266'), ('country', 'Russian Empire'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q760'), ('country', 'Saint Lucia'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q214'), ('country', 'Slovakia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q215'), ('country', 'Slovenia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q258'), ('country', 'South Africa'), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q884'), ('country', 'South Korea'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q750583'), ('country', 'Southern Rhodesia'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q15180'), ('country', 'Soviet Union'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q29'), ('country', 'Spain'), ('noOfPrizes', '3')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34'), ('country', 'Sweden'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q39'), ('country', 'Switzerland'), ('noOfPrizes', '5')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q754'), ('country', 'Trinidad and Tobago'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q43'), ('country', 'Turkey'), ('noOfPrizes', '2')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q212'), ('country', 'Ukraine'), ('noOfPrizes', '4')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q145'), ('country', 'United Kingdom'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q30'), ('country', 'United States of America'), ('noOfPrizes', '6')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q717'), ('country', 'Venezuela'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q881'), ('country', 'Vietnam'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q41304'), ('country', 'Weimar Republic'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q805'), ('country', 'Yemen'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q954'), ('country', 'Zimbabwe'), ('noOfPrizes', '1')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q890120'), ('country', 'Zimbabwe Rhodesia'), ('noOfPrizes', '1')]\n",
      "95\n"
     ]
    }
   ],
   "source": [
    "# Query 21\n",
    "\n",
    "# Finding total number of distinct Nobel Prize each European country won.\n",
    "# wdt:P166 => 'award received'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?c as ?countryIRI) (?cName as ?country) (COUNT(DISTINCT(?prize)) as ?noOfPrizes) \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 ?prize ;\n",
    "      wdt:P19 ?pBirth .\n",
    "      \n",
    "   ?prize wdt:P279 wd:Q7191 .\n",
    "   \n",
    "   ?pBirth wdt:P17 ?c .\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "488946eb-1267-439d-8f1e-aef0d240e6e1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'Austria-Hungary'), ('prizeName', 'Nobel Prize in Chemistry')]\n",
      "[('country', 'Hungary'), ('prizeName', 'Nobel Prize in Physiology or Medicine')]\n",
      "[('country', 'Hungary'), ('prizeName', 'Nobel Prize in Physics')]\n",
      "[('country', 'Hungary'), ('prizeName', 'Nobel Prize in Chemistry')]\n",
      "[('country', 'Hungary'), ('prizeName', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
      "[('country', 'Hungary'), ('prizeName', 'Nobel Prize in Literature')]\n",
      "[('country', 'Kingdom of the Netherlands'), ('prizeName', 'Nobel Prize in Physics')]\n",
      "[('country', 'Kingdom of the Netherlands'), ('prizeName', 'Nobel Prize in Chemistry')]\n",
      "[('country', 'Kingdom of the Netherlands'), ('prizeName', 'Nobel Peace Prize')]\n",
      "[('country', 'Netherlands'), ('prizeName', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
      "[('country', 'Netherlands'), ('prizeName', 'Nobel Peace Prize')]\n",
      "[('country', 'Netherlands'), ('prizeName', 'Nobel Prize in Physiology or Medicine')]\n",
      "[('country', 'Netherlands'), ('prizeName', 'Nobel Prize in Physics')]\n",
      "[('country', 'Netherlands'), ('prizeName', 'Nobel Prize in Chemistry')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# Query 22\n",
    "\n",
    "# From Query 20 I know that total number of distinct Nobel Prizes is 6.\n",
    "# From noOfPrizes of Query 21 it is possible to find the result. Just need to check which countries won 6 distinct Nobel Prizes. \n",
    "# Some countries appear in the result in different rows, because of their different name during history, or they won a prize with other countries.\n",
    "# Austria & Germany --> appear in the result in any case because they have noOfPrizes = 6 for at least one row.\n",
    "# China appears in two rows with noOfprizes = 1 & 4. So in the best scenario final noOfPrizes could reach 5. No appearence in the final result.\n",
    "# Hungry & Netherlands should be check.\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?cName as ?country)  ?prizeName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 ?prize ;\n",
    "      wdt:P19 ?pBirth .\n",
    "      \n",
    "   ?prize wdt:P279 wd:Q7191 .\n",
    "   \n",
    "   ?pBirth wdt:P17 ?c .\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "   ?prize sc:name ?prizeName\n",
    "   \n",
    "   FILTER (REGEX(?cName,\"Hungary\") || REGEX(?cName,\"Netherlands\"))\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2390f6d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "08c73baf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q40'), ('country', 'Austria')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q16'), ('country', 'Canada')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q142'), ('country', 'France')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q183'), ('country', 'Germany')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q668'), ('country', 'India')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q38'), ('country', 'Italy')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q20'), ('country', 'Norway')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q36'), ('country', 'Poland')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q159'), ('country', 'Russia')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q34'), ('country', 'Sweden')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q145'), ('country', 'United Kingdom')]\n",
      "[('countryIRI', 'http://www.wikidata.org/entity/Q30'), ('country', 'United States of America')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 23\n",
    "\n",
    "# From Query 20 I know that total number of distinct Nobel Prizes is 6.\n",
    "# From noOfPrizes of Query 21 it is possible to find the result.\n",
    "# The result of Query 22 shows that issues about Hungary and Netherlands do not change the final result (They should not appear in the final result).\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P17 => 'country'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?c as ?countryIRI) (?cName as ?country)  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 ?prize ;\n",
    "      wdt:P19 ?pBirth .\n",
    "      \n",
    "   ?prize wdt:P279 wd:Q7191 .\n",
    "   \n",
    "   ?pBirth wdt:P17 ?c .\n",
    "\n",
    "   # get the label\n",
    "   ?c sc:name ?cName .\n",
    "\n",
    "}\n",
    "GROUP BY (?c) (?cName)\n",
    "HAVING (COUNT(DISTINCT(?prize)) = 6)\n",
    "ORDER BY (?cName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bde3a9f5",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries )."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "6a415355",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q937'), ('sName', 'Albert Einstein'), ('noOfDiscoveries', '10')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q173028'), ('sName', 'Emilio G. Segrè'), ('noOfDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8753'), ('sName', 'Enrico Fermi'), ('noOfDiscoveries', '6')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q160518'), ('sName', 'Gustaf Dalén'), ('noOfDiscoveries', '4')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47285'), ('sName', 'J. J. Thomson'), ('noOfDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('noOfDiscoveries', '12')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47480'), ('sName', 'Paul Dirac'), ('noOfDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('sName', 'Pierre Curie'), ('noOfDiscoveries', '4')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('sName', 'Roger Penrose'), ('noOfDiscoveries', '6')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 24\n",
    "\n",
    "# All information is founded before.\n",
    "\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "# wdt:P106 => 'occupation'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s  ?sName COUNT(?o) AS ?noOfDiscoveries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 .\n",
    "   \n",
    "   ?o wdt:P61 ?s .\n",
    "      \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "\n",
    "}\n",
    "GROUP BY (?s) (?sName)\n",
    "HAVING (COUNT(?o) > 2)\n",
    "ORDER BY (?sName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5be028bd",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "a2a9aaec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q937'), ('physiscistName', 'Albert Einstein'), ('noOfDiscoveries', '10')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q173028'), ('physiscistName', 'Emilio G. Segrè'), ('noOfDiscoveries', '3')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q8753'), ('physiscistName', 'Enrico Fermi'), ('noOfDiscoveries', '6')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q160518'), ('physiscistName', 'Gustaf Dalén'), ('noOfDiscoveries', '4')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q47285'), ('physiscistName', 'J. J. Thomson'), ('noOfDiscoveries', '3')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q123975'), ('physiscistName', 'Michel Mayor'), ('noOfDiscoveries', '12')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q47480'), ('physiscistName', 'Paul Dirac'), ('noOfDiscoveries', '3')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q37463'), ('physiscistName', 'Pierre Curie'), ('noOfDiscoveries', '4')]\n",
      "[('physiscistIRI', 'http://www.wikidata.org/entity/Q193803'), ('physiscistName', 'Roger Penrose'), ('noOfDiscoveries', '6')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "\n",
    "# Query 25\n",
    "\n",
    "# All information is founded before.\n",
    "\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "# wdt:P106 => 'occupation'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s AS ?physiscistIRI  ?sName as ?physiscistName COUNT(?o) AS ?noOfDiscoveries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 .\n",
    "   \n",
    "   ?o wdt:P61 ?s .\n",
    "      \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "\n",
    "}\n",
    "GROUP BY (?s) (?sName)\n",
    "HAVING (COUNT(?o) > 2)\n",
    "ORDER BY (?sName)\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6a81605e",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "d4df7bc7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q659080'), ('oName', 'University of Bern')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1622272'), ('oName', 'university teacher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q168756'), ('oName', 'University of California, Berkeley')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q25287226'), ('oName', 'Honorary doctor of the University of Geneva')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q28861731'), ('oName', 'honorary doctor of the Hebrew University of Jerusalem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pName', 'archives at'), ('o', 'http://www.wikidata.org/entity/Q39934978'), ('oName', 'ETH Zurich University Archives')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q42309226'), ('oName', 'honorary doctor of the Princeton University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q50621171'), ('oName', 'honorary doctor of the University of Madrid Complutense')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q152087'), ('oName', 'Humboldt University of Berlin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q156598'), ('oName', 'Leiden University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q206702'), ('oName', 'University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pName', 'educated at'), ('o', 'http://www.wikidata.org/entity/Q206702'), ('oName', 'University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q21578'), ('oName', 'Princeton University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q31519'), ('oName', 'Charles University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q1729754'), ('oName', 'German University in Prague')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 25\n",
    "\n",
    "# Looking for relation between person and university. I cheked any things having 'university' related to 'Albert Einstein'.\n",
    "\n",
    "# What I know till now:\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q1622272 => 'university teacher' (from Query 5)\n",
    "# wd:Q37226 => 'teacher' (from Query 5)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?pName,\"[Uu]niversity\") || REGEX (?oName,\"[Uu]niversity\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "77438153-28f9-49ff-8b55-fa4c82ebfc1f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1622272'), ('oName', 'university teacher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q1729754'), ('oName', 'German University in Prague')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q156598'), ('oName', 'Leiden University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q21578'), ('oName', 'Princeton University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q659080'), ('oName', 'University of Bern')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q206702'), ('oName', 'University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q31519'), ('oName', 'Charles University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q168756'), ('oName', 'University of California, Berkeley')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('o', 'http://www.wikidata.org/entity/Q152087'), ('oName', 'Humboldt University of Berlin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q50621171'), ('oName', 'honorary doctor of the University of Madrid Complutense')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q25287226'), ('oName', 'Honorary doctor of the University of Geneva')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q42309226'), ('oName', 'honorary doctor of the Princeton University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('o', 'http://www.wikidata.org/entity/Q28861731'), ('oName', 'honorary doctor of the Hebrew University of Jerusalem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pName', 'archives at'), ('o', 'http://www.wikidata.org/entity/Q39934978'), ('oName', 'ETH Zurich University Archives')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pName', 'educated at'), ('o', 'http://www.wikidata.org/entity/Q206702'), ('oName', 'University of Zurich')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 25-improved\n",
    "\n",
    "# In Query 25 I searched (FILTER) both prediction and object for '[Uu]niversity'.\n",
    "# But since it is supposed that the triple be somthing like \"Einstein  taught in university XX\", searching prediction for '[Uu]niversity' is an unnecessary computation load.\n",
    "# Thus it is better to search just object. I improved the Query 25 as this one.\n",
    "\n",
    "\n",
    "# Looking for relation between person and university. I cheked any things having 'university' related to 'Albert Einstein'.\n",
    "\n",
    "# What I know till now:\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q1622272 => 'university teacher' (from Query 5)\n",
    "# wd:Q37226 => 'teacher' (from Query 5)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "   \n",
    "   FILTER (REGEX (?oName,\"[Uu]niversity\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "28720fec-6cff-494b-a8f8-849f0c4753d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sName', 'William Henry Bragg'), ('o', 'http://www.wikidata.org/entity/Q15574'), ('oName', 'University of Adelaide'), ('pBirth', 'http://www.wikidata.org/entity/Q2227457'), ('birthCity', 'Wigton')]\n",
      "[('sName', 'Donna Strickland'), ('o', 'http://www.wikidata.org/entity/Q1437507'), ('oName', 'National Research Council'), ('pBirth', 'http://www.wikidata.org/entity/Q504114'), ('birthCity', 'Guelph')]\n",
      "[('sName', 'Brian David Josephson'), ('o', 'http://www.wikidata.org/entity/Q4380853'), ('oName', 'Missouri University of Science and Technology'), ('pBirth', 'http://www.wikidata.org/entity/Q10690'), ('birthCity', 'Cardiff')]\n",
      "[('sName', 'Alexei Abrikosov'), ('o', 'http://www.wikidata.org/entity/Q492766'), ('oName', 'N. I. Lobachevsky State University of Nizhny Novgorod'), ('pBirth', 'http://www.wikidata.org/entity/Q649'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Henri Becquerel'), ('o', 'http://www.wikidata.org/entity/Q838691'), ('oName', \"Muséum national d'histoire naturelle\"), ('pBirth', 'http://www.wikidata.org/entity/Q90'), ('birthCity', 'Paris')]\n",
      "[('sName', 'Theodor W. Hänsch'), ('o', 'http://www.wikidata.org/entity/Q829535'), ('oName', 'Max Planck Institute of Quantum Optics'), ('pBirth', 'http://www.wikidata.org/entity/Q2966'), ('birthCity', 'Heidelberg')]\n",
      "[('sName', 'Maria Goeppert Mayer'), ('o', 'http://www.wikidata.org/entity/Q649120'), ('oName', 'Argonne National Laboratory'), ('pBirth', 'http://www.wikidata.org/entity/Q588'), ('birthCity', 'Katowice')]\n",
      "[('sName', 'Peter Grünberg'), ('o', 'http://www.wikidata.org/entity/Q1041737'), ('oName', 'Carleton University'), ('pBirth', 'http://www.wikidata.org/entity/Q43453'), ('birthCity', 'Plzeň')]\n",
      "[('sName', 'Erwin Schrödinger'), ('o', 'http://www.wikidata.org/entity/Q1137665'), ('oName', 'Ghent University'), ('pBirth', 'http://www.wikidata.org/entity/Q1741'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Klaus von Klitzing'), ('o', 'http://www.wikidata.org/entity/Q122453'), ('oName', 'University of Stuttgart'), ('pBirth', 'http://www.wikidata.org/entity/Q554658'), ('birthCity', 'Gmina Środa Wielkopolska')]\n",
      "[('sName', 'Erwin Schrödinger'), ('o', 'http://www.wikidata.org/entity/Q122453'), ('oName', 'University of Stuttgart'), ('pBirth', 'http://www.wikidata.org/entity/Q1741'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Brian Schmidt'), ('o', 'http://www.wikidata.org/entity/Q127990'), ('oName', 'Australian National University'), ('pBirth', 'http://www.wikidata.org/entity/Q189602'), ('birthCity', 'Missoula')]\n",
      "[('sName', 'John Cockcroft'), ('o', 'http://www.wikidata.org/entity/Q127990'), ('oName', 'Australian National University'), ('pBirth', 'http://www.wikidata.org/entity/Q1327770'), ('birthCity', 'Todmorden')]\n",
      "[('sName', 'Victor Francis Hess'), ('o', 'http://www.wikidata.org/entity/Q130965'), ('oName', 'Fordham University'), ('pBirth', 'http://www.wikidata.org/entity/Q513647'), ('birthCity', 'Deutschfeistritz')]\n",
      "[('sName', 'Lev Landau'), ('o', 'http://www.wikidata.org/entity/Q1458695'), ('oName', 'National University of Kharkiv'), ('pBirth', 'http://www.wikidata.org/entity/Q9248'), ('birthCity', 'Baku')]\n",
      "[('sName', 'Ernst Ruska'), ('o', 'http://www.wikidata.org/entity/Q153006'), ('oName', 'Freie Universität Berlin'), ('pBirth', 'http://www.wikidata.org/entity/Q2966'), ('birthCity', 'Heidelberg')]\n",
      "[('sName', 'Max Planck'), ('o', 'http://www.wikidata.org/entity/Q156737'), ('oName', 'University of Kiel'), ('pBirth', 'http://www.wikidata.org/entity/Q1707'), ('birthCity', 'Kiel')]\n",
      "[('sName', 'Philipp Lenard'), ('o', 'http://www.wikidata.org/entity/Q156737'), ('oName', 'University of Kiel'), ('pBirth', 'http://www.wikidata.org/entity/Q1780'), ('birthCity', 'Bratislava')]\n",
      "[('sName', 'Otto Stern'), ('o', 'http://www.wikidata.org/entity/Q159895'), ('oName', 'University of Rostock'), ('pBirth', 'http://www.wikidata.org/entity/Q393171'), ('birthCity', 'Żory')]\n",
      "[('sName', 'Ferdinand Braun'), ('o', 'http://www.wikidata.org/entity/Q161976'), ('oName', 'University of Würzburg'), ('pBirth', 'http://www.wikidata.org/entity/Q3963'), ('birthCity', 'Fulda')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# Query 26\n",
    "\n",
    "# Lets see if wdt:P108 ('employer') is a good choice.\n",
    "\n",
    "# What I know till now:\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q1622272 => 'university teacher' (from Query 5)\n",
    "# wd:Q37226 => 'teacher' (from Query 5)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "# wdt:P108 => 'employer'\n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?sName ?o ?oName ?pBirth ?birthCity\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth ;\n",
    "      wdt:P108 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "   ?o sc:name ?oName .\n",
    "   ?pBirth sc:name ?birthCity .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "aecf49d6-ff52-4f6c-86a9-ccba2123e5c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5242'), ('pName', 'ARWU university ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6683'), ('pName', 'Alexander Turnbull Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('pName', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2651'), ('pName', 'CRICOS Provider Code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('pName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3153'), ('pName', 'Crossref funder ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5785'), ('pName', 'EU Research participant ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3608'), ('pName', 'EU VAT number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4228'), ('pName', 'Encyclopedia of Australian Science ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('pName', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('pName', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('pName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('pName', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2427'), ('pName', 'GRID ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1566'), ('pName', 'GeoNames ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4013'), ('pName', 'Giphy username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2037'), ('pName', 'GitHub username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3749'), ('pName', 'Google Maps Customer ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6773'), ('pName', 'HAL structure ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('pName', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('pName', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2003'), ('pName', 'Instagram username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P409'), ('pName', 'Libraries Australia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('pName', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3393'), ('pName', 'LittleSis organization ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('pName', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('pName', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('pName', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('pName', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('pName', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('pName', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7030'), ('pName', 'National Pollutant Inventory ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4293'), ('pName', 'PM20 folder ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5584'), ('pName', 'QS World University ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('pName', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6782'), ('pName', 'ROR ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3500'), ('pName', 'Ringgold ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3544'), ('pName', 'Te Papa agent ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5586'), ('pName', 'Times Higher Education World University ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2002'), ('pName', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5600'), ('pName', 'U-Multirank university ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('pName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('pName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3876'), ('pName', 'category for alumni of educational institution')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4195'), ('pName', 'category for employees of the organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P488'), ('pName', 'chairperson')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1037'), ('pName', 'director / manager')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P112'), ('pName', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('pName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pName', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('pName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pName', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pName', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2388'), ('pName', 'office held by head of the organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1448'), ('pName', 'official name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('pName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8687'), ('pName', 'social media followers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2196'), ('pName', 'students count')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\")]\n",
      "66\n"
     ]
    }
   ],
   "source": [
    "# Query 27\n",
    "\n",
    "# Looking for city of university. To do this, I check all properties of a sample university (the first one from the result of Query 26).\n",
    "\n",
    "# wd:Q515 => 'city' (from Query 16)\n",
    "# wd:Q15574 => 'University of Adelaide'\n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   wd:Q15574 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "\n",
    "}\n",
    "ORDER BY (?pName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "72a2b50d-a988-4ad5-8390-d900d78fa02c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('pName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Query 28\n",
    "\n",
    "# Some predicates contain 'location'. Let filter them.\n",
    "\n",
    "# wdt:P => 'headquarters location'\n",
    "# wd:Q515 => 'city' (from Query 16)\n",
    "# wd:Q15574 => 'University of Adelaide'\n",
    "# wd:Q161976 => 'University of Würzburg'\n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   wd:Q15574 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   \n",
    "   \n",
    "   FILTER(REGEX(?pName,\"[Ll]ocation\"))  \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "07494ace-a778-49ba-b273-a5bf99866e4c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sName', 'Aage Niels Bohr'), ('oName', 'Los Alamos National Laboratory'), ('universityCity', 'Los Alamos'), ('birthCity', 'Copenhagen')]\n",
      "[('sName', 'Aage Niels Bohr'), ('oName', 'Nordic Institute for Theoretical Physics'), ('universityCity', 'Stockholm'), ('birthCity', 'Copenhagen')]\n",
      "[('sName', 'Adam Riess'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'Adam Riess'), ('oName', 'Johns Hopkins University'), ('universityCity', 'Baltimore'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'Adam Riess'), ('oName', 'Space Telescope Science Institute'), ('universityCity', 'Baltimore'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'Albert A. Michelson'), ('oName', 'Case Western Reserve University'), ('universityCity', 'Cleveland'), ('birthCity', 'Strzelno')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Deutsche Physikalische Gesellschaft'), ('universityCity', 'Bad Honnef'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Institute for Advanced Study'), ('universityCity', 'Princeton'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'University of Zurich'), ('universityCity', 'Zürich'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Charles University'), ('universityCity', 'Prague'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'German University in Prague'), ('universityCity', 'Prague'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Kaiser Wilhelm Society'), ('universityCity', 'Berlin'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Humboldt University of Berlin'), ('universityCity', 'Berlin'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'Swiss Federal Institute of Intellectual Property'), ('universityCity', 'Bern'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'University of Bern'), ('universityCity', 'Main building of the University of Berne'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Albert Einstein'), ('oName', 'ETH Zürich'), ('universityCity', 'ETH Zurich main building'), ('birthCity', 'Ulm')]\n",
      "[('sName', 'Alexander Prokhorov'), ('oName', 'Moscow State University'), ('universityCity', 'Moscow'), ('birthCity', 'Atherton')]\n",
      "[('sName', 'Alexander Prokhorov'), ('oName', 'Lebedev Physical Institute'), ('universityCity', 'Moscow'), ('birthCity', 'Atherton')]\n",
      "[('sName', 'Alexander Prokhorov'), ('oName', 'Moscow Institute of Physics and Technology'), ('universityCity', 'Dolgoprudny'), ('birthCity', 'Atherton')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'Utah State University'), ('universityCity', 'Logan'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'Moscow State University'), ('universityCity', 'Moscow'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'Bauman Moscow State Technical University'), ('universityCity', 'Moscow'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'National University of Science and Technology'), ('universityCity', 'Moscow'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'N. I. Lobachevsky State University of Nizhny Novgorod'), ('universityCity', 'Nizhny Novgorod'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Alexei Abrikosov'), ('oName', 'Moscow Institute of Physics and Technology'), ('universityCity', 'Dolgoprudny'), ('birthCity', 'Moscow')]\n",
      "[('sName', 'Andre Geim'), ('oName', 'University of Manchester'), ('universityCity', 'Manchester'), ('birthCity', 'Sochi')]\n",
      "[('sName', 'Anthony James Leggett'), ('oName', 'University of Waterloo'), ('universityCity', 'Waterloo'), ('birthCity', 'Camberwell')]\n",
      "[('sName', 'Anthony James Leggett'), ('oName', 'University of Sussex'), ('universityCity', 'Falmer'), ('birthCity', 'Camberwell')]\n",
      "[('sName', 'Antony Hewish'), ('oName', 'Yale University'), ('universityCity', 'New Haven'), ('birthCity', 'Fowey')]\n",
      "[('sName', 'Arno Allan Penzias'), ('oName', 'Bell Labs'), ('universityCity', 'United States of America'), ('birthCity', 'Munich')]\n",
      "[('sName', 'Arno Allan Penzias'), ('oName', 'Bell Labs'), ('universityCity', 'Murray Hill'), ('birthCity', 'Munich')]\n",
      "[('sName', 'Arthur Ashkin'), ('oName', 'Bell Labs'), ('universityCity', 'United States of America'), ('birthCity', 'Brooklyn')]\n",
      "[('sName', 'Arthur Ashkin'), ('oName', 'Lucent'), ('universityCity', 'Murray Hill'), ('birthCity', 'Brooklyn')]\n",
      "[('sName', 'Arthur Ashkin'), ('oName', 'Bell Labs'), ('universityCity', 'Murray Hill'), ('birthCity', 'Brooklyn')]\n",
      "[('sName', 'Arthur B. McDonald'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Sydney')]\n",
      "[('sName', 'Arthur Compton'), ('oName', 'Washington University in St.\\xa0Louis'), ('universityCity', 'St. Louis'), ('birthCity', 'Wooster')]\n",
      "[('sName', 'Arthur Compton'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Wooster')]\n",
      "[('sName', 'Arthur Leonard Schawlow'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Mount Vernon')]\n",
      "[('sName', 'Barry C. Barish'), ('oName', 'California Institute of Technology'), ('universityCity', 'California'), ('birthCity', 'Omaha')]\n",
      "[('sName', 'Barry C. Barish'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Omaha')]\n",
      "[('sName', 'Ben Roy Mottelson'), ('oName', 'Nordic Institute for Theoretical Physics'), ('universityCity', 'Stockholm'), ('birthCity', 'Chicago')]\n",
      "[('sName', 'Brian Schmidt'), ('oName', 'Australian National University'), ('universityCity', 'Canberra'), ('birthCity', 'Missoula')]\n",
      "[('sName', 'Burton Richter'), ('oName', 'Stanford University'), ('universityCity', 'Stanford'), ('birthCity', 'New York City')]\n",
      "[('sName', 'C. F. Powell'), ('oName', 'University of Bristol'), ('universityCity', 'Bristol'), ('birthCity', 'Tonbridge')]\n",
      "[('sName', 'C. V. Raman'), ('oName', 'University of Calcutta'), ('universityCity', 'Kolkata'), ('birthCity', 'Trichy')]\n",
      "[('sName', 'C. V. Raman'), ('oName', 'Banaras Hindu University'), ('universityCity', 'Varanasi'), ('birthCity', 'Trichy')]\n",
      "[('sName', 'Carl David Anderson'), ('oName', 'California Institute of Technology'), ('universityCity', 'California'), ('birthCity', 'New York City')]\n",
      "[('sName', 'Carl Wieman'), ('oName', 'University of British Columbia'), ('universityCity', 'Vancouver'), ('birthCity', 'Corvallis')]\n",
      "[('sName', 'Carl Wieman'), ('oName', 'University of Michigan'), ('universityCity', 'Ann Arbor'), ('birthCity', 'Corvallis')]\n",
      "[('sName', 'Carl Wieman'), ('oName', 'Stanford University'), ('universityCity', 'Stanford'), ('birthCity', 'Corvallis')]\n",
      "[('sName', 'Carlo Rubbia'), ('oName', 'Harvard University'), ('universityCity', 'Cambridge'), ('birthCity', 'Gorizia')]\n",
      "[('sName', 'Charles Glover Barkla'), ('oName', 'University of Edinburgh'), ('universityCity', 'Edinburgh'), ('birthCity', 'Widnes')]\n",
      "[('sName', 'Charles Glover Barkla'), ('oName', 'University of Cambridge'), ('universityCity', 'Cambridge'), ('birthCity', 'Widnes')]\n",
      "[('sName', 'Charles Glover Barkla'), ('oName', 'University of London'), ('universityCity', 'London'), ('birthCity', 'Widnes')]\n",
      "[('sName', 'Charles Glover Barkla'), ('oName', \"King's College London\"), ('universityCity', 'London'), ('birthCity', 'Widnes')]\n",
      "[('sName', 'Charles Hard Townes'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Greenville')]\n",
      "[('sName', 'Charles Hard Townes'), ('oName', 'University of Michigan'), ('universityCity', 'Ann Arbor'), ('birthCity', 'Greenville')]\n",
      "[('sName', 'Charles Hard Townes'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Greenville')]\n",
      "[('sName', 'Charles K. Kao'), ('oName', 'Yale University'), ('universityCity', 'New Haven'), ('birthCity', 'Shanghai')]\n",
      "[('sName', 'Charles K. Kao'), ('oName', 'Imperial College London'), ('universityCity', 'South Kensington Campus, Imperial College London'), ('birthCity', 'Shanghai')]\n",
      "[('sName', 'Charles Thomson Rees Wilson'), ('oName', 'University of Cambridge'), ('universityCity', 'Cambridge'), ('birthCity', 'Glencorse')]\n",
      "[('sName', 'Charles Édouard Guillaume'), ('oName', 'International Bureau of Weights and Measures'), ('universityCity', 'Metropolis of Greater Paris'), ('birthCity', 'Fleurier')]\n",
      "[('sName', 'Chen-ning Yang'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Hefei County')]\n",
      "[('sName', 'Chen-ning Yang'), ('oName', 'Stony Brook University'), ('universityCity', 'New York City'), ('birthCity', 'Hefei County')]\n",
      "[('sName', 'Chen-ning Yang'), ('oName', 'Tsinghua University'), ('universityCity', 'Beijing'), ('birthCity', 'Hefei County')]\n",
      "[('sName', 'Claude Cohen-Tannoudji'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Constantine')]\n",
      "[('sName', 'Claude Cohen-Tannoudji'), ('oName', 'Collège de France'), ('universityCity', 'Paris'), ('birthCity', 'Constantine')]\n",
      "[('sName', 'Claude Cohen-Tannoudji'), ('oName', 'Pierre and Marie Curie University'), ('universityCity', 'Paris'), ('birthCity', 'Constantine')]\n",
      "[('sName', 'Clifford Shull'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Pittsburgh')]\n",
      "[('sName', 'Clinton Davisson'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Bloomington')]\n",
      "[('sName', 'Clinton Davisson'), ('oName', 'University of Virginia'), ('universityCity', 'Charlottesville'), ('birthCity', 'Bloomington')]\n",
      "[('sName', 'Daniel C. Tsui'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Baofeng County')]\n",
      "[('sName', 'David Gross'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'David Gross'), ('oName', 'University of California, Santa Barbara'), ('universityCity', 'Santa Barbara'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'David Gross'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'David Gross'), ('oName', 'Harvard University'), ('universityCity', 'Cambridge'), ('birthCity', 'Washington, D.C.')]\n",
      "[('sName', 'David J. Thouless'), ('oName', 'University of Birmingham'), ('universityCity', 'Birmingham'), ('birthCity', 'Bearsden')]\n",
      "[('sName', 'David J. Wineland'), ('oName', 'National Institute of Standards and Technology'), ('universityCity', 'Gaithersburg'), ('birthCity', 'Milwaukee')]\n",
      "[('sName', 'David Lee'), ('oName', 'Texas A&M University'), ('universityCity', 'College Station'), ('birthCity', 'Rye')]\n",
      "[('sName', 'David Lee'), ('oName', 'University of Florida'), ('universityCity', 'Gainesville'), ('birthCity', 'Rye')]\n",
      "[('sName', 'David Lee'), ('oName', 'Cornell University'), ('universityCity', 'Ithaca'), ('birthCity', 'Rye')]\n",
      "[('sName', 'Dennis Gabor'), ('oName', 'Imperial College London'), ('universityCity', 'South Kensington Campus, Imperial College London'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Dennis Gabor'), ('oName', 'Technical University of Berlin'), ('universityCity', 'Technische Universität Berlin, Hauptgebäude'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Donald Arthur Glaser'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Cleveland')]\n",
      "[('sName', 'Donald Arthur Glaser'), ('oName', 'University of Michigan'), ('universityCity', 'Ann Arbor'), ('birthCity', 'Cleveland')]\n",
      "[('sName', 'Donna Strickland'), ('oName', 'National Research Council'), ('universityCity', 'Ottawa'), ('birthCity', 'Guelph')]\n",
      "[('sName', 'Donna Strickland'), ('oName', 'University of Waterloo'), ('universityCity', 'Waterloo'), ('birthCity', 'Guelph')]\n",
      "[('sName', 'Douglas Osheroff'), ('oName', 'Stanford University'), ('universityCity', 'Stanford'), ('birthCity', 'Aberdeen')]\n",
      "[('sName', 'Duncan Haldane'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'London')]\n",
      "[('sName', 'Duncan Haldane'), ('oName', 'University of California, San Diego'), ('universityCity', 'San Diego'), ('birthCity', 'London')]\n",
      "[('sName', 'Duncan Haldane'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'London')]\n",
      "[('sName', 'Edward Mills Purcell'), ('oName', 'Harvard University'), ('universityCity', 'Cambridge'), ('birthCity', 'Taylorville')]\n",
      "[('sName', 'Edward Mills Purcell'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Taylorville')]\n",
      "[('sName', 'Edward Victor Appleton'), ('oName', 'University of Cambridge'), ('universityCity', 'Cambridge'), ('birthCity', 'Bradford')]\n",
      "[('sName', 'Edward Victor Appleton'), ('oName', 'University of London'), ('universityCity', 'London'), ('birthCity', 'Bradford')]\n",
      "[('sName', 'Edward Victor Appleton'), ('oName', \"King's College London\"), ('universityCity', 'London'), ('birthCity', 'Bradford')]\n",
      "[('sName', 'Emilio G. Segrè'), ('oName', 'Sapienza University of Rome'), ('universityCity', 'città universitaria of Rome'), ('birthCity', 'Tivoli')]\n",
      "[('sName', 'Emilio G. Segrè'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Tivoli')]\n",
      "[('sName', 'Enrico Fermi'), ('oName', 'Sapienza University of Rome'), ('universityCity', 'città universitaria of Rome'), ('birthCity', 'Rome')]\n",
      "[('sName', 'Enrico Fermi'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Rome')]\n",
      "[('sName', 'Enrico Fermi'), ('oName', 'University of Florence'), ('universityCity', 'Florence'), ('birthCity', 'Rome')]\n",
      "[('sName', 'Eric Allin Cornell'), ('oName', 'National Institute of Standards and Technology'), ('universityCity', 'Gaithersburg'), ('birthCity', 'Palo Alto')]\n",
      "[('sName', 'Eric Allin Cornell'), ('oName', 'Stanford University'), ('universityCity', 'Stanford'), ('birthCity', 'Palo Alto')]\n",
      "[('sName', 'Ernest Lawrence'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Canton')]\n",
      "[('sName', 'Ernest Walton'), ('oName', 'University of Cambridge'), ('universityCity', 'Cambridge'), ('birthCity', 'Abbeyside')]\n",
      "[('sName', 'Ernest Walton'), ('oName', 'Trinity College Dublin'), ('universityCity', 'Dublin'), ('birthCity', 'Abbeyside')]\n",
      "[('sName', 'Ernst Ruska'), ('oName', 'Max Planck Society'), ('universityCity', 'Munich'), ('birthCity', 'Heidelberg')]\n",
      "[('sName', 'Ernst Ruska'), ('oName', 'Freie Universität Berlin'), ('universityCity', 'Berlin'), ('birthCity', 'Heidelberg')]\n",
      "[('sName', 'Ernst Ruska'), ('oName', 'Technical University of Berlin'), ('universityCity', 'Technische Universität Berlin, Hauptgebäude'), ('birthCity', 'Heidelberg')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Zurich'), ('universityCity', 'Zürich'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Stuttgart'), ('universityCity', 'Stuttgart'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'Ghent University'), ('universityCity', 'Ghent'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Graz'), ('universityCity', 'Graz'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Vienna'), ('universityCity', 'Vienna'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Oxford'), ('universityCity', 'Oxford'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'Humboldt University of Berlin'), ('universityCity', 'Berlin'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Erwin Schrödinger'), ('oName', 'University of Jena'), ('universityCity', 'Jena'), ('birthCity', 'Vienna')]\n",
      "[('sName', 'Eugene Wigner'), ('oName', 'Manhattan Project'), ('universityCity', 'Oak Ridge'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Eugene Wigner'), ('oName', 'Princeton University'), ('universityCity', 'Princeton'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Eugene Wigner'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Eugene Wigner'), ('oName', 'Technical University of Berlin'), ('universityCity', 'Technische Universität Berlin, Hauptgebäude'), ('birthCity', 'Budapest')]\n",
      "[('sName', 'Felix Bloch'), ('oName', 'Manhattan Project'), ('universityCity', 'Oak Ridge'), ('birthCity', 'Zürich')]\n",
      "[('sName', 'Felix Bloch'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Zürich')]\n",
      "[('sName', 'Felix Bloch'), ('oName', 'Stanford University'), ('universityCity', 'Stanford'), ('birthCity', 'Zürich')]\n",
      "[('sName', 'Felix Bloch'), ('oName', 'ETH Zürich'), ('universityCity', 'ETH Zurich main building'), ('birthCity', 'Zürich')]\n",
      "[('sName', 'Ferdinand Braun'), ('oName', 'Karlsruhe Institute of Technology'), ('universityCity', 'Karlsruhe'), ('birthCity', 'Fulda')]\n",
      "[('sName', 'Ferdinand Braun'), ('oName', 'University of Marburg'), ('universityCity', 'Marburg'), ('birthCity', 'Fulda')]\n",
      "[('sName', 'Ferdinand Braun'), ('oName', 'University of Tübingen'), ('universityCity', 'Tübingen'), ('birthCity', 'Fulda')]\n",
      "[('sName', 'Ferdinand Braun'), ('oName', 'University of Würzburg'), ('universityCity', 'Würzburg'), ('birthCity', 'Fulda')]\n",
      "[('sName', 'Frank Wilczek'), ('oName', 'University of California, Santa Barbara'), ('universityCity', 'Santa Barbara'), ('birthCity', 'Mineola')]\n",
      "[('sName', 'Frank Wilczek'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Mineola')]\n",
      "[('sName', 'Frank Wilczek'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Mineola')]\n",
      "[('sName', 'François Englert'), ('oName', 'Tel Aviv University'), ('universityCity', 'Tel Aviv'), ('birthCity', 'Etterbeek')]\n",
      "[('sName', 'François Englert'), ('oName', 'Cornell University'), ('universityCity', 'Ithaca'), ('birthCity', 'Etterbeek')]\n",
      "[('sName', 'François Englert'), ('oName', 'Université libre de Bruxelles'), ('universityCity', 'Avenue Franklin Roosevelt - Franklin Rooseveltlaan'), ('birthCity', 'Etterbeek')]\n",
      "[('sName', 'Frederick Reines'), ('oName', 'Case Western Reserve University'), ('universityCity', 'Cleveland'), ('birthCity', 'Paterson')]\n",
      "[('sName', 'Georg Bednorz'), ('oName', 'IBM'), ('universityCity', 'Armonk'), ('birthCity', 'Neuenkirchen')]\n",
      "[('sName', 'George E. Smith'), ('oName', 'Bell Labs'), ('universityCity', 'United States of America'), ('birthCity', 'White Plains')]\n",
      "[('sName', 'George E. Smith'), ('oName', 'Bell Labs'), ('universityCity', 'Murray Hill'), ('birthCity', 'White Plains')]\n",
      "[('sName', 'George F. Smoot'), ('oName', 'University of California, Berkeley'), ('universityCity', 'Berkeley'), ('birthCity', 'Yukon')]\n",
      "[('sName', 'George Paget Thomson'), ('oName', 'University of Aberdeen'), ('universityCity', 'Aberdeen'), ('birthCity', 'Cambridge')]\n",
      "[('sName', 'George Paget Thomson'), ('oName', 'Imperial College London'), ('universityCity', 'South Kensington Campus, Imperial College London'), ('birthCity', 'Cambridge')]\n",
      "[('sName', 'Georges Charpak'), ('oName', 'CERN'), ('universityCity', 'Meyrin'), ('birthCity', 'Dubrovytsia')]\n",
      "[('sName', 'Georges Charpak'), ('oName', 'CERN'), ('universityCity', 'Prévessin-Moëns'), ('birthCity', 'Dubrovytsia')]\n",
      "[('sName', \"Gerard 't Hooft\"), ('oName', 'CERN'), ('universityCity', 'Meyrin'), ('birthCity', 'Den Helder')]\n",
      "[('sName', \"Gerard 't Hooft\"), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Den Helder')]\n",
      "[('sName', \"Gerard 't Hooft\"), ('oName', 'Utrecht University'), ('universityCity', 'Utrecht'), ('birthCity', 'Den Helder')]\n",
      "[('sName', \"Gerard 't Hooft\"), ('oName', 'CERN'), ('universityCity', 'Prévessin-Moëns'), ('birthCity', 'Den Helder')]\n",
      "[('sName', 'Gerd Binnig'), ('oName', 'IBM'), ('universityCity', 'Armonk'), ('birthCity', 'Frankfurt am Main')]\n",
      "[('sName', 'Gerd Binnig'), ('oName', 'Ludwig Maximilian University of Munich'), ('universityCity', 'Hauptgebäude der Ludwig-Maximilians-Universität München'), ('birthCity', 'Frankfurt am Main')]\n",
      "[('sName', 'Gustaf Dalén'), ('oName', 'AGA AB'), ('universityCity', 'Lidingö'), ('birthCity', 'Stenstorp')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Siemens'), ('universityCity', 'Palais Ludwig Ferdinand'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Leipzig University'), ('universityCity', 'Leipzig'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Siemens'), ('universityCity', 'Berlin'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Humboldt University of Berlin'), ('universityCity', 'Berlin'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Koninklijke Philips NV'), ('universityCity', 'Amsterdam'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gustav Ludwig Hertz'), ('oName', 'Technical University of Berlin'), ('universityCity', 'Technische Universität Berlin, Hauptgebäude'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'Gérard Mourou'), ('oName', 'University of Michigan'), ('universityCity', 'Ann Arbor'), ('birthCity', 'Albertville')]\n",
      "[('sName', 'Gérard Mourou'), ('oName', 'University of Rochester'), ('universityCity', 'Rochester'), ('birthCity', 'Albertville')]\n",
      "[('sName', 'Hannes Alfvén'), ('oName', 'University of California, San Diego'), ('universityCity', 'San Diego'), ('birthCity', 'Norrköping')]\n",
      "[('sName', 'Hannes Alfvén'), ('oName', 'Uppsala University'), ('universityCity', 'Uppsala'), ('birthCity', 'Norrköping')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'Manhattan Project'), ('universityCity', 'Oak Ridge'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'Victoria University of Manchester'), ('universityCity', 'Manchester'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'University of Manchester'), ('universityCity', 'Manchester'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'University of Tübingen'), ('universityCity', 'Tübingen'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'Cornell University'), ('universityCity', 'Ithaca'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Bethe'), ('oName', 'Goethe University Frankfurt'), ('universityCity', 'Jügelhaus'), ('birthCity', 'Strasbourg')]\n",
      "[('sName', 'Hans Georg Dehmelt'), ('oName', 'Duke University'), ('universityCity', 'Durham'), ('birthCity', 'Görlitz')]\n",
      "[('sName', 'Heike Kamerlingh Onnes'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Groningen')]\n",
      "[('sName', 'Heinrich Rohrer'), ('oName', 'IBM'), ('universityCity', 'Armonk'), ('birthCity', 'Buchs')]\n",
      "[('sName', 'Hendrik Lorentz'), ('oName', 'Leiden University'), ('universityCity', 'Leiden'), ('birthCity', 'Arnhem')]\n",
      "[('sName', 'Henri Becquerel'), ('oName', \"Muséum national d'histoire naturelle\"), ('universityCity', 'Paris'), ('birthCity', 'Paris')]\n",
      "[('sName', 'Henry Way Kendall'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Boston')]\n",
      "[('sName', 'Herbert Kroemer'), ('oName', 'University of California, Santa Barbara'), ('universityCity', 'Santa Barbara'), ('birthCity', 'Weimar')]\n",
      "[('sName', 'Hideki Yukawa'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Azabu')]\n",
      "[('sName', 'Hideki Yukawa'), ('oName', 'Kyoto University'), ('universityCity', 'Kyoto'), ('birthCity', 'Azabu')]\n",
      "[('sName', 'Hideki Yukawa'), ('oName', 'Osaka University'), ('universityCity', 'Suita'), ('birthCity', 'Azabu')]\n",
      "[('sName', 'Hiroshi Amano'), ('oName', 'Nagoya University'), ('universityCity', 'Nagoya'), ('birthCity', 'Hamamatsu')]\n",
      "[('sName', 'Horst Ludwig Störmer'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Frankfurt am Main')]\n",
      "[('sName', 'Hugh David Politzer'), ('oName', 'California Institute of Technology'), ('universityCity', 'California'), ('birthCity', 'New York City')]\n",
      "[('sName', 'Ilya Frank'), ('oName', 'Joint Institute for Nuclear Research'), ('universityCity', 'Dubna'), ('birthCity', 'Saint Petersburg')]\n",
      "[('sName', 'Ilya Frank'), ('oName', 'Lebedev Physical Institute'), ('universityCity', 'Moscow'), ('birthCity', 'Saint Petersburg')]\n",
      "[('sName', 'Isamu Akasaki'), ('oName', 'Panasonic Corporation'), ('universityCity', 'Kadoma'), ('birthCity', 'Chiran')]\n",
      "[('sName', 'Isamu Akasaki'), ('oName', 'Nagoya University'), ('universityCity', 'Nagoya'), ('birthCity', 'Chiran')]\n",
      "[('sName', 'Isamu Akasaki'), ('oName', 'Denso Ten'), ('universityCity', 'Kōbe'), ('birthCity', 'Chiran')]\n",
      "[('sName', 'Isidor Isaac Rabi'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Rymanów')]\n",
      "[('sName', 'Isidor Isaac Rabi'), ('oName', 'Massachusetts Institute of Technology'), ('universityCity', 'Cambridge'), ('birthCity', 'Rymanów')]\n",
      "[('sName', 'J. Hans D. Jensen'), ('oName', 'Leibniz University Hannover'), ('universityCity', 'Hanover'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'J. J. Thomson'), ('oName', 'University of Cambridge'), ('universityCity', 'Cambridge'), ('birthCity', 'Manchester')]\n",
      "[('sName', 'Jack Kilby'), ('oName', 'Texas Instruments'), ('universityCity', 'Dallas'), ('birthCity', 'Jefferson City')]\n",
      "[('sName', 'Jack Steinberger'), ('oName', 'CERN'), ('universityCity', 'Meyrin'), ('birthCity', 'Bad Kissingen')]\n",
      "[('sName', 'Jack Steinberger'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Bad Kissingen')]\n",
      "[('sName', 'Jack Steinberger'), ('oName', 'CERN'), ('universityCity', 'Prévessin-Moëns'), ('birthCity', 'Bad Kissingen')]\n",
      "[('sName', 'James Cronin'), ('oName', 'Collège de France'), ('universityCity', 'Paris'), ('birthCity', 'Chicago')]\n",
      "[('sName', 'James Franck'), ('oName', 'Johns Hopkins University'), ('universityCity', 'Baltimore'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'James Franck'), ('oName', 'Humboldt University of Berlin'), ('universityCity', 'Berlin'), ('birthCity', 'Hamburg')]\n",
      "[('sName', 'James Rainwater'), ('oName', 'Columbia University'), ('universityCity', 'Manhattan'), ('birthCity', 'Council')]\n",
      "200\n"
     ]
    }
   ],
   "source": [
    "# Query 29\n",
    "\n",
    "# Many of universities have branches, departments or buildings in different cities.\n",
    "# Considering this fact, it seems that choosing wd:P159 ('headquarters location') is a good idea.\n",
    "\n",
    "# wdt:P159 => 'headquarters location'\n",
    "# wd:Q515 => 'city'\n",
    "# wd:Q15574 => 'University of Adelaide'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q1622272 => 'university teacher' (from Query 5)\n",
    "# wd:Q37226 => 'teacher' (from Query 5)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "# wdt:P108 => 'employer'\n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sName ?oName ?cName AS ?universityCity ?birthCity\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth ;\n",
    "      wdt:P108 ?o .\n",
    "      \n",
    "   ?o wdt:P159 ?c .\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "   ?o sc:name ?oName .\n",
    "   ?c sc:name ?cName .\n",
    "   ?pBirth sc:name ?birthCity .\n",
    "}\n",
    "ORDER BY (?sName)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "eb60e430-c8a6-4f75-b3f2-773a3939a693",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q188128'), ('sName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q1472245'), ('universityName', 'Bauman Moscow State Technical University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q188128'), ('sName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q13164'), ('universityName', 'Moscow State University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q188128'), ('sName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q4315005'), ('universityName', 'National University of Science and Technology')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9130'), ('sName', 'Erwin Schrödinger'), ('university', 'http://www.wikidata.org/entity/Q165980'), ('universityName', 'University of Vienna')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41269'), ('sName', 'Henri Becquerel'), ('university', 'http://www.wikidata.org/entity/Q838691'), ('universityName', \"Muséum national d'histoire naturelle\")]\n",
      "[('s', 'http://www.wikidata.org/entity/Q202164'), ('sName', 'Makoto Kobayashi'), ('university', 'http://www.wikidata.org/entity/Q1191132'), ('universityName', 'Nagoya University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9021'), ('sName', 'Max Planck'), ('university', 'http://www.wikidata.org/entity/Q156737'), ('universityName', 'University of Kiel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q184499'), ('sName', 'Patrick Blackett, Baron Blackett'), ('university', 'http://www.wikidata.org/entity/Q375606'), ('universityName', 'Birkbeck, University of London')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q172118'), ('sName', 'Percy Williams Bridgman'), ('university', 'http://www.wikidata.org/entity/Q13371'), ('universityName', 'Harvard University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q44286'), ('sName', 'Rudolf Mössbauer'), ('university', 'http://www.wikidata.org/entity/Q157808'), ('universityName', 'Technical University of Munich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q202168'), ('sName', 'Toshihide Maskawa'), ('university', 'http://www.wikidata.org/entity/Q1191132'), ('universityName', 'Nagoya University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q104668'), ('sName', 'Vitaly Ginzburg'), ('university', 'http://www.wikidata.org/entity/Q1810862'), ('universityName', 'Lebedev Physical Institute')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# Query 30\n",
    "\n",
    "# It seems that everything is ready to run final query.\n",
    "\n",
    "# Task 7:\n",
    "# Amongst the physicists who won the Nobel Prize in Physics,\n",
    "# find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label).\n",
    "\n",
    "\n",
    "# wdt:P159 => 'headquarters location'\n",
    "# wd:Q515 => 'city'\n",
    "# wd:Q15574 => 'University of Adelaide'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# P61 => \"discoverer or inventor\"\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P166 => 'award received'  (from Query 7)\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q1622272 => 'university teacher' (from Query 5)\n",
    "# wd:Q37226 => 'teacher' (from Query 5)\n",
    "# wd:Q937 => 'Albert Einstein'\n",
    "# wdt:P108 => 'employer'\n",
    "# wdt:P19 => 'place of birth'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sName ?university ?universityName\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth ;\n",
    "      wdt:P108 ?university .\n",
    "      \n",
    "   ?university wdt:P159 ?pBirth.\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sName .\n",
    "   ?university sc:name ?universityName .\n",
    "\n",
    "}\n",
    "ORDER BY (?sName) (?universityName)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b870629f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "e132b1ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q202164'), ('Name', 'Makoto Kobayashi'), ('uni', 'http://www.wikidata.org/entity/Q1191132'), ('uniName', 'Nagoya University')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q9130'), ('Name', 'Erwin Schrödinger'), ('uni', 'http://www.wikidata.org/entity/Q165980'), ('uniName', 'University of Vienna')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q184499'), ('Name', 'Patrick Blackett, Baron Blackett'), ('uni', 'http://www.wikidata.org/entity/Q375606'), ('uniName', 'Birkbeck, University of London')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q41269'), ('Name', 'Henri Becquerel'), ('uni', 'http://www.wikidata.org/entity/Q838691'), ('uniName', \"Muséum national d'histoire naturelle\")]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q9021'), ('Name', 'Max Planck'), ('uni', 'http://www.wikidata.org/entity/Q156737'), ('uniName', 'University of Kiel')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q172118'), ('Name', 'Percy Williams Bridgman'), ('uni', 'http://www.wikidata.org/entity/Q13371'), ('uniName', 'Harvard University')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q202168'), ('Name', 'Toshihide Maskawa'), ('uni', 'http://www.wikidata.org/entity/Q1191132'), ('uniName', 'Nagoya University')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q44286'), ('Name', 'Rudolf Mössbauer'), ('uni', 'http://www.wikidata.org/entity/Q157808'), ('uniName', 'Technical University of Munich')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q188128'), ('Name', 'Alexei Abrikosov'), ('uni', 'http://www.wikidata.org/entity/Q4315005'), ('uniName', 'National University of Science and Technology')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q188128'), ('Name', 'Alexei Abrikosov'), ('uni', 'http://www.wikidata.org/entity/Q13164'), ('uniName', 'Moscow State University')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q188128'), ('Name', 'Alexei Abrikosov'), ('uni', 'http://www.wikidata.org/entity/Q1472245'), ('uniName', 'Bauman Moscow State Technical University')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q104668'), ('Name', 'Vitaly Ginzburg'), ('uni', 'http://www.wikidata.org/entity/Q1810862'), ('uniName', 'Lebedev Physical Institute')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 31\n",
    "\n",
    "# wdt:P166 => 'award received'\n",
    "# wd:Q38104 => 'Nobel Prize in Physics'\n",
    "# wdt:P106 => 'occupation'\n",
    "# wd:Q169470 => 'physicist'\n",
    "# wdt:P19 => 'place of birth'\n",
    "# wdt:P108 => 'employer'\n",
    "# wdt:P159 => 'headquarters location'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s AS ?IRI ?Name ?uni ?uniName\n",
    "WHERE {\n",
    "   # bind something\n",
    "  \n",
    "   ?s wdt:P166 wd:Q38104 ;\n",
    "      wdt:P106 wd:Q169470 ;\n",
    "      wdt:P19 ?pBirth ;\n",
    "      wdt:P108 ?uni .\n",
    "      \n",
    "   ?uni wdt:P159 ?pBirth.\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?Name .\n",
    "   ?uni sc:name ?uniName .\n",
    "\n",
    "}\n",
    "ORDER BY (?physicistName) (?universityName)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
