{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "97240114",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "9aece556",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-8f7f46850d-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68f5af3a",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Film Genre and directors explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the directors for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ca538896",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n",
    "| `wd:Q3772`| Quentin Tarantino      | node |\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "facb53b4",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for director\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films).\n",
    "\n",
    "5. Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films). \n",
    "\n",
    "6. Identify the BGP for Academy Awards \n",
    "\n",
    "7. Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won).\n",
    "\n",
    "8. Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "87cf63d9",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e04c5ef5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q10800557'), ('oName', 'film actor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15981151'), ('oName', 'jazz musician')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18844224'), ('oName', 'science fiction writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1930187'), ('oName', 'journalist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q214917'), ('oName', 'playwright')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q245068'), ('oName', 'comedian')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2526255'), ('oName', 'film director')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28389'), ('oName', 'screenwriter')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3282637'), ('oName', 'film producer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('oName', 'writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36834'), ('oName', 'composer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q482980'), ('oName', 'author')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q639669'), ('oName', 'musician')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q948329'), ('oName', 'character actor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q118865'), ('oName', 'clarinetist')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "\n",
    "#Query 1\n",
    "\n",
    "# At first let check what is/are Woody Allen's ocupation.\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wdt:P106  => occupation\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P106 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f43c8f8a-5bae-4783-8850-28b1ee59eb00",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q103360'), ('oName', 'Academy Award for Best Director'), ('m', 'http://www.wikidata.org/entity/Q19020'), ('mName', 'Academy Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41417'), ('oName', 'Academy Award for Best Writing, Original Screenplay'), ('m', 'http://www.wikidata.org/entity/Q19020'), ('mName', 'Academy Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q103916'), ('oName', 'Academy Award for Best Actor'), ('m', 'http://www.wikidata.org/entity/Q19020'), ('mName', 'Academy Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q139184'), ('oName', 'BAFTA Award for Best Film'), ('m', 'http://www.wikidata.org/entity/Q732997'), ('mName', 'British Academy Film Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q787148'), ('oName', 'Academy Fellowship Award'), ('m', 'http://www.wikidata.org/entity/Q732997'), ('mName', 'British Academy Film Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q787131'), ('oName', 'BAFTA Award for Best Direction'), ('m', 'http://www.wikidata.org/entity/Q732997'), ('mName', 'British Academy Film Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41375'), ('oName', 'BAFTA Award for Best Original Screenplay'), ('m', 'http://www.wikidata.org/entity/Q732997'), ('mName', 'British Academy Film Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3404523'), ('oName', 'David di Donatello for Best Foreign Actor'), ('m', 'http://www.wikidata.org/entity/Q31579'), ('mName', 'David di Donatello')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q768476'), ('oName', 'David di Donatello for Best Film'), ('m', 'http://www.wikidata.org/entity/Q31579'), ('mName', 'David di Donatello')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1377772'), ('oName', 'European Film Award for Best Non-European Film'), ('m', 'http://www.wikidata.org/entity/Q223740'), ('mName', 'European Film Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q849124'), ('oName', 'Golden Globe Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q1011547'), ('mName', 'Golden Globe Award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2418096'), ('oName', 'Goya Award for Best European Film'), ('m', 'http://www.wikidata.org/entity/Q212828'), ('mName', 'Goya Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1170507'), ('oName', 'Independent Spirit Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q311836'), ('mName', 'Independent Spirit Awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1789102'), ('oName', 'National Board of Review Award for Best Film'), ('m', 'http://www.wikidata.org/entity/Q81565646'), ('mName', 'National Board of Review Award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7778126'), ('oName', 'Category:Films directed by Woody Allen'), ('m', 'http://www.wikidata.org/entity/Q4167836'), ('mName', 'Wikimedia category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7370834'), ('oName', 'Category:Woody Allen'), ('m', 'http://www.wikidata.org/entity/Q4167836'), ('mName', 'Wikimedia category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16971520'), ('oName', 'Woody Allen bibliography'), ('m', 'http://www.wikidata.org/entity/Q13406463'), ('mName', 'Wikimedia list article')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q58488719'), ('oName', 'Billy Ireland Cartoon Library & Museum biographical files'), ('m', 'http://www.wikidata.org/entity/Q9388534'), ('mName', 'archival collection')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q188740'), ('oName', 'Museum of Modern Art'), ('m', 'http://www.wikidata.org/entity/Q20897549'), ('mName', 'art institution')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q188740'), ('oName', 'Museum of Modern Art'), ('m', 'http://www.wikidata.org/entity/Q207694'), ('mName', 'art museum')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3319305'), ('oName', 'Princess of Asturias Award for the Arts'), ('m', 'http://www.wikidata.org/entity/Q1792571'), ('mName', 'art prize')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q50616934'), ('oName', 'honorary doctorate of Pompeu Fabra University'), ('m', 'http://www.wikidata.org/entity/Q618779'), ('mName', 'award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3822438'), ('oName', 'Butaca Awards'), ('m', 'http://www.wikidata.org/entity/Q618779'), ('mName', 'award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1415017'), ('oName', 'Writers Guild of America Award'), ('m', 'http://www.wikidata.org/entity/Q618779'), ('mName', 'award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q103360'), ('oName', 'Academy Award for Best Director'), ('m', 'http://www.wikidata.org/entity/Q96474679'), ('mName', 'award for best direction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q139184'), ('oName', 'BAFTA Award for Best Film'), ('m', 'http://www.wikidata.org/entity/Q96474687'), ('mName', 'award for best film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q768476'), ('oName', 'David di Donatello for Best Film'), ('m', 'http://www.wikidata.org/entity/Q96474687'), ('mName', 'award for best film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2418096'), ('oName', 'Goya Award for Best European Film'), ('m', 'http://www.wikidata.org/entity/Q96474690'), ('mName', 'award for best film by place of origin')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q103916'), ('oName', 'Academy Award for Best Actor'), ('m', 'http://www.wikidata.org/entity/Q96474691'), ('mName', 'award for best leading actor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41375'), ('oName', 'BAFTA Award for Best Original Screenplay'), ('m', 'http://www.wikidata.org/entity/Q96474703'), ('mName', 'award for best original screenplay')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41417'), ('oName', 'Academy Award for Best Writing, Original Screenplay'), ('m', 'http://www.wikidata.org/entity/Q96474700'), ('mName', 'award for best screenplay')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1170507'), ('oName', 'Independent Spirit Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q96474700'), ('mName', 'award for best screenplay')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q849124'), ('oName', 'Golden Globe Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q96474700'), ('mName', 'award for best screenplay')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16971520'), ('oName', 'Woody Allen bibliography'), ('m', 'http://www.wikidata.org/entity/Q1631107'), ('mName', 'bibliography')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18426'), ('oName', 'The Bronx'), ('m', 'http://www.wikidata.org/entity/Q408804'), ('mName', 'borough of New York City')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3404523'), ('oName', 'David di Donatello for Best Foreign Actor'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3404587'), ('oName', 'FIPRESCI Prize of the Festival de Cannes'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1789102'), ('oName', 'National Board of Review Award for Best Film'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q787131'), ('oName', 'BAFTA Award for Best Direction'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41375'), ('oName', 'BAFTA Award for Best Original Screenplay'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q670282'), ('oName', 'Golden Globe Award for Best Motion Picture – Musical or Comedy'), ('m', 'http://www.wikidata.org/entity/Q38033430'), ('mName', 'class of award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q1520223'), ('mName', 'constitutional republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q73555012'), ('oName', 'works protected by copyrights'), ('m', 'http://www.wikidata.org/entity/Q73568642'), ('mName', 'copyright status of works')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q6256'), ('mName', 'country')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q5255892'), ('mName', 'democratic republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q288928'), ('oName', 'agnosticism'), ('m', 'http://www.wikidata.org/entity/Q5303685'), ('mName', 'doxastic attitude')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q678551'), ('oName', 'American Jews'), ('m', 'http://www.wikidata.org/entity/Q41710'), ('mName', 'ethnic group')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q797078'), ('oName', 'New York University Tisch School of the Arts'), ('m', 'http://www.wikidata.org/entity/Q180958'), ('mName', 'faculty')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2648323'), ('oName', 'Allen'), ('m', 'http://www.wikidata.org/entity/Q101352'), ('mName', 'family name')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q512187'), ('mName', 'federal republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q52382875'), ('oName', 'AAAS Fellow'), ('m', 'http://www.wikidata.org/entity/Q20006438'), ('mName', 'fellowship')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q206124'), ('oName', 'Midnight in Paris'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q971865'), ('oName', \"What's Up, Tiger Lily?\"), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1004531'), ('oName', 'Bullets Over Broadway'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1354109'), ('oName', 'Mighty Aphrodite'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q729026'), ('oName', 'Broadway Danny Rose'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q733677'), ('oName', 'Match Point'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q740143'), ('oName', 'Husbands and Wives'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q806092'), ('oName', 'Bananas'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1321004'), ('oName', 'You Will Meet a Tall Dark Stranger'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q14511869'), ('oName', 'Magic in the Moonlight'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q614009'), ('oName', 'Anything Else'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q187423'), ('oName', 'Zelig'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27703144'), ('oName', 'Wonder Wheel'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q786585'), ('oName', 'Sweet and Lowdown'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1052826'), ('oName', 'Celebrity'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1218888'), ('oName', 'Love and Death'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q181555'), ('oName', 'Crimes and Misdemeanors'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q682002'), ('oName', 'scoop'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q653518'), ('oName', 'Stardust Memories'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q977372'), ('oName', 'New York Stories'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q750003'), ('oName', 'Sleeper'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q610163'), ('oName', 'Small Time Crooks'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q910523'), ('oName', 'Shadows and Fog'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1133277'), ('oName', 'Manhattan Murder Mystery'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1146315'), ('oName', 'Take the Money and Run'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1354121'), ('oName', 'Melinda and Melinda'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2907178'), ('oName', 'Blue Jasmine'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q731310'), ('oName', 'Manhattan'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q833530'), ('oName', \"Cassandra's Dream\"), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q499697'), ('oName', 'Everything You Always Wanted to Know About Sex*'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q912729'), ('oName', 'The Purple Rose of Cairo'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1770003'), ('oName', 'September'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q692208'), ('oName', 'Whatever Works'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q17417520'), ('oName', 'Irrational Man'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q29658'), ('oName', 'To Rome with Love'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20950014'), ('oName', 'Café Society'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1306629'), ('oName', \"A Midsummer Night's Sex Comedy\"), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q541185'), ('oName', 'Another Woman'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q685109'), ('oName', 'Radio Days'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q42307699'), ('oName', 'A Rainy Day in New York'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1334572'), ('oName', 'Everyone Says I Love You'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q212123'), ('oName', 'Vicky Cristina Barcelona'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q233464'), ('oName', 'Annie Hall'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q335508'), ('oName', 'The Curse of the Jade Scorpion'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q551762'), ('oName', 'Deconstructing Harry'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q582021'), ('oName', 'Hollywood Ending'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q845057'), ('oName', 'Hannah and Her Sisters'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q961403'), ('oName', 'Interiors'), ('m', 'http://www.wikidata.org/entity/Q11424'), ('mName', 'film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3404587'), ('oName', 'FIPRESCI Prize of the Festival de Cannes'), ('m', 'http://www.wikidata.org/entity/Q4220917'), ('mName', 'film award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q908858'), ('oName', 'Donostia Award'), ('m', 'http://www.wikidata.org/entity/Q4220917'), ('mName', 'film award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2372386'), ('oName', 'Sant Jordi Prize'), ('m', 'http://www.wikidata.org/entity/Q4220917'), ('mName', 'film award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q889842'), ('oName', 'Bodil Awards'), ('m', 'http://www.wikidata.org/entity/Q4220917'), ('mName', 'film award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3241784'), ('oName', 'Golden Lion for Lifetime Achievements'), ('m', 'http://www.wikidata.org/entity/Q56116950'), ('mName', 'film award category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q139184'), ('oName', 'BAFTA Award for Best Film'), ('m', 'http://www.wikidata.org/entity/Q56116950'), ('mName', 'film award category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q768476'), ('oName', 'David di Donatello for Best Film'), ('m', 'http://www.wikidata.org/entity/Q56116950'), ('mName', 'film award category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1170507'), ('oName', 'Independent Spirit Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q56116950'), ('mName', 'film award category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q849124'), ('oName', 'Golden Globe Award for Best Screenplay'), ('m', 'http://www.wikidata.org/entity/Q56116950'), ('mName', 'film award category')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q797078'), ('oName', 'New York University Tisch School of the Arts'), ('m', 'http://www.wikidata.org/entity/Q380093'), ('mName', 'film school')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10800557'), ('oName', 'film actor'), ('m', 'http://www.wikidata.org/entity/Q4220920'), ('mName', 'filmmaking occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2526255'), ('oName', 'film director'), ('m', 'http://www.wikidata.org/entity/Q4220920'), ('mName', 'filmmaking occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28389'), ('oName', 'screenwriter'), ('m', 'http://www.wikidata.org/entity/Q4220920'), ('mName', 'filmmaking occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3282637'), ('oName', 'film producer'), ('m', 'http://www.wikidata.org/entity/Q4220920'), ('mName', 'filmmaking occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2455835'), ('oName', 'Woody Allen filmography'), ('m', 'http://www.wikidata.org/entity/Q1371849'), ('mName', 'filmography')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6581097'), ('oName', 'male'), ('m', 'http://www.wikidata.org/entity/Q48264'), ('mName', 'gender identity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13452531'), ('oName', 'Commandeur des Arts et des Lettres\\u200e'), ('m', 'http://www.wikidata.org/entity/Q60754876'), ('mName', 'grade of an order')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q31579'), ('oName', 'David di Donatello'), ('m', 'http://www.wikidata.org/entity/Q107655869'), ('mName', 'group of awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q174389'), ('oName', 'César Award'), ('m', 'http://www.wikidata.org/entity/Q107655869'), ('mName', 'group of awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q708135'), ('oName', 'Silver Bear'), ('m', 'http://www.wikidata.org/entity/Q107655869'), ('mName', 'group of awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1111310'), ('oName', 'Directors Guild of America Award'), ('m', 'http://www.wikidata.org/entity/Q107655869'), ('mName', 'group of awards')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10749664'), ('oName', 'Midwood High School'), ('m', 'http://www.wikidata.org/entity/Q9826'), ('mName', 'high school')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q99541706'), ('mName', 'historical unrecognized state')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q349357'), ('oName', 'Woody Herman'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1140914'), ('oName', 'Soon-Yi Previn'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q22673707'), ('oName', 'Bechet Dumaine Allen'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q22673708'), ('oName', 'Manzie Tio Allen'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q102642'), ('oName', 'Diane Keaton'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3831197'), ('oName', 'Letty Aronson'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q202725'), ('oName', 'Mia Farrow'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108223439'), ('oName', 'Martin Königsberg'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108223445'), ('oName', 'Nettie Königsberg'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q100135417'), ('oName', 'Dylan Farrow'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16217493'), ('oName', 'Moses Farrow'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7365461'), ('oName', 'Ronan Farrow'), ('m', 'http://www.wikidata.org/entity/Q5'), ('mName', 'human')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19961034'), ('oName', 'Woody'), ('m', 'http://www.wikidata.org/entity/Q1130279'), ('mName', 'hypocorism')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1860'), ('oName', 'English'), ('m', 'http://www.wikidata.org/entity/Q34770'), ('mName', 'language')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q463303'), ('oName', 'American Academy of Arts and Sciences'), ('m', 'http://www.wikidata.org/entity/Q955824'), ('mName', 'learned society')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19339'), ('oName', 'O. Henry Award'), ('m', 'http://www.wikidata.org/entity/Q378427'), ('mName', 'literary award')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19961034'), ('oName', 'Woody'), ('m', 'http://www.wikidata.org/entity/Q12308941'), ('mName', 'male given name')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1860'), ('oName', 'English'), ('m', 'http://www.wikidata.org/entity/Q1288568'), ('mName', 'modern language')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q67311526'), ('oName', 'Obalky knih.cz'), ('m', 'http://www.wikidata.org/entity/Q12038942'), ('mName', 'multimedia database')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15981151'), ('oName', 'jazz musician'), ('m', 'http://www.wikidata.org/entity/Q66715801'), ('mName', 'musical profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36834'), ('oName', 'composer'), ('m', 'http://www.wikidata.org/entity/Q66715801'), ('mName', 'musical profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q639669'), ('oName', 'musician'), ('m', 'http://www.wikidata.org/entity/Q66715801'), ('mName', 'musical profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q118865'), ('oName', 'clarinetist'), ('m', 'http://www.wikidata.org/entity/Q66715801'), ('mName', 'musical profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1860'), ('oName', 'English'), ('m', 'http://www.wikidata.org/entity/Q33742'), ('mName', 'natural language')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15981151'), ('oName', 'jazz musician'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1930187'), ('oName', 'journalist'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q214917'), ('oName', 'playwright'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q245068'), ('oName', 'comedian'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('oName', 'writer'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36834'), ('oName', 'composer'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q482980'), ('oName', 'author'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q118865'), ('oName', 'clarinetist'), ('m', 'http://www.wikidata.org/entity/Q12737077'), ('mName', 'occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1930187'), ('oName', 'journalist'), ('m', 'http://www.wikidata.org/entity/Q108300140'), ('mName', 'occupation group according to ISCO')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q599316'), ('oName', 'New School'), ('m', 'http://www.wikidata.org/entity/Q45400320'), ('mName', 'open-access publisher')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5'), ('oName', 'human'), ('m', 'http://www.wikidata.org/entity/Q55983715'), ('mName', 'organisms known by a particular common name')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q797078'), ('oName', 'New York University Tisch School of the Arts'), ('m', 'http://www.wikidata.org/entity/Q2029841'), ('mName', 'organization')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q797078'), ('oName', 'New York University Tisch School of the Arts'), ('m', 'http://www.wikidata.org/entity/Q23005231'), ('mName', 'performing arts school')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q288928'), ('oName', 'agnosticism'), ('m', 'http://www.wikidata.org/entity/Q12558574'), ('mName', 'point of view')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('oName', 'writer'), ('m', 'http://www.wikidata.org/entity/Q4164871'), ('mName', 'position')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q118865'), ('oName', 'clarinetist'), ('m', 'http://www.wikidata.org/entity/Q4164871'), ('mName', 'position')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q599316'), ('oName', 'New School'), ('m', 'http://www.wikidata.org/entity/Q23002054'), ('mName', 'private not-for-profit educational institution')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q599316'), ('oName', 'New School'), ('m', 'http://www.wikidata.org/entity/Q902104'), ('mName', 'private university')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18844224'), ('oName', 'science fiction writer'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1930187'), ('oName', 'journalist'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q245068'), ('oName', 'comedian'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2526255'), ('oName', 'film director'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('oName', 'writer'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q948329'), ('oName', 'character actor'), ('m', 'http://www.wikidata.org/entity/Q28640'), ('mName', 'profession')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q193023'), ('oName', 'Capitol Records'), ('m', 'http://www.wikidata.org/entity/Q18127'), ('mName', 'record label')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q288928'), ('oName', 'agnosticism'), ('m', 'http://www.wikidata.org/entity/Q4392985'), ('mName', 'religious identity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q599316'), ('oName', 'New School'), ('m', 'http://www.wikidata.org/entity/Q15936437'), ('mName', 'research university')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6581097'), ('oName', 'male'), ('m', 'http://www.wikidata.org/entity/Q4369513'), ('mName', 'sex of humans')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q3624078'), ('mName', 'sovereign state')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America'), ('m', 'http://www.wikidata.org/entity/Q1489259'), ('mName', 'superpower')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18844733'), ('oName', 'Crisis in Six Scenes'), ('m', 'http://www.wikidata.org/entity/Q5398426'), ('mName', 'television series')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q288928'), ('oName', 'agnosticism'), ('m', 'http://www.wikidata.org/entity/Q13649246'), ('mName', 'uncertainty')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q67311526'), ('oName', 'Obalky knih.cz'), ('m', 'http://www.wikidata.org/entity/Q186165'), ('mName', 'web portal')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q58488719'), ('oName', 'Billy Ireland Cartoon Library & Museum biographical files'), ('m', 'http://www.wikidata.org/entity/Q386724'), ('mName', 'work')]\n",
      "180\n"
     ]
    }
   ],
   "source": [
    "#Query 2\n",
    "\n",
    "# He could have different roles related to films. I am looking for object which is instance of film. I can filter them for things like 'film' or 'movie',\n",
    "# but I decided no to do it. Because maybe in the results I find somethings helpfull for other tasks.\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wdt:P106  => occupation\n",
    "# wdt:P31 => instance of\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName ?m ?mName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 ?p ?o .\n",
    "   ?o wdt:P31 ?m.\n",
    "      \n",
    "   # get the label\n",
    "   ?m sc:name ?mName.\n",
    "   ?o sc:name ?oName.\n",
    "   \n",
    "}\n",
    "ORDER BY (?mName)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1f7d8d62-c717-44cc-8188-0f457de4e86f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#Query 3\n",
    "\n",
    "# wd:Q11424 => film\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q11424 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q11424 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q11424 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5ff4cd09",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "554913b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "#Query 4\n",
    "\n",
    "\n",
    "# wd:Q11424 => film\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q11424 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q11424 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q11424 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a7df37c",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for director"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "aaeb3031",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q3455803'), ('oName', 'director')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3391743'), ('oName', 'visual artist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3406858'), ('oName', 'film professional')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 5\n",
    "\n",
    "# One of Woody Allen's occupation is film director. let check its superclass.\n",
    "# wd:Q2526255 => film director (Query 1)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2526255 wdt:P279 ?o  .\n",
    "   \n",
    "   # get the label\n",
    "   ?o  sc:name ?oName.\n",
    "}\n",
    "ORDER BY ?pName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "765a7a31",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "157260aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3455803'), ('name', 'director')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "#Query 6\n",
    "\n",
    "# wd:Q3455803 => director    (Query 5)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q3455803 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q3455803 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e838d641",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for film genre"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "20dbbf6c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('pName', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6145'), ('pName', 'Academy Awards Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('pName', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('pName', 'Allcinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('pName', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('pName', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2629'), ('pName', 'BBFC rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4438'), ('pName', 'BFI Films, TV and people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('pName', 'Bechdel Test Movie List ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('pName', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('pName', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2758'), ('pName', 'CNC film rating (France)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3402'), ('pName', 'CNC film rating (Romania)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3933'), ('pName', 'Cinema.de ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('pName', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('pName', 'Ciné-Ressources film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4276'), ('pName', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('pName', 'DNF film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('pName', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('pName', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3141'), ('pName', 'EDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('pName', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('pName', 'Elonet movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('pName', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1981'), ('pName', 'FSK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7970'), ('pName', 'FandangoNow ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('pName', 'FilmAffinity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2747'), ('pName', 'Filmiroda rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5032'), ('pName', 'Filmweb.pl film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('pName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('pName', 'Google Play Movies & TV ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5680'), ('pName', 'Hoopla title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5128'), ('pName', 'ICAA film catalogue ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3306'), ('pName', 'ICAA rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('pName', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('pName', 'ISAN')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('pName', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3650'), ('pName', 'JMK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('pName', 'KINENOTE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5311'), ('pName', 'Kino-teatr.ua film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('pName', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3340'), ('pName', 'Kvikmyndir film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('pName', 'LdiF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('pName', 'Letterboxd film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('pName', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5970'), ('pName', 'Medierådet rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('pName', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2509'), ('pName', 'Movie Walker film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('pName', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('pName', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('pName', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('pName', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('pName', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('pName', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('pName', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3834'), ('pName', 'RTC film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('pName', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('pName', 'Scope.dk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6584'), ('pName', 'Scripts.com script ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3145'), ('pName', 'Sratim ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('pName', 'Swedish Film Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('pName', 'TCM Movie Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('pName', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('pName', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('pName', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('pName', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5357'), ('pName', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('pName', 'The Numbers movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('pName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('pName', 'aspect ratio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('pName', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2142'), ('pName', 'box office')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('pName', 'cine.gr film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('pName', 'color')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('pName', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2130'), ('pName', 'cost')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('pName', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('pName', 'director of photography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('pName', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('pName', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3135'), ('pName', 'elCinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('pName', 'elFilm film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2755'), ('pName', 'exploitation visa number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1040'), ('pName', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P915'), ('pName', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('pName', 'iTunes movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pName', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('pName', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('pName', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('pName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('pName', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('pName', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('pName', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('pName', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('pName', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('pName', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('pName', 'ČSFD film ID')]\n",
      "104\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "#Query 7\n",
    "\n",
    "# Ckecking all properties of a film related to Woody Allen to find 'genre'\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q206124 ?p ?o  .\n",
    "   \n",
    "   # get the label\n",
    "   ?p  sc:name ?pName.\n",
    "}\n",
    "ORDER BY ?pName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "4e2b8b65-2fe4-4399-8b2f-707d9cc50120",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('g', 'http://www.wikidata.org/entity/Q108329096'), ('gName', 'genre by art form')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q15961987'), ('gName', 'television genre')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q201658'), ('gName', 'film genre')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q1194240'), ('gName', 'science fiction genre')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q20076756'), ('gName', 'speculative fiction genre')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q5151404'), ('gName', 'comedic genre')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# Query 8\n",
    "\n",
    "# Finding classes that genre of 'Midnight in Paris' is an instance of it.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P136 => genre    (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?g ?gName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q206124 wdt:P136 ?o .\n",
    "   ?o wdt:P31 ?g.\n",
    "   \n",
    "   # get the label\n",
    "   ?g sc:name ?gName.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c4bca15c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d0f6bcce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "\n",
    "#Query 9\n",
    "\n",
    "# wd:Q201658 => film genre\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q201658 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "\n",
    "   # get the label\n",
    "   wd:Q201658 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4896a041",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "2c4e27a1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('g', 'http://www.wikidata.org/entity/Q268854'), ('gName', 'Red Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q4235011'), ('gName', 'Space Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q172980'), ('gName', 'Western film')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q491158'), ('gName', 'Revisionist Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q212781'), ('gName', 'spaghetti western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q4836991'), ('gName', 'B western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q6804274'), ('gName', 'meat pie Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q5461696'), ('gName', 'Florida Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q4674071'), ('gName', 'Acid Western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q83646243'), ('gName', 'western animation')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q78528852'), ('gName', 'neo-western')]\n",
      "[('g', 'http://www.wikidata.org/entity/Q8066387'), ('gName', 'Zapata Western')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 10\n",
    "\n",
    "# To complete this task, I need to find 'western', 'realeased date', 'european',and 'country' (or similar/sysnonymum things).\n",
    "# From another workflow I know that\n",
    "    # wdt:P17 => 'country'\n",
    "    # wdt:P30 => 'continent'\n",
    "    # wd:Q46 => 'Europe'\n",
    "# However, I suppose every workflow as totally independent work. Thus I will try to find them again.\n",
    "\n",
    "# Usefull thing that I have found before are:\n",
    "# wdt:P577 => publication date  (Query 7)  ----> instead of released date\n",
    "# wdt:P495 => country of origin (Query 7)\n",
    "# wdt:P136 => genre    (Query 7)\n",
    "\n",
    "# First let find western.\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?g ?gName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?g wdt:P31 wd:Q201658.\n",
    "   \n",
    "   FILTER(REGEX(?gName, \"[Ww]estern\"))\n",
    "   \n",
    "   # get the label\n",
    "   ?g sc:name ?gName.\n",
    "}\n",
    "ORDER BY ?oName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "1ff7de57-fdc4-44c2-b7cb-98de2caf26b1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q12536'), ('oName', 'Abbasid Caliphate')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q23334'), ('oName', 'Abkhazia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1519'), ('oName', 'Abu Dhabi')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q207353'), ('oName', 'Acadia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1823'), ('oName', 'Aceh')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q389688'), ('oName', 'Achaemenid Empire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q131013'), ('oName', 'Acropolis of Athens')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q666909'), ('oName', 'Act of Mediation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5112'), ('oName', 'Adelaide')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q131694'), ('oName', 'Aden')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1152445'), ('oName', 'Aerican Empire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q889'), ('oName', 'Afghanistan')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15'), ('oName', 'Africa')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q555994'), ('oName', 'Ag Qoyunlu Tribe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q207600'), ('oName', 'Aghlabids')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q79952'), ('oName', 'Aguascalientes')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q797'), ('oName', 'Alaska')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q222'), ('oName', 'Albania')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1448131'), ('oName', 'Albanian Kingdom')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q87'), ('oName', 'Alexandria')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q218272'), ('oName', 'Algeria')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q262'), ('oName', 'Algeria')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2415901'), ('oName', 'Allied-occupied Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q35493'), ('oName', 'Almaty')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10400'), ('oName', 'Almería')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4733812'), ('oName', 'Almighty dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q199688'), ('oName', 'Almohad Caliphate')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1142'), ('oName', 'Alsace')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1635681'), ('oName', 'Alsasua – Altsasu')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6904'), ('oName', 'Alt Empordà')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5955'), ('oName', 'Altai Mountains')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5971'), ('oName', 'Altai Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q170453'), ('oName', 'Amazonas')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16641'), ('oName', 'American Samoa')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q55304'), ('oName', 'American occupation zone in Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q828'), ('oName', 'Americas')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q470148'), ('oName', 'Amerind languages')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q51614'), ('oName', 'Anatolia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11768'), ('oName', 'Ancient Egypt')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11772'), ('oName', 'Ancient Greece')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3149991'), ('oName', 'Ancient India')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1747689'), ('oName', 'Ancient Rome')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5783'), ('oName', 'Andalusia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3751548'), ('oName', 'Andean Region')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1159'), ('oName', 'Andhra Pradesh')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q228'), ('oName', 'Andorra')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q916'), ('oName', 'Angola')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25228'), ('oName', 'Anguilla')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107426'), ('oName', 'Anjou')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10828323'), ('oName', 'Annam')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 11\n",
    "\n",
    "# Finding sample country will help to find a property related to 'european'\n",
    "\n",
    "# wdt:P577 => publication date \n",
    "# wdt:P495 => country of origin\n",
    "# wdt:P136 => genre\n",
    "# wd:Q172980 => Western film (Query 10)\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P495 ?o.\n",
    "      \n",
    "   # get the label\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "ORDER BY ?oName\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "db5b123b-cb95-470a-81a8-588d03d0f75f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q27509'), ('oName', 'Central Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27468'), ('oName', 'Eastern Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q46'), ('oName', 'Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q166400'), ('oName', 'European Broadcasting Union')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q458'), ('oName', 'European Union')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27479'), ('oName', 'Northern Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27449'), ('oName', 'Southern Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27496'), ('oName', 'Western Europe')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q466039'), ('oName', 'continental Europe')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 12\n",
    "\n",
    "# Results of Query 11 not only includes countries, but also continet and cities. \n",
    "# let use it with filtering to reach 'country' and 'european' more quickly.\n",
    "\n",
    "# Usefull thing that I have found before are:\n",
    "# wdt:P577 => publication date \n",
    "# wdt:P495 => country of origin\n",
    "# wdt:P136 => genre\n",
    "# wd:Q172980 => Western film\n",
    "\n",
    "# wd:Q222 => Albania (Query 11) ----> an european country\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P495 ?o.\n",
    "   \n",
    "   FILTER(REGEX(?oName, \"[Ee]urop\"))\n",
    "   \n",
    "   # get the label\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "ORDER BY ?oName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d4a0bc73-c8a0-40e9-931a-2affe6e2a55d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pName', 'continent')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 13\n",
    "\n",
    "# Finding relation between 'Albania' and 'Europe'\n",
    "\n",
    "# Usefull thing that I have found before are:\n",
    "# wdt:P577 => publication date \n",
    "# wdt:P495 => country of origin\n",
    "# wdt:P136 => genre\n",
    "# wd:Q172980 => Western film\n",
    "# wd:Q46 => Europe\n",
    "\n",
    "# wd:Q222 => Albania (Query 11) ----> an european country\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q222 ?p wd:Q46.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "ORDER BY ?oName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "4a636294-cdef-4ff0-8016-4ce308a983eb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q40'), ('Country', 'Austria'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-10T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q40'), ('Country', 'Austria'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-13T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q40'), ('Country', 'Austria'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-14T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q31'), ('Country', 'Belgium'), ('Film', 'The Salvation'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q31'), ('Country', 'Belgium'), ('Film', 'The Salvation'), ('Releasedate', '2014-10-09T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q35'), ('Country', 'Denmark'), ('Film', 'The Salvation'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q35'), ('Country', 'Denmark'), ('Film', 'The Salvation'), ('Releasedate', '2014-10-09T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q142'), ('Country', 'France'), ('Film', 'The Homesman'), ('Releasedate', '2014-12-18T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q142'), ('Country', 'France'), ('Film', 'The Homesman'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q142'), ('Country', 'France'), ('Film', 'Blackthorn'), ('Releasedate', '2011-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-10T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-14T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('Film', 'The Dark Valley'), ('Releasedate', '2014-02-13T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('Film', 'Snowblind'), ('Releasedate', '2010-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('Film', 'Gold'), ('Releasedate', '2013-08-15T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q221'), ('Country', 'North Macedonia'), ('Film', 'To the Hilt'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q29'), ('Country', 'Spain'), ('Film', 'Blackthorn'), ('Releasedate', '2011-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q34'), ('Country', 'Sweden'), ('Film', 'The Salvation'), ('Releasedate', '2014-10-09T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q34'), ('Country', 'Sweden'), ('Film', 'The Salvation'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q43'), ('Country', 'Turkey'), ('Film', 'Yahsi Bati - The Ottoman Cowboys'), ('Releasedate', '2010-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q145'), ('Country', 'United Kingdom'), ('Film', 'Blackthorn'), ('Releasedate', '2011-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q145'), ('Country', 'United Kingdom'), ('Film', 'The Salvation'), ('Releasedate', '2014-10-09T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q145'), ('Country', 'United Kingdom'), ('Film', 'The Salvation'), ('Releasedate', '2014-01-01T00:00:00Z')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q145'), ('Country', 'United Kingdom'), ('Film', 'Slow West'), ('Releasedate', '2015-01-24T00:00:00Z')]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 14\n",
    "\n",
    "# TASK 4:\n",
    "    # Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 \n",
    "    # (the result set must be country IRI, label and #films).\n",
    "    \n",
    "# Let find all western films from european countries from 2010-01-01 to 2015-31-12 to check if everythings is correct.\n",
    "\n",
    "# Usefull thing that I have found before are:\n",
    "# wdt:P577 => publication date \n",
    "# wdt:P495 => country of origin\n",
    "# wdt:P136 => genre\n",
    "# wd:Q172980 => Western film\n",
    "# wd:Q46 => Europe\n",
    "# wdt:P30 => continent\n",
    "# wd:Q11424 => film\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?c as ?IRI ?Country  ?Film ?d as ?Releasedate\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?f wdt:P31 wd:Q11424 ;\n",
    "      wdt:P136 wd:Q172980 ;\n",
    "      wdt:P495 ?c ;\n",
    "      wdt:P577 ?d .\n",
    "      \n",
    "   ?c wdt:P30 wd:Q46 .\n",
    "\n",
    "   FILTER(2010 <= year(?d) && year(?d) <= 2015 )\n",
    "   \n",
    "   # get the label\n",
    "   ?c sc:name ?Country.\n",
    "   ?f sc:name ?Film.\n",
    "}\n",
    "ORDER BY ?Country\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73b262c3",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "59341ed8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q40'), ('Country', 'Austria'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q31'), ('Country', 'Belgium'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q35'), ('Country', 'Denmark'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q142'), ('Country', 'France'), ('noOfFilms', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183'), ('Country', 'Germany'), ('noOfFilms', '3')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q221'), ('Country', 'North Macedonia'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q29'), ('Country', 'Spain'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q34'), ('Country', 'Sweden'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q43'), ('Country', 'Turkey'), ('noOfFilms', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q145'), ('Country', 'United Kingdom'), ('noOfFilms', '3')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 15\n",
    "\n",
    "# TASK 4:\n",
    "    # Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 \n",
    "    # (the result set must be country IRI, label and #films).\n",
    "    \n",
    "# Query 14 shows that some films has more than one release date. They should be count once.\n",
    "\n",
    "# Usefull thing that I have found before are:\n",
    "# wdt:P577 => publication date \n",
    "# wdt:P495 => country of origin\n",
    "# wdt:P136 => genre\n",
    "# wd:Q172980 => Western film\n",
    "# wd:Q46 => Europe\n",
    "# wdt:P30 => continent\n",
    "# wd:Q11424 => film\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?c as ?IRI ?Country  (COUNT(DISTINCT(?f)) as ?noOfFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?f wdt:P31 wd:Q11424 ;\n",
    "      wdt:P136 wd:Q172980 ;\n",
    "      wdt:P495 ?c ;\n",
    "      wdt:P577 ?d .\n",
    "      \n",
    "   ?c wdt:P30 wd:Q46 .\n",
    "   \n",
    "   FILTER(2010 <= year(?d) && year(?d) <= 2015 )\n",
    "   \n",
    "   # get the label\n",
    "   ?c sc:name ?Country.\n",
    "   ?f sc:name ?Film.\n",
    "}\n",
    "ORDER BY ASC(?Country)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61e6995e",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "6a84e608",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pdate', '1982-01-01T00:00:00Z')]\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pdate', '1982-10-15T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-07-26T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-09-18T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-12-05T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-12-12T00:00:00Z')]\n",
      "[('film', 'Alice'), ('pdate', '1990-01-01T00:00:00Z')]\n",
      "[('film', 'Alice'), ('pdate', '1991-02-28T00:00:00Z')]\n",
      "[('film', 'Annie Hall'), ('pdate', '1977-04-20T00:00:00Z')]\n",
      "[('film', 'Another Woman'), ('pdate', '1988-01-01T00:00:00Z')]\n",
      "[('film', 'Another Woman'), ('pdate', '1989-03-16T00:00:00Z')]\n",
      "[('film', 'Anything Else'), ('pdate', '2003-01-01T00:00:00Z')]\n",
      "[('film', 'Bananas'), ('pdate', '1971-01-01T00:00:00Z')]\n",
      "[('film', 'Bananas'), ('pdate', '1974-08-30T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-07-26T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-08-29T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-11-07T00:00:00Z')]\n",
      "[('film', 'Broadway Danny Rose'), ('pdate', '1984-01-01T00:00:00Z')]\n",
      "[('film', 'Broadway Danny Rose'), ('pdate', '1984-08-17T00:00:00Z')]\n",
      "[('film', 'Bullets Over Broadway'), ('pdate', '1994-09-16T00:00:00Z')]\n",
      "[('film', 'Bullets Over Broadway'), ('pdate', '1995-04-20T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-01-01T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-11-10T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-11-17T00:00:00Z')]\n",
      "[('film', \"Cassandra's Dream\"), ('pdate', '2007-01-01T00:00:00Z')]\n",
      "[('film', \"Cassandra's Dream\"), ('pdate', '2008-06-05T00:00:00Z')]\n",
      "[('film', 'Celebrity'), ('pdate', '1998-09-07T00:00:00Z')]\n",
      "[('film', 'Celebrity'), ('pdate', '1999-04-08T00:00:00Z')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pdate', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pdate', '1990-03-01T00:00:00Z')]\n",
      "[('film', 'Deconstructing Harry'), ('pdate', '1997-01-01T00:00:00Z')]\n",
      "[('film', 'Deconstructing Harry'), ('pdate', '1998-05-21T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1996-01-01T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1996-12-08T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1997-08-14T00:00:00Z')]\n",
      "[('film', 'Everything You Always Wanted to Know About Sex*'), ('pdate', '1972-01-01T00:00:00Z')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pdate', '1986-02-07T00:00:00Z')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pdate', '1986-10-02T00:00:00Z')]\n",
      "[('film', 'Hollywood Ending'), ('pdate', '2002-01-01T00:00:00Z')]\n",
      "[('film', 'Husbands and Wives'), ('pdate', '1992-01-01T00:00:00Z')]\n",
      "[('film', 'Husbands and Wives'), ('pdate', '1993-02-25T00:00:00Z')]\n",
      "[('film', 'Interiors'), ('pdate', '1978-01-01T00:00:00Z')]\n",
      "[('film', 'Irrational Man'), ('pdate', '2015-05-16T00:00:00Z')]\n",
      "[('film', 'Love and Death'), ('pdate', '1975-01-01T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-01-01T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-11-13T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-12-04T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-01-01T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-08-30T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-12-14T00:00:00Z')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pdate', '1993-01-01T00:00:00Z')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pdate', '1994-02-03T00:00:00Z')]\n",
      "[('film', 'Match Point'), ('pdate', '2005-05-12T00:00:00Z')]\n",
      "[('film', 'Match Point'), ('pdate', '2005-12-29T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2004-01-01T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2005-03-18T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2005-06-23T00:00:00Z')]\n",
      "[('film', 'Midnight in Paris'), ('pdate', '2011-01-01T00:00:00Z')]\n",
      "[('film', 'Midnight in Paris'), ('pdate', '2011-08-18T00:00:00Z')]\n",
      "[('film', 'Mighty Aphrodite'), ('pdate', '1995-01-01T00:00:00Z')]\n",
      "[('film', 'Mighty Aphrodite'), ('pdate', '1996-08-15T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-03-10T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-09-21T00:00:00Z')]\n",
      "[('film', 'Radio Days'), ('pdate', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'Radio Days'), ('pdate', '1987-10-01T00:00:00Z')]\n",
      "[('film', \"Rifkin's Festival\"), ('pdate', '2020-01-01T00:00:00Z')]\n",
      "[('film', 'September'), ('pdate', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'September'), ('pdate', '1988-03-31T00:00:00Z')]\n",
      "[('film', 'Shadows and Fog'), ('pdate', '1991-01-01T00:00:00Z')]\n",
      "[('film', 'Shadows and Fog'), ('pdate', '1992-02-27T00:00:00Z')]\n",
      "[('film', 'Sleeper'), ('pdate', '1973-12-17T00:00:00Z')]\n",
      "[('film', 'Sleeper'), ('pdate', '1974-04-25T00:00:00Z')]\n",
      "[('film', 'Small Time Crooks'), ('pdate', '2000-01-01T00:00:00Z')]\n",
      "[('film', 'Small Time Crooks'), ('pdate', '2000-11-30T00:00:00Z')]\n",
      "[('film', 'Stardust Memories'), ('pdate', '1980-01-01T00:00:00Z')]\n",
      "[('film', 'Stardust Memories'), ('pdate', '1981-01-22T00:00:00Z')]\n",
      "[('film', 'Sweet and Lowdown'), ('pdate', '1999-01-01T00:00:00Z')]\n",
      "[('film', 'Sweet and Lowdown'), ('pdate', '2000-03-30T00:00:00Z')]\n",
      "[('film', 'Take the Money and Run'), ('pdate', '1969-01-01T00:00:00Z')]\n",
      "[('film', 'The Concert for New York City'), ('pdate', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pdate', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pdate', '2001-12-06T00:00:00Z')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pdate', '1985-01-01T00:00:00Z')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pdate', '1985-10-03T00:00:00Z')]\n",
      "[('film', 'To Rome with Love'), ('pdate', '2012-01-01T00:00:00Z')]\n",
      "[('film', 'To Rome with Love'), ('pdate', '2012-08-30T00:00:00Z')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pdate', '2008-01-01T00:00:00Z')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pdate', '2008-12-04T00:00:00Z')]\n",
      "[('film', \"What's Up, Tiger Lily?\"), ('pdate', '1966-01-01T00:00:00Z')]\n",
      "[('film', 'Whatever Works'), ('pdate', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'Whatever Works'), ('pdate', '2009-12-03T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2017-12-01T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2017-12-07T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2018-01-11T00:00:00Z')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pdate', '2010-01-01T00:00:00Z')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pdate', '2010-12-02T00:00:00Z')]\n",
      "[('film', 'Zelig'), ('pdate', '1983-01-01T00:00:00Z')]\n",
      "[('film', 'Zelig'), ('pdate', '1983-09-30T00:00:00Z')]\n",
      "[('film', 'scoop'), ('pdate', '2006-01-01T00:00:00Z')]\n",
      "[('film', 'scoop'), ('pdate', '2006-11-16T00:00:00Z')]\n",
      "101\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 16\n",
    "\n",
    "# Finding films directed by Woody Allen and their details to have a clue.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?pdate\n",
    "WHERE {\n",
    "   # bind something\n",
    "  ?f wdt:P31 wd:Q11424 ;\n",
    "     wdt:P57 wd:Q25089 ;\n",
    "     wdt:P577 ?pdate .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?f sc:name ?film.\n",
    "\n",
    "}\n",
    "ORDER BY (?film)  (?pdate) \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "f328c091-ba3c-4ea8-b74a-d5453b4297d9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', \"What's Up, Tiger Lily?\"), ('pYear', '1966')]\n",
      "[('film', 'Take the Money and Run'), ('pYear', '1969')]\n",
      "[('film', 'Bananas'), ('pYear', '1971')]\n",
      "[('film', 'Everything You Always Wanted to Know About Sex*'), ('pYear', '1972')]\n",
      "[('film', 'Sleeper'), ('pYear', '1973')]\n",
      "[('film', 'Love and Death'), ('pYear', '1975')]\n",
      "[('film', 'Annie Hall'), ('pYear', '1977')]\n",
      "[('film', 'Interiors'), ('pYear', '1978')]\n",
      "[('film', 'Manhattan'), ('pYear', '1979')]\n",
      "[('film', 'Stardust Memories'), ('pYear', '1980')]\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pYear', '1982')]\n",
      "[('film', 'Zelig'), ('pYear', '1983')]\n",
      "[('film', 'Broadway Danny Rose'), ('pYear', '1984')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pYear', '1985')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pYear', '1986')]\n",
      "[('film', 'Radio Days'), ('pYear', '1987')]\n",
      "[('film', 'September'), ('pYear', '1987')]\n",
      "[('film', 'Another Woman'), ('pYear', '1988')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pYear', '1989')]\n",
      "[('film', 'New York Stories'), ('pYear', '1989')]\n",
      "[('film', 'Alice'), ('pYear', '1990')]\n",
      "[('film', 'Shadows and Fog'), ('pYear', '1991')]\n",
      "[('film', 'Husbands and Wives'), ('pYear', '1992')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pYear', '1993')]\n",
      "[('film', 'Bullets Over Broadway'), ('pYear', '1994')]\n",
      "[('film', 'Mighty Aphrodite'), ('pYear', '1995')]\n",
      "[('film', 'Everyone Says I Love You'), ('pYear', '1996')]\n",
      "[('film', 'Deconstructing Harry'), ('pYear', '1997')]\n",
      "[('film', 'Celebrity'), ('pYear', '1998')]\n",
      "[('film', 'Sweet and Lowdown'), ('pYear', '1999')]\n",
      "[('film', 'Small Time Crooks'), ('pYear', '2000')]\n",
      "[('film', 'The Concert for New York City'), ('pYear', '2001')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pYear', '2001')]\n",
      "[('film', 'Hollywood Ending'), ('pYear', '2002')]\n",
      "[('film', 'Anything Else'), ('pYear', '2003')]\n",
      "[('film', 'Melinda and Melinda'), ('pYear', '2004')]\n",
      "[('film', 'Match Point'), ('pYear', '2005')]\n",
      "[('film', 'scoop'), ('pYear', '2006')]\n",
      "[('film', \"Cassandra's Dream\"), ('pYear', '2007')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pYear', '2008')]\n",
      "[('film', 'Whatever Works'), ('pYear', '2009')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pYear', '2010')]\n",
      "[('film', 'Midnight in Paris'), ('pYear', '2011')]\n",
      "[('film', 'To Rome with Love'), ('pYear', '2012')]\n",
      "[('film', 'Blue Jasmine'), ('pYear', '2013')]\n",
      "[('film', 'Magic in the Moonlight'), ('pYear', '2014')]\n",
      "[('film', 'Irrational Man'), ('pYear', '2015')]\n",
      "[('film', 'Café Society'), ('pYear', '2016')]\n",
      "[('film', 'Wonder Wheel'), ('pYear', '2017')]\n",
      "[('film', 'A Rainy Day in New York'), ('pYear', '2019')]\n",
      "[('film', \"Rifkin's Festival\"), ('pYear', '2020')]\n",
      "51\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 17\n",
    "\n",
    "# Lots of films have more than one publication date.\n",
    "# Selecting first publication date for each film.\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film (MIN(YEAR(?pdate)) as ?pYear)\n",
    "WHERE {\n",
    "   # bind something\n",
    "  ?f wdt:P31 wd:Q11424 ;\n",
    "     wdt:P57 wd:Q25089 ;\n",
    "     wdt:P577 ?pdate .\n",
    "   \n",
    "   # get the label\n",
    "   ?f sc:name ?film.\n",
    "\n",
    "}\n",
    "ORDER BY ASC(?pYear) (?film)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e20aaf9",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "125e3cd1-a4bb-40e8-86e2-d70c8060da98",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pYear', '1966'), ('filmNo', '1')]\n",
      "[('pYear', '1969'), ('filmNo', '1')]\n",
      "[('pYear', '1971'), ('filmNo', '1')]\n",
      "[('pYear', '1972'), ('filmNo', '1')]\n",
      "[('pYear', '1973'), ('filmNo', '1')]\n",
      "[('pYear', '1975'), ('filmNo', '1')]\n",
      "[('pYear', '1977'), ('filmNo', '1')]\n",
      "[('pYear', '1978'), ('filmNo', '1')]\n",
      "[('pYear', '1979'), ('filmNo', '1')]\n",
      "[('pYear', '1980'), ('filmNo', '1')]\n",
      "[('pYear', '1982'), ('filmNo', '1')]\n",
      "[('pYear', '1983'), ('filmNo', '1')]\n",
      "[('pYear', '1984'), ('filmNo', '1')]\n",
      "[('pYear', '1985'), ('filmNo', '1')]\n",
      "[('pYear', '1986'), ('filmNo', '1')]\n",
      "[('pYear', '1987'), ('filmNo', '2')]\n",
      "[('pYear', '1988'), ('filmNo', '1')]\n",
      "[('pYear', '1989'), ('filmNo', '2')]\n",
      "[('pYear', '1990'), ('filmNo', '1')]\n",
      "[('pYear', '1991'), ('filmNo', '1')]\n",
      "[('pYear', '1992'), ('filmNo', '1')]\n",
      "[('pYear', '1993'), ('filmNo', '1')]\n",
      "[('pYear', '1994'), ('filmNo', '1')]\n",
      "[('pYear', '1995'), ('filmNo', '1')]\n",
      "[('pYear', '1996'), ('filmNo', '1')]\n",
      "[('pYear', '1997'), ('filmNo', '1')]\n",
      "[('pYear', '1998'), ('filmNo', '1')]\n",
      "[('pYear', '1999'), ('filmNo', '1')]\n",
      "[('pYear', '2000'), ('filmNo', '1')]\n",
      "[('pYear', '2001'), ('filmNo', '2')]\n",
      "[('pYear', '2002'), ('filmNo', '1')]\n",
      "[('pYear', '2003'), ('filmNo', '1')]\n",
      "[('pYear', '2004'), ('filmNo', '1')]\n",
      "[('pYear', '2005'), ('filmNo', '1')]\n",
      "[('pYear', '2006'), ('filmNo', '1')]\n",
      "[('pYear', '2007'), ('filmNo', '1')]\n",
      "[('pYear', '2008'), ('filmNo', '1')]\n",
      "[('pYear', '2009'), ('filmNo', '1')]\n",
      "[('pYear', '2010'), ('filmNo', '1')]\n",
      "[('pYear', '2011'), ('filmNo', '1')]\n",
      "[('pYear', '2012'), ('filmNo', '1')]\n",
      "[('pYear', '2013'), ('filmNo', '1')]\n",
      "[('pYear', '2014'), ('filmNo', '1')]\n",
      "[('pYear', '2015'), ('filmNo', '1')]\n",
      "[('pYear', '2016'), ('filmNo', '1')]\n",
      "[('pYear', '2017'), ('filmNo', '1')]\n",
      "[('pYear', '2019'), ('filmNo', '1')]\n",
      "[('pYear', '2020'), ('filmNo', '1')]\n",
      "48\n"
     ]
    }
   ],
   "source": [
    "# Query 18\n",
    "\n",
    "# Counting no of films for each year.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "{\n",
    "    SELECT DISTINCT ?film (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "    {\n",
    "        # bind something\n",
    "        ?f wdt:P31 wd:Q11424 ;\n",
    "            wdt:P57 wd:Q25089 ;\n",
    "            wdt:P577 ?pdate .\n",
    "        \n",
    "        # get the label\n",
    "        ?f sc:name ?film.\n",
    "    }\n",
    "    GROUP BY ?film\n",
    "}\n",
    "GROUP BY ?pYear\n",
    "ORDER BY ?pYear\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "fe9861ea-d2ca-4e00-a575-9d645f280fb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1966'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1969'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1971'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1972'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1973'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1975'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1977'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1978'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1979'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1980'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1982'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1983'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1984'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1985'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1986'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1987'), ('filmNo', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1988'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1989'), ('filmNo', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1990'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1991'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1992'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1993'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1994'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1995'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1996'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1997'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1998'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '1999'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2000'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2001'), ('filmNo', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2002'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2003'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2004'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2005'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2006'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2007'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2008'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2009'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2010'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2011'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2012'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2013'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2014'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2015'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2016'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2017'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2019'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('pYear', '2020'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '1992'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '1994'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '1997'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2003'), ('filmNo', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2004'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2005'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2007'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2009'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2012'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2015'), ('filmNo', '1')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('pYear', '2019'), ('filmNo', '1')]\n",
      "59\n"
     ]
    }
   ],
   "source": [
    "# Query 19\n",
    "\n",
    "# Adding both directors to query. \n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "{\n",
    "    SELECT DISTINCT ?IRI ?film (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "    {\n",
    "        # bind something\n",
    "        VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "        ?f wdt:P31 wd:Q11424 ;\n",
    "            wdt:P57 ?IRI ;\n",
    "            wdt:P577 ?pdate .\n",
    "        \n",
    "        # get the label\n",
    "        ?f sc:name ?film.\n",
    "    }\n",
    "    GROUP BY ?IRI ?film\n",
    "}\n",
    "GROUP BY ?IRI ?pYear\n",
    "ORDER BY ?IRI ?pYear\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "6acd870d-1ae1-4692-937b-1d06e6595876",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('maxNo', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('maxNo', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Query 20\n",
    "\n",
    "# Finding max no of published films per year for each director. \n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT ?IRI  (MAX(?filmNo) as ?maxNo)\n",
    "{\n",
    "    SELECT DISTINCT ?IRI ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "    {\n",
    "        SELECT DISTINCT ?IRI ?film (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "        {\n",
    "            # bind something\n",
    "            VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "            ?f wdt:P31 wd:Q11424 ;\n",
    "                wdt:P57 ?IRI ;\n",
    "                wdt:P577 ?pdate .\n",
    "            \n",
    "            # get the label\n",
    "            ?f sc:name ?film.\n",
    "        }\n",
    "        GROUP BY ?IRI ?film\n",
    "    }\n",
    "    GROUP BY ?IRI ?pYear\n",
    "}\n",
    "GROUP BY ?IRI\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "75976021-fd0a-4b77-90ae-5cd6a11f4d62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('Year', '2003'), ('noOfFilms', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('Director', 'Woody Allen'), ('Year', '1989, 1987, 2001'), ('noOfFilms', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Query 21\n",
    "\n",
    "# Now for each director I should compare number of films per year with related maximum.\n",
    "# I will use the same query as before, but I will add a filter to get only the years with maximum films. \n",
    "\n",
    "# I suppose that the the task wants to consider each director separately, so I will use a subquery to get the number of films per year for each one of them.\n",
    "# In case that the meaning of task was different,\n",
    "# for example find the year that sum of the films released by all directors are maximum and then find each one contributions, the query would be different.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?Director (GROUP_CONCAT(?pYear; SEPARATOR=\", \") as ?Year) (?filmNo as ?noOfFilms) WHERE\n",
    "{\n",
    "\n",
    "############################################################################################################\n",
    "    # get the number of films per year\n",
    "    # I will use a subquery to get the number of films per year\n",
    "    # Its output are IRI, pYear and filmNo\n",
    "    {\n",
    "        SELECT DISTINCT ?IRI ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "        {\n",
    "            SELECT DISTINCT ?IRI ?f (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "            {\n",
    "                # bind something\n",
    "                VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "                ?f wdt:P31 wd:Q11424 ;\n",
    "                    wdt:P57 ?IRI ;\n",
    "                    wdt:P577 ?pdate .\n",
    "            }\n",
    "            GROUP BY ?IRI ?f\n",
    "        }\n",
    "        GROUP BY ?IRI ?pYear\n",
    "    }\n",
    "############################################################################################################\n",
    "    # get the maximum number of films per year\n",
    "    # I will use a subquery to get the maximum number of films per year\n",
    "    # Its output are IRIm and maxNo\n",
    "    {\n",
    "        SELECT ?IRIm  (MAX(?filmNo) as ?maxNo)\n",
    "        {\n",
    "            SELECT DISTINCT ?IRIm ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "            {\n",
    "                SELECT DISTINCT ?IRIm ?f (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "                {\n",
    "                    # bind something\n",
    "                    VALUES ?IRIm {wd:Q25089 wd:Q3772}\n",
    "                    ?f wdt:P31 wd:Q11424 ;\n",
    "                        wdt:P57 ?IRIm ;\n",
    "                        wdt:P577 ?pdate .\n",
    "                }\n",
    "                GROUP BY ?IRIm ?f\n",
    "            }\n",
    "            GROUP BY ?IRIm ?pYear\n",
    "        }\n",
    "        GROUP BY ?IRIm\n",
    "    }\n",
    "############################################################################################################\n",
    "\n",
    "\n",
    "FILTER(?IRIm = ?IRI && ?filmNo = ?maxNo)\n",
    "\n",
    "?IRI sc:name ?Director\n",
    "\n",
    "}\n",
    "GROUP BY ?IRI  ?Director ?filmNo\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "3ddf3881",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('Year', '2003'), ('noOfFilms', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('Director', 'Woody Allen'), ('Year', '1989, 1987, 2001'), ('noOfFilms', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 22\n",
    "\n",
    "# Now for each director I should compare number of films per year with related maximum.\n",
    "# I will use the same query as before, but I will add a filter to get only the years with maximum films. \n",
    "\n",
    "# I suppose that the the task wants to consider each director separately, so I will use a subquery to get the number of films per year for each one of them.\n",
    "# In case that the meaning of task was different,\n",
    "# for example find the year sum of the films released by all directors are maximum and then find each one contributions, the query would be different.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?Director (GROUP_CONCAT(?pYear; SEPARATOR=\", \") as ?Year) (?filmNo as ?noOfFilms) WHERE\n",
    "{\n",
    "\n",
    "############################################################################################################\n",
    "    # get the number of films per year\n",
    "    # I will use a subquery to get the number of films per year\n",
    "    # Its output are IRI, pYear and filmNo\n",
    "    {\n",
    "        SELECT DISTINCT ?IRI ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "        {\n",
    "            SELECT DISTINCT ?IRI ?f (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "            {\n",
    "                # bind something\n",
    "                VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "                ?f wdt:P31 wd:Q11424 ;\n",
    "                    wdt:P57 ?IRI ;\n",
    "                    wdt:P577 ?pdate .\n",
    "            }\n",
    "            GROUP BY ?IRI ?f\n",
    "        }\n",
    "        GROUP BY ?IRI ?pYear\n",
    "    }\n",
    "############################################################################################################\n",
    "    # get the maximum number of films per year\n",
    "    # I will use a subquery to get the maximum number of films per year\n",
    "    # Its output are IRIm and maxNo\n",
    "    {\n",
    "        SELECT ?IRIm  (MAX(?filmNo) as ?maxNo)\n",
    "        {\n",
    "            SELECT DISTINCT ?IRIm ?pYear (COUNT(?pYear) as ?filmNo) WHERE\n",
    "            {\n",
    "                SELECT DISTINCT ?IRIm ?f (MIN(YEAR(?pdate)) as ?pYear) WHERE\n",
    "                {\n",
    "                    # bind something\n",
    "                    VALUES ?IRIm {wd:Q25089 wd:Q3772}\n",
    "                    ?f wdt:P31 wd:Q11424 ;\n",
    "                        wdt:P57 ?IRIm ;\n",
    "                        wdt:P577 ?pdate .\n",
    "                }\n",
    "                GROUP BY ?IRIm ?f\n",
    "            }\n",
    "            GROUP BY ?IRIm ?pYear\n",
    "        }\n",
    "        GROUP BY ?IRIm\n",
    "    }\n",
    "############################################################################################################\n",
    "\n",
    "\n",
    "FILTER(?IRIm = ?IRI && ?filmNo = ?maxNo)\n",
    "\n",
    "?IRI sc:name ?Director\n",
    "\n",
    "}\n",
    "GROUP BY ?IRI  ?Director ?filmNo\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "37e07c8f",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Identify the BGP for Academy Awards"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7358d6af",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries\n",
    "\n",
    "# In the result of Query 2, I have it.\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "547a0587",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "14192c78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q19020'), ('name', 'Academy Awards')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 23\n",
    "\n",
    "\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q19020 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q19020 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3afd8dd7",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "d1611633",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Once Upon a Time in Hollywood'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Once Upon a Time in Hollywood'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Original Score')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Vicky Cristina Barcelona'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 24\n",
    "\n",
    "# Ckecking all films from both directors that recieve an Academy Awards.\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director ?fName ?aName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   \n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P166 ?a .\n",
    "      \n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "ORDER BY ?Director ?fName ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "67c2978e-4de8-40f5-9aa6-ce7d462708b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('awards', '2')]\n",
      "[('Director', 'Quentin Tarantino'), ('awards', '1')]\n",
      "[('Director', 'Woody Allen'), ('awards', '4')]\n",
      "[('Director', 'Woody Allen'), ('awards', '3')]\n",
      "[('Director', 'Woody Allen'), ('awards', '1')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 25\n",
    "\n",
    "# Counting awards of each film, grouping based on director and film\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director (COUNT(DISTINCT(?aName)) as ?awards)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   \n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P166 ?a .\n",
    "      \n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "GROUP BY ?Director ?fName\n",
    "ORDER BY ?Director DESC(?awards)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "63749e37-71be-4586-9b1c-fb51f7b06b70",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Woody Allen'), ('maxAwards', '4')]\n",
      "[('Director', 'Quentin Tarantino'), ('maxAwards', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Query 26\n",
    "\n",
    "# Maximun awards of each director\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director (MAX(?awards) as ?maxAwards) WHERE\n",
    "{\n",
    "   SELECT DISTINCT ?Director (COUNT(DISTINCT(?aName)) as ?awards) WHERE\n",
    "   {\n",
    "      # bind something\n",
    "      VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "      \n",
    "      ?f wdt:P57 ?IRI ;\n",
    "         wdt:P166 ?a .\n",
    "         \n",
    "      ?a wdt:P31 wd:Q19020 .\n",
    "      \n",
    "      # get the label\n",
    "      ?f  sc:name ?fName.\n",
    "      ?a sc:name ?aName.\n",
    "      ?IRI sc:name ?Director.\n",
    "   }\n",
    "   GROUP BY ?Director ?fName\n",
    "}\n",
    "GROUP BY ?Director\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "90ba83bd-04b4-4de2-86ba-f8c3f9dfeeb0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('film', 'Django Unchained'), ('awards', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('film', 'Once Upon a Time in Hollywood'), ('awards', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('Director', 'Woody Allen'), ('film', 'Annie Hall'), ('awards', '4')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# Query 27\n",
    "\n",
    "# Counting awards of each film, grouping based on director and film\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?IRI ?Director ?filmIRI ?film ?awards WHERE\n",
    "{\n",
    "\n",
    "############################################################################################################\n",
    "# get the number of awards per film for each director\n",
    "# Output are IRI, f (filmIRI) and awards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRI ?f (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "   {\n",
    "      # bind something\n",
    "      VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "      ?f wdt:P57 ?IRI ;\n",
    "         wdt:P166 ?a .  \n",
    "      ?a wdt:P31 wd:Q19020 .\n",
    "   }\n",
    "   GROUP BY ?IRI ?f\n",
    "   }\n",
    "############################################################################################################\n",
    "# get the maximum of awards per film for each director\n",
    "# Output are IRIm and maxAwards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRIm (MAX(?awards) as ?maxAwards) WHERE\n",
    "   {\n",
    "      SELECT DISTINCT ?IRIm (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "      {\n",
    "         # bind something\n",
    "         VALUES ?IRIm {wd:Q25089 wd:Q3772}\n",
    "         ?f wdt:P57 ?IRIm ;\n",
    "            wdt:P166 ?a .\n",
    "         ?a wdt:P31 wd:Q19020 .\n",
    "      }\n",
    "      GROUP BY ?IRIm ?f\n",
    "   }\n",
    "   GROUP BY ?IRIm\n",
    "   }\n",
    "############################################################################################################\n",
    "\n",
    "   FILTER(?IRI = ?IRIm && ?awards = ?maxAwards)\n",
    "\n",
    "   # get the label\n",
    "   ?f  sc:name ?film.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3442462",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "fefedff3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('Director', 'Woody Allen'), ('filmIRI', 'http://www.wikidata.org/entity/Q233464'), ('filmtitle', 'Annie Hall'), ('awards', '4')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('filmIRI', 'http://www.wikidata.org/entity/Q571032, http://www.wikidata.org/entity/Q47300912'), ('filmtitle', 'Django Unchained, Once Upon a Time in Hollywood'), ('awards', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 28\n",
    "\n",
    "# What is done is very similar to Task 5. \n",
    "# Note that filmIRIs and filmTitles are in same order in concatenated output result.\n",
    "\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?IRI ?Director (GROUP_CONCAT(?f; SEPARATOR=\", \") as ?filmIRI) (GROUP_CONCAT(?film; SEPARATOR=\", \") as ?filmtitle) ?awards WHERE\n",
    "{\n",
    "\n",
    "############################################################################################################\n",
    "# get the number of awards per film for each director\n",
    "# Output are IRI, f (filmIRI) and awards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRI ?f (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "   {\n",
    "      # bind something\n",
    "      VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "      ?f wdt:P57 ?IRI ;\n",
    "         wdt:P166 ?a .  \n",
    "      ?a wdt:P31 wd:Q19020 .\n",
    "   }\n",
    "   GROUP BY ?IRI ?f\n",
    "   }\n",
    "############################################################################################################\n",
    "# get the maximum of awards per film for each director\n",
    "# Output are IRIm and maxAwards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRIm (MAX(?awards) as ?maxAwards) WHERE\n",
    "   {\n",
    "      SELECT DISTINCT ?IRIm (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "      {\n",
    "         # bind something\n",
    "         VALUES ?IRIm {wd:Q25089 wd:Q3772}\n",
    "         ?f wdt:P57 ?IRIm ;\n",
    "            wdt:P166 ?a .\n",
    "         ?a wdt:P31 wd:Q19020 .\n",
    "      }\n",
    "      GROUP BY ?IRIm ?f\n",
    "   }\n",
    "   GROUP BY ?IRIm\n",
    "   }\n",
    "############################################################################################################\n",
    "\n",
    "   FILTER(?IRI = ?IRIm && ?awards = ?maxAwards)\n",
    "\n",
    "   # get the label\n",
    "   ?f  sc:name ?film.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a01a08ec",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "b1943f54",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Sound Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Sound')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Sound Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Jackie Brown'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Original Score')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Alice'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Broadway Danny Rose'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Broadway Danny Rose'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Costume Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Deconstructing Harry'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Husbands and Wives'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Husbands and Wives'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Manhattan'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Manhattan'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Match Point'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Radio Days'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Radio Days'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Sweet and Lowdown'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Sweet and Lowdown'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'The Purple Rose of Cairo'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Vicky Cristina Barcelona'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Zelig'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Zelig'), ('aName', 'Academy Award for Best Costume Design')]\n",
      "76\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 29\n",
    "\n",
    "# Finding list of all films from directors nominated for any kind of Academy Awards to have a clue.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director ?fName ?aName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "ORDER BY ?Director ?fName ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "4613bc33-6123-4309-86d7-afb55ce38f3c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('aName', 'Academy Award for Best Actor'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Actress'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Cinematography'), ('noOfFilm', '4')]\n",
      "[('aName', 'Academy Award for Best Costume Design'), ('noOfFilm', '2')]\n",
      "[('aName', 'Academy Award for Best Director'), ('noOfFilm', '9')]\n",
      "[('aName', 'Academy Award for Best Film Editing'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Original Score'), ('noOfFilm', '1')]\n",
      "[('aName', 'Academy Award for Best Picture'), ('noOfFilm', '6')]\n",
      "[('aName', 'Academy Award for Best Production Design'), ('noOfFilm', '5')]\n",
      "[('aName', 'Academy Award for Best Sound'), ('noOfFilm', '1')]\n",
      "[('aName', 'Academy Award for Best Sound Editing'), ('noOfFilm', '2')]\n",
      "[('aName', 'Academy Award for Best Supporting Actor'), ('noOfFilm', '7')]\n",
      "[('aName', 'Academy Award for Best Supporting Actress'), ('noOfFilm', '11')]\n",
      "[('aName', 'Academy Award for Best Writing, Original Screenplay'), ('noOfFilm', '19')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# Query 30\n",
    "\n",
    "# Counting no of nominated films for each Academic Awards.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?aName (COUNT(?f) as ?noOfFilm)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?a sc:name ?aName.\n",
    "}\n",
    "GROUP BY ?aName\n",
    "ORDER BY ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4dc9e930",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "7266249f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103916'), ('award', 'Academy Award for Best Actor'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103618'), ('award', 'Academy Award for Best Actress'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q131520'), ('award', 'Academy Award for Best Cinematography'), ('noOfNominates', '4')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q277536'), ('award', 'Academy Award for Best Costume Design'), ('noOfNominates', '2')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103360'), ('award', 'Academy Award for Best Director'), ('noOfNominates', '9')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q281939'), ('award', 'Academy Award for Best Film Editing'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q488651'), ('award', 'Academy Award for Best Original Score'), ('noOfNominates', '1')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q102427'), ('award', 'Academy Award for Best Picture'), ('noOfNominates', '6')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q277751'), ('award', 'Academy Award for Best Production Design'), ('noOfNominates', '5')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q830079'), ('award', 'Academy Award for Best Sound'), ('noOfNominates', '1')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q488645'), ('award', 'Academy Award for Best Sound Editing'), ('noOfNominates', '2')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q106291'), ('award', 'Academy Award for Best Supporting Actor'), ('noOfNominates', '7')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q106301'), ('award', 'Academy Award for Best Supporting Actress'), ('noOfNominates', '11')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q41417'), ('award', 'Academy Award for Best Writing, Original Screenplay'), ('noOfNominates', '19')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 31\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?a as ?awardIRI) ?award (COUNT(?f) as ?noOfNominates)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?a sc:name ?award.\n",
    "}\n",
    "GROUP BY ?a ?award\n",
    "ORDER BY ?award\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
