{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "cb037cdf",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "10f60adb",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-64afa1085b-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b1b77b2",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Ancient Rome explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> The goal of this workflow is to study the Ancient Rome and some of the main events connected to that historical period. For instance, the emperors, killings, wars and so on."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "728cff39",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following data are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q1048`| Julius Caesar       | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3effb897",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider that\n",
    "\n",
    "```\n",
    "wd:Q1048 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Julius Caesar**.\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for Ancient Rome\n",
    "\n",
    "2. Find all the Roman Dictators (return the IRI and the name of the dictator)\n",
    "\n",
    "3. Identify the BGP for Roman Empire and Roman Republic\n",
    "\n",
    "4. Return the IRI and the name of all Roman emperors killed by homicide (see \"manner of death\") and, for each killed emperor, return also the IRI and name of the killer, if present in Wikidata.\n",
    "\n",
    "5. Return the Roman emperors who killed another Roman emperor (the result set must a list of 4-tuples with killer IRI and label, and killed IRI and label).\n",
    "\n",
    "6. Find the BGP for war\n",
    "\n",
    "7. Find the wars (note that \"war\" and \"battle\" are not the same thing) participated by the Roman Empire (return IRI and name of the war).\n",
    "\n",
    "8. Consider all the wars participated by the Roman Empire. For each war return the number of related battles and the opponent (a war is composed of one or more battles) (the result set must be a list of 5-tuples war IRI, label, opponent IRI and label, and #battles).\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "31376c51",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 1\n",
    "Identify the BGP for Ancient Rome"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "8f6ec917",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q5413489'), ('oname', 'curule aedile')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3701'), ('name', 'incarnation of'), ('o', 'http://www.wikidata.org/entity/Q58373'), ('oname', 'Amun')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work'), ('o', 'http://www.wikidata.org/entity/Q544948'), ('oname', 'Commentarii de Bello Civili')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3716'), ('name', 'social classification'), ('o', 'http://www.wikidata.org/entity/Q16744001'), ('oname', 'noble')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2358'), ('name', 'Roman praenomen'), ('o', 'http://www.wikidata.org/entity/Q5517401'), ('oname', 'Gaius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q172907'), ('oname', 'praetor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q189430'), ('oname', 'quaestor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period'), ('o', 'http://www.wikidata.org/entity/Q2815472'), ('oname', 'Late Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P410'), ('name', 'military rank'), ('o', 'http://www.wikidata.org/entity/Q849288'), ('oname', 'Military tribune')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event'), ('o', 'http://www.wikidata.org/entity/Q17768966'), ('oname', 'capture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother'), ('o', 'http://www.wikidata.org/entity/Q232725'), ('oname', 'Aurelia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling'), ('o', 'http://www.wikidata.org/entity/Q241143'), ('oname', 'Julia Minor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P102'), ('name', 'member of political party'), ('o', 'http://www.wikidata.org/entity/Q271108'), ('oname', 'populares')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling'), ('o', 'http://www.wikidata.org/entity/Q2743448'), ('oname', 'Julia Major')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father'), ('o', 'http://www.wikidata.org/entity/Q314710'), ('oname', 'Gaius Julius Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q432130'), ('oname', 'Sempronia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('o', 'http://www.wikidata.org/entity/Q657438'), ('oname', 'Roman triumph')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('o', 'http://www.wikidata.org/entity/Q242174'), ('oname', 'Julius Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q3409374'), ('oname', 'Ancient Roman priest')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q952844'), ('oname', 'pontifex')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q99899510'), ('oname', 'Ancient Roman historian')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by'), ('o', 'http://www.wikidata.org/entity/Q294846'), ('oname', 'Decimus Junius Brutus Albinus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict'), ('o', 'http://www.wikidata.org/entity/Q202161'), ('oname', 'Gallic War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse'), ('o', 'http://www.wikidata.org/entity/Q234825'), ('oname', 'Pompeia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q106727050'), ('oname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1097498'), ('oname', 'ruler')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q1138524'), ('oname', 'Paulys Realenzyklopädie der klassischen Altertumswissenschaft')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q1190123'), ('oname', 'Roman governor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q12859263'), ('oname', 'orator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1402561'), ('oname', 'military leader')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death'), ('o', 'http://www.wikidata.org/entity/Q149086'), ('oname', 'homicide')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship'), ('o', 'http://www.wikidata.org/entity/Q1747689'), ('oname', 'Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q19180675'), ('oname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q20056508'), ('oname', 'Ancient Roman senator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q212943'), ('oname', 'pontifex maximus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection'), ('o', 'http://www.wikidata.org/entity/Q213322'), ('oname', 'Victoria and Albert Museum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth'), ('o', 'http://www.wikidata.org/entity/Q220'), ('oname', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence'), ('o', 'http://www.wikidata.org/entity/Q220'), ('oname', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q30059240'), ('oname', \"Real'nyj slovar' klassicheskih drevnostej po Ljubkeru\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q3181656'), ('oname', 'The Nuttall Encyclopædia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed'), ('o', 'http://www.wikidata.org/entity/Q35497'), ('oname', 'Ancient Greek')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6886'), ('name', 'writing language'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work'), ('o', 'http://www.wikidata.org/entity/Q40185'), ('oname', 'The Divine Comedy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q40779'), ('oname', 'Roman consul')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4173137'), ('oname', 'Jewish Encyclopedia of Brockhaus and Efron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q46002746'), ('oname', 'Dictionary of African Biography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q49757'), ('oname', 'poet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q5'), ('oname', 'human')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q51955019'), ('oname', 'BEIC Digital Library')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q602358'), ('oname', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender'), ('o', 'http://www.wikidata.org/entity/Q6581097'), ('oname', 'male')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q67311526'), ('oname', 'Obalky knih.cz')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator'), ('o', 'http://www.wikidata.org/entity/Q71887839'), ('oname', 'copyrights on works have expired')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection'), ('o', 'http://www.wikidata.org/entity/Q731126'), ('oname', 'J. Paul Getty Museum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q82955'), ('oname', 'politician')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q842337'), ('oname', 'Parallel Lives')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q867541'), ('oname', 'Encyclopædia Britannica 11th edition')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q97667506'), ('oname', 'Ancient Roman politician')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q98103687'), ('oname', 'Ancient Roman military personnel')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of'), ('o', 'http://www.wikidata.org/entity/Q715380'), ('oname', 'First Triumvirate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8822'), ('name', 'epithet'), ('o', 'http://www.wikidata.org/entity/Q1231627'), ('oname', 'Divus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q1426927'), ('oname', 'Flamen Dialis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q11942503'), ('oname', 'Postumia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q11774156'), ('oname', 'memoirist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1038'), ('name', 'relative'), ('o', 'http://www.wikidata.org/entity/Q1405'), ('oname', 'Augustus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child'), ('o', 'http://www.wikidata.org/entity/Q1405'), ('oname', 'Augustus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P509'), ('name', 'cause of death'), ('o', 'http://www.wikidata.org/entity/Q4228595'), ('oname', 'stab wound')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2365'), ('name', 'Roman cognomen'), ('o', 'http://www.wikidata.org/entity/Q1025414'), ('oname', 'Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3716'), ('name', 'social classification'), ('o', 'http://www.wikidata.org/entity/Q154668'), ('oname', 'patrician')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q232229'), ('oname', 'Servilia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held'), ('o', 'http://www.wikidata.org/entity/Q236885'), ('oname', 'Roman dictator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2359'), ('name', 'Roman nomen gentilicium'), ('o', 'http://www.wikidata.org/entity/Q29871072'), ('oname', 'Julius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P53'), ('name', 'family'), ('o', 'http://www.wikidata.org/entity/Q3268376'), ('oname', 'Julii Caesares')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5025'), ('name', 'gens'), ('o', 'http://www.wikidata.org/entity/Q510193'), ('oname', 'Julia gens')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work'), ('o', 'http://www.wikidata.org/entity/Q106199'), ('oname', 'Commentarii de Bello Gallico')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse'), ('o', 'http://www.wikidata.org/entity/Q235627'), ('oname', 'Calpurnia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict'), ('o', 'http://www.wikidata.org/entity/Q1238338'), ('oname', \"Caesar's Civil War\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by'), ('o', 'http://www.wikidata.org/entity/Q1243545'), ('oname', 'Publius Servilius Casca')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('o', 'http://www.wikidata.org/entity/Q580995'), ('oname', 'apotheosis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q635'), ('oname', 'Cleopatra')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death'), ('o', 'http://www.wikidata.org/entity/Q944814'), ('oname', 'Theatre of Pompey')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse'), ('o', 'http://www.wikidata.org/entity/Q235423'), ('oname', 'Cornelia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by'), ('o', 'http://www.wikidata.org/entity/Q172248'), ('oname', 'Marcus Junius Brutus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q1102155'), ('oname', 'Clodia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q91615986'), ('oname', 'Postumia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q12271314'), ('oname', 'Tertulla')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q273616'), ('oname', 'Mucia Tertia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('o', 'http://www.wikidata.org/entity/Q86215133'), ('oname', 'Pseudo-Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('o', 'http://www.wikidata.org/entity/Q5517436'), ('oname', 'Gaius Julius Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child'), ('o', 'http://www.wikidata.org/entity/Q39589'), ('oname', 'Caesarion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q11942281'), ('oname', 'Pomponia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by'), ('o', 'http://www.wikidata.org/entity/Q207370'), ('oname', 'Gaius Cassius Longinus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child'), ('o', 'http://www.wikidata.org/entity/Q235087'), ('oname', 'Julia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('o', 'http://www.wikidata.org/entity/Q11002436'), ('oname', 'Lollia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q7329059'), ('oname', 'Category:Julius Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial'), ('o', 'http://www.wikidata.org/entity/Q1133288'), ('oname', 'Temple of Caesar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by'), ('o', 'http://www.wikidata.org/entity/Q1228715'), ('oname', 'Tillius Cimber')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name  ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1048 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e3e162d0-e548-4a62-9536-91dda35adcd2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P832'), ('name', 'public holiday'), ('oname', 'Saturnalia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic'), ('oname', 'history of ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('name', 'category of associated people'), ('oname', 'Category:Ancient Romans')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('oname', 'Category:Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent'), ('oname', 'Africa')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('oname', 'Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('oname', 'historical country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('oname', 'Granat Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent'), ('oname', 'Europe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent'), ('oname', 'Asia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('name', 'shares border with'), ('oname', 'Persian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('oname', 'Byzantine Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period'), ('oname', 'classical antiquity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('oname', 'Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('oname', 'Roman Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('name', 'capital'), ('oname', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('name', 'located in/on physical feature'), ('oname', 'Mediterranean Basin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('name', 'studied by'), ('oname', 'ancient history')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('name', 'economy of topic'), ('oname', 'economy of Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject'), ('oname', 'WikiProject Ancient Rome')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# Q1747689 --> 'Ancient Rome'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1747689 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "32f28696",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "56a447a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P832'), ('o', 'http://www.wikidata.org/entity/Q207213'), ('pname', 'public holiday'), ('oname', 'Saturnalia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('o', 'http://www.wikidata.org/entity/Q830852'), ('pname', 'history of topic'), ('oname', 'history of ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('o', 'http://www.wikidata.org/entity/Q5652564'), ('pname', 'category of associated people'), ('oname', 'Category:Ancient Romans')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('o', 'http://www.wikidata.org/entity/Q7098243'), ('pname', \"topic's main category\"), ('oname', 'Category:Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q15'), ('pname', 'continent'), ('oname', 'Africa')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q2277'), ('pname', 'has part'), ('oname', 'Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('o', 'http://www.wikidata.org/entity/Q3024240'), ('pname', 'instance of'), ('oname', 'historical country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('o', 'http://www.wikidata.org/entity/Q4532138'), ('pname', 'described by source'), ('oname', 'Granat Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q46'), ('pname', 'continent'), ('oname', 'Europe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q48'), ('pname', 'continent'), ('oname', 'Asia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('o', 'http://www.wikidata.org/entity/Q83311'), ('pname', 'shares border with'), ('oname', 'Persian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('pname', 'has part'), ('oname', 'Byzantine Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('pname', 'time period'), ('oname', 'classical antiquity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('pname', 'has part'), ('oname', 'Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q201038'), ('pname', 'has part'), ('oname', 'Roman Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('o', 'http://www.wikidata.org/entity/Q18287233'), ('pname', 'capital'), ('oname', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('o', 'http://www.wikidata.org/entity/Q72499'), ('pname', 'located in/on physical feature'), ('oname', 'Mediterranean Basin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('o', 'http://www.wikidata.org/entity/Q435608'), ('pname', 'studied by'), ('oname', 'ancient history')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('o', 'http://www.wikidata.org/entity/Q15265460'), ('pname', 'economy of topic'), ('oname', 'economy of Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('o', 'http://www.wikidata.org/entity/Q6337458'), ('pname', 'maintained by WikiProject'), ('oname', 'WikiProject Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('o', 'http://www.wikidata.org/entity/Q6678368'), ('pname', \"topic's main template\"), ('oname', 'Template:Ancient Rome topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('o', 'http://www.wikidata.org/entity/Q10631465'), ('pname', \"topic's main Wikimedia portal\"), ('oname', 'Portal:Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5125'), ('o', 'http://www.wikidata.org/entity/Q1216140'), ('pname', 'Wikimedia outline'), ('oname', 'outline of ancient Rome')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Q1747689 --> 'Ancient Rome'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?o ?pname ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1747689 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b3faa3b",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 2\n",
    "Find all the Roman Dictators (return the IRI and the name of the dictator)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "df39d2b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'public holiday'), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('o', 'http://www.wikidata.org/entity/Q207213'), ('oname', 'Saturnalia')]\n",
      "[('pname', 'history of topic'), ('p', 'http://www.wikidata.org/prop/direct/P2184'), ('o', 'http://www.wikidata.org/entity/Q830852'), ('oname', 'history of ancient Rome')]\n",
      "[('pname', 'category of associated people'), ('p', 'http://www.wikidata.org/prop/direct/P1792'), ('o', 'http://www.wikidata.org/entity/Q5652564'), ('oname', 'Category:Ancient Romans')]\n",
      "[('pname', \"topic's main category\"), ('p', 'http://www.wikidata.org/prop/direct/P910'), ('o', 'http://www.wikidata.org/entity/Q7098243'), ('oname', 'Category:Ancient Rome')]\n",
      "[('pname', 'continent'), ('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q15'), ('oname', 'Africa')]\n",
      "[('pname', 'has part'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q2277'), ('oname', 'Roman Empire')]\n",
      "[('pname', 'instance of'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('o', 'http://www.wikidata.org/entity/Q3024240'), ('oname', 'historical country')]\n",
      "[('pname', 'described by source'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('o', 'http://www.wikidata.org/entity/Q4532138'), ('oname', 'Granat Encyclopedic Dictionary')]\n",
      "[('pname', 'continent'), ('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q46'), ('oname', 'Europe')]\n",
      "[('pname', 'continent'), ('p', 'http://www.wikidata.org/prop/direct/P30'), ('o', 'http://www.wikidata.org/entity/Q48'), ('oname', 'Asia')]\n",
      "[('pname', 'shares border with'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('o', 'http://www.wikidata.org/entity/Q83311'), ('oname', 'Persian Empire')]\n",
      "[('pname', 'has part'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('oname', 'Byzantine Empire')]\n",
      "[('pname', 'time period'), ('p', 'http://www.wikidata.org/prop/direct/P2348'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('oname', 'classical antiquity')]\n",
      "[('pname', 'has part'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('oname', 'Roman Republic')]\n",
      "[('pname', 'has part'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('o', 'http://www.wikidata.org/entity/Q201038'), ('oname', 'Roman Kingdom')]\n",
      "[('pname', 'capital'), ('p', 'http://www.wikidata.org/prop/direct/P36'), ('o', 'http://www.wikidata.org/entity/Q18287233'), ('oname', 'Rome')]\n",
      "[('pname', 'located in/on physical feature'), ('p', 'http://www.wikidata.org/prop/direct/P706'), ('o', 'http://www.wikidata.org/entity/Q72499'), ('oname', 'Mediterranean Basin')]\n",
      "[('pname', 'studied by'), ('p', 'http://www.wikidata.org/prop/direct/P2579'), ('o', 'http://www.wikidata.org/entity/Q435608'), ('oname', 'ancient history')]\n",
      "[('pname', 'economy of topic'), ('p', 'http://www.wikidata.org/prop/direct/P8744'), ('o', 'http://www.wikidata.org/entity/Q15265460'), ('oname', 'economy of Ancient Rome')]\n",
      "[('pname', 'maintained by WikiProject'), ('p', 'http://www.wikidata.org/prop/direct/P6104'), ('o', 'http://www.wikidata.org/entity/Q6337458'), ('oname', 'WikiProject Ancient Rome')]\n",
      "[('pname', \"topic's main template\"), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('o', 'http://www.wikidata.org/entity/Q6678368'), ('oname', 'Template:Ancient Rome topics')]\n",
      "[('pname', \"topic's main Wikimedia portal\"), ('p', 'http://www.wikidata.org/prop/direct/P1151'), ('o', 'http://www.wikidata.org/entity/Q10631465'), ('oname', 'Portal:Ancient Rome')]\n",
      "[('pname', 'Wikimedia outline'), ('p', 'http://www.wikidata.org/prop/direct/P5125'), ('o', 'http://www.wikidata.org/entity/Q1216140'), ('oname', 'outline of ancient Rome')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q1747689 --> 'Ancient Rome'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pname ?p ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1747689 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "2e001fe0-6f61-4249-8902-168a7491a50e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q202311'), ('oname', 'Egypt')]\n",
      "[('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency')]\n",
      "[('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q208041'), ('oname', 'sestertius')]\n",
      "[('pname', 'coat of arms'), ('o', 'http://www.wikidata.org/entity/Q163323'), ('oname', 'Roman legion')]\n",
      "[('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q1456601'), ('oname', 'Category:Roman Empire')]\n",
      "[('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q11514315'), ('oname', 'historical period')]\n",
      "[('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q15'), ('oname', 'Africa')]\n",
      "[('pname', 'has works in the collection'), ('o', 'http://www.wikidata.org/entity/Q160236'), ('oname', 'Metropolitan Museum of Art')]\n",
      "[('pname', 'basic form of government'), ('o', 'http://www.wikidata.org/entity/Q173424'), ('oname', 'autocracy')]\n",
      "[('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q1747689'), ('oname', 'Ancient Rome')]\n",
      "[('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q1747689'), ('oname', 'Ancient Rome')]\n",
      "[('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q19180675'), ('oname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('pname', 'capital'), ('o', 'http://www.wikidata.org/entity/Q220'), ('oname', 'Rome')]\n",
      "[('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q2886278'), ('oname', 'Later Roman Empire')]\n",
      "[('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q3024240'), ('oname', 'historical country')]\n",
      "[('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q3181656'), ('oname', 'The Nuttall Encyclopædia')]\n",
      "[('pname', 'religion'), ('o', 'http://www.wikidata.org/entity/Q337547'), ('oname', 'ancient Roman religion')]\n",
      "[('pname', 'official religion'), ('o', 'http://www.wikidata.org/entity/Q337547'), ('oname', 'ancient Roman religion')]\n",
      "[('pname', 'language used'), ('o', 'http://www.wikidata.org/entity/Q35497'), ('oname', 'Ancient Greek')]\n",
      "[('pname', 'official language'), ('o', 'http://www.wikidata.org/entity/Q35497'), ('oname', 'Ancient Greek')]\n",
      "[('pname', 'located in present-day administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q38'), ('oname', 'Italy')]\n",
      "[('pname', 'language used'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('pname', 'official language'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('pname', 'located in present-day administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q43'), ('oname', 'Turkey')]\n",
      "[('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q46'), ('oname', 'Europe')]\n",
      "[('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q48'), ('oname', 'Asia')]\n",
      "[('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q48349'), ('oname', 'empire')]\n",
      "[('pname', 'official religion'), ('o', 'http://www.wikidata.org/entity/Q5043'), ('oname', 'Christianity')]\n",
      "[('pname', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q62646'), ('oname', 'Germania')]\n",
      "[('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q7209'), ('oname', 'Han dynasty')]\n",
      "[('pname', 'basic form of government'), ('o', 'http://www.wikidata.org/entity/Q7269'), ('oname', 'monarchy')]\n",
      "[('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q787204'), ('oname', 'High Roman Empire')]\n",
      "[('pname', 'office held by head of state'), ('o', 'http://www.wikidata.org/entity/Q842606'), ('oname', 'Roman emperor')]\n",
      "[('pname', 'replaced by'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('oname', 'Byzantine Empire')]\n",
      "[('pname', 'capital'), ('o', 'http://www.wikidata.org/entity/Q16869'), ('oname', 'Constantinople')]\n",
      "[('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q178897'), ('oname', 'Latin Empire')]\n",
      "[('pname', 'replaced by'), ('o', 'http://www.wikidata.org/entity/Q42834'), ('oname', 'Western Roman Empire (395-476 AD)')]\n",
      "[('pname', 'time period'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('oname', 'classical antiquity')]\n",
      "[('pname', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q1986139'), ('oname', 'Parthian Empire')]\n",
      "[('pname', 'replaces'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('oname', 'Roman Republic')]\n",
      "[('pname', 'legislative body'), ('o', 'http://www.wikidata.org/entity/Q3510883'), ('oname', 'Senate of the Roman Empire')]\n",
      "[('pname', 'history of topic'), ('o', 'http://www.wikidata.org/entity/Q2671119'), ('oname', 'history of the Roman Empire')]\n",
      "[('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q302980'), ('oname', 'Hibernia')]\n",
      "[('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q187776'), ('oname', 'denarius')]\n",
      "[('pname', 'demographics of topic'), ('o', 'http://www.wikidata.org/entity/Q21192389'), ('oname', 'demographics of the Roman Empire')]\n",
      "[('pname', 'coat of arms'), ('o', 'http://www.wikidata.org/entity/Q264655'), ('oname', 'vexillum')]\n",
      "[('pname', 'economy of topic'), ('o', 'http://www.wikidata.org/entity/Q3718695'), ('oname', 'economy of the Roman Empire')]\n",
      "[('pname', 'participant in'), ('o', 'http://www.wikidata.org/entity/Q63146684'), ('oname', 'Battles of Bedriacum')]\n",
      "[('pname', 'religion'), ('o', 'http://www.wikidata.org/entity/Q7603670'), ('oname', 'state church of the Roman Empire')]\n",
      "[('pname', 'category for maps'), ('o', 'http://www.wikidata.org/entity/Q8607609'), ('oname', 'Category:Maps of the Roman Empire')]\n",
      "[('pname', 'category of associated people'), ('o', 'http://www.wikidata.org/entity/Q8678282'), ('oname', 'Category:People of the Roman Empire')]\n",
      "52\n"
     ]
    }
   ],
   "source": [
    "# Q2277 --> 'Roman Empire'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2277 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "13dbfce3-89f6-4817-b755-70d165783502",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q66890318'), ('oname', 'Helsinki term bank for the arts and sciences')]\n",
      "[('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q11768'), ('oname', 'Ancient Egypt')]\n",
      "[('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q2041543'), ('oname', 'Ottův slovník naučný')]\n",
      "[('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q269678'), ('oname', 'ancient Near East')]\n",
      "[('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q309'), ('oname', 'history')]\n",
      "[('pname', 'facet of'), ('o', 'http://www.wikidata.org/entity/Q309'), ('oname', 'history')]\n",
      "[('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q1047113'), ('oname', 'specialty')]\n",
      "[('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('oname', 'classical antiquity')]\n",
      "[('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('oname', 'classical antiquity')]\n",
      "[('pname', 'follows'), ('o', 'http://www.wikidata.org/entity/Q11756'), ('oname', 'prehistory')]\n",
      "[('pname', 'followed by'), ('o', 'http://www.wikidata.org/entity/Q12554'), ('oname', 'Middle Ages')]\n",
      "[('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q186081'), ('oname', 'time interval')]\n",
      "[('pname', 'followed by'), ('o', 'http://www.wikidata.org/entity/Q7234117'), ('oname', 'Postclassical Era')]\n",
      "[('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q6499653'), ('oname', 'Category:Ancient history')]\n",
      "[('pname', 'Wikimedia outline'), ('o', 'http://www.wikidata.org/entity/Q28453687'), ('oname', 'outline of ancient history')]\n",
      "[('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q6678356'), ('oname', 'Template:Ancient history')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "# Q830852 --> 'history of ancient Rome'\n",
    "# Q201038 --> 'Roman Kingdom'\n",
    "# Q18287233 --> 'Rome'\n",
    "# Q2277 --> 'Roman Empire'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q41493 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "c5dc98c7-675a-43ae-b0b5-0c9c8c7a0cfb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q99899510'), ('oname', 'Ancient Roman historian')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q98103687'), ('oname', 'Ancient Roman military personnel')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q3409374'), ('oname', 'Ancient Roman priest')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q97667506'), ('oname', 'Ancient Roman politician')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received'), ('o', 'http://www.wikidata.org/entity/Q657438'), ('oname', 'Roman triumph')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('pname', 'time period'), ('o', 'http://www.wikidata.org/entity/Q2815472'), ('oname', 'Late Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('o', 'http://www.wikidata.org/entity/Q236885'), ('oname', 'Roman dictator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('o', 'http://www.wikidata.org/entity/Q20056508'), ('oname', 'Ancient Roman senator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('o', 'http://www.wikidata.org/entity/Q1190123'), ('oname', 'Roman governor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('o', 'http://www.wikidata.org/entity/Q40779'), ('oname', 'Roman consul')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# Q830852 --> 'history of ancient Rome' \n",
    "# Q201038 --> 'Roman Kingdom' \n",
    "# Q18287233 --> 'Rome' \n",
    "# Q294846 --> 'Decimus Junius Brutus Albinus' \n",
    "# Q5413489 --> 'curule aedile' \n",
    "# Q2277 --> 'Roman Empire'\n",
    "# Q1048 --> 'Julius Caesar' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #Get the data of julius Caesar from the given data\n",
    "   wd:Q1048 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "   Filter (REGEX (?oname ,\"Roman*\"))\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "6c6af33f-c399-42c1-9a23-251e7a9b029f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q155312'), ('oname', 'Gaius Claudius Centho')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q297783'), ('oname', 'Appius Claudius Caecus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q703448'), ('oname', 'Marcus Livius Salinator')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q529867'), ('oname', 'Titus Lartius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q15034789'), ('oname', 'Manius Valerius Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q359810'), ('oname', 'Lucius Caecilius Metellus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q929498'), ('oname', 'Quintus Caecilius Metellus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q519186'), ('oname', 'Quintus Hortensius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q637596'), ('oname', 'Quintus Servilius Priscus Structus Fidenas')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1223522'), ('oname', 'Caius Poetelius Libo Visolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q682087'), ('oname', 'Gaius Poetelius Libo Visolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1234290'), ('oname', 'Quintus Publilius Philo')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q435408'), ('oname', 'Gaius Duilius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1048'), ('oname', 'Julius Caesar')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q483783'), ('oname', 'Sulla')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q718133'), ('oname', 'Titus Manlius Torquatus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q709224'), ('oname', 'Marcus Fabius Ambustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q334940'), ('oname', 'Aulus Cornelius Cossus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3622696'), ('oname', 'Quintus Fabius Ambustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q9064243'), ('oname', 'Publius Cornelius Scipio Barbatus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1439387'), ('oname', 'Lucius Veturius Philo')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q63314619'), ('oname', 'Manius Valerius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q963870'), ('oname', 'Lucius Aemilius Mamercinus Privernas')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q5759141'), ('oname', 'Gaius Claudius Crassus Inrelligensis')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1491536'), ('oname', 'Gaius Servilius Geminus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3772609'), ('oname', 'Gnaeus Quinctius Capitolinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1227246'), ('oname', 'Quintus Servilius Ahala')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q59559'), ('oname', 'Marcus Aemilius Papus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q935315'), ('oname', 'Gaius Marcius Rutilus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q274545'), ('oname', 'Quintus Fabius Maximus Verrucosus')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# Q236885 --> 'Roman dictator' \n",
    "# P39 --> 'position held' \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?item wdt:P39 wd:Q236885 .\n",
    "   # get the label\n",
    "   #?p sc:name ?pname.\n",
    "   ?item sc:name ?oname\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9a2ab6e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "882caa6d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q155312'), ('oname', 'Gaius Claudius Centho')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q297783'), ('oname', 'Appius Claudius Caecus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q703448'), ('oname', 'Marcus Livius Salinator')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q529867'), ('oname', 'Titus Lartius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q15034789'), ('oname', 'Manius Valerius Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q359810'), ('oname', 'Lucius Caecilius Metellus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q929498'), ('oname', 'Quintus Caecilius Metellus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q519186'), ('oname', 'Quintus Hortensius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q637596'), ('oname', 'Quintus Servilius Priscus Structus Fidenas')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1223522'), ('oname', 'Caius Poetelius Libo Visolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q682087'), ('oname', 'Gaius Poetelius Libo Visolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1234290'), ('oname', 'Quintus Publilius Philo')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q435408'), ('oname', 'Gaius Duilius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1048'), ('oname', 'Julius Caesar')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q483783'), ('oname', 'Sulla')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q718133'), ('oname', 'Titus Manlius Torquatus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q709224'), ('oname', 'Marcus Fabius Ambustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q334940'), ('oname', 'Aulus Cornelius Cossus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3622696'), ('oname', 'Quintus Fabius Ambustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q9064243'), ('oname', 'Publius Cornelius Scipio Barbatus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1439387'), ('oname', 'Lucius Veturius Philo')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q63314619'), ('oname', 'Manius Valerius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q963870'), ('oname', 'Lucius Aemilius Mamercinus Privernas')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q5759141'), ('oname', 'Gaius Claudius Crassus Inrelligensis')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1491536'), ('oname', 'Gaius Servilius Geminus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3772609'), ('oname', 'Gnaeus Quinctius Capitolinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1227246'), ('oname', 'Quintus Servilius Ahala')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q59559'), ('oname', 'Marcus Aemilius Papus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q935315'), ('oname', 'Gaius Marcius Rutilus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q274545'), ('oname', 'Quintus Fabius Maximus Verrucosus')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?item wdt:P39 wd:Q236885 .\n",
    "   # get the label\n",
    "   #?p sc:name ?pname.\n",
    "   ?item sc:name ?oname\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1d0a223a",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 3\n",
    "Identify the BGP for Roman Empire and Roman Republic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "a9627d0f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p2name', 'basic form of government'), ('REname', 'autocracy')]\n",
      "[('p2name', 'basic form of government'), ('REname', 'monarchy')]\n",
      "[('p2name', 'described by source'), ('REname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p2name', 'described by source'), ('REname', 'The Nuttall Encyclopædia')]\n",
      "[('p2name', 'participant in'), ('REname', 'Battles of Bedriacum')]\n",
      "[('p2name', 'replaces'), ('REname', 'Roman Republic')]\n",
      "[('p2name', 'replaced by'), ('REname', 'Byzantine Empire')]\n",
      "[('p2name', 'replaced by'), ('REname', 'Western Roman Empire (395-476 AD)')]\n",
      "[('p2name', 'religion'), ('REname', 'ancient Roman religion')]\n",
      "[('p2name', 'religion'), ('REname', 'state church of the Roman Empire')]\n",
      "[('p2name', 'contains administrative territorial entity'), ('REname', 'Egypt')]\n",
      "[('p2name', 'country'), ('REname', 'Ancient Rome')]\n",
      "[('p2name', 'category of associated people'), ('REname', 'Category:People of the Roman Empire')]\n",
      "[('p2name', 'different from'), ('REname', 'Latin Empire')]\n",
      "[('p2name', 'office held by head of state'), ('REname', 'Roman emperor')]\n",
      "[('p2name', 'legislative body'), ('REname', 'Senate of the Roman Empire')]\n",
      "[('p2name', 'history of topic'), ('REname', 'history of the Roman Empire')]\n",
      "[('p2name', 'time period'), ('REname', 'classical antiquity')]\n",
      "[('p2name', 'coat of arms'), ('REname', 'Roman legion')]\n",
      "[('p2name', 'coat of arms'), ('REname', 'vexillum')]\n",
      "[('p2name', 'language used'), ('REname', 'Ancient Greek')]\n",
      "[('p2name', 'language used'), ('REname', 'Latin')]\n",
      "[('p2name', 'continent'), ('REname', 'Africa')]\n",
      "[('p2name', 'continent'), ('REname', 'Europe')]\n",
      "[('p2name', 'continent'), ('REname', 'Asia')]\n",
      "[('p2name', 'official religion'), ('REname', 'ancient Roman religion')]\n",
      "[('p2name', 'official religion'), ('REname', 'Christianity')]\n",
      "[('p2name', 'instance of'), ('REname', 'historical period')]\n",
      "[('p2name', 'instance of'), ('REname', 'historical country')]\n",
      "[('p2name', 'instance of'), ('REname', 'empire')]\n",
      "[('p2name', 'capital'), ('REname', 'Rome')]\n",
      "[('p2name', 'capital'), ('REname', 'Constantinople')]\n",
      "[('p2name', 'part of'), ('REname', 'Ancient Rome')]\n",
      "[('p2name', 'official language'), ('REname', 'Ancient Greek')]\n",
      "[('p2name', 'official language'), ('REname', 'Latin')]\n",
      "[('p2name', 'currency'), ('REname', 'Roman currency')]\n",
      "[('p2name', 'currency'), ('REname', 'sestertius')]\n",
      "[('p2name', 'currency'), ('REname', 'denarius')]\n",
      "[('p2name', 'shares border with'), ('REname', 'Parthian Empire')]\n",
      "[('p2name', 'on focus list of Wikimedia project'), ('REname', 'Wikipedia:Vital articles')]\n",
      "[('p2name', 'has part'), ('REname', 'Later Roman Empire')]\n",
      "[('p2name', 'has part'), ('REname', 'High Roman Empire')]\n",
      "[('p2name', 'diplomatic relation'), ('REname', 'Germania')]\n",
      "[('p2name', 'diplomatic relation'), ('REname', 'Han dynasty')]\n",
      "[('p2name', 'diplomatic relation'), ('REname', 'Hibernia')]\n",
      "[('p2name', 'has works in the collection'), ('REname', 'Metropolitan Museum of Art')]\n",
      "[('p2name', 'category for maps'), ('REname', 'Category:Maps of the Roman Empire')]\n",
      "[('p2name', 'economy of topic'), ('REname', 'economy of the Roman Empire')]\n",
      "[('p2name', \"topic's main category\"), ('REname', 'Category:Roman Empire')]\n",
      "[('p2name', 'demographics of topic'), ('REname', 'demographics of the Roman Empire')]\n",
      "[('p2name', 'located in present-day administrative territorial entity'), ('REname', 'Italy')]\n",
      "[('p2name', 'located in present-day administrative territorial entity'), ('REname', 'Turkey')]\n",
      "[('p3name', 'basic form of government'), ('RRname', 'Aristocratic republic')]\n",
      "[('p3name', 'participant in'), ('RRname', 'Punic Wars')]\n",
      "[('p3name', 'participant in'), ('RRname', 'Pyrrhic War')]\n",
      "[('p3name', 'participant in'), ('RRname', 'Macedonian Wars')]\n",
      "[('p3name', 'participant in'), ('RRname', 'Battle of the Arar')]\n",
      "[('p3name', 'replaces'), ('RRname', 'Roman Kingdom')]\n",
      "[('p3name', 'replaced by'), ('RRname', 'Roman Empire')]\n",
      "[('p3name', 'religion'), ('RRname', 'ancient Roman religion')]\n",
      "[('p3name', 'follows'), ('RRname', 'Roman Kingdom')]\n",
      "[('p3name', 'category of associated people'), ('RRname', 'Category:People of the Roman Republic')]\n",
      "[('p3name', 'different from'), ('RRname', 'Roman Republic')]\n",
      "[('p3name', 'legislative body'), ('RRname', 'Roman Senate')]\n",
      "[('p3name', 'time period'), ('RRname', 'classical antiquity')]\n",
      "[('p3name', 'language used'), ('RRname', 'Ancient Greek')]\n",
      "[('p3name', 'language used'), ('RRname', 'Latin')]\n",
      "[('p3name', 'continent'), ('RRname', 'Africa')]\n",
      "[('p3name', 'continent'), ('RRname', 'Europe')]\n",
      "[('p3name', 'continent'), ('RRname', 'Asia')]\n",
      "[('p3name', 'official religion'), ('RRname', 'ancient Roman religion')]\n",
      "[('p3name', 'instance of'), ('RRname', 'historical period')]\n",
      "[('p3name', 'instance of'), ('RRname', 'historical country')]\n",
      "[('p3name', 'instance of'), ('RRname', 'republic')]\n",
      "[('p3name', 'capital'), ('RRname', 'Rome')]\n",
      "[('p3name', 'part of'), ('RRname', 'Ancient Rome')]\n",
      "[('p3name', 'currency'), ('RRname', 'Roman currency')]\n",
      "[('p3name', 'has part'), ('RRname', 'Late Roman Republic')]\n",
      "[('p3name', 'has part'), ('RRname', 'Early Roman Republic')]\n",
      "[('p3name', 'has part'), ('RRname', 'Middle Roman Republic')]\n",
      "[('p3name', \"topic's main category\"), ('RRname', 'Category:Roman Republic')]\n",
      "81\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q1747689 --> 'Ancient Rome'\n",
    "# Q2277 --> 'Roman Empire'\n",
    "# Q17167 --> 'Roman Republic'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p2name ?REname ?p3name ?RRname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1747689 ?p ?o .\n",
    "   \n",
    "   #Roman Empire part  \n",
    "   {?o ?p1 wd:Q2277 .\n",
    "   wd:Q2277 ?p2 ?RE .\n",
    "   ?p2 sc:name ?p2name .\n",
    "   ?RE sc:name ?REname .}\n",
    "   \n",
    "   #wd:Q2277 \n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "  \n",
    "UNION \n",
    "        #Roman Republic part\n",
    "        {?o ?p1 wd:Q17167 .\n",
    "        wd:Q17167 ?p3 ?RR .\n",
    "        ?p3 sc:name ?p3name .\n",
    "        ?RR sc:name ?RRname .}   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8f0b96e5",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "06e0ccf1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P122'), ('p2name', 'basic form of government'), ('RE', 'http://www.wikidata.org/entity/Q173424'), ('REname', 'autocracy')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P122'), ('p2name', 'basic form of government'), ('RE', 'http://www.wikidata.org/entity/Q7269'), ('REname', 'monarchy')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1343'), ('p2name', 'described by source'), ('RE', 'http://www.wikidata.org/entity/Q19180675'), ('REname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1343'), ('p2name', 'described by source'), ('RE', 'http://www.wikidata.org/entity/Q3181656'), ('REname', 'The Nuttall Encyclopædia')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1344'), ('p2name', 'participant in'), ('RE', 'http://www.wikidata.org/entity/Q63146684'), ('REname', 'Battles of Bedriacum')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1365'), ('p2name', 'replaces'), ('RE', 'http://www.wikidata.org/entity/Q17167'), ('REname', 'Roman Republic')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1366'), ('p2name', 'replaced by'), ('RE', 'http://www.wikidata.org/entity/Q12544'), ('REname', 'Byzantine Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1366'), ('p2name', 'replaced by'), ('RE', 'http://www.wikidata.org/entity/Q42834'), ('REname', 'Western Roman Empire (395-476 AD)')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P140'), ('p2name', 'religion'), ('RE', 'http://www.wikidata.org/entity/Q337547'), ('REname', 'ancient Roman religion')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P140'), ('p2name', 'religion'), ('RE', 'http://www.wikidata.org/entity/Q7603670'), ('REname', 'state church of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P150'), ('p2name', 'contains administrative territorial entity'), ('RE', 'http://www.wikidata.org/entity/Q202311'), ('REname', 'Egypt')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P17'), ('p2name', 'country'), ('RE', 'http://www.wikidata.org/entity/Q1747689'), ('REname', 'Ancient Rome')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1792'), ('p2name', 'category of associated people'), ('RE', 'http://www.wikidata.org/entity/Q8678282'), ('REname', 'Category:People of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1889'), ('p2name', 'different from'), ('RE', 'http://www.wikidata.org/entity/Q178897'), ('REname', 'Latin Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P1906'), ('p2name', 'office held by head of state'), ('RE', 'http://www.wikidata.org/entity/Q842606'), ('REname', 'Roman emperor')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P194'), ('p2name', 'legislative body'), ('RE', 'http://www.wikidata.org/entity/Q3510883'), ('REname', 'Senate of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P2184'), ('p2name', 'history of topic'), ('RE', 'http://www.wikidata.org/entity/Q2671119'), ('REname', 'history of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P2348'), ('p2name', 'time period'), ('RE', 'http://www.wikidata.org/entity/Q486761'), ('REname', 'classical antiquity')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P237'), ('p2name', 'coat of arms'), ('RE', 'http://www.wikidata.org/entity/Q163323'), ('REname', 'Roman legion')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P237'), ('p2name', 'coat of arms'), ('RE', 'http://www.wikidata.org/entity/Q264655'), ('REname', 'vexillum')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P2936'), ('p2name', 'language used'), ('RE', 'http://www.wikidata.org/entity/Q35497'), ('REname', 'Ancient Greek')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P2936'), ('p2name', 'language used'), ('RE', 'http://www.wikidata.org/entity/Q397'), ('REname', 'Latin')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P30'), ('p2name', 'continent'), ('RE', 'http://www.wikidata.org/entity/Q15'), ('REname', 'Africa')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P30'), ('p2name', 'continent'), ('RE', 'http://www.wikidata.org/entity/Q46'), ('REname', 'Europe')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P30'), ('p2name', 'continent'), ('RE', 'http://www.wikidata.org/entity/Q48'), ('REname', 'Asia')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P3075'), ('p2name', 'official religion'), ('RE', 'http://www.wikidata.org/entity/Q337547'), ('REname', 'ancient Roman religion')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P3075'), ('p2name', 'official religion'), ('RE', 'http://www.wikidata.org/entity/Q5043'), ('REname', 'Christianity')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P31'), ('p2name', 'instance of'), ('RE', 'http://www.wikidata.org/entity/Q11514315'), ('REname', 'historical period')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P31'), ('p2name', 'instance of'), ('RE', 'http://www.wikidata.org/entity/Q3024240'), ('REname', 'historical country')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P31'), ('p2name', 'instance of'), ('RE', 'http://www.wikidata.org/entity/Q48349'), ('REname', 'empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P36'), ('p2name', 'capital'), ('RE', 'http://www.wikidata.org/entity/Q220'), ('REname', 'Rome')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P36'), ('p2name', 'capital'), ('RE', 'http://www.wikidata.org/entity/Q16869'), ('REname', 'Constantinople')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P361'), ('p2name', 'part of'), ('RE', 'http://www.wikidata.org/entity/Q1747689'), ('REname', 'Ancient Rome')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P37'), ('p2name', 'official language'), ('RE', 'http://www.wikidata.org/entity/Q35497'), ('REname', 'Ancient Greek')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P37'), ('p2name', 'official language'), ('RE', 'http://www.wikidata.org/entity/Q397'), ('REname', 'Latin')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P38'), ('p2name', 'currency'), ('RE', 'http://www.wikidata.org/entity/Q952064'), ('REname', 'Roman currency')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P38'), ('p2name', 'currency'), ('RE', 'http://www.wikidata.org/entity/Q208041'), ('REname', 'sestertius')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P38'), ('p2name', 'currency'), ('RE', 'http://www.wikidata.org/entity/Q187776'), ('REname', 'denarius')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P47'), ('p2name', 'shares border with'), ('RE', 'http://www.wikidata.org/entity/Q1986139'), ('REname', 'Parthian Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P5008'), ('p2name', 'on focus list of Wikimedia project'), ('RE', 'http://www.wikidata.org/entity/Q5460604'), ('REname', 'Wikipedia:Vital articles')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P527'), ('p2name', 'has part'), ('RE', 'http://www.wikidata.org/entity/Q2886278'), ('REname', 'Later Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P527'), ('p2name', 'has part'), ('RE', 'http://www.wikidata.org/entity/Q787204'), ('REname', 'High Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P530'), ('p2name', 'diplomatic relation'), ('RE', 'http://www.wikidata.org/entity/Q62646'), ('REname', 'Germania')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P530'), ('p2name', 'diplomatic relation'), ('RE', 'http://www.wikidata.org/entity/Q7209'), ('REname', 'Han dynasty')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P530'), ('p2name', 'diplomatic relation'), ('RE', 'http://www.wikidata.org/entity/Q302980'), ('REname', 'Hibernia')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P6379'), ('p2name', 'has works in the collection'), ('RE', 'http://www.wikidata.org/entity/Q160236'), ('REname', 'Metropolitan Museum of Art')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P7867'), ('p2name', 'category for maps'), ('RE', 'http://www.wikidata.org/entity/Q8607609'), ('REname', 'Category:Maps of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P8744'), ('p2name', 'economy of topic'), ('RE', 'http://www.wikidata.org/entity/Q3718695'), ('REname', 'economy of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P910'), ('p2name', \"topic's main category\"), ('RE', 'http://www.wikidata.org/entity/Q1456601'), ('REname', 'Category:Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P9241'), ('p2name', 'demographics of topic'), ('RE', 'http://www.wikidata.org/entity/Q21192389'), ('REname', 'demographics of the Roman Empire')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P3842'), ('p2name', 'located in present-day administrative territorial entity'), ('RE', 'http://www.wikidata.org/entity/Q38'), ('REname', 'Italy')]\n",
      "[('p2', 'http://www.wikidata.org/prop/direct/P3842'), ('p2name', 'located in present-day administrative territorial entity'), ('RE', 'http://www.wikidata.org/entity/Q43'), ('REname', 'Turkey')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P122'), ('p3name', 'basic form of government'), ('RR', 'http://www.wikidata.org/entity/Q666680'), ('RRname', 'Aristocratic republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1344'), ('p3name', 'participant in'), ('RR', 'http://www.wikidata.org/entity/Q124988'), ('RRname', 'Punic Wars')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1344'), ('p3name', 'participant in'), ('RR', 'http://www.wikidata.org/entity/Q596373'), ('RRname', 'Pyrrhic War')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1344'), ('p3name', 'participant in'), ('RR', 'http://www.wikidata.org/entity/Q75813'), ('RRname', 'Macedonian Wars')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1344'), ('p3name', 'participant in'), ('RR', 'http://www.wikidata.org/entity/Q1274566'), ('RRname', 'Battle of the Arar')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1365'), ('p3name', 'replaces'), ('RR', 'http://www.wikidata.org/entity/Q201038'), ('RRname', 'Roman Kingdom')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1366'), ('p3name', 'replaced by'), ('RR', 'http://www.wikidata.org/entity/Q2277'), ('RRname', 'Roman Empire')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P140'), ('p3name', 'religion'), ('RR', 'http://www.wikidata.org/entity/Q337547'), ('RRname', 'ancient Roman religion')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P155'), ('p3name', 'follows'), ('RR', 'http://www.wikidata.org/entity/Q201038'), ('RRname', 'Roman Kingdom')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1792'), ('p3name', 'category of associated people'), ('RR', 'http://www.wikidata.org/entity/Q13285410'), ('RRname', 'Category:People of the Roman Republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P1889'), ('p3name', 'different from'), ('RR', 'http://www.wikidata.org/entity/Q175881'), ('RRname', 'Roman Republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P194'), ('p3name', 'legislative body'), ('RR', 'http://www.wikidata.org/entity/Q130614'), ('RRname', 'Roman Senate')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P2348'), ('p3name', 'time period'), ('RR', 'http://www.wikidata.org/entity/Q486761'), ('RRname', 'classical antiquity')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P2936'), ('p3name', 'language used'), ('RR', 'http://www.wikidata.org/entity/Q35497'), ('RRname', 'Ancient Greek')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P2936'), ('p3name', 'language used'), ('RR', 'http://www.wikidata.org/entity/Q397'), ('RRname', 'Latin')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P30'), ('p3name', 'continent'), ('RR', 'http://www.wikidata.org/entity/Q15'), ('RRname', 'Africa')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P30'), ('p3name', 'continent'), ('RR', 'http://www.wikidata.org/entity/Q46'), ('RRname', 'Europe')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P30'), ('p3name', 'continent'), ('RR', 'http://www.wikidata.org/entity/Q48'), ('RRname', 'Asia')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P3075'), ('p3name', 'official religion'), ('RR', 'http://www.wikidata.org/entity/Q337547'), ('RRname', 'ancient Roman religion')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P31'), ('p3name', 'instance of'), ('RR', 'http://www.wikidata.org/entity/Q11514315'), ('RRname', 'historical period')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P31'), ('p3name', 'instance of'), ('RR', 'http://www.wikidata.org/entity/Q3024240'), ('RRname', 'historical country')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P31'), ('p3name', 'instance of'), ('RR', 'http://www.wikidata.org/entity/Q7270'), ('RRname', 'republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P36'), ('p3name', 'capital'), ('RR', 'http://www.wikidata.org/entity/Q220'), ('RRname', 'Rome')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P361'), ('p3name', 'part of'), ('RR', 'http://www.wikidata.org/entity/Q1747689'), ('RRname', 'Ancient Rome')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P38'), ('p3name', 'currency'), ('RR', 'http://www.wikidata.org/entity/Q952064'), ('RRname', 'Roman currency')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P527'), ('p3name', 'has part'), ('RR', 'http://www.wikidata.org/entity/Q2815472'), ('RRname', 'Late Roman Republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P527'), ('p3name', 'has part'), ('RR', 'http://www.wikidata.org/entity/Q2839628'), ('RRname', 'Early Roman Republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P527'), ('p3name', 'has part'), ('RR', 'http://www.wikidata.org/entity/Q6106068'), ('RRname', 'Middle Roman Republic')]\n",
      "[('p3', 'http://www.wikidata.org/prop/direct/P910'), ('p3name', \"topic's main category\"), ('RR', 'http://www.wikidata.org/entity/Q6944405'), ('RRname', 'Category:Roman Republic')]\n",
      "81\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Q1747689 --> 'Ancient Rome'\n",
    "# Q2277 --> 'Roman Empire'\n",
    "# Q17167 --> 'Roman Republic'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p2 ?p2name ?RE ?REname ?p3 ?p3name ?RR ?RRname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1747689 ?p ?o .\n",
    "   \n",
    "   #Roman Empire part  \n",
    "   {?o ?p1 wd:Q2277 .\n",
    "   wd:Q2277 ?p2 ?RE .\n",
    "   ?p2 sc:name ?p2name .\n",
    "   ?RE sc:name ?REname .}\n",
    "   \n",
    "   #wd:Q2277 \n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "  \n",
    "UNION \n",
    "        #Roman Republic part\n",
    "        {?o ?p1 wd:Q17167 .\n",
    "        wd:Q17167 ?p3 ?RR .\n",
    "        ?p3 sc:name ?p3name .\n",
    "        ?RR sc:name ?RRname .}   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14801e4d",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Return the IRI and the name of all Roman emperors killed by homicide (see \"manner of death\") and, for each killed emperor, return also the IRI and name of the killer, if present in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "d699d896",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q125740'), ('oname', 'list of Roman emperors')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q842606 --> 'Roman emperor' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q842606 wdt:P2354 ?o  .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "27151233-ba68-487a-a517-6a565e1e44fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q842606'), ('oname', 'Roman emperor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7361954'), ('oname', 'Roman Emperor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6992597'), ('oname', 'Category:Roman emperors')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7361952'), ('oname', 'Roman Emperor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7361953'), ('oname', 'Roman Emperor')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q842606 --> 'Roman emperor' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?o ?s wd:Q125740.\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "dbf990ef-0278-413b-acb2-821c17586775",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q46780'), ('oname', 'Aurelian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q159798'), ('oname', 'Honorius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q437604'), ('oname', 'Julius Saturninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q211396'), ('oname', 'Magnus Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q550622'), ('oname', 'Maximus of Hispania')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1777'), ('oname', 'Maximinus Thrax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q518890'), ('oname', 'Gaius Julius Verus Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q172471'), ('oname', 'Valens')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q314828'), ('oname', 'Vetranio')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q187489'), ('oname', 'Silvanus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1427'), ('oname', 'Hadrian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q172168'), ('oname', 'Galerius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1429'), ('oname', 'Antoninus Pius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q201905'), ('oname', 'Constantius III')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q560559'), ('oname', 'Constans II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1762'), ('oname', 'Elagabalus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1430'), ('oname', 'Marcus Aurelius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q507623'), ('oname', 'Vaballathus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q189095'), ('oname', 'Maximinus II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q131195'), ('oname', 'Constantius Chlorus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1411'), ('oname', 'Claudius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1416'), ('oname', 'Otho')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1419'), ('oname', 'Vespasian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1421'), ('oname', 'Titus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1423'), ('oname', 'Domitian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1812'), ('oname', 'Gordian III')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q185538'), ('oname', 'Constans')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q238023'), ('oname', 'Flavia Julia Constantia')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46418'), ('oname', 'Constantius II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46734'), ('oname', 'Constantine II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q8413'), ('oname', 'Constantine the Great')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q178004'), ('oname', 'Marcian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q103860'), ('oname', 'Julius Nepos')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1442'), ('oname', 'Septimius Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1830'), ('oname', 'Decius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q184549'), ('oname', 'Licinius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q104475'), ('oname', 'Gallienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1405'), ('oname', 'Augustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q164087'), ('oname', 'Flavius Severianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q189108'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46720'), ('oname', 'Valentinian I')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46750'), ('oname', 'Valerian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46814'), ('oname', 'Flavius Valerius Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46846'), ('oname', 'Valentinian II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q552224'), ('oname', 'Valerian II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1407'), ('oname', 'Tiberius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1409'), ('oname', 'Caligula')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q154732'), ('oname', 'Agrippina the Younger')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191956'), ('oname', 'Majorian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q160353'), ('oname', 'Theodosius II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q170026'), ('oname', 'Valentinian III')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191940'), ('oname', 'Petronius Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q182070'), ('oname', 'Maxentius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q33941'), ('oname', 'Julian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46768'), ('oname', 'Maximian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1413'), ('oname', 'Nero')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q378675'), ('oname', 'Macrianus Major')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1446'), ('oname', 'Caracalla')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q203198'), ('oname', 'Avitus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q43107'), ('oname', 'Diocletian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1425'), ('oname', 'Trajan')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1414'), ('oname', 'Galba')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q731546'), ('oname', 'Bassianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1440'), ('oname', 'Didius Julianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1433'), ('oname', 'Lucius Verus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q181764'), ('oname', 'Maurice')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1200638'), ('oname', 'Desiderius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1417'), ('oname', 'Vitellius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1434'), ('oname', 'Commodus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q207121'), ('oname', 'Libius Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q507675'), ('oname', 'Flavius Victor')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1769'), ('oname', 'Alexander Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q130601'), ('oname', 'Romulus Augustus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q202543'), ('oname', 'Glycerius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46762'), ('oname', 'Claudius Gothicus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1424'), ('oname', 'Nerva')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46837'), ('oname', 'Hostilian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46696'), ('oname', 'Theodosius I')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q177980'), ('oname', 'Aemilianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1782'), ('oname', 'Gordian I')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1797'), ('oname', 'Pupienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1436'), ('oname', 'Pertinax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q273253'), ('oname', 'Herennius Etruscus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q187004'), ('oname', 'Carus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q190097'), ('oname', 'Carinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46821'), ('oname', 'Numerian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q211772'), ('oname', 'Anthemius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q159369'), ('oname', 'Arcadius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q187068'), ('oname', 'Marcus Aurelius Probus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q263444'), ('oname', 'Pacatianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q265083'), ('oname', 'Domitianus II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q631423'), ('oname', 'Sabinus Iulianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1817'), ('oname', 'Philip the Arab')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q297494'), ('oname', 'Saloninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q312672'), ('oname', 'Tetricus I')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q317232'), ('oname', 'Carausius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q437760'), ('oname', 'Bonosus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q171023'), ('oname', 'Trebonianus Gallus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q202222'), ('oname', 'Volusianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1805'), ('oname', 'Balbinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q177988'), ('oname', 'Marcus Claudius Tacitus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q562376'), ('oname', 'Sebastianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q183089'), ('oname', 'Geta')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255453'), ('oname', 'Marcus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q118186'), ('oname', 'Marcus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q311556'), ('oname', 'Allectus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q310442'), ('oname', 'Marcus Aurelius Marius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1752'), ('oname', 'Macrinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q453041'), ('oname', 'Sabinianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q34074'), ('oname', 'Jovian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q312910'), ('oname', 'Aureolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q114072'), ('oname', 'Ingenuus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q199946'), ('oname', 'Florianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1803'), ('oname', 'Gordian II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q193678'), ('oname', 'Olybrius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q709713'), ('oname', 'Domitius Domitianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q885870'), ('oname', 'Victorinus Junior')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q333799'), ('oname', 'Regalianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q185844'), ('oname', 'Quintillus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1283853'), ('oname', 'Marcellus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q887042'), ('oname', 'Septimius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q316284'), ('oname', 'Procopius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q259150'), ('oname', 'Uranius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q176536'), ('oname', 'Jotapianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255143'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q311274'), ('oname', 'Valerius Valens')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q268744'), ('oname', 'Sextus Martinianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q442570'), ('oname', 'Silbannacus')]\n",
      "128\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q842606 --> 'Roman emperor' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?item wdt:P31 wd:Q5; \n",
    "    wdt:P39 wd:Q842606.\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?item sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "6cf39fa9-90af-4b7d-ad02-a91bb38e6ea5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q46780'), ('oname', 'Aurelian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q437604'), ('oname', 'Julius Saturninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1777'), ('oname', 'Maximinus Thrax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q518890'), ('oname', 'Gaius Julius Verus Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1762'), ('oname', 'Elagabalus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1411'), ('oname', 'Claudius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1423'), ('oname', 'Domitian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q185538'), ('oname', 'Constans')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46734'), ('oname', 'Constantine II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q103860'), ('oname', 'Julius Nepos')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1830'), ('oname', 'Decius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q104475'), ('oname', 'Gallienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q189108'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1409'), ('oname', 'Caligula')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191956'), ('oname', 'Majorian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q170026'), ('oname', 'Valentinian III')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191940'), ('oname', 'Petronius Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q182070'), ('oname', 'Maxentius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q33941'), ('oname', 'Julian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1446'), ('oname', 'Caracalla')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q203198'), ('oname', 'Avitus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1414'), ('oname', 'Galba')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q731546'), ('oname', 'Bassianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1440'), ('oname', 'Didius Julianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q181764'), ('oname', 'Maurice')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1417'), ('oname', 'Vitellius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1434'), ('oname', 'Commodus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q207121'), ('oname', 'Libius Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1769'), ('oname', 'Alexander Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46837'), ('oname', 'Hostilian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q177980'), ('oname', 'Aemilianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1797'), ('oname', 'Pupienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1436'), ('oname', 'Pertinax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q273253'), ('oname', 'Herennius Etruscus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q190097'), ('oname', 'Carinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q211772'), ('oname', 'Anthemius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q187068'), ('oname', 'Marcus Aurelius Probus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1817'), ('oname', 'Philip the Arab')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q297494'), ('oname', 'Saloninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q317232'), ('oname', 'Carausius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q171023'), ('oname', 'Trebonianus Gallus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q202222'), ('oname', 'Volusianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1805'), ('oname', 'Balbinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q183089'), ('oname', 'Geta')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255453'), ('oname', 'Marcus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q310442'), ('oname', 'Marcus Aurelius Marius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1752'), ('oname', 'Macrinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q312910'), ('oname', 'Aureolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q199946'), ('oname', 'Florianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1803'), ('oname', 'Gordian II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q885870'), ('oname', 'Victorinus Junior')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q333799'), ('oname', 'Regalianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q887042'), ('oname', 'Septimius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q176536'), ('oname', 'Jotapianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255143'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q311274'), ('oname', 'Valerius Valens')]\n",
      "56\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q842606 --> 'Roman emperor'\n",
    "# P1196 --> 'manner of death'\n",
    "# Q149086 --> 'homicide'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?item wdt:P31 wd:Q5; \n",
    "    wdt:P39 wd:Q842606;\n",
    "    wdt:P1196 wd:Q149086.\n",
    "    \n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?item sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2d88430",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "76b833dc-18dc-48f9-82fd-da338c005eb6",
   "metadata": {},
   "source": [
    "I checked the datail of roman emperor and i get all data execpt killer name so killer name is not available in the wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "c6711f42",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q46780'), ('oname', 'Aurelian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q437604'), ('oname', 'Julius Saturninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1777'), ('oname', 'Maximinus Thrax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q518890'), ('oname', 'Gaius Julius Verus Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1762'), ('oname', 'Elagabalus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1411'), ('oname', 'Claudius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1423'), ('oname', 'Domitian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q185538'), ('oname', 'Constans')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46734'), ('oname', 'Constantine II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q103860'), ('oname', 'Julius Nepos')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1830'), ('oname', 'Decius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q104475'), ('oname', 'Gallienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q189108'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1409'), ('oname', 'Caligula')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191956'), ('oname', 'Majorian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q170026'), ('oname', 'Valentinian III')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q191940'), ('oname', 'Petronius Maximus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q182070'), ('oname', 'Maxentius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q33941'), ('oname', 'Julian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1446'), ('oname', 'Caracalla')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q203198'), ('oname', 'Avitus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1414'), ('oname', 'Galba')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q731546'), ('oname', 'Bassianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1440'), ('oname', 'Didius Julianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q181764'), ('oname', 'Maurice')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1417'), ('oname', 'Vitellius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1434'), ('oname', 'Commodus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q207121'), ('oname', 'Libius Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1769'), ('oname', 'Alexander Severus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q46837'), ('oname', 'Hostilian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q177980'), ('oname', 'Aemilianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1797'), ('oname', 'Pupienus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1436'), ('oname', 'Pertinax')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q273253'), ('oname', 'Herennius Etruscus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q190097'), ('oname', 'Carinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q211772'), ('oname', 'Anthemius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q187068'), ('oname', 'Marcus Aurelius Probus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1817'), ('oname', 'Philip the Arab')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q297494'), ('oname', 'Saloninus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q317232'), ('oname', 'Carausius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q171023'), ('oname', 'Trebonianus Gallus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q202222'), ('oname', 'Volusianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1805'), ('oname', 'Balbinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q183089'), ('oname', 'Geta')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255453'), ('oname', 'Marcus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q310442'), ('oname', 'Marcus Aurelius Marius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1752'), ('oname', 'Macrinus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q312910'), ('oname', 'Aureolus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q199946'), ('oname', 'Florianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1803'), ('oname', 'Gordian II')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q885870'), ('oname', 'Victorinus Junior')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q333799'), ('oname', 'Regalianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q887042'), ('oname', 'Septimius')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q176536'), ('oname', 'Jotapianus')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q255143'), ('oname', 'Gratian')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q311274'), ('oname', 'Valerius Valens')]\n",
      "56\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Q842606 --> 'Roman emperor'\n",
    "# P1196 --> 'manner of death'\n",
    "# Q149086 --> 'homicide'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #Get the data of julius Caesar from the given data\n",
    "   ?item wdt:P31 wd:Q5; \n",
    "    wdt:P39 wd:Q842606;\n",
    "    wdt:P1196 wd:Q149086.\n",
    "    \n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?item sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1a897e70",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 5\n",
    "Return the Roman emperors who killed another Roman emperor (the result set must a list of 4-tuples with killer IRI and label, and killed IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "7fa050aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q5413489'), ('pname', 'curule aedile')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P3701'), ('sname', 'incarnation of'), ('p', 'http://www.wikidata.org/entity/Q58373'), ('pname', 'Amun')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P800'), ('sname', 'notable work'), ('p', 'http://www.wikidata.org/entity/Q544948'), ('pname', 'Commentarii de Bello Civili')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P3716'), ('sname', 'social classification'), ('p', 'http://www.wikidata.org/entity/Q16744001'), ('pname', 'noble')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2358'), ('sname', 'Roman praenomen'), ('p', 'http://www.wikidata.org/entity/Q5517401'), ('pname', 'Gaius')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q172907'), ('pname', 'praetor')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q189430'), ('pname', 'quaestor')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2348'), ('sname', 'time period'), ('p', 'http://www.wikidata.org/entity/Q2815472'), ('pname', 'Late Roman Republic')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P410'), ('sname', 'military rank'), ('p', 'http://www.wikidata.org/entity/Q849288'), ('pname', 'Military tribune')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P793'), ('sname', 'significant event'), ('p', 'http://www.wikidata.org/entity/Q17768966'), ('pname', 'capture')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P25'), ('sname', 'mother'), ('p', 'http://www.wikidata.org/entity/Q232725'), ('pname', 'Aurelia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P3373'), ('sname', 'sibling'), ('p', 'http://www.wikidata.org/entity/Q241143'), ('pname', 'Julia Minor')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P102'), ('sname', 'member of political party'), ('p', 'http://www.wikidata.org/entity/Q271108'), ('pname', 'populares')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P3373'), ('sname', 'sibling'), ('p', 'http://www.wikidata.org/entity/Q2743448'), ('pname', 'Julia Major')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P22'), ('sname', 'father'), ('p', 'http://www.wikidata.org/entity/Q314710'), ('pname', 'Gaius Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q432130'), ('pname', 'Sempronia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P166'), ('sname', 'award received'), ('p', 'http://www.wikidata.org/entity/Q657438'), ('pname', 'Roman triumph')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1889'), ('sname', 'different from'), ('p', 'http://www.wikidata.org/entity/Q242174'), ('pname', 'Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q3409374'), ('pname', 'Ancient Roman priest')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q952844'), ('pname', 'pontifex')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q99899510'), ('pname', 'Ancient Roman historian')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P157'), ('sname', 'killed by'), ('p', 'http://www.wikidata.org/entity/Q294846'), ('pname', 'Decimus Junius Brutus Albinus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P607'), ('sname', 'conflict'), ('p', 'http://www.wikidata.org/entity/Q202161'), ('pname', 'Gallic War')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P26'), ('sname', 'spouse'), ('p', 'http://www.wikidata.org/entity/Q234825'), ('pname', 'Pompeia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q106727050'), ('pname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q1097498'), ('pname', 'ruler')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q1138524'), ('pname', 'Paulys Realenzyklopädie der klassischen Altertumswissenschaft')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q1190123'), ('pname', 'Roman governor')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q12859263'), ('pname', 'orator')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q1402561'), ('pname', 'military leader')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1196'), ('sname', 'manner of death'), ('p', 'http://www.wikidata.org/entity/Q149086'), ('pname', 'homicide')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P27'), ('sname', 'country of citizenship'), ('p', 'http://www.wikidata.org/entity/Q1747689'), ('pname', 'Ancient Rome')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q19180675'), ('pname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q20056508'), ('pname', 'Ancient Roman senator')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q212943'), ('pname', 'pontifex maximus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P6379'), ('sname', 'has works in the collection'), ('p', 'http://www.wikidata.org/entity/Q213322'), ('pname', 'Victoria and Albert Museum')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P19'), ('sname', 'place of birth'), ('p', 'http://www.wikidata.org/entity/Q220'), ('pname', 'Rome')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P551'), ('sname', 'residence'), ('p', 'http://www.wikidata.org/entity/Q220'), ('pname', 'Rome')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q30059240'), ('pname', \"Real'nyj slovar' klassicheskih drevnostej po Ljubkeru\")]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q3181656'), ('pname', 'The Nuttall Encyclopædia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1412'), ('sname', 'languages spoken, written or signed'), ('p', 'http://www.wikidata.org/entity/Q35497'), ('pname', 'Ancient Greek')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P103'), ('sname', 'native language'), ('p', 'http://www.wikidata.org/entity/Q397'), ('pname', 'Latin')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1412'), ('sname', 'languages spoken, written or signed'), ('p', 'http://www.wikidata.org/entity/Q397'), ('pname', 'Latin')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P6886'), ('sname', 'writing language'), ('p', 'http://www.wikidata.org/entity/Q397'), ('pname', 'Latin')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1441'), ('sname', 'present in work'), ('p', 'http://www.wikidata.org/entity/Q40185'), ('pname', 'The Divine Comedy')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q40779'), ('pname', 'Roman consul')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q4173137'), ('pname', 'Jewish Encyclopedia of Brockhaus and Efron')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q46002746'), ('pname', 'Dictionary of African Biography')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q49757'), ('pname', 'poet')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P31'), ('sname', 'instance of'), ('p', 'http://www.wikidata.org/entity/Q5'), ('pname', 'human')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q51955019'), ('pname', 'BEIC Digital Library')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P5008'), ('sname', 'on focus list of Wikimedia project'), ('p', 'http://www.wikidata.org/entity/Q5460604'), ('pname', 'Wikipedia:Vital articles')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q602358'), ('pname', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P21'), ('sname', 'sex or gender'), ('p', 'http://www.wikidata.org/entity/Q6581097'), ('pname', 'male')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q67311526'), ('pname', 'Obalky knih.cz')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P7763'), ('sname', 'copyright status as a creator'), ('p', 'http://www.wikidata.org/entity/Q71887839'), ('pname', 'copyrights on works have expired')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P6379'), ('sname', 'has works in the collection'), ('p', 'http://www.wikidata.org/entity/Q731126'), ('pname', 'J. Paul Getty Museum')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q82955'), ('pname', 'politician')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q842337'), ('pname', 'Parallel Lives')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q867541'), ('pname', 'Encyclopædia Britannica 11th edition')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q97667506'), ('pname', 'Ancient Roman politician')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q98103687'), ('pname', 'Ancient Roman military personnel')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P463'), ('sname', 'member of'), ('p', 'http://www.wikidata.org/entity/Q715380'), ('pname', 'First Triumvirate')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P8822'), ('sname', 'epithet'), ('p', 'http://www.wikidata.org/entity/Q1231627'), ('pname', 'Divus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q1426927'), ('pname', 'Flamen Dialis')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q11942503'), ('pname', 'Postumia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation'), ('p', 'http://www.wikidata.org/entity/Q11774156'), ('pname', 'memoirist')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1038'), ('sname', 'relative'), ('p', 'http://www.wikidata.org/entity/Q1405'), ('pname', 'Augustus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P40'), ('sname', 'child'), ('p', 'http://www.wikidata.org/entity/Q1405'), ('pname', 'Augustus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P509'), ('sname', 'cause of death'), ('p', 'http://www.wikidata.org/entity/Q4228595'), ('pname', 'stab wound')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2365'), ('sname', 'Roman cognomen'), ('p', 'http://www.wikidata.org/entity/Q1025414'), ('pname', 'Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P3716'), ('sname', 'social classification'), ('p', 'http://www.wikidata.org/entity/Q154668'), ('pname', 'patrician')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q232229'), ('pname', 'Servilia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P39'), ('sname', 'position held'), ('p', 'http://www.wikidata.org/entity/Q236885'), ('pname', 'Roman dictator')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2359'), ('sname', 'Roman nomen gentilicium'), ('p', 'http://www.wikidata.org/entity/Q29871072'), ('pname', 'Julius')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P53'), ('sname', 'family'), ('p', 'http://www.wikidata.org/entity/Q3268376'), ('pname', 'Julii Caesares')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P5025'), ('sname', 'gens'), ('p', 'http://www.wikidata.org/entity/Q510193'), ('pname', 'Julia gens')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P800'), ('sname', 'notable work'), ('p', 'http://www.wikidata.org/entity/Q106199'), ('pname', 'Commentarii de Bello Gallico')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P26'), ('sname', 'spouse'), ('p', 'http://www.wikidata.org/entity/Q235627'), ('pname', 'Calpurnia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P607'), ('sname', 'conflict'), ('p', 'http://www.wikidata.org/entity/Q1238338'), ('pname', \"Caesar's Civil War\")]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P157'), ('sname', 'killed by'), ('p', 'http://www.wikidata.org/entity/Q1243545'), ('pname', 'Publius Servilius Casca')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P166'), ('sname', 'award received'), ('p', 'http://www.wikidata.org/entity/Q580995'), ('pname', 'apotheosis')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q635'), ('pname', 'Cleopatra')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P20'), ('sname', 'place of death'), ('p', 'http://www.wikidata.org/entity/Q944814'), ('pname', 'Theatre of Pompey')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P26'), ('sname', 'spouse'), ('p', 'http://www.wikidata.org/entity/Q235423'), ('pname', 'Cornelia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P157'), ('sname', 'killed by'), ('p', 'http://www.wikidata.org/entity/Q172248'), ('pname', 'Marcus Junius Brutus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q1102155'), ('pname', 'Clodia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q91615986'), ('pname', 'Postumia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q12271314'), ('pname', 'Tertulla')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q273616'), ('pname', 'Mucia Tertia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1889'), ('sname', 'different from'), ('p', 'http://www.wikidata.org/entity/Q86215133'), ('pname', 'Pseudo-Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1889'), ('sname', 'different from'), ('p', 'http://www.wikidata.org/entity/Q5517436'), ('pname', 'Gaius Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P40'), ('sname', 'child'), ('p', 'http://www.wikidata.org/entity/Q39589'), ('pname', 'Caesarion')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q11942281'), ('pname', 'Pomponia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P157'), ('sname', 'killed by'), ('p', 'http://www.wikidata.org/entity/Q207370'), ('pname', 'Gaius Cassius Longinus')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P40'), ('sname', 'child'), ('p', 'http://www.wikidata.org/entity/Q235087'), ('pname', 'Julia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q11002436'), ('pname', 'Lollia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P910'), ('sname', \"topic's main category\"), ('p', 'http://www.wikidata.org/entity/Q7329059'), ('pname', 'Category:Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P119'), ('sname', 'place of burial'), ('p', 'http://www.wikidata.org/entity/Q1133288'), ('pname', 'Temple of Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P157'), ('sname', 'killed by'), ('p', 'http://www.wikidata.org/entity/Q1228715'), ('pname', 'Tillius Cimber')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2868'), ('sname', 'subject has role'), ('p', 'http://www.wikidata.org/entity/Q1231621'), ('pname', 'Divus Iulius')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q17505974'), ('pname', 'Eunoë')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P2184'), ('sname', 'history of topic'), ('p', 'http://www.wikidata.org/entity/Q30752931'), ('pname', 'History of Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P451'), ('sname', 'unmarried partner'), ('p', 'http://www.wikidata.org/entity/Q440420'), ('pname', 'Cossutia')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1343'), ('sname', 'described by source'), ('p', 'http://www.wikidata.org/entity/Q46997079'), ('pname', 'Caesar in Gaul: New Perspectives on the Archaeology of Mass Violence')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P410'), ('sname', 'military rank'), ('p', 'http://www.wikidata.org/entity/Q725434'), ('pname', 'Imperator')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P511'), ('sname', 'honorific prefix'), ('p', 'http://www.wikidata.org/entity/Q725434'), ('pname', 'Imperator')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1424'), ('sname', \"topic's main template\"), ('p', 'http://www.wikidata.org/entity/Q88009196'), ('pname', 'Template:Julius Caesar')]\n",
      "[('s', 'http://www.wikidata.org/prop/direct/P1035'), ('sname', 'honorific suffix'), ('p', 'http://www.wikidata.org/entity/Q928994'), ('pname', 'Pater Patriae')]\n",
      "109\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire'\n",
    "# Q1048 --> 'Julius Caesar'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #Get the data of julius Caesar from the given data\n",
    "    wd:Q1048 ?s ?p .\n",
    "   # get the label\n",
    "   ?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   #?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "26e54dbc-dc8e-4fc9-a3d9-659862b9a168",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q184549'), ('emperorname', 'Licinius'), ('ki', 'http://www.wikidata.org/entity/Q8413'), ('killername', 'Constantine the Great')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q183089'), ('emperorname', 'Geta'), ('ki', 'http://www.wikidata.org/entity/Q1446'), ('killername', 'Caracalla')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q842606 --> 'Roman emperor' \n",
    "# P157 -->'killed by' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?emperorname ?ki ?killername\n",
    "WHERE {\n",
    "   # bind something  \n",
    "    ?item wdt:P31 wd:Q5; \n",
    "     wdt:P39 wd:Q842606;\n",
    "     wdt:P157 ?ki.\n",
    "     \n",
    "     ?ki wdt:P39 wd:Q842606.\n",
    "   \n",
    "   # get the label\n",
    "   ?item sc:name ?emperorname .\n",
    "   ?ki sc:name ?killername.\n",
    "   #?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2303547",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "b977a4a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q184549'), ('emperorname', 'Licinius'), ('ki', 'http://www.wikidata.org/entity/Q8413'), ('killername', 'Constantine the Great')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q183089'), ('emperorname', 'Geta'), ('ki', 'http://www.wikidata.org/entity/Q1446'), ('killername', 'Caracalla')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?item ?emperorname ?ki ?killername\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #Get the data of julius Caesar from the given data\n",
    "    \n",
    "    ?item wdt:P31 wd:Q5; \n",
    "     wdt:P39 wd:Q842606;\n",
    "     wdt:P157 ?ki.\n",
    "     \n",
    "     ?ki wdt:P39 wd:Q842606.\n",
    "   \n",
    "   # get the label\n",
    "   ?item sc:name ?emperorname .\n",
    "   ?ki sc:name ?killername.\n",
    "   #?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "770e9dfa",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "Find the BGP for war"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "e32cf483",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q198'), ('pname', 'war')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q202161 --> 'Gallic War' \n",
    "#P31 --> Instance\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q202161 wdt:P31 ?p.\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   #?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "369de587-0d40-4a46-840d-e5a428514bfe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q350604'), ('oname', 'armed conflict')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P461'), ('pname', 'opposite of'), ('o', 'http://www.wikidata.org/entity/Q454'), ('oname', 'peace')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8394144'), ('oname', 'Category:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q106727050'), ('oname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1190554'), ('oname', 'occurrence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q178561'), ('oname', 'battle')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4086271'), ('oname', 'Bible Encyclopedia of Archimandrite Nicephorus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4114391'), ('oname', 'Sytin Military Encyclopedia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4173137'), ('oname', 'Jewish Encyclopedia of Brockhaus and Efron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q678259'), ('oname', 'Nordisk familjebok')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('pname', 'studied by'), ('o', 'http://www.wikidata.org/entity/Q192781'), ('oname', 'military history')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1920219'), ('oname', 'social issue')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q4476237'), ('oname', 'Category:Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P607'), ('oname', 'conflict')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q13479477'), ('oname', 'Template:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('pname', \"topic's main Wikimedia portal\"), ('o', 'http://www.wikidata.org/entity/Q10632410'), ('oname', 'Portal:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q105370834'), ('oname', 'war phase')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "# write your queries \n",
    "# Q198 --> 'war'\n",
    "# Q202161 --> 'Gallic War' \n",
    "# P31 --> Instance\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something \n",
    "   wd:Q198 ?p ?o.\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e3b5aa4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "a0a3597d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q350604'), ('oname', 'armed conflict')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P461'), ('pname', 'opposite of'), ('o', 'http://www.wikidata.org/entity/Q454'), ('oname', 'peace')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8394144'), ('oname', 'Category:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q106727050'), ('oname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1190554'), ('oname', 'occurrence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q178561'), ('oname', 'battle')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4086271'), ('oname', 'Bible Encyclopedia of Archimandrite Nicephorus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4114391'), ('oname', 'Sytin Military Encyclopedia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q4173137'), ('oname', 'Jewish Encyclopedia of Brockhaus and Efron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q678259'), ('oname', 'Nordisk familjebok')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('pname', 'studied by'), ('o', 'http://www.wikidata.org/entity/Q192781'), ('oname', 'military history')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1920219'), ('oname', 'social issue')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q4476237'), ('oname', 'Category:Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P607'), ('oname', 'conflict')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q13479477'), ('oname', 'Template:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('pname', \"topic's main Wikimedia portal\"), ('o', 'http://www.wikidata.org/entity/Q10632410'), ('oname', 'Portal:War')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q105370834'), ('oname', 'war phase')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #Get the data of julius Caesar from the given data\n",
    "   wd:Q198 ?p ?o.\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "746dbce1",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 7\n",
    "Find the wars (note that \"war\" and \"battle\" are not the same thing) participated by the Roman Empire (return IRI and name of the war)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "15dc05d7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q202311'), ('oname', 'Egypt')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q208041'), ('oname', 'sestertius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('pname', 'coat of arms'), ('o', 'http://www.wikidata.org/entity/Q163323'), ('oname', 'Roman legion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q1456601'), ('oname', 'Category:Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q11514315'), ('oname', 'historical period')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q15'), ('oname', 'Africa')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('pname', 'has works in the collection'), ('o', 'http://www.wikidata.org/entity/Q160236'), ('oname', 'Metropolitan Museum of Art')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('pname', 'basic form of government'), ('o', 'http://www.wikidata.org/entity/Q173424'), ('oname', 'autocracy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q1747689'), ('oname', 'Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q1747689'), ('oname', 'Ancient Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q19180675'), ('oname', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital'), ('o', 'http://www.wikidata.org/entity/Q220'), ('oname', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q2886278'), ('oname', 'Later Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q3024240'), ('oname', 'historical country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q3181656'), ('oname', 'The Nuttall Encyclopædia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('pname', 'religion'), ('o', 'http://www.wikidata.org/entity/Q337547'), ('oname', 'ancient Roman religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3075'), ('pname', 'official religion'), ('o', 'http://www.wikidata.org/entity/Q337547'), ('oname', 'ancient Roman religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used'), ('o', 'http://www.wikidata.org/entity/Q35497'), ('oname', 'Ancient Greek')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('pname', 'official language'), ('o', 'http://www.wikidata.org/entity/Q35497'), ('oname', 'Ancient Greek')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3842'), ('pname', 'located in present-day administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q38'), ('oname', 'Italy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('pname', 'official language'), ('o', 'http://www.wikidata.org/entity/Q397'), ('oname', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3842'), ('pname', 'located in present-day administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q43'), ('oname', 'Turkey')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q46'), ('oname', 'Europe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('o', 'http://www.wikidata.org/entity/Q48'), ('oname', 'Asia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q48349'), ('oname', 'empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3075'), ('pname', 'official religion'), ('o', 'http://www.wikidata.org/entity/Q5043'), ('oname', 'Christianity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q62646'), ('oname', 'Germania')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q7209'), ('oname', 'Han dynasty')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('pname', 'basic form of government'), ('o', 'http://www.wikidata.org/entity/Q7269'), ('oname', 'monarchy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q787204'), ('oname', 'High Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('pname', 'office held by head of state'), ('o', 'http://www.wikidata.org/entity/Q842606'), ('oname', 'Roman emperor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('oname', 'Byzantine Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital'), ('o', 'http://www.wikidata.org/entity/Q16869'), ('oname', 'Constantinople')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q178897'), ('oname', 'Latin Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by'), ('o', 'http://www.wikidata.org/entity/Q42834'), ('oname', 'Western Roman Empire (395-476 AD)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('pname', 'time period'), ('o', 'http://www.wikidata.org/entity/Q486761'), ('oname', 'classical antiquity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with'), ('o', 'http://www.wikidata.org/entity/Q1986139'), ('oname', 'Parthian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('oname', 'Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('pname', 'legislative body'), ('o', 'http://www.wikidata.org/entity/Q3510883'), ('oname', 'Senate of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('pname', 'history of topic'), ('o', 'http://www.wikidata.org/entity/Q2671119'), ('oname', 'history of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q302980'), ('oname', 'Hibernia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency'), ('o', 'http://www.wikidata.org/entity/Q187776'), ('oname', 'denarius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9241'), ('pname', 'demographics of topic'), ('o', 'http://www.wikidata.org/entity/Q21192389'), ('oname', 'demographics of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('pname', 'coat of arms'), ('o', 'http://www.wikidata.org/entity/Q264655'), ('oname', 'vexillum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('pname', 'economy of topic'), ('o', 'http://www.wikidata.org/entity/Q3718695'), ('oname', 'economy of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('pname', 'participant in'), ('o', 'http://www.wikidata.org/entity/Q63146684'), ('oname', 'Battles of Bedriacum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('pname', 'religion'), ('o', 'http://www.wikidata.org/entity/Q7603670'), ('oname', 'state church of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('pname', 'category for maps'), ('o', 'http://www.wikidata.org/entity/Q8607609'), ('oname', 'Category:Maps of the Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('pname', 'category of associated people'), ('o', 'http://www.wikidata.org/entity/Q8678282'), ('oname', 'Category:People of the Roman Empire')]\n",
      "52\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2277 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "cd691b07-00e7-4ef5-ae8b-1dde2a07e33a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q63146684'), ('oname', 'Battles of Bedriacum')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2277 wdt:P1344 ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "971d71b0-8ec5-4aee-95a8-6c5dbafe28e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q6324312'), ('oname', 'Category:Wars involving Turkey')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6324267'), ('oname', 'Category:Wars involving Greece')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6990096'), ('oname', 'Category:Wars involving Pakistan')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6480612'), ('oname', 'Category:Wars involving Ethiopia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6990260'), ('oname', 'Category:Wars involving Poland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6989300'), ('oname', 'Category:Wars involving ancient Rome')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6802131'), ('oname', 'Category:Wars involving the Soviet Union')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6244273'), ('oname', 'Category:Wars involving Israel')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8085859'), ('oname', 'Category:Wars between the United States and Native Americans')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "# P4224 --> 'category contains'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?o wdt:P4224 wd:Q198 .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "b2b59190-70d8-4cfa-9be3-2608e4d1f464",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4224'), ('pname', 'category contains'), ('o', 'http://www.wikidata.org/entity/Q198'), ('oname', 'war')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q4167836'), ('oname', 'Wikimedia category')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "# P4224 --> 'category contains'\n",
    "# Q6989300 --> 'Category:Wars involving ancient Rome'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q6989300 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "ca0b424d-76fd-4e34-9b30-f01ab5be4325",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q3417663'), ('sname', 'Roman–Gallic wars')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q252298'), ('sname', 'Hungarian–Romanian war of 1919')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4205368'), ('sname', 'Jewish–Roman wars')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q486831'), ('sname', 'Roman–Seleucid War')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q500409'), ('sname', 'Roman–Persian Wars')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q202578'), ('sname', 'First Jewish-Roman War')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1533828'), ('sname', 'Roman–Parthian War of 58–63')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3778687'), ('sname', 'Romanian War of Independence')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2407716'), ('sname', 'Roman–Sassanid War')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1790268'), ('sname', 'Roman–Parthian War of 161–166')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q84850006'), ('sname', 'Roman–Parthian War of 195–198')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q12292667'), ('sname', 'Romanian involvement in the Balkan Wars')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "# P4224 --> 'category contains'\n",
    "# Q6989300 --> 'Category:Wars involving ancient Rome'\n",
    "# Q198 --> 'war' \n",
    "#P31 --> Instance\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q198.\n",
    "   # get the label\n",
    "   ?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   #?o sc:name ?oname\n",
    "   Filter(Regex (?sname ,\"Roman*\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "c0626d80-92e8-4aed-aa12-cd523b46dd34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q202311'), ('oname', 'Egypt')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q12824780'), ('oname', 'Asia Minor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q81483'), ('oname', 'Levant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q83891'), ('oname', 'Sasanian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1542'), ('pname', 'has effect'), ('o', 'http://www.wikidata.org/entity/Q275918'), ('oname', 'Muslim conquests')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q1192043'), ('oname', 'Roman–Parthian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q198'), ('oname', 'war')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q2277'), ('oname', 'Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q23522'), ('oname', 'Balkans')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('oname', 'Byzantine Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q34575'), ('oname', 'Aegean Sea')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q858108'), ('oname', 'Byzantine–Sassanian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q260437'), ('oname', 'Atropatene')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q1986139'), ('oname', 'Parthian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('oname', 'Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q11767'), ('oname', 'Mesopotamia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q200173'), ('oname', 'South Caucasus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P828'), ('pname', 'has cause'), ('o', 'http://www.wikidata.org/entity/Q18121382'), ('oname', 'multiple causes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8682034'), ('oname', 'Category:Roman–Persian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1542'), ('pname', 'has effect'), ('o', 'http://www.wikidata.org/entity/Q5432180'), ('oname', 'Fall of the Sassanid Empire')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "# P4224 --> 'category contains'\n",
    "# Q6989300 --> 'Category:Wars involving ancient Rome'\n",
    "# Q198 --> 'war' \n",
    "#P31 --> Instance\n",
    "# Q500409 --> 'Roman–Persian Wars' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname \n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q500409 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0860bc3c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "822c5da1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q500409'), ('sname', 'Roman–Persian Wars')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q202578'), ('sname', 'First Jewish-Roman War')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1533828'), ('sname', 'Roman–Parthian War of 58–63')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1790268'), ('sname', 'Roman–Parthian War of 161–166')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q84850006'), ('sname', 'Roman–Parthian War of 195–198')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# Q2277 --> 'Roman Empire' from the above query\n",
    "# P1344 --> 'participant in'\n",
    "# P4224 --> 'category contains'\n",
    "# Q6989300 --> 'Category:Wars involving ancient Rome'\n",
    "# Q198 --> 'war' \n",
    "#P31 --> Instance\n",
    "# Q500409 --> 'Roman–Persian Wars' \n",
    "# P710 --> 'participant'\n",
    "# Q198 --> 'war'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q198;\n",
    "   wdt:P710 wd:Q2277.\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   #?o sc:name ?oname\n",
    "   Filter(Regex (?sname ,\"Roman*\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "    \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "edc3ae22",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 8\n",
    "Consider all the wars participated by the Roman Empire. For each war return the number of related battles and the opponent (a war is composed of one or more battles) (the result set must be a list of 5-tuples war IRI, label, opponent IRI and label, and #battles)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "b43dd955",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q1192043'), ('oname', 'Roman–Parthian Wars')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q858108'), ('oname', 'Byzantine–Sassanian Wars')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# P527 --> 'has part' \n",
    "# Q500409 --> 'Roman–Persian Wars'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q500409 wdt:P527 ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "2131c782-92db-4de3-bf79-e7ed0f3f887a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q202311'), ('oname', 'Egypt')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q12824780'), ('oname', 'Asia Minor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q81483'), ('oname', 'Levant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q83891'), ('oname', 'Sasanian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1542'), ('pname', 'has effect'), ('o', 'http://www.wikidata.org/entity/Q275918'), ('oname', 'Muslim conquests')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q1192043'), ('oname', 'Roman–Parthian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q198'), ('oname', 'war')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q2277'), ('oname', 'Roman Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q23522'), ('oname', 'Balkans')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q12544'), ('oname', 'Byzantine Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q34575'), ('oname', 'Aegean Sea')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q858108'), ('oname', 'Byzantine–Sassanian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q260437'), ('oname', 'Atropatene')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q1986139'), ('oname', 'Parthian Empire')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant'), ('o', 'http://www.wikidata.org/entity/Q17167'), ('oname', 'Roman Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q11767'), ('oname', 'Mesopotamia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pname', 'location'), ('o', 'http://www.wikidata.org/entity/Q200173'), ('oname', 'South Caucasus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P828'), ('pname', 'has cause'), ('o', 'http://www.wikidata.org/entity/Q18121382'), ('oname', 'multiple causes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8682034'), ('oname', 'Category:Roman–Persian Wars')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1542'), ('pname', 'has effect'), ('o', 'http://www.wikidata.org/entity/Q5432180'), ('oname', 'Fall of the Sassanid Empire')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# P527 --> 'has part' \n",
    "# Q500409 --> 'Roman–Persian Wars'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q500409 ?p ?o .\n",
    "   # get the label\n",
    "   #?s sc:name ?sname .\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "31c609bf",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "735fb629",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1720c705-7def-4dee-8c21-dd756c094834",
   "metadata": {},
   "source": [
    "There is no data avaiable of any battle related to any war"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
