{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "2dab0400",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "8565bd65",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-f79a19311a-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d729b5f5",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Sherlock Holmes explorative search\") \n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> Investigate the canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes) and which are the films and tv series related to the canon. We are also interested in the Emmy Awards and hiw many awards each film won. \n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wd:Q35610` | Arthur Conan Doyle        | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q35610 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Arthur Conan Doyle**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes)\n",
    "\n",
    "2. Identify the BGP for film\n",
    "\n",
    "3. Identify the BGP for television series\n",
    "\n",
    "4. Return the year of publication (take the first one if there are more publication dates) for each film and television series related to the canon of Sherlock Holmes (the result set must be a list of triples film/tv series IRI, label and year).\n",
    "\n",
    "5. Find who acted in more than one film or tv series related to the canon of Sherlock Holmes (the result set must be a list of triples actor/actress IRI, label and #film).\n",
    "\n",
    "6. Identify the BGP for Primetime Emmy Award\n",
    "\n",
    "7. Return all the types of Primetime Emmy Award (the result set must be a list of couples award IRI and label).\n",
    "\n",
    "8. For each film and television series related to the canon of Sherlock Holmes, return the number of Primetime Emmy Awards they won (return also the objects who did not win an Award) (the result set must be a list of triples film/tv series IRI, label and #award)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a02c8cb",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f0e5d5b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4928'), ('name', 'Ricorso author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5714'), ('name', 'Tor.com author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9419'), ('name', 'personal library at')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5470'), ('name', 'Scottish Poetry Library poet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1017'), ('name', 'Vatican Library ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P102'), ('name', 'member of political party')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q35610 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "578e3072-05a8-4e6b-9096-04244acb1635",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('name', \"category's main topic\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P655'), ('name', 'translator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P971'), ('name', 'category combines topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P87'), ('name', 'librettist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('name', 'Wikidata property example')]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "# incoming edges to Arthur Conan Doyle\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?sub ?p wd:Q35610 .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b5b1a33a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('subName', 'Inspector Lestrade'), ('name', 'creator')]\n",
      "[('subName', 'Dr. John Watson'), ('name', 'creator')]\n",
      "[('subName', 'Stamford'), ('name', 'creator')]\n",
      "[('subName', 'Enoch J. Drebber'), ('name', 'creator')]\n",
      "[('subName', 'Inspector Gregson'), ('name', 'creator')]\n",
      "[('subName', 'Sherlock Holmes'), ('name', 'creator')]\n",
      "[('subName', 'Professor Moriarty'), ('name', 'creator')]\n",
      "[('subName', 'Mary Morstan'), ('name', 'creator')]\n",
      "[('subName', 'Edward Malone'), ('name', 'creator')]\n",
      "[('subName', 'Professor Challenger'), ('name', 'creator')]\n",
      "[('subName', 'Lord John Roxton'), ('name', 'creator')]\n",
      "[('subName', 'Mrs. Hudson'), ('name', 'creator')]\n",
      "[('subName', '221B Baker Street'), ('name', 'creator')]\n",
      "[('subName', 'Irene Adler'), ('name', 'creator')]\n",
      "[('subName', 'Baker Street Irregulars'), ('name', 'creator')]\n",
      "[('subName', 'Inspector MacDonald'), ('name', 'creator')]\n",
      "[('subName', 'Inspector Bradstreet'), ('name', 'creator')]\n",
      "[('subName', 'Inspector Hopkins'), ('name', 'creator')]\n",
      "[('subName', 'Mycroft Holmes'), ('name', 'creator')]\n",
      "[('subName', 'Jonas Oldacre'), ('name', 'creator')]\n",
      "[('subName', 'Inspector Baynes'), ('name', 'creator')]\n",
      "[('subName', 'The Baker Street Irregulars'), ('name', 'field of work')]\n",
      "[('subName', 'Billy'), ('name', 'creator')]\n",
      "[('subName', 'McGinty'), ('name', 'creator')]\n",
      "[('subName', 'Brigadier Gerard'), ('name', 'creator')]\n",
      "[('subName', 'Wilhelm Gottsreich Sigismond von Ormstein'), ('name', 'creator')]\n",
      "[('subName', 'Henry Baskerville'), ('name', 'creator')]\n",
      "[('subName', 'Diogenes Club'), ('name', 'creator')]\n",
      "[('subName', 'Sebastian Moran'), ('name', 'creator')]\n",
      "[('subName', 'The Baker Street Boys'), ('name', 'creator')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# subjects with properties \"creator\",\"field of work\", \"characters\" or \"main subject\" and object Arthur Conan Doyle.\n",
    "# increased the limit to 30\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?subName ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?sub ?p wd:Q35610 .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?sub sc:name ?subName\n",
    "   VALUES ?p {wdt:P170 wdt:P101 wdt:P674 wdt:P921}\n",
    "}\n",
    "LIMIT 30\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9d936ea7-f03e-4848-8524-600c8af638e6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sub', 'http://www.wikidata.org/entity/Q1067723'), ('subName', 'Inspector Lestrade')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q187349'), ('subName', 'Dr. John Watson')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q20730767'), ('subName', 'Stamford')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q20730814'), ('subName', 'Enoch J. Drebber')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q3271215'), ('subName', 'Inspector Gregson')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q4653'), ('subName', 'Sherlock Holmes')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q283111'), ('subName', 'Professor Moriarty')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2731317'), ('subName', 'Mary Morstan')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q3719991'), ('subName', 'Edward Malone')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2330719'), ('subName', 'Professor Challenger')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q6679455'), ('subName', 'Lord John Roxton')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2456753'), ('subName', 'Mrs. Hudson')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q1992196'), ('subName', '221B Baker Street')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q42769523'), ('subName', 'Disguising a Suicide as a Homicide: Sir Arthur Conan Doyle, Hans Gross, and \"The Problem of Thor Bridge\"')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q1779558'), ('subName', 'Irene Adler')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q3154573'), ('subName', 'Baker Street Irregulars')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q10302353'), ('subName', 'Inspector MacDonald')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q6310867'), ('subName', 'Inspector Bradstreet')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q6316786'), ('subName', 'Inspector Hopkins')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q1616457'), ('subName', 'Mycroft Holmes')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q10307970'), ('subName', 'Jonas Oldacre')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q18275969'), ('subName', 'Inspector Baynes')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q47183632'), ('subName', 'The Baker Street Irregulars')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q16532764'), ('subName', 'Billy')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q48746152'), ('subName', 'McGinty')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q40902566'), ('subName', 'Medical writings of a literary physician, Sir Arthur Conan Doyle(1859-1930).')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2060930'), ('subName', 'Brigadier Gerard')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q3568234'), ('subName', 'Wilhelm Gottsreich Sigismond von Ormstein')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q19957946'), ('subName', 'EB-11 / Doyle, Sir Arthur Conan')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q28051383'), ('subName', 'Arthur Conan Doyle')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q20081073'), ('subName', 'Henry Baskerville')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2979919'), ('subName', 'Diogenes Club')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2499763'), ('subName', 'Sebastian Moran')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q24052752'), ('subName', 'NSRW / Doyle, Sir Arthur Conan')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q7715363'), ('subName', 'The Baker Street Boys')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2278328'), ('subName', 'Sherlock Holmes')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q30593439'), ('subName', 'On Conan Doyle; or, The Whole Art of Storytelling')]\n",
      "[('sub', 'http://www.wikidata.org/entity/Q13471093'), ('subName', 'Arthur Conan Doyle')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# basically the same query as before with limit up to 100\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sub ?subName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?sub ?p wd:Q35610 .\n",
    "   # get the label\n",
    "   ?sub sc:name ?subName.\n",
    "   VALUES ?p {wdt:P170 wdt:P101 wdt:P674 wdt:P921}\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "edb663c2-9f83-4fc7-8ed9-ec3031fef326",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sub', 'http://www.wikidata.org/entity/Q2316684'), ('subName', 'canon of Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# subjects that contain \"canon\" with incoming edges to Arthur Conan Doyle.\n",
    "# a piece of work (\"canon of Sherlock Holmes\") should be directly connected with it's author\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?sub ?subName ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?sub ?p wd:Q35610 .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?sub sc:name ?subName.\n",
    "   FILTER(REGEX(?subName, \"(?i)canon\"))\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c325b48-ce15-47c6-88aa-ef8cce7ab2a4",
   "metadata": {},
   "source": [
    "> The node we are interested in is \"wd:Q2316684\" with label \"canon of Sherlock Holmes\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4b3ae551",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for film"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ef697880",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8895'), ('name', 'All the Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "# all properties of the canon of Sherlock Holmes\n",
    "# The only starting point I have to find the BGP for \"film\" is either Arthur Conan Doyle or the \"canon of Sherlock Holmes\"\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "5a0478af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1764019'), ('name', 'Sherlock Holmes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q192837'), ('name', 'Sherlock')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q247643'), ('name', 'Elementary')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4523158'), ('name', 'Sherlock Holmes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q200396'), ('name', 'Sherlock Holmes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1210893'), ('name', 'The Adventures of Sherlock Holmes and Dr. Watson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q387306'), ('name', 'Sherlock Holmes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q243643'), ('name', 'Sherlock Holmes: A Game of Shadows')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# I know there are movies about Sherlock Holmes, so I look for\n",
    "# \"derivative work\" (wdt:P4969) of the \"Canon of Sherlock Holmes\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ca46af05-b878-40f9-a352-24157b11547f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q24856'), ('name', 'film series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1259759'), ('name', 'miniseries')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# What are the derivative works \"instances of\" (wdt:P31\") ?\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969/wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f501788-4928-4c2f-9257-32ae78366dd7",
   "metadata": {},
   "source": [
    ">Each row represents different instances of derivative work. The node we are interested in is \"wd:Q11424\" with label \"film\".\\\n",
    "This query is also the solution for the next task."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a39596ec",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for television series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "469b5f23",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q24856'), ('name', 'film series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1259759'), ('name', 'miniseries')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# Same query as the previous one.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969/wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c20e2e2b",
   "metadata": {},
   "source": [
    ">Each row represents different instances of derivative work. The node we are interested in is \"wd:Q5398426\" with label \"television series\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8800070d",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return the year of publication (take the first one if there are more publication dates) for each film and television series related to the canon of Sherlock Holmes (the result set must be a list of triples film/tv series IRI, label and year)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d44e7879",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1267'), ('name', 'AlloCiné series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1881'), ('name', 'list of characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2397'), ('name', 'YouTube channel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2515'), ('name', 'costume designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2636'), ('name', 'Minkultury film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2639'), ('name', 'Filmportal ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2703'), ('name', 'BFI National Archive work ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2755'), ('name', 'exploitation visa number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2758'), ('name', 'CNC film rating (France)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3121'), ('name', 'Epguides ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3135'), ('name', 'elCinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3145'), ('name', 'Sratim ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3402'), ('name', 'CNC film rating (Romania)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3650'), ('name', 'JMK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3834'), ('name', 'RTC film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4438'), ('name', 'BFI Films, TV and people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P449'), ('name', 'original broadcaster')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4786'), ('name', 'cinematografo film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4835'), ('name', 'TheTVDB.com series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4983'), ('name', 'TMDb TV series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5327'), ('name', 'fernsehserien.de ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5732'), ('name', 'bgm.tv subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5925'), ('name', 'Moviepilot.de series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6145'), ('name', 'Academy Awards Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6760'), ('name', 'Know Your Meme ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8013'), ('name', 'Trakt.tv ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P827'), ('name', 'BBC programme ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8278'), ('name', 'serial identifier on SerialZone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8419'), ('name', 'Archive of Our Own tag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8687'), ('name', 'social media followers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8847'), ('name', 'Kinorium movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3995'), ('name', 'Filmweb.pl ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4312'), ('name', 'camera setup')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4784'), ('name', 'Movieplayer TV-series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4834'), ('name', 'Deutsche Synchronkartei series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5990'), ('name', 'Movies Anywhere ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6133'), ('name', 'Siamzone film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6467'), ('name', 'Hulu series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6643'), ('name', 'TV Spielfilm series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7107'), ('name', 'LezWatch.TV show ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7501'), ('name', 'audio system')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9751'), ('name', 'Apple TV show ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2826'), ('name', 'Megogo ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8055'), ('name', 'Amazon.com Prime Video ID')]\n",
      "166\n"
     ]
    }
   ],
   "source": [
    "# Properties of films and tv series related to the canon of Sherlock Holmes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   ?p ?obj.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "19d287bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# Check objects with predicate publication date (wdt:P577). But publication date seems to never be used.\n",
    "# Actually, I am looking for objects that have a label, so excluding strings such as dates. That's why empty result set.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?derivativeWork wdt:P577 ?obj.\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "   #?derivativeWork sc:name ?dName.\n",
    "   #VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 2\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "93b3392b-c323-49ad-b1d2-9b85653cde91",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q192837'), ('derivativeWorkName', 'Sherlock')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q4523158'), ('derivativeWorkName', 'Sherlock Holmes')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q387306'), ('derivativeWorkName', 'Sherlock Holmes')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# Derivative work of the canon of Sherlock Holmes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   \n",
    "   # get the label\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "e5414413-f547-4893-a9ed-d7c06174a313",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2515'), ('name', 'costume designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3135'), ('name', 'elCinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3145'), ('name', 'Sratim ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3402'), ('name', 'CNC film rating (Romania)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3650'), ('name', 'JMK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3834'), ('name', 'RTC film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5990'), ('name', 'Movies Anywhere ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6133'), ('name', 'Siamzone film ID')]\n",
      "94\n"
     ]
    }
   ],
   "source": [
    "# Properties of Sherlock Holmes: A Game of Shadows\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q243643 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 2000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "b12b4e6c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# Publication date of Sherlock Holmes: A Game of Shadows. Empty (Again, I am excluding literals..)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q243643 wdt:P577 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 2000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "32aba14b-883c-4155-8002-2cc511f4a0b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)'), ('obj', 'sherlockholmes2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID'), ('obj', 'm/sherlock_holmes_a_game_of_shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID'), ('obj', '173048')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title'), ('obj', 'Sherlock Holmes: A Game of Shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID'), ('obj', 'v518386')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID'), ('obj', 'movie/sherlock-holmes-a-game-of-shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID'), ('obj', '75170')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID'), ('obj', '70202148')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID'), ('obj', '72142')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration'), ('obj', '129')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office'), ('obj', '543848418')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID'), ('obj', '75321')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID'), ('obj', '1515738')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID'), ('obj', '340799')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID'), ('obj', '42794')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID'), ('obj', 'mv48683')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID'), ('obj', '8066')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID'), ('obj', '273969')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID'), ('obj', '474953')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID'), ('obj', '823624')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID'), ('obj', 'movies/sherlock-holmes-a-game-of-shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID'), ('obj', '10.5240/1961-CD47-6DCA-E02D-6CE4-R')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget'), ('obj', '125000000')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID'), ('obj', '240117')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID'), ('obj', '538633')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID'), ('obj', '713185')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3135'), ('name', 'elCinema film ID'), ('obj', '2005594')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID'), ('obj', '219852')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID'), ('obj', 't0027210')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID'), ('obj', '1296147')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3145'), ('name', 'Sratim ID'), ('obj', 'tt185235')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID'), ('obj', '115296')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN'), ('obj', '0000-0003-01B3-0000-O-0000-0000-2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID'), ('obj', '29634')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID'), ('obj', 'Sherlock-Holmes-A-Game-of-Shadows-2011-movie')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID'), ('obj', 'tt1515091')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID'), ('obj', '68328')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category'), ('obj', 'Sherlock Holmes: A Game of Shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)'), ('obj', '339025')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID'), ('obj', 'Sherlock-Holmes-A-Game-of-Shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID'), ('obj', '20983')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID'), ('obj', '4434679')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID'), ('obj', '4051753')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID'), ('obj', '2943')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID'), ('obj', '559386')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID'), ('obj', '937637')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID'), ('obj', '58574')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID'), ('obj', '556864')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID'), ('obj', 'film1/sherlockholmes2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date'), ('obj', '2011-12-16T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID'), ('obj', 'sherlock-holmes-2-spiel-im-schatten')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID'), ('obj', '4025-1383')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID'), ('obj', 'sherlock-holmes-a-game-of-shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID'), ('obj', '503347581')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('obj', '/m/0dlngsd')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID'), ('obj', '0hC1b9z8ZLk')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier'), ('obj', 'Film/SherlockHolmesAGameOfShadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID'), ('obj', '1MV196d11458861f1b8784da719840ccf1d')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID'), ('obj', '118838')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID'), ('obj', 'umc.cmc.oc1sz4hgm2t8x8un84c6htey')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID'), ('obj', '5673')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5990'), ('name', 'Movies Anywhere ID'), ('obj', 'sherlock-holmes-a-game-of-shadows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6133'), ('name', 'Siamzone film ID'), ('obj', '6269')]\n",
      "63\n"
     ]
    }
   ],
   "source": [
    "# All literals of properties of Sherlock Holmes: A Game of Shadows. \n",
    "# Only here I realize using \"sc:name\" automatically filters out all literals, because they don't have a label\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q243643 ?p ?obj.\n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   FILTER(isLiteral(?obj))\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "a942fe15-b3ff-47a7-b9d7-f9b5bcf0b8c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('Year', '2013')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('Year', '2014')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('Year', '2009')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('Year', '2010')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows'), ('Year', '2011')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# publication years of films and tv series derivative from the \"canon of Sherlock Holmes\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (year(?obj) as ?Year)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P577 ?obj.\n",
    "                   \n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e170e87f-d219-4532-94da-a47f4f49d291",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('Year', '2009')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('Year', '2013')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows'), ('Year', '2011')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# publication year of films and tv series derivative from the \"canon of Sherlock Holmes\"\n",
    "# retrieving only the most recent year\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (MIN(year(?obj)) as ?Year)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P577 ?obj.\n",
    "                   \n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "1d4d724f-5067-418c-87cd-39c6517f7817",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('video', 'http://www.wikidata.org/entity/Q200396'), ('videoName', 'Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q247643'), ('videoName', 'Elementary'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q387306'), ('videoName', 'Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q192837'), ('videoName', 'Sherlock'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q243643'), ('videoName', 'Sherlock Holmes: A Game of Shadows'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q4523158'), ('videoName', 'Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q604180'), ('videoName', 'The Private Life of Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P941'), ('pName', 'inspired by')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# Up to know I used \"derivative Work\" to get related works. I see if there are films or tv series with edges\n",
    "# incoming to the \"canon of Sherlock Holmes\".\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?video ?videoName ?p ?pName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?video ?p wd:Q2316684.\n",
    "   ?video wdt:P31 ?type.\n",
    "                   \n",
    "    ?p sc:name ?pName.\n",
    "    ?video sc:name ?videoName. \n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "472fb6c6-9036-4fd8-b253-b5755ffb40a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('video', 'http://www.wikidata.org/entity/Q200396'), ('videoName', 'Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on'), ('Year', '2009')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q604180'), ('videoName', 'The Private Life of Sherlock Holmes'), ('p', 'http://www.wikidata.org/prop/direct/P941'), ('pName', 'inspired by'), ('Year', '1970')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q247643'), ('videoName', 'Elementary'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on'), ('Year', '2013')]\n",
      "[('video', 'http://www.wikidata.org/entity/Q243643'), ('videoName', 'Sherlock Holmes: A Game of Shadows'), ('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on'), ('Year', '2011')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# Up to know I used \"derivative Work\" to get related works. I see if there are films or tv series with edges\n",
    "# incoming to the \"canon of Sherlock Holmes\" and their release year.\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?video ?videoName ?p ?pName (MIN(year(?publicationDate)) as ?Year)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?video ?p wd:Q2316684.\n",
    "   ?video wdt:P31 ?type;\n",
    "          wdt:P577 ?publicationDate.\n",
    "                   \n",
    "    ?p sc:name ?pName.\n",
    "    ?video sc:name ?videoName. \n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b6cc468d-d0e1-43f1-967f-7768bc4b5497",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q604180'), ('relatedWorkName', 'The Private Life of Sherlock Holmes'), ('Year', '1970')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q200396'), ('relatedWorkName', 'Sherlock Holmes'), ('Year', '2009')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q247643'), ('relatedWorkName', 'Elementary'), ('Year', '2013')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q243643'), ('relatedWorkName', 'Sherlock Holmes: A Game of Shadows'), ('Year', '2011')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# publication year of films and tv series related to the \"canon of Sherlock Holmes\"\n",
    "# retrieving only the most recent year\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?derivativeWork as ?relatedWork) (?derivativeWorkName as ?relatedWorkName) (MIN(year(?obj)) as ?Year)\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P577 ?obj.\n",
    "                   \n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}}\n",
    "   UNION{\n",
    "      # bind something\n",
    "   ?derivativeWork ?p wd:Q2316684.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "          wdt:P577 ?obj.\n",
    "                   \n",
    "     ?derivativeWork sc:name ?derivativeWorkName. \n",
    "\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e6888f9-fcb0-41ec-b1fd-0ee2cc5920cb",
   "metadata": {},
   "source": [
    ">Results in the format \"Related Work IRI\" - \"Related Work Label\" - \"Year of publication\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61fbfc5b",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find who acted in more than one film or tv series related to the canon of Sherlock Holmes (the result set must be a list of triples actor/actress IRI, label and #film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c9dd7e7a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q1102002'), ('castMemberName', 'Clive Russell'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q190386'), ('castMemberName', 'Rachel McAdams'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q45647'), ('castMemberName', 'Eddie Marsan'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q440926'), ('castMemberName', 'Geraldine James'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q165219'), ('castMemberName', 'Robert Downey Jr.'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q160432'), ('castMemberName', 'Jude Law'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q236167'), ('castMemberName', 'Kelly Reilly'), ('film', '2')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# Cast member (wdt:P161) found with CTRL+F in the notebook. \n",
    "# results seems to have only actors of the two major latest movies (the ones with Jude Law)..\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castMember ?castMemberName (COUNT(DISTINCT ?derivativeWork) as ?film)\n",
    "WHERE { \n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P161 ?castMember.\n",
    "   \n",
    "   # get the label\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   ?castMember sc:name ?castMemberName.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   \n",
    "}\n",
    "GROUP BY ?castMember ?castMemberName \n",
    "HAVING (COUNT( DISTINCT ?derivativeWork) > 1)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6d28af99-b52a-498f-8c05-88d2f0f7bdc1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P136'), ('edgeName', 'genre')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1411'), ('edgeName', 'nominated for')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P144'), ('edgeName', 'based on')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P154'), ('edgeName', 'logo image')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P162'), ('edgeName', 'producer')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P166'), ('edgeName', 'award received')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P170'), ('edgeName', 'creator')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P18'), ('edgeName', 'image')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1811'), ('edgeName', 'list of episodes')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1881'), ('edgeName', 'list of characters')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1889'), ('edgeName', 'different from')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P2061'), ('edgeName', 'aspect ratio')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P272'), ('edgeName', 'production company')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P31'), ('edgeName', 'instance of')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P364'), ('edgeName', 'original language of film or TV show')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P437'), ('edgeName', 'distribution format')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P449'), ('edgeName', 'original broadcaster')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P495'), ('edgeName', 'country of origin')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P57'), ('edgeName', 'director')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P750'), ('edgeName', 'distributed by')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P840'), ('edgeName', 'narrative location')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P8411'), ('edgeName', 'set in environment')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P856'), ('edgeName', 'official website')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P86'), ('edgeName', 'composer')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P910'), ('edgeName', \"topic's main category\")]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P915'), ('edgeName', 'filming location')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P941'), ('edgeName', 'inspired by')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P973'), ('edgeName', 'described at URL')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1877'), ('edgeName', 'after a work by')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P4312'), ('edgeName', 'camera setup')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P7501'), ('edgeName', 'audio system')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1441'), ('edgeName', 'present in work')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P301'), ('edgeName', \"category's main topic\")]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P4969'), ('edgeName', 'derivative work')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P800'), ('edgeName', 'notable work')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P971'), ('edgeName', 'category combines topics')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1855'), ('edgeName', 'Wikidata property example')]\n",
      "41\n"
     ]
    }
   ],
   "source": [
    "# looking if there are other ways to retrieve cast members, starting from \"Sherlock\" (wd:Q192837)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?edge ?edgeName \n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q192837 ?edge ?object.\n",
    "   # get the label\n",
    "   ?edge sc:name ?edgeName.\n",
    "   \n",
    "   FILTER (!isLiteral(?object))\n",
    "   }UNION{\n",
    "   ?subject ?edge wd:Q192837.\n",
    "   ?edge sc:name ?edgeName\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "4582c309-74dc-455b-9599-7ec51a41e5e5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q560286'), ('iriName', 'Mark Gatiss')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q472216'), ('iriName', 'Rupert Graves')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q309486'), ('iriName', 'Martin Freeman')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q1319582'), ('iriName', 'Una Stubbs')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q507322'), ('iriName', 'Andrew Scott')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q244674'), ('iriName', 'Benedict Cumberbatch')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q453740'), ('iriName', 'Amanda Abbington')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q2035905'), ('iriName', 'Zoe Telford')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q6272441'), ('iriName', 'Jonathan Aris')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q102893869'), ('iriName', 'Janice Acquah')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q1057334'), ('iriName', 'Louise Brealey')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q263691'), ('iriName', 'Lara Pulver')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q2947988'), ('iriName', 'Vinette Robinson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1881'), ('edgeName', 'list of characters'), ('iri', 'http://www.wikidata.org/entity/Q6596867'), ('iriName', 'list of Sherlock characters')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28101242'), ('iriName', 'The Six Thatchers')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28128648'), ('iriName', 'The Final Problem')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827477'), ('iriName', 'Sherlock, season 4')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28128111'), ('iriName', 'The Lying Detective')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1346200'), ('iriName', 'The Reichenbach Fall')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q194727'), ('iriName', 'A Scandal in Belgravia')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q3231484'), ('iriName', 'The Hounds of Baskerville')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827366'), ('iriName', 'Sherlock, season 2')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1067723'), ('iriName', 'Inspector Lestrade')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q187349'), ('iriName', 'Dr. John Watson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q2118360'), ('iriName', 'A Study in Pink')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q4653'), ('iriName', 'Sherlock Holmes')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q283111'), ('iriName', 'Professor Moriarty')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q2731317'), ('iriName', 'Mary Morstan')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q2456753'), ('iriName', 'Mrs. Hudson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1779558'), ('iriName', 'Irene Adler')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1308120'), ('iriName', 'The Great Game')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15428438'), ('iriName', 'Many Happy Returns')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15516580'), ('iriName', 'The Empty Hearse')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15581476'), ('iriName', 'The Sign of Three')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15581505'), ('iriName', 'His Last Vow')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1616457'), ('iriName', 'Mycroft Holmes')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1632666'), ('iriName', 'The Blind Banker')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q16674972'), ('iriName', 'Sherlock, season 1')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q21931680'), ('iriName', 'The Abominable Bride')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827406'), ('iriName', 'Sherlock, season 3')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q28101242'), ('iriName', 'The Six Thatchers')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q28128648'), ('iriName', 'The Final Problem')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q55827477'), ('iriName', 'Sherlock, season 4')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q28128111'), ('iriName', 'The Lying Detective')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q1346200'), ('iriName', 'The Reichenbach Fall')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q194727'), ('iriName', 'A Scandal in Belgravia')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q3231484'), ('iriName', 'The Hounds of Baskerville')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q55827366'), ('iriName', 'Sherlock, season 2')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q2118360'), ('iriName', 'A Study in Pink')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q1308120'), ('iriName', 'The Great Game')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q15428438'), ('iriName', 'Many Happy Returns')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q15516580'), ('iriName', 'The Empty Hearse')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q15581476'), ('iriName', 'The Sign of Three')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q15581505'), ('iriName', 'His Last Vow')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q1632666'), ('iriName', 'The Blind Banker')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q16674972'), ('iriName', 'Sherlock, season 1')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q21931680'), ('iriName', 'The Abominable Bride')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P179'), ('edgeName', 'part of the series'), ('iri', 'http://www.wikidata.org/entity/Q55827406'), ('iriName', 'Sherlock, season 3')]\n",
      "58\n"
     ]
    }
   ],
   "source": [
    "# looking if there are other ways to retrieve cast members, starting from \"Sherlock\"(wd:Q192837),\n",
    "# printing subjects and objects with some specific predicates\n",
    "# after reading the results it seems that actors are only retrieved with \"cast mamber\" (wdt:P161)\n",
    "\n",
    "# This is an inefficient query, because is checking the same edges to be either outgoing or incoming. \n",
    "# To make it more efficient I would need use the appropriate VALUES for incoming/outgoing edges \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?edge ?edgeName ?iri ?iriName\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q192837 ?edge ?iri.\n",
    "   # get the label\n",
    "   ?edge sc:name ?edgeName.\n",
    "   ?iri sc:name ?iriName.\n",
    "   VALUES ?edge {wdt:P161 wdt:P1881 wdt:P674 wdt:P179 wdt:P527}\n",
    "   #FILTER (!isLiteral(?object))\n",
    "   }UNION{\n",
    "   ?iri ?edge wd:Q192837.\n",
    "   ?edge sc:name ?edgeName.\n",
    "   ?iri sc:name ?iriName.\n",
    "   VALUES ?edge {wdt:P161 wdt:P1881 wdt:P674 wdt:P179 wdt:P527}\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5585d7ed-789f-4c64-b123-9a0a6ea7e03a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P136'), ('outgoingEdgeName', 'genre')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P1411'), ('outgoingEdgeName', 'nominated for')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P144'), ('outgoingEdgeName', 'based on')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P154'), ('outgoingEdgeName', 'logo image')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P161'), ('outgoingEdgeName', 'cast member')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P162'), ('outgoingEdgeName', 'producer')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P166'), ('outgoingEdgeName', 'award received')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P170'), ('outgoingEdgeName', 'creator')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P18'), ('outgoingEdgeName', 'image')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P1811'), ('outgoingEdgeName', 'list of episodes')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P1881'), ('outgoingEdgeName', 'list of characters')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P1889'), ('outgoingEdgeName', 'different from')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P2061'), ('outgoingEdgeName', 'aspect ratio')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P272'), ('outgoingEdgeName', 'production company')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P31'), ('outgoingEdgeName', 'instance of')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P364'), ('outgoingEdgeName', 'original language of film or TV show')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P437'), ('outgoingEdgeName', 'distribution format')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P449'), ('outgoingEdgeName', 'original broadcaster')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P495'), ('outgoingEdgeName', 'country of origin')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P527'), ('outgoingEdgeName', 'has part')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P57'), ('outgoingEdgeName', 'director')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P674'), ('outgoingEdgeName', 'characters')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P750'), ('outgoingEdgeName', 'distributed by')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P840'), ('outgoingEdgeName', 'narrative location')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P8411'), ('outgoingEdgeName', 'set in environment')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P856'), ('outgoingEdgeName', 'official website')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P86'), ('outgoingEdgeName', 'composer')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P910'), ('outgoingEdgeName', \"topic's main category\")]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P915'), ('outgoingEdgeName', 'filming location')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P941'), ('outgoingEdgeName', 'inspired by')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P973'), ('outgoingEdgeName', 'described at URL')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P1877'), ('outgoingEdgeName', 'after a work by')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P4312'), ('outgoingEdgeName', 'camera setup')]\n",
      "[('outgoingEdge', 'http://www.wikidata.org/prop/direct/P7501'), ('outgoingEdgeName', 'audio system')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P1441'), ('incomingEdgeName', 'present in work')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P179'), ('incomingEdgeName', 'part of the series')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P301'), ('incomingEdgeName', \"category's main topic\")]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P4969'), ('incomingEdgeName', 'derivative work')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P800'), ('incomingEdgeName', 'notable work')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P971'), ('incomingEdgeName', 'category combines topics')]\n",
      "[('incomingEdge', 'http://www.wikidata.org/prop/direct/P1855'), ('incomingEdgeName', 'Wikidata property example')]\n",
      "41\n"
     ]
    }
   ],
   "source": [
    "# Same as before but trying to distinguish between incoming/outgoing edges.\n",
    "# It's longer to write\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?incomingEdge ?incomingEdgeName ?outgoingEdge ?outgoingEdgeName\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q192837 ?outgoingEdge?object.\n",
    "   # get the label\n",
    "   ?outgoingEdge sc:name ?outgoingEdgeName.\n",
    "   \n",
    "   FILTER (!isLiteral(?object)) # I don't really need this\n",
    "   }UNION{\n",
    "   ?subject ?incomingEdge wd:Q192837.\n",
    "   ?incomingEdge sc:name ?incomingEdgeName\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "74b9fdf6-9f78-448d-ad89-3aebdf8d9fd3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28101242'), ('iriName', 'The Six Thatchers')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28128648'), ('iriName', 'The Final Problem')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827477'), ('iriName', 'Sherlock, season 4')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q28128111'), ('iriName', 'The Lying Detective')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q560286'), ('iriName', 'Mark Gatiss')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q472216'), ('iriName', 'Rupert Graves')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1346200'), ('iriName', 'The Reichenbach Fall')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q194727'), ('iriName', 'A Scandal in Belgravia')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q3231484'), ('iriName', 'The Hounds of Baskerville')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827366'), ('iriName', 'Sherlock, season 2')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q309486'), ('iriName', 'Martin Freeman')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1067723'), ('iriName', 'Inspector Lestrade')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q1319582'), ('iriName', 'Una Stubbs')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q187349'), ('iriName', 'Dr. John Watson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q2118360'), ('iriName', 'A Study in Pink')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q4653'), ('iriName', 'Sherlock Holmes')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q283111'), ('iriName', 'Professor Moriarty')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q507322'), ('iriName', 'Andrew Scott')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q244674'), ('iriName', 'Benedict Cumberbatch')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q2731317'), ('iriName', 'Mary Morstan')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q453740'), ('iriName', 'Amanda Abbington')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q2035905'), ('iriName', 'Zoe Telford')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q6272441'), ('iriName', 'Jonathan Aris')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q2456753'), ('iriName', 'Mrs. Hudson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1779558'), ('iriName', 'Irene Adler')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q102893869'), ('iriName', 'Janice Acquah')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q1057334'), ('iriName', 'Louise Brealey')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1308120'), ('iriName', 'The Great Game')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15428438'), ('iriName', 'Many Happy Returns')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15516580'), ('iriName', 'The Empty Hearse')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15581476'), ('iriName', 'The Sign of Three')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q15581505'), ('iriName', 'His Last Vow')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P674'), ('edgeName', 'characters'), ('iri', 'http://www.wikidata.org/entity/Q1616457'), ('iriName', 'Mycroft Holmes')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q1632666'), ('iriName', 'The Blind Banker')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q16674972'), ('iriName', 'Sherlock, season 1')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q21931680'), ('iriName', 'The Abominable Bride')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q263691'), ('iriName', 'Lara Pulver')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P161'), ('edgeName', 'cast member'), ('iri', 'http://www.wikidata.org/entity/Q2947988'), ('iriName', 'Vinette Robinson')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P527'), ('edgeName', 'has part'), ('iri', 'http://www.wikidata.org/entity/Q55827406'), ('iriName', 'Sherlock, season 3')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P1881'), ('edgeName', 'list of characters'), ('iri', 'http://www.wikidata.org/entity/Q6596867'), ('iriName', 'list of Sherlock characters')]\n",
      "40\n"
     ]
    }
   ],
   "source": [
    "# looking if there are other ways to retrieve cast members, starting from \"Sherlock\"(wd:Q192837),\n",
    "# printing subjects and objects with some specific predicates\n",
    "# after reading the results it seems that actors are only retrieved with \"cast mamber\" (wdt:P161)\n",
    "\n",
    "# Same as before, but differentiating between incoming/outgoing edges\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?edge ?edgeName ?iri ?iriName\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q192837 ?edge ?iri.\n",
    "   # get the label\n",
    "   ?edge sc:name ?edgeName.\n",
    "   ?iri sc:name ?iriName.\n",
    "   VALUES ?edge {wdt:P161 wdt:P1881 wdt:P674 wdt:P527}\n",
    "   #FILTER (!isLiteral(?object))\n",
    "   }UNION{\n",
    "   ?iri ?edge wd:Q192837.\n",
    "   ?edge sc:name ?edgeName.\n",
    "   ?iri sc:name ?iriName.\n",
    "   VALUES ?edge {wdt:P527}\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "46d17d30-c42a-4a8d-aa74-2d147d053f7b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q1102002'), ('castMemberName', 'Clive Russell'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q190386'), ('castMemberName', 'Rachel McAdams'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q45647'), ('castMemberName', 'Eddie Marsan'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q440926'), ('castMemberName', 'Geraldine James'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q165219'), ('castMemberName', 'Robert Downey Jr.'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q160432'), ('castMemberName', 'Jude Law'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q236167'), ('castMemberName', 'Kelly Reilly'), ('film', '2')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# Including all derivative works, not only tv series and films. But, same result as before. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castMember ?castMemberName (COUNT(DISTINCT ?derivativeWork) as ?film)\n",
    "WHERE { \n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P161 ?castMember.\n",
    "   \n",
    "   # get the label\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   ?castMember sc:name ?castMemberName.\n",
    "   #VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   \n",
    "}\n",
    "GROUP BY ?castMember ?castMemberName \n",
    "HAVING (COUNT( DISTINCT ?derivativeWork) > 1)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "f9801a2b-e9de-44ab-bbb6-c4a25e108e60",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q1102002'), ('castMemberName', 'Clive Russell'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q190386'), ('castMemberName', 'Rachel McAdams'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q45647'), ('castMemberName', 'Eddie Marsan'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q440926'), ('castMemberName', 'Geraldine James'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q165219'), ('castMemberName', 'Robert Downey Jr.'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q160432'), ('castMemberName', 'Jude Law'), ('film', '2')]\n",
      "[('castMember', 'http://www.wikidata.org/entity/Q236167'), ('castMemberName', 'Kelly Reilly'), ('film', '2')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# Same as the first query for this task but considering also films or tv series with edges\n",
    "# incoming to the \"canon of Sherlock Holmes\".\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castMember ?castMemberName (COUNT(DISTINCT ?derivativeWork) as ?film)\n",
    "WHERE { {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P161 ?castMember.\n",
    "   \n",
    "   # get the label\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   ?castMember sc:name ?castMemberName.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}}\n",
    "   UNION {\n",
    "      # bind something\n",
    "   ?derivativeWork ?p wd:Q2316684.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "          wdt:P161 ?castMember.\n",
    "                   \n",
    "     # get the label\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   ?castMember sc:name ?castMemberName.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   }\n",
    "   \n",
    "   }\n",
    "   \n",
    "\n",
    "GROUP BY ?castMember ?castMemberName \n",
    "HAVING (COUNT( DISTINCT ?derivativeWork) > 1)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49372c83-405e-44f4-a3e8-eec40859532c",
   "metadata": {},
   "source": [
    ">Results are in the format \"Actor IRI\" - \"Actor Label\" - \"Number of films\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b5a1a21",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Identify the BGP for Primetime Emmy Award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "51382e75",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q838121'), ('name', 'Peabody Awards')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7243506'), ('name', 'Primetime Emmy Award for Outstanding Made for Television Movie')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q945887'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q989453'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17986500'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Miniseries or Movie')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2925700'), ('name', 'British Academy Television Award for Best Supporting Actor')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7243513'), ('name', 'Primetime Emmy Award for Outstanding Special Visual Effects')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18154853'), ('name', 'Teen Choice Award for Choice TV Actress Action')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7669617'), ('name', 'TCA Award for Outstanding Achievement in Movies, Miniseries and Specials')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2925698'), ('name', 'British Academy Television Award for Best Drama Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3403230'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Miniseries, Movie or a Dramatic Special')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17009259'), ('name', 'Primetime Emmy Award for Outstanding Music Composition for a Miniseries, Movie, or a Special')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q24887148'), ('name', 'Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Limited Series or Movie')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3002947'), ('name', \"Critics' Choice Television Award for Best Movie/Miniseries\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16254850'), ('name', 'Primetime Emmy Award for Outstanding Sound Editing for a Limited or Anthology Series, Movie or Special')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3002953'), ('name', \"Critics' Choice Television Award for Best Movie/Miniseries Actor\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7426020'), ('name', 'Satellite Award for Best Miniseries')]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "# From Wikipedia: \"presented in recognition of excellence in American primetime television programming\".\n",
    "# with CTRL+F found \"award received\" (wdt:P166) in this notebook. (I was looking for \"award\", substring of the requested BGP)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type;\n",
    "                   wdt:P166 ?obj.\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "d4bdca4b-85ec-48ce-b1c2-a37348442f1a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q30'), ('iriName', 'United States of America')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1044427'), ('iriName', 'Primetime Emmy Award')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q38033430'), ('iriName', 'class of award')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q558112'), ('iriName', 'Black Mirror')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q229305'), ('iriName', 'Joan Allen')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1159206'), ('iriName', 'Dana Brunetti')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1033016'), ('iriName', 'Halle Berry')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q300341'), ('iriName', 'A Bright Shining Lie')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q560286'), ('iriName', 'Mark Gatiss')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q3133366'), ('iriName', 'Sue Vertue')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q764812'), ('iriName', 'August Wilson')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q315808'), ('iriName', 'Neil Simon')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11339660'), ('iriName', 'Michael Hausman')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q41422'), ('iriName', 'Mark Ruffalo')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q186485'), ('iriName', 'Billy Crystal')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q193048'), ('iriName', 'Laurence Fishburne')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q192837'), ('iriName', 'Sherlock')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q461003'), ('iriName', 'Steven Moffat')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q5084984'), ('iriName', 'Charlie Hanson')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q19880918'), ('iriName', 'Meg LeFauve')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1110157'), ('iriName', 'James Manos, Jr.')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q60178661'), ('iriName', 'Black Mirror: Bandersnatch')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q32235'), ('iriName', 'Stalin')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1093438'), ('iriName', 'Citizen X')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1093425'), ('iriName', 'RKO 281')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# IRIs connected with Primetime Emmy Award for Outstanding Made for Television Movie\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?iri ?iriName \n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q7243506 ?edge ?iri.\n",
    "   # get the label\n",
    "   ?iri sc:name ?iriName.\n",
    "   }UNION{\n",
    "   ?iri ?edge wd:Q7243506.\n",
    "   ?iri sc:name ?iriName\n",
    "   }\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c81015d1-e2ad-4f4f-92e2-2ce1021426ba",
   "metadata": {},
   "source": [
    ">The node we are interested in is wd:Q1044427 with label \"Primetime Emmy Award\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "942f438d",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Return all the types of Primetime Emmy Award (the result set must be a list of couples award IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "820f304d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P17'), ('edgeName', 'country'), ('iri', 'http://www.wikidata.org/entity/Q30'), ('iriName', 'United States of America')]\n",
      "[('edge', 'http://www.wikidata.org/prop/direct/P31'), ('edgeName', 'instance of'), ('iri', 'http://www.wikidata.org/entity/Q1044427'), ('iriName', 'Primetime Emmy Award')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Retrieving predicates between Primetime Emmy Award for Outstanding Made for Television Movie \n",
    "# and Primetime Emmy Award -> \"instance of\" (wdt:P31)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?edge ?edgeName ?iri ?iriName \n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q7243506 ?edge ?iri.\n",
    "   # get the label\n",
    "   ?iri sc:name ?iriName.\n",
    "   ?edge sc:name ?edgeName.\n",
    "\n",
    "   }UNION{\n",
    "   ?iri ?edge wd:Q7243506.\n",
    "   ?iri sc:name ?iriName.\n",
    "   ?edge sc:name ?edgeName.\n",
    "   }\n",
    "}\n",
    "LIMIT 2\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "605b0ebf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q18153303'), ('name', 'Primetime Emmy Award for Outstanding Unstructured Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445729'), ('name', 'Primetime Emmy Award for Outstanding Actress in a Short Form Comedy or Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989439'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2604800'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243506'), ('name', 'Primetime Emmy Award for Outstanding Made for Television Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1277961'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3123491'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20714679'), ('name', 'Primetime Emmy Award for Outstanding Limited Miniseries')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17048589'), ('name', 'Primetime Emmy Award for Outstanding Narrator')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989447'), ('name', 'Primetime Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285970'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q530923'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989442'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243507'), ('name', 'Primetime Emmy Award for Outstanding Original Main Title Theme Music')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285504'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2981152'), ('name', 'Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q583972'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q945887'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989453'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1286639'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q337926'), ('name', 'Primetime Emmy Award for Outstanding Animated Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17986500'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Miniseries or Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3045762'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3062632'), ('name', 'Primetime Emmy Award for Outstanding Guest Actress in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3403229'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Limited Series, Movie, or Dramatic Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989445'), ('name', 'Primetime Emmy Award for Outstanding Lead Actress in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989449'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1287335'), ('name', 'Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3131545'), ('name', 'Primetime Emmy Award for Outstanding Voice-Over Performance')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243513'), ('name', 'Primetime Emmy Award for Outstanding Special Visual Effects')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989438'), ('name', 'Primetime Emmy Award for Outstanding Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989450'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243500'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a One Hour Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q25831324'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Variety Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243497'), ('name', 'Primetime Emmy Award for Outstanding Casting for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243502'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Single-Camera Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243504'), ('name', 'Primetime Emmy Award for Outstanding Costumes for a Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243505'), ('name', 'Primetime Emmy Award for Outstanding Main Title Design')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243511'), ('name', 'Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4354969'), ('name', 'Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3403230'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Miniseries, Movie or a Dramatic Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243508'), ('name', 'Primetime Emmy Award for Outstanding Music Composition for a Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q30632982'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Nonfiction Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445759'), ('name', 'Primetime Emmy Award for Outstanding Short Form Comedy or Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17009259'), ('name', 'Primetime Emmy Award for Outstanding Music Composition for a Miniseries, Movie, or a Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17985610'), ('name', 'Primetime Emmy Award for Outstanding Art Direction for a Period Series, Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q24902182'), ('name', 'Primetime Emmy Award for Outstanding Sound Mixing for a Limited Series or Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q16254850'), ('name', 'Primetime Emmy Award for Outstanding Sound Editing for a Limited or Anthology Series, Movie or Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q50506251'), ('name', 'Primetime Emmy Award for Outstanding Directorial Achievement in Variety or Music')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17092538'), ('name', 'Primetime Emmy Award for Outstanding Stunt Coordination')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243516'), ('name', 'Primetime Emmy Award for Outstanding Variety, Music, or Comedy Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243499'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Half-Hour Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243514'), ('name', 'Primetime Emmy Award for Outstanding Reality-Competition Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q25021464'), ('name', 'Primetime Emmy Award for Outstanding Variety Talk Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20858220'), ('name', 'Primetime Emmy Award for Program of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2110156'), ('name', 'Primetime Emmy Award for Outstanding Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q16254853'), ('name', 'Primetime Emmy Award for Outstanding Sound Editing for a Comedy or Drama Series (One-Hour)')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q13423511'), ('name', 'Primetime Emmy Award for Outstanding Miniseries or Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17010296'), ('name', 'Primetime Emmy Award for Outstanding Character Voice-Over Performance')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243495'), ('name', 'Primetime Emmy Award for Outstanding Casting for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243496'), ('name', 'Primetime Emmy Award for Outstanding Casting for a Miniseries, Movie, or a Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243503'), ('name', 'Primetime Emmy Award for Outstanding Costumes for a Miniseries, Movie or a Special')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445727'), ('name', 'Primetime Emmy Award for Outstanding Actor in a Short Form Comedy or Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243517'), ('name', 'Primetime Emmy Award for Outstanding Variety, Music or Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243498'), ('name', 'Primetime Emmy Award for Outstanding Choreography')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q30644355'), ('name', 'Primetime Emmy Award for Outstanding Interactive Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243510'), ('name', 'Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17010286'), ('name', 'Primetime Emmy Award for Outstanding Art Direction for a Multi-Camera Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445917'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q89817598'), ('name', 'Outstanding Cinematography for Nonfiction Programming (Single or Multi-Camera)')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17010308'), ('name', \"Primetime Emmy Award for Outstanding Children's Program\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243501'), ('name', 'Primetime Emmy Award for Outstanding Cinematography for a Multi-Camera Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q18153296'), ('name', 'Primetime Emmy Award for Outstanding Short-Format Live-Action Entertainment Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q16987659'), ('name', 'Primetime Emmy Award for Short-format Animation')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243492'), ('name', 'Primetime Emmy Award for Actress of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243493'), ('name', 'Primetime Emmy Award for Actor of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q55630471'), ('name', 'Primetime Emmy Award for Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) and Animation')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q27159818'), ('name', 'Primetime Emmy Award for Best Producer for a Film Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243512'), ('name', 'Primetime Emmy Award for Outstanding Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17985608'), ('name', 'Primetime Emmy Award for Outstanding Art Direction for a Contemporary or Fantasy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17985609'), ('name', 'Primetime Emmy Award for Outstanding Art Direction for a Contemporary Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q19880988'), ('name', 'Primetime Emmy Award for Outstanding New Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q18153300'), ('name', 'Primetime Emmy Award for Outstanding Structured Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q98839622'), ('name', 'Primetime Emmy Award')]\n",
      "84\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# All instances of Primetime Emmy Award\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q1044427.\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b8d0cb6d-a8f0-4497-b751-75f90c726f65",
   "metadata": {},
   "source": [
    "> Each row is a type of Primetime Emmy Award in the format \"Award IRI\" - \"Award Label\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ca99009",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "For each film and television series related to the canon of Sherlock Holmes, return the number of Primetime Emmy Awards they won (return also the objects who did not win an Award) (the result set must be a list of triples film/tv series IRI, label and #award)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "30dc876e-f74d-473d-95d4-e0913505195d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q192837'), ('derivativeWorkName', 'Sherlock'), ('award', '8')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q4523158'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q387306'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows'), ('award', '0')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# Number of awards per derivative work \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (COUNT(DISTINCT ?premio) as ?award)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   \n",
    "   OPTIONAL{\n",
    "       ?derivativeWork wdt:P166 ?premio.\n",
    "       ?premio wdt:P31  wd:Q1044427.\n",
    "       }\n",
    "       \n",
    "    # get the label\n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "    \n",
    "   \n",
    "}\n",
    "GROUP BY  ?derivativeWork ?derivativeWorkName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "225d5fe4-4c1f-49ec-8173-69085aa798d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q4523158'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q1764019'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q1210893'), ('derivativeWorkName', 'The Adventures of Sherlock Holmes and Dr. Watson'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q192837'), ('derivativeWorkName', 'Sherlock'), ('award', '8')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q387306'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# Including all derivative works, not only tv series and films. But, same result as before. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (COUNT( DISTINCT ?premio) as ?award)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   \n",
    "   OPTIONAL{\n",
    "   ?derivativeWork wdt:P166 ?premio.\n",
    "   ?premio wdt:P31  wd:Q1044427.\n",
    "   }\n",
    "   # get the label\n",
    "\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "}\n",
    "GROUP BY  ?derivativeWork ?derivativeWorkName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "87815726-f2a4-49d6-81f3-940349f8bb8e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# wrong query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (COUNT( DISTINCT ?premio) as ?award)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?anotherWork wdt:P94 wd:Q2316684. #adding also the works inspired by the canon of Sherlock Holmes\n",
    "   OPTIONAL{\n",
    "   ?anotherWork wdt:P166 ?premio.\n",
    "   ?premio wdt:P31  wd:Q1044427.\n",
    "   }\n",
    "   OPTIONAL{\n",
    "   ?derivativeWork wdt:P166 ?premio.\n",
    "   ?premio wdt:P31  wd:Q1044427.\n",
    "   }\n",
    "   # get the label\n",
    "\n",
    "   ?derivativeWork sc:name ?derivativeWorkName.\n",
    "   ?anotherWork sc:name ?anotherWorkName.\n",
    "}\n",
    "GROUP BY  ?derivativeWork ?derivativeWorkName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "6df17060-7a3d-46bd-9deb-c4659fb01495",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q192837'), ('derivativeWorkName', 'Sherlock'), ('award', '8')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q4523158'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q387306'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q247643'), ('derivativeWorkName', 'Elementary'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q200396'), ('derivativeWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('derivativeWork', 'http://www.wikidata.org/entity/Q243643'), ('derivativeWorkName', 'Sherlock Holmes: A Game of Shadows'), ('award', '0')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# Number of awards per derivative work. Not working because I am using wdt:P94 instead of wdt:P941.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?derivativeWork ?derivativeWorkName (COUNT(DISTINCT ?premio) as ?award)\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   \n",
    "   OPTIONAL{\n",
    "       ?derivativeWork wdt:P166 ?premio.\n",
    "       ?premio wdt:P31  wd:Q1044427.\n",
    "       }\n",
    "       \n",
    "    # get the label\n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "    \n",
    "    }UNION {\n",
    "       # bind something\n",
    "   ?derivativeWork wdt:P94 wd:Q2316684 . #don't know why this does not return \"The Private Life of Sherlock Holmes\"\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "   \n",
    "   OPTIONAL{\n",
    "       ?derivativeWork wdt:P166 ?premio.\n",
    "       ?premio wdt:P31  wd:Q1044427.\n",
    "       }\n",
    "       \n",
    "    # get the label\n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "    }\n",
    "   \n",
    "}\n",
    "GROUP BY  ?derivativeWork ?derivativeWorkName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "67d07991-8658-42fc-9161-244c00e5416f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q604180'), ('relatedWorkName', 'The Private Life of Sherlock Holmes'), ('award', '0')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q192837'), ('relatedWorkName', 'Sherlock'), ('award', '8')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q4523158'), ('relatedWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q387306'), ('relatedWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q247643'), ('relatedWorkName', 'Elementary'), ('award', '0')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q200396'), ('relatedWorkName', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('relatedWork', 'http://www.wikidata.org/entity/Q243643'), ('relatedWorkName', 'Sherlock Holmes: A Game of Shadows'), ('award', '0')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY\n",
    "# Number of awards per related film and television series\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?derivativeWork as ?relatedWork) (?derivativeWorkName as ?relatedWorkName) (COUNT(DISTINCT ?premio) as ?award)\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P4969 ?derivativeWork.\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "       \n",
    "    # get the label\n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "    \n",
    "    }UNION {\n",
    "       # bind something\n",
    "   ?derivativeWork ?p wd:Q2316684 . #Including \"The Private Life of Sherlock Holmes\"\n",
    "   ?derivativeWork wdt:P31 ?type.\n",
    "   VALUES ?type {wd:Q5398426 wd:Q11424}\n",
    "          \n",
    "    # get the label\n",
    "    ?derivativeWork sc:name ?derivativeWorkName.\n",
    "    }\n",
    "     OPTIONAL{\n",
    "       ?derivativeWork wdt:P166 ?premio.\n",
    "       ?premio wdt:P31  wd:Q1044427.\n",
    "       }\n",
    "   \n",
    "}\n",
    "GROUP BY  ?derivativeWork ?derivativeWorkName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe33de59-0d82-49bd-b064-dc126e934abb",
   "metadata": {},
   "source": [
    ">Results in the format \"Related Work IRI\" - \"Related Work Label\" - \"number of awards\""
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
