{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0b71e150",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d3e5a8fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.\n"
     ]
    }
   ],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-90fb9589ee-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "723d17d5",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Cultural Movements explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the cultural movements, in particular the Renaissance, Baroque and Romanticsm. We'd like to get an overview of the main artists belonging to these movements, musicians, poets, sculptors and painters."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3547de9b",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q37562`| Donatello    | node |\n",
    "| `wd:Q19675`| Louvre Museum | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d0335c6a",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q37562 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Donatello**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for Cultural Movement\n",
    "\n",
    "2. Identify the BGP for Renassaince, Baroque and Romanticism\n",
    "\n",
    "3. Identify the BGP for composer, painter, sculptor and poet\n",
    "\n",
    "4. Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)\n",
    "\n",
    "5. Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures).\n",
    "\n",
    "6. For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets).\n",
    "\n",
    "7. Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "502247ff",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for Cultural Movement"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "e5c7922d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1017'), ('name', 'Vatican Library ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1138'), ('name', 'Kunstindeks Danmark Artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1248'), ('name', 'KulturNav-ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1367'), ('name', 'Art UK artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1422'), ('name', 'Sandrart.net person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1472'), ('name', 'Commons Creator page')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1711'), ('name', 'British Museum person or institution ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1871'), ('name', 'CERL Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1882'), ('name', 'Web Gallery of Art ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1986'), ('name', 'Biographical Dictionary of Italian People ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2042'), ('name', 'Artsy artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2252'), ('name', 'National Gallery of Art artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2342'), ('name', 'AGORHA person/institution ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P245'), ('name', 'Union List of Artist Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2538'), ('name', 'Nationalmuseum Sweden actor ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P271'), ('name', 'CiNii author ID (books)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2732'), ('name', 'Persée author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2843'), ('name', 'Benezit ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2949'), ('name', 'WikiTree person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3241'), ('name', 'Catholic Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('name', 'SNAC ARK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3782'), ('name', 'Artnet artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3791'), ('name', 'Art Renewal Center artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3888'), ('name', 'Boijmans artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P396'), ('name', 'SBN author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3987'), ('name', 'SHARE Catalogue author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4145'), ('name', 'Athenaeum person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4223'), ('name', \"Treccani's Enciclopedia Italiana ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4553'), ('name', 'RA Collections ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4808'), ('name', 'Royal Academy new identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4927'), ('name', 'Invaluable.com person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P535'), ('name', 'Find A Grave memorial ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5587'), ('name', 'Libris-URI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5597'), ('name', 'Artcyclopedia artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6002'), ('name', 'WikiArt ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6394'), ('name', 'ELNET ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P650'), ('name', 'RKDartists ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6656'), ('name', 'BHCL ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6706'), ('name', 'De Agostini ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6844'), ('name', 'abART person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7444'), ('name', 'Rijksmuseum Research Library authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7666'), ('name', 'Visuotinė lietuvių enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7699'), ('name', 'National Library of Lithuania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7704'), ('name', 'Europeana entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7711'), ('name', 'Joconde author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "68d121a1-dd09-49ed-b51d-58febb6a0f32",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 wdt:P135 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "  # filter(regex(?name,\"cultural movement\"))\n",
    "  #propertysysubjectkesenikalen\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2918f601",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "7c7ce0cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q11514315'), ('name', 'historical period'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P156')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P361')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1472236 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "deae080c-a6b7-42bb-af9b-e067337fcd6b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13830551'), ('name', 'Portal:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1151')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15885248'), ('name', 'Renaissance painting'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1781608'), ('name', 'Renaissance literature'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041543'), ('name', 'Ottův slovník naučný'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27496'), ('name', 'Western Europe'), ('o', 'http://www.wikidata.org/prop/direct/P276')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque'), ('o', 'http://www.wikidata.org/prop/direct/P156')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5460604'), ('name', 'Wikipedia:Vital articles'), ('o', 'http://www.wikidata.org/prop/direct/P5008')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q236122'), ('name', 'Renaissance architecture'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q32880'), ('name', 'architectural style'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12554'), ('name', 'Middle Ages'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201405'), ('name', 'Renaissance music'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46825'), ('name', 'Gothic art'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133779'), ('name', 'Renaissance art'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q936588'), ('name', 'Renaissance sculpture'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q25111456'), ('name', 'Renaissance studies'), ('o', 'http://www.wikidata.org/prop/direct/P2579')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q978825'), ('name', 'Renaissance dance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10999203'), ('name', 'Template:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1424')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13400700'), ('name', 'Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8651924'), ('name', 'Category:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7112776'), ('name', 'outline of the Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P5125')]\n",
      "28\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'),\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4692 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "ca2c8360-39bf-426f-9fc6-560d6e4f1ca8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P135'), ('name', 'movement'), ('o', 'http://www.wikidata.org/prop/direct/P1687')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q49773'), ('name', 'social movement'), ('o', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3533467'), ('name', 'group action'), ('o', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6638204'), ('name', 'Category:Cultural movement'), ('o', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#final query task 1 BGP OF CULTURAL MOVEMENT.\n",
    "#[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'),\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2198855 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb48c364",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for Renassaince, Baroque and Romanticism"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "8816c97e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5604'), ('name', 'archINFORM keyword ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# FOR RENASSAINCE\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1472236 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "d58d4f3a-7ace-448e-84fd-02c64f169f45",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q11514315'), ('name', 'historical period'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P156')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P361')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1472236 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "97a638ec",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "c7e83b53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13830551'), ('name', 'Portal:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1151')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15885248'), ('name', 'Renaissance painting'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1781608'), ('name', 'Renaissance literature'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041543'), ('name', 'Ottův slovník naučný'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27496'), ('name', 'Western Europe'), ('o', 'http://www.wikidata.org/prop/direct/P276')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque'), ('o', 'http://www.wikidata.org/prop/direct/P156')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5460604'), ('name', 'Wikipedia:Vital articles'), ('o', 'http://www.wikidata.org/prop/direct/P5008')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q236122'), ('name', 'Renaissance architecture'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q32880'), ('name', 'architectural style'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12554'), ('name', 'Middle Ages'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201405'), ('name', 'Renaissance music'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46825'), ('name', 'Gothic art'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133779'), ('name', 'Renaissance art'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q936588'), ('name', 'Renaissance sculpture'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q25111456'), ('name', 'Renaissance studies'), ('o', 'http://www.wikidata.org/prop/direct/P2579')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q978825'), ('name', 'Renaissance dance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10999203'), ('name', 'Template:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1424')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13400700'), ('name', 'Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8651924'), ('name', 'Category:Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7112776'), ('name', 'outline of the Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P5125')]\n",
      "28\n"
     ]
    }
   ],
   "source": [
    "# BGP OF RENAISSANCE\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'),\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4692 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "df64eae9-8c16-4d55-9e13-ed393f8764e5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q172991'), ('name', 'Council of Trent'), ('o', 'http://www.wikidata.org/prop/direct/P737')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11514315'), ('name', 'historical period'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1292119'), ('name', 'style'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131808'), ('name', 'Mannerism'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041543'), ('name', 'Ottův slovník naučný'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2657718'), ('name', 'Armenian Soviet Encyclopedia'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia'), ('o', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q32880'), ('name', 'architectural style'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'), ('o', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1431376'), ('name', 'Baroque literature'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3624106'), ('name', 'Baroque art'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q63442026'), ('name', 'High Baroque'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8810374'), ('name', 'Category:Baroque'), ('o', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# BGP OF BAROQUE\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque'),\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37853 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "540b1370-0e52-4a3c-9326-b99259871c92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q8210150'), ('name', 'Avanzada Regia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q211481'), ('name', 'Dogme 95')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2046861'), ('name', 'Palaeologan Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1400430'), ('name', 'Macedonian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q430167'), ('name', 'Spanish Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1814286'), ('name', 'Young Estonia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2614483'), ('name', 'Pre-romanticism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q39427'), ('name', 'surrealism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2349908'), ('name', 'French Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q878985'), ('name', 'modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q466887'), ('name', 'Belle Époque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12539'), ('name', 'Age of Enlightenment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q265581'), ('name', 'fin de siècle')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q42865'), ('name', 'Orientalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q934618'), ('name', 'Danish Golden Age')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3488076'), ('name', 'La Sape')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3083331'), ('name', 'Andean Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1753636'), ('name', 'Gilded Age')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131808'), ('name', 'Mannerism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q751880'), ('name', 'japonism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q620629'), ('name', 'deism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q744738'), ('name', 'encyclopédistes')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q863679'), ('name', 'chinoiserie')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4745501'), ('name', 'American modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q164800'), ('name', 'Symbolism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5653011'), ('name', 'North Group')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6034'), ('name', 'Dada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q466521'), ('name', 'kinetic art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q374278'), ('name', 'agitprop')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q940595'), ('name', 'Zutiste')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2896922'), ('name', 'Berberism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q846933'), ('name', 'renaissance humanism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q194100'), ('name', 'transhumanism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q9033935'), ('name', 'Brazilian modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2390991'), ('name', 'Gothicismus')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1347824'), ('name', 'La Movida Madrileña')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3424747'), ('name', 'Modern Greek Enlightenment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3482195'), ('name', 'shingeki')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q472670'), ('name', 'Haskalah')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64528910'), ('name', 'The Forge')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3362516'), ('name', 'Afrofuturism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1759189'), ('name', 'mangue bit')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10468834'), ('name', 'White cube gallery')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q89099707'), ('name', 'Özgün müzik')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q478004'), ('name', 'anti-clericalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10936092'), ('name', 'Taisho Roman')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1580216'), ('name', 'Noucentisme')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q160476'), ('name', 'German Expressionism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2639653'), ('name', 'Leonese regionalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64761829'), ('name', 'New Drama')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15991289'), ('name', 'Old School Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16573056'), ('name', 'Guardia Vieja')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3298288'), ('name', 'post-postmodernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133329'), ('name', 'Young Poland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1172762'), ('name', 'Dau al Set')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2907232'), ('name', 'Antropophagia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4920294'), ('name', 'Black Arts Movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q153946'), ('name', 'punk counterculture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6110311'), ('name', 'flamenco rock')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1413061'), ('name', 'tropicália')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7215510'), ('name', 'Ukrainian Russophiles')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2368408'), ('name', 'artistic indianism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q703472'), ('name', 'Renaixença')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16497571'), ('name', 'Brazilian Belle Époque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1745141'), ('name', 'Fantastic Realism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q61693382'), ('name', 'pilantragem')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q852377'), ('name', 'New Culture Movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q63442026'), ('name', 'High Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q899271'), ('name', 'Baroque in Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4922353'), ('name', 'Black is Beautiful')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1431758'), ('name', 'San Francisco Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1520921'), ('name', 'Nahda')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2289148'), ('name', 'The Singing Voice of Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q877637'), ('name', 'Rangaku')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3683985'), ('name', 'combat folk')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q234105'), ('name', 'Lost Generation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5651123'), ('name', 'Hanshinkan Modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q57206373'), ('name', 'Black Aesthetic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1713406'), ('name', 'Young Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q700923'), ('name', 'Vormärz')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3326886'), ('name', 'Ez Dok Amairu')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2037910'), ('name', 'Swinging London')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8059379'), ('name', 'Youthquake')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q74950'), ('name', 'objectivism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q856643'), ('name', 'Trecento')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q105661166'), ('name', 'Tutmania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q254272'), ('name', 'Egyptomania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q700324'), ('name', 'Bunmei Kaika')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1334000'), ('name', 'School of Salamanca')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3307647'), ('name', 'Rexurdimento')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104215395'), ('name', 'Africanfuturism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3953335'), ('name', 'Genoa school')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6025377'), ('name', 'Movimiento indaliano')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3759612'), ('name', 'Generation of 1914')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q695274'), ('name', 'Philhellenism')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#exploring cultural movement fpr romanticism\n",
    "#[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P31 wd:Q2198855 .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "318df208-0ed5-42c3-b3a3-2898ba184457",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID'), ('o', '300021147')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID'), ('o', '11644')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning'), ('o', '687754')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID'), ('o', '0162729')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID'), ('o', '0007955')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID'), ('o', '0083458')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q2041543')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q2657718')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q3181656')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID'), ('o', 'art/Baroque-art-and-architecture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID'), ('o', 'art/Baroque-period')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows'), ('o', 'http://www.wikidata.org/entity/Q131808')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows'), ('o', 'http://www.wikidata.org/entity/Q4692')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image'), ('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/Lazio%20Roma%20SIgnazio%20tango7174.jpg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1807'), ('name', 'Great Aragonese Encyclopedia ID'), ('o', '1993')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID'), ('o', '4004541-9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID'), ('o', '15757')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID'), ('o', 'sh85008345')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID'), ('o', '00008669n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID'), ('o', '11948397n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID'), ('o', '1862794')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q11514315')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q1292119')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q32880')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q968159')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q2198855')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID'), ('o', 'baroque')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3241'), ('name', 'Catholic Encyclopedia ID'), ('o', '02303b')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID'), ('o', 'barocco')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID'), ('o', 'Barroco')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID'), ('o', 'kunst-van-renaissance-tot-1850/barok')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category'), ('o', 'Baroque art')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID'), ('o', 'baroque-art')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID'), ('o', 'baroque-literature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID'), ('o', 'barock')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID'), ('o', 'i117432')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID'), ('o', '18806')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('o', 'http://www.wikidata.org/entity/Q1431376')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('o', 'http://www.wikidata.org/entity/Q3624106')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('o', 'http://www.wikidata.org/entity/Q63442026')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5604'), ('name', 'archINFORM keyword ID'), ('o', '111')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time'), ('o', '1590-01-01T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time'), ('o', '1750-01-01T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID'), ('o', 'divers/wd/25737')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID'), ('o', '136410877')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6404'), ('name', \"Treccani's Dizionario di Storia ID\"), ('o', 'barocco')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6412'), ('name', 'Gran Enciclopèdia de la Música ID'), ('o', '2413')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('o', '/m/0194x')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID'), ('o', 'Barock')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by'), ('o', 'http://www.wikidata.org/entity/Q172991')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7786'), ('name', 'Joconde epoch ID'), ('o', 'T93-913')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID'), ('o', 'Art_baroque')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID'), ('o', 'Barroco')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID'), ('o', '6003')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8135'), ('name', 'Encyclopedia of České Budějovice ID'), ('o', 'baroko')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID'), ('o', '10898')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8406'), ('name', 'Grove Art Online ID'), ('o', 'T006459')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8432'), ('name', 'Österreichisches Musiklexikon Online ID'), ('o', 'B/Barock')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID'), ('o', '65181')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID'), ('o', '15283887-n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID'), ('o', '011182')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8810374')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P920'), ('name', 'LEM ID'), ('o', 'LEM201009649')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID'), ('o', 'XX525325')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio'), ('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/Baroko%20-%20namluven%C3%BD%20%C4%8Dl%C3%A1nek.ogg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9779'), ('name', 'abART term ID'), ('o', '2033')]\n",
      "[('o', '300021140'), ('p1', 'http://www.wikidata.org/prop/direct/P1014'), ('name1', 'Art & Architecture Thesaurus ID')]\n",
      "[('o', '11642'), ('p1', 'http://www.wikidata.org/prop/direct/P1051'), ('name1', 'PSH ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13830551'), ('p1', 'http://www.wikidata.org/prop/direct/P1151'), ('name1', \"topic's main Wikimedia portal\")]\n",
      "[('o', '23T26'), ('p1', 'http://www.wikidata.org/prop/direct/P1256'), ('name1', 'Iconclass notation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2041543'), ('p1', 'http://www.wikidata.org/prop/direct/P1343'), ('name1', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3181656'), ('p1', 'http://www.wikidata.org/prop/direct/P1343'), ('name1', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q602358'), ('p1', 'http://www.wikidata.org/prop/direct/P1343'), ('name1', 'described by source')]\n",
      "[('o', 'event/Renaissance'), ('p1', 'http://www.wikidata.org/prop/direct/P1417'), ('name1', 'Encyclopædia Britannica Online ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10999203'), ('p1', 'http://www.wikidata.org/prop/direct/P1424'), ('name1', \"topic's main template\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12554'), ('p1', 'http://www.wikidata.org/prop/direct/P155'), ('name1', 'follows')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q46825'), ('p1', 'http://www.wikidata.org/prop/direct/P155'), ('name1', 'follows')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q37853'), ('p1', 'http://www.wikidata.org/prop/direct/P156'), ('name1', 'followed by')]\n",
      "[('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/Da%20Vinci%20Vitruve%20Luc%20Viatour.jpg'), ('p1', 'http://www.wikidata.org/prop/direct/P18'), ('name1', 'image')]\n",
      "[('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/%27David%27%20by%20Michelangelo%20JBU04.JPG'), ('p1', 'http://www.wikidata.org/prop/direct/P18'), ('name1', 'image')]\n",
      "[('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/Sandro%20Botticelli%20-%20La%20nascita%20di%20Venere%20-%20Google%20Art%20Project.jpg'), ('p1', 'http://www.wikidata.org/prop/direct/P18'), ('name1', 'image')]\n",
      "[('o', '10762'), ('p1', 'http://www.wikidata.org/prop/direct/P1807'), ('name1', 'Great Aragonese Encyclopedia ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13400700'), ('p1', 'http://www.wikidata.org/prop/direct/P1889'), ('name1', 'different from')]\n",
      "[('o', '4049450-0'), ('p1', 'http://www.wikidata.org/prop/direct/P227'), ('name1', 'GND ID')]\n",
      "[('o', '4979'), ('p1', 'http://www.wikidata.org/prop/direct/P2347'), ('name1', 'YSO ID')]\n",
      "[('o', 'sh85112806'), ('p1', 'http://www.wikidata.org/prop/direct/P244'), ('name1', 'Library of Congress authority ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25111456'), ('p1', 'http://www.wikidata.org/prop/direct/P2579'), ('name1', 'studied by')]\n",
      "[('o', '13318531w'), ('p1', 'http://www.wikidata.org/prop/direct/P268'), ('name1', 'Bibliothèque nationale de France ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27496'), ('p1', 'http://www.wikidata.org/prop/direct/P276'), ('name1', 'location')]\n",
      "[('o', '1924973'), ('p1', 'http://www.wikidata.org/prop/direct/P2924'), ('name1', 'Great Russian Encyclopedia Online ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q32880'), ('p1', 'http://www.wikidata.org/prop/direct/P31'), ('name1', 'instance of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q968159'), ('p1', 'http://www.wikidata.org/prop/direct/P31'), ('name1', 'instance of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2198855'), ('p1', 'http://www.wikidata.org/prop/direct/P31'), ('name1', 'instance of')]\n",
      "[('o', 'renässans'), ('p1', 'http://www.wikidata.org/prop/direct/P3222'), ('name1', 'NE.se ID')]\n",
      "[('o', '12765b'), ('p1', 'http://www.wikidata.org/prop/direct/P3241'), ('name1', 'Catholic Encyclopedia ID')]\n",
      "[('o', 'The-Renacimiento'), ('p1', 'http://www.wikidata.org/prop/direct/P3417'), ('name1', 'Quora topic ID')]\n",
      "[('o', '00569811'), ('p1', 'http://www.wikidata.org/prop/direct/P349'), ('name1', 'National Diet Library ID')]\n",
      "[('o', '19597086'), ('p1', 'http://www.wikidata.org/prop/direct/P3553'), ('name1', 'Zhihu topic ID')]\n",
      "[('o', 'Renaissance'), ('p1', 'http://www.wikidata.org/prop/direct/P373'), ('name1', 'Commons category')]\n",
      "[('o', 'renaissance'), ('p1', 'http://www.wikidata.org/prop/direct/P3827'), ('name1', 'JSTOR topic ID')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# BGP OF BAROQUE AND RENAISSANCE AND ROMANTICISM\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance'),\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm ?p1 ?name1\n",
    "WHERE{ {\n",
    "   # bind something\n",
    "    wd:Q37853 ?p ?o.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.   \n",
    "}\n",
    "Union\n",
    "{\n",
    "# bind something\n",
    "    wd:Q4692 ?p1 ?o.\n",
    "   # get the label\n",
    "   ?p1 sc:name ?name1.\n",
    "   }\n",
    "   Union\n",
    "{\n",
    "# bind something\n",
    "    wd:Q37068 ?x ?o.\n",
    "   # get the label\n",
    "   ?x sc:name ?nm.\n",
    "   }\n",
    "   }\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "129f0fb7",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for composer, painter, sculptor and poet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "72335955",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104694359'), ('name', 'WikiProject PCC Wikidata Pilot/Frick Art Reference Library')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106675203'), ('name', 'WikiProject PCC Wikidata Pilot/Berenson Library')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1081881'), ('name', 'National Museum of San Matteo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13362'), ('name', 'Ferrara')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13375'), ('name', 'Pisa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q134307'), ('name', 'portrait')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q148540'), ('name', 'Republic of Florence')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q180788'), ('name', 'National Gallery')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2044'), ('name', 'Florence')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q213322'), ('name', 'Victoria and Albert Museum')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q214867'), ('name', 'National Gallery of Art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q220'), ('name', 'Rome')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2634'), ('name', 'Naples')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2751'), ('name', 'Siena')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2864737'), ('name', 'religious art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3374376'), ('name', 'mythological painting')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q483501'), ('name', 'artist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q49133'), ('name', 'Museum of Fine Arts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q50001'), ('name', 'Italians')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5503390'), ('name', 'Frick Art Reference Library')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q59452059'), ('name', 'Berenson Library')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6247'), ('name', 'Mantua')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q652'), ('name', 'Italian')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q67311526'), ('name', 'Obalky knih.cz')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q679527'), ('name', 'Museum Boijmans Van Beuningen')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q71887839'), ('name', 'copyrights on works have expired')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q842858'), ('name', 'Nationalmuseum')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q856749'), ('name', 'Bicci di Lorenzo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11634'), ('name', 'art of sculpture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1165526'), ('name', 'Musée Jacquemart-André')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1200696'), ('name', \"Museo dell'Opera del Duomo\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13373'), ('name', 'Lucca')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13377'), ('name', 'Prato')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q157825'), ('name', 'Bode Museum')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1636061'), ('name', 'Zuccone')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q191739'), ('name', 'Florence Cathedral')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19967495'), ('name', 'Donatello')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q271928'), ('name', 'Palazzo Vecchio')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q279'), ('name', 'Modena')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3330090'), ('name', 'Villa Guinigi National Museum')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3399515'), ('name', 'equestrian portrait')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3698261'), ('name', 'Crucifix in Santa Croce')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3867573'), ('name', 'Museum Bardini')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q388448'), ('name', 'Bargello')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q395755'), ('name', 'Agostino di Duccio')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q51177'), ('name', 'Basilica of Santa Croce')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q573881'), ('name', 'Basilica of San Lorenzo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q617'), ('name', 'Padua')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q628471'), ('name', 'Donato')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q640232'), ('name', 'Tomb of Giovanni Pecci')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64214265'), ('name', 'Wiki Loves Pride Art & Artists')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q651579'), ('name', 'Handel holding Putti in the museum Jacquemart-André')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66087835'), ('name', 'Donatello')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q735085'), ('name', 'David')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q79320565'), ('name', 'Donatello')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q828363'), ('name', 'Bertoldo di Giovanni')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q9141126'), ('name', 'Category:Donatello')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q98688625'), ('name', 'di Niccolò di Betto Bardi')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q99357626'), ('name', 'Book Donatello by Arsène Alexandre')]\n",
      "66\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "37f6469b-a994-4e04-8a09-dc1a1e737f8c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1027879'), ('name', 'graphics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q128538'), ('name', 'Luke the Evangelist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5914426'), ('name', 'Template:Infobox artist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6615720'), ('name', 'Category:Painters')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11629'), ('name', 'art of painting')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12737077'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q174705'), ('name', 'oil painting')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q174219'), ('name', 'paint')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q189085'), ('name', 'pastel')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3391743'), ('name', 'visual artist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q193897'), ('name', 'paintbrush')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3300034'), ('name', 'painting material')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q861259'), ('name', 'painting surface')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q425548'), ('name', 'palette')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q939611'), ('name', 'easel')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4687'), ('name', 'Dictionnaire des peintres belges ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1375139'), ('name', 'Malíř')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8538537'), ('name', 'Category:Wikipedia categories named after painters')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "#Including the 2 Numbers from last result (Painter and Scupltor)\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1028181 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "ca2090fe-66ad-447d-a356-96b6bf101426",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q4048530'), ('name', 'Category:Occupations')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q151885'), ('name', 'concept')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4164871'), ('name', 'position')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24017414'), ('name', 'second-order class')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1807498'), ('name', 'social position')]\n",
      "[('p', 'http://www.wikidata.org/entity/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3095'), ('name', 'practiced by')]\n",
      "[('p', 'http://www.wikidata.org/entity/P425'), ('name', 'field of this occupation')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#exploring occupation for composer and poet\n",
    "#[('p', 'http://www.wikidata.org/entity/Q12737077'), ('name', 'occupation')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q12737077 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "f326dee1-b9b6-4d8a-b2b8-4c6e29db1376",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q15252222'), ('name', 'Composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16387857'), ('name', 'Composers Union of Armenia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8008937'), ('name', 'Category:Composers')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1754714'), ('name', 'Media Composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1121767'), ('name', 'Composer')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#exploring occupation for composer and poet\n",
    "#[('p', 'http://www.wikidata.org/entity/P106'), ('name', 'occupation')]queryString = \"\"\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   filter(regex(?name,\"Composer\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "7048b0a8-3651-4d2f-8e25-e622610c656b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q106376813'), ('name', 'visual poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1209498'), ('name', 'poet lawyer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q482'), ('name', 'poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182357'), ('name', 'lyric poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11386386'), ('name', 'haiku poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11122954'), ('name', 'tanka poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23117687'), ('name', 'dithyrambic poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1237928'), ('name', 'poet laureate')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2293636'), ('name', 'slam poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7168247'), ('name', 'performance poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7207537'), ('name', 'poetry reading')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107714046'), ('name', 'performance poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107230508'), ('name', 'woman poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17378131'), ('name', 'dub poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104824215'), ('name', 'poetry teacher')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12901590'), ('name', 'poetaster')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2293670'), ('name', 'slam poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3401082'), ('name', 'war poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20528752'), ('name', 'concrete poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q73644030'), ('name', 'urdu poets')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104236711'), ('name', 'modern poetry scholar')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "#exploring occupation for composer and poet\n",
    "#[('p', 'http://www.wikidata.org/entity/P106'), ('name', 'occupation')]queryString = \"\"\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   filter(regex(?name,\"poet\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1af7da4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "3f395c23",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID'), ('o', '300025513')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID'), ('o', '0133026')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q106727050')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class'), ('o', 'http://dbpedia.org/ontology/Poet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('o', 'http://www.wikidata.org/entity/Q24054302')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5509')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5477')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5506')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5710')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5430')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5343')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5609')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5503')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5344')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5393')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5394')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5465')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5341')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5392')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5470')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5478')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID'), ('o', '4436441-6')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID'), ('o', '4168391-2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID'), ('o', '4246394-4')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID'), ('o', 'sh85103733')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID'), ('o', '00063196n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID'), ('o', '11933176q')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q36180')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q28640')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID'), ('o', 'Poets')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID'), ('o', 'POETESS')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID'), ('o', '00571341')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID'), ('o', '19567979')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category'), ('o', 'Poets')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID'), ('o', 'concept15267')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID'), ('o', 'pcrthaeJNwN3zK')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID'), ('o', 'pcrto2X1tJXRSS')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation'), ('o', 'http://www.wikidata.org/entity/Q482')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as'), ('o', 'http://www.wikidata.org/entity/Q1293108')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID'), ('o', '5113')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5160'), ('name', 'Thesaurus for Graphic Materials ID'), ('o', 'tgm007949')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories'), ('o', 'http://www.wikidata.org/entity/Q9579555')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID'), ('o', 'memory-alpha:Poet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('o', '/m/05z96')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID'), ('o', 'scot/2049')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID'), ('o', 'Poet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID'), ('o', '64529')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID'), ('o', '10466829-n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q6487149')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID'), ('o', 'XX533423')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)'), ('o', 'E1102')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4167410'), ('p1', 'http://www.wikidata.org/prop/direct/P31'), ('name1', 'instance of')]\n",
      "[('o', '300025136'), ('nm', 'Art & Architecture Thesaurus ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5914426'), ('nm', \"topic's main template\")]\n",
      "[('o', 'http://dbpedia.org/ontology/Painter'), ('nm', 'equivalent class')]\n",
      "[('o', 'http://commons.wikimedia.org/wiki/Special:FilePath/Painters%20Xingping%20town%2020090502%206089.jpg'), ('nm', 'image')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1375139'), ('nm', 'different from')]\n",
      "[('o', 'http://www.wikidata.org/entity/P4687'), ('nm', 'properties for this type')]\n",
      "[('o', '4037215-7'), ('nm', 'GND ID')]\n",
      "[('o', '4037223-6'), ('nm', 'GND ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q174219'), ('nm', 'uses')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q193897'), ('nm', 'uses')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3300034'), ('nm', 'uses')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q861259'), ('nm', 'uses')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q425548'), ('nm', 'uses')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q939611'), ('nm', 'uses')]\n",
      "[('o', 'sh85147670'), ('nm', 'Library of Congress authority ID')]\n",
      "[('o', '11989910g'), ('nm', 'Bibliothèque nationale de France ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3391743'), ('nm', 'subclass of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12737077'), ('nm', 'instance of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28640'), ('nm', 'instance of')]\n",
      "[('o', 'Painters'), ('nm', 'Quora topic ID')]\n",
      "[('o', '00562159'), ('nm', 'National Diet Library ID')]\n",
      "[('o', 'Painters'), ('nm', 'Commons category')]\n",
      "[('o', 'painters'), ('nm', 'Open Library subject ID')]\n",
      "[('o', 'concept3099'), ('nm', 'UNESCO Thesaurus ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q128538'), ('nm', 'patron saint')]\n",
      "[('o', 'pcrtaynDRL2SuJ'), ('nm', 'PACTOLS thesaurus ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1027879'), ('nm', 'field of this occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11629'), ('nm', 'field of this occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q174705'), ('nm', 'field of this occupation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q189085'), ('nm', 'field of this occupation')]\n",
      "[('o', 'dg2015060134'), ('nm', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('o', '3784'), ('nm', 'BNCF Thesaurus ID')]\n",
      "[('o', '3783'), ('nm', 'BNCF Thesaurus ID')]\n",
      "[('o', 'pittore'), ('nm', 'Treccani Vocabulary ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8538537'), ('nm', 'category for eponymous categories')]\n",
      "[('o', '/m/02nxqmh'), ('nm', 'Freebase ID')]\n",
      "[('o', 'Maler'), ('nm', 'Klexikon article ID')]\n",
      "[('o', 'scot/346'), ('nm', 'Australian Educational Vocabulary ID')]\n",
      "[('o', '6'), ('nm', 'RKD thesaurus ID')]\n",
      "[('o', '46436'), ('nm', 'RKD thesaurus ID')]\n",
      "[('o', '1523'), ('nm', 'AniDB tag ID')]\n",
      "[('o', '10411352-n'), ('nm', 'WordNet 3.1 Synset ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6615720'), ('nm', \"topic's main category\")]\n",
      "[('o', 'B1101'), ('nm', 'ROME Occupation Code (v3)')]\n",
      "[('o', '2651'), ('nm', 'ISCO-88 occupation code')]\n",
      "[('nmm', 'Art & Architecture Thesaurus ID'), ('u', 'http://www.wikidata.org/prop/direct/P1014')]\n",
      "[('nmm', 'product or material produced'), ('u', 'http://www.wikidata.org/prop/direct/P1056')]\n",
      "[('nmm', 'OpenStreetMap tag or key'), ('u', 'http://www.wikidata.org/prop/direct/P1282')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1121767'), ('name', 'Composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm ?p1 ?name1 ?nmm ?u\n",
    "WHERE{ {\n",
    "   # bind something\n",
    "    wd:Q49757 ?p ?o.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.   \n",
    "}\n",
    "Union\n",
    "{\n",
    "# bind something\n",
    "    wd:Q1121767 ?p1 ?o.\n",
    "   # get the label\n",
    "   ?p1 sc:name ?name1.\n",
    "   }\n",
    "   Union\n",
    "{\n",
    "# bind something\n",
    "    wd:Q1028181 ?x ?o.\n",
    "   # get the label\n",
    "   ?x sc:name ?nm.\n",
    "   }\n",
    "   \n",
    "   Union\n",
    "{\n",
    "# bind something\n",
    "    wd:Q1281618 ?u ?z.\n",
    "   # get the label\n",
    "   ?u sc:name ?nmm.\n",
    "   }\n",
    "   }\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8b65c36d",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "54ea0b53",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "77174af4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "683a0a9e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "761c7d7a",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37c8e17e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d737ef8b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b7bfe5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0a12d9d9",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d1ed3433",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "437c79cf",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "03cd5b0c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "093f8996",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6a516289",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "217a646b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fd84f6da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
