{"macro_topic": "Sport", "topic": "Sport Workflow Series (Basketball and NBA seasons explorative search\")", "worker": "2022_40", "goals": {"1": "Identify the BGP for basketball player.", "2": "Identify the BGP for basketball.", "3": "Identify the BGP for basketball team.", "4": "Return all french basketball teams born before 1930 (the result set must be a list of triples basketball team IRI, label and year of inception).", "5": "Return all the NBA season (the result set must be a list of couples NBA season IRI, label)", "6": "Consider only the basketball teams which Michael Jordan and Kobe Bryant played. Return the number of NBA seasons won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team even if they never won a season).", "7": "Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, label and #players)", "8": "Identify the BGP for the NBA Defensive Player of the Year Award (see https://en.wikipedia.org/wiki/NBA_Defensive_Player_of_the_Year_Award)", "9": "Consider the players who won the NBA Defensive Player of the Year Award. Return for these players the number of NBA Defensive Player of the Year Award won in their career (the result set must be triples of player IRI, label and #victories)"}, "name": "b6eba7d980", "search_workflow": {"1": [{"narrative": "query example", "query": "SELECT DISTINCT ?p ?name WHERE { wd:Q41421 ?p ?obj . ?p sc:name ?name. } LIMIT 20", "output": [], "parseError": null, "keywords": {"SELECT": 1, "ASK": 0, "DESCRIBE": 0, "CONSTRUCT": 0, "NESTED QUERY": 0, "DISTINCT": 1, "LIMIT": 1, "OFFSET": 0, "ORDER BY": 0, "FILTER": 0, "REGEX": 0, "AND": 0, "UNION": 0, "OPTIONAL": 0, "GRAPH": 0, "EXISTS": 0, "NOT EXISTS": 0, "MINUS": 0, "COUNT": 0, "MAX": 0, "MIN": 0, "AVG": 0, "SUM": 0, "GROUP BY": 0, "HAVING": 0, "GROUP_CONCAT": 0}, "index": 0, "recall": 0.0, "precision": 0.0, "accuracy": 0.0, "fscore": 0.0}]}}