{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "eeafdab9",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "b681255a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.\n"
     ]
    }
   ],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-559ada6c32-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f03df9f",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Cultural Movements explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the cultural movements, in particular the Renaissance, Baroque and Romanticsm. We'd like to get an overview of the main artists belonging to these movements, musicians, poets, sculptors and painters."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8bcb47a4",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q37562`| Donatello    | node |\n",
    "| `wd:Q19675`| Louvre Museum | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f9fd20b",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q37562 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Donatello**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for Cultural Movement\n",
    "\n",
    "2. Identify the BGP for Renassaince, Baroque and Romanticism\n",
    "\n",
    "3. Identify the BGP for composer, painter, sculptor and poet\n",
    "\n",
    "4. Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)\n",
    "\n",
    "5. Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures).\n",
    "\n",
    "6. For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets).\n",
    "\n",
    "7. Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c7af0ca1",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for Cultural Movement"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "bf1aa6b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1017'), ('name', 'Vatican Library ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1138'), ('name', 'Kunstindeks Danmark Artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1248'), ('name', 'KulturNav-ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1367'), ('name', 'Art UK artist ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "44a80879-005f-4b74-b63c-ac1114ff6602",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 wdt:P135 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5efb71a9-3278-48fb-b44e-86ba79a40461",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5604'), ('name', 'archINFORM keyword ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1472236 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "21899dc6-a7d0-4187-a561-20af238984cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P910 ?o  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER(REGEX(?name,\"cultural movement\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "e522b295-5e3e-4869-949a-ac4024511646",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13830551'), ('name', 'Portal:Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15885248'), ('name', 'Renaissance painting')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1781608'), ('name', 'Renaissance literature')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041543'), ('name', 'Ottův slovník naučný')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27496'), ('name', 'Western Europe')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5460604'), ('name', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q236122'), ('name', 'Renaissance architecture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q32880'), ('name', 'architectural style')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12554'), ('name', 'Middle Ages')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201405'), ('name', 'Renaissance music')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46825'), ('name', 'Gothic art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133779'), ('name', 'Renaissance art')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4692 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73923c9c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "98081b1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q49773'), ('name', 'social movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3533467'), ('name', 'group action')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6638204'), ('name', 'Category:Cultural movement')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2198855 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22ee620e",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for Renassaince, Baroque and Romanticism"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9fd042ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1472236 wdt:P361 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "aeea10c1-3eca-4040-90f6-c49fa25f9270",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13830551'), ('name', 'Portal:Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15885248'), ('name', 'Renaissance painting')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1781608'), ('name', 'Renaissance literature')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1474884'), ('name', 'High Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041543'), ('name', 'Ottův slovník naučný')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27496'), ('name', 'Western Europe')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3181656'), ('name', 'The Nuttall Encyclopædia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5460604'), ('name', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q236122'), ('name', 'Renaissance architecture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q32880'), ('name', 'architectural style')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12554'), ('name', 'Middle Ages')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201405'), ('name', 'Renaissance music')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46825'), ('name', 'Gothic art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133779'), ('name', 'Renaissance art')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4692 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b1055488-b421-4538-8102-84d3ed60f74b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q172991'), ('bname', 'Council of Trent')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11514315'), ('bname', 'historical period')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1292119'), ('bname', 'style')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q131808'), ('bname', 'Mannerism')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q32880'), ('bname', 'architectural style')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4692'), ('bname', 'Renaissance')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q968159'), ('bname', 'art movement')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2198855'), ('bname', 'cultural movement')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1431376'), ('bname', 'Baroque literature')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3624106'), ('bname', 'Baroque art')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q63442026'), ('bname', 'High Baroque')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8810374'), ('bname', 'Category:Baroque')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?o ?bname\n",
    "WHERE {\n",
    "   # bind something\n",
    "  # wd:Q4692 ?obj ?p .\n",
    "   wd:Q37853 ?obj1 ?o.\n",
    "   # get the label\n",
    "   #?p sc:name ?name.\n",
    "   ?o sc:name ?bname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "286d12ca-a114-4cf8-b508-283fbc51dcf1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q8210150'), ('name', 'Avanzada Regia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q211481'), ('name', 'Dogme 95')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2046861'), ('name', 'Palaeologan Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1400430'), ('name', 'Macedonian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q430167'), ('name', 'Spanish Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1814286'), ('name', 'Young Estonia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2614483'), ('name', 'Pre-romanticism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q39427'), ('name', 'surrealism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2349908'), ('name', 'French Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q878985'), ('name', 'modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q466887'), ('name', 'Belle Époque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12539'), ('name', 'Age of Enlightenment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q265581'), ('name', 'fin de siècle')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q42865'), ('name', 'Orientalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q934618'), ('name', 'Danish Golden Age')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3488076'), ('name', 'La Sape')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3083331'), ('name', 'Andean Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1753636'), ('name', 'Gilded Age')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131808'), ('name', 'Mannerism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q751880'), ('name', 'japonism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q620629'), ('name', 'deism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q744738'), ('name', 'encyclopédistes')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q863679'), ('name', 'chinoiserie')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4745501'), ('name', 'American modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q164800'), ('name', 'Symbolism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5653011'), ('name', 'North Group')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6034'), ('name', 'Dada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q466521'), ('name', 'kinetic art')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q374278'), ('name', 'agitprop')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q940595'), ('name', 'Zutiste')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2896922'), ('name', 'Berberism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q846933'), ('name', 'renaissance humanism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q194100'), ('name', 'transhumanism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q9033935'), ('name', 'Brazilian modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2390991'), ('name', 'Gothicismus')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1347824'), ('name', 'La Movida Madrileña')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3424747'), ('name', 'Modern Greek Enlightenment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3482195'), ('name', 'shingeki')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q472670'), ('name', 'Haskalah')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64528910'), ('name', 'The Forge')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3362516'), ('name', 'Afrofuturism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1759189'), ('name', 'mangue bit')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10468834'), ('name', 'White cube gallery')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q89099707'), ('name', 'Özgün müzik')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q478004'), ('name', 'anti-clericalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10936092'), ('name', 'Taisho Roman')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1580216'), ('name', 'Noucentisme')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q160476'), ('name', 'German Expressionism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2639653'), ('name', 'Leonese regionalism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64761829'), ('name', 'New Drama')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15991289'), ('name', 'Old School Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16573056'), ('name', 'Guardia Vieja')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3298288'), ('name', 'post-postmodernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1133329'), ('name', 'Young Poland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q979160'), ('name', 'Proto-Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1172762'), ('name', 'Dau al Set')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2907232'), ('name', 'Antropophagia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4920294'), ('name', 'Black Arts Movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q153946'), ('name', 'punk counterculture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6110311'), ('name', 'flamenco rock')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1413061'), ('name', 'tropicália')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7215510'), ('name', 'Ukrainian Russophiles')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2368408'), ('name', 'artistic indianism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q703472'), ('name', 'Renaixença')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16497571'), ('name', 'Brazilian Belle Époque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1745141'), ('name', 'Fantastic Realism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q61693382'), ('name', 'pilantragem')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q852377'), ('name', 'New Culture Movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q63442026'), ('name', 'High Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q899271'), ('name', 'Baroque in Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4922353'), ('name', 'Black is Beautiful')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1431758'), ('name', 'San Francisco Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1520921'), ('name', 'Nahda')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2289148'), ('name', 'The Singing Voice of Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q877637'), ('name', 'Rangaku')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3683985'), ('name', 'combat folk')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q234105'), ('name', 'Lost Generation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5651123'), ('name', 'Hanshinkan Modernism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q57206373'), ('name', 'Black Aesthetic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1713406'), ('name', 'Young Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q700923'), ('name', 'Vormärz')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3326886'), ('name', 'Ez Dok Amairu')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2037910'), ('name', 'Swinging London')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8059379'), ('name', 'Youthquake')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q74950'), ('name', 'objectivism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q856643'), ('name', 'Trecento')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q105661166'), ('name', 'Tutmania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q254272'), ('name', 'Egyptomania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q700324'), ('name', 'Bunmei Kaika')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1334000'), ('name', 'School of Salamanca')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3307647'), ('name', 'Rexurdimento')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104215395'), ('name', 'Africanfuturism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3953335'), ('name', 'Genoa school')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6025377'), ('name', 'Movimiento indaliano')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3759612'), ('name', 'Generation of 1914')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q695274'), ('name', 'Philhellenism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2717024'), ('name', 'Pre-Pottery Neolithic C')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3547880'), ('name', 'ukiyo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3718891'), ('name', 'Silver Age')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85758112'), ('name', 'e-girls and e-boys')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3441123'), ('name', 'Romantisme baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q88467256'), ('name', 'Asturian Baroque')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11838999'), ('name', 'The Flacăra cenacle')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q694408'), ('name', 'Weimar Classicism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1263842'), ('name', 'Duecento')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12179231'), ('name', 'Pre-Islamic literature')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6296743'), ('name', 'Jovem Guarda')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q336522'), ('name', 'Indie role-playing game')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q42907814'), ('name', 'dandyism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q969107'), ('name', 'postgenderism')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q57244244'), ('name', 'Black Atlantic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q329170'), ('name', 'Wissenschaft des Judentums')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q700429'), ('name', 'Wiener Moderne')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1755539'), ('name', 'City Beautiful movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3866622'), ('name', 'Movimento di Cooperazione Educativa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5421149'), ('name', 'experimental architecture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1061960'), ('name', 'Purismo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3935973'), ('name', 'Renaissance in Ferrara')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85850403'), ('name', 'Convergence culture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5528642'), ('name', 'Gay Shame')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q239514'), ('name', 'Quiet Revolution')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5443468'), ('name', 'Aetas Ovidiana')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85148248'), ('name', 'Thullal prasthanam')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3575095'), ('name', 'Zef')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131826'), ('name', 'Young Latvians')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4120724'), ('name', 'Ōuchi culture')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q672638'), ('name', 'spiritual defence')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11937152'), ('name', 'Modernism in Camprodon')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16488690'), ('name', 'Armenian Renaissance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5669970'), ('name', 'Movida viguesa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31358818'), ('name', 'Cool Cymru')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7269008'), ('name', 'Quantum aesthetics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1793969'), ('name', 'Scandinavian design')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4789421'), ('name', 'Argentine Open Theatre')]\n",
      "138\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1472236'), ('name', 'Early Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?p wdt:P31 wd:Q2198855.\n",
    "    #wd:Q2198855 ?obj ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "4a8021b2-7c85-4dc1-af17-c02971969d78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q12554'), ('ename', 'Middle Ages')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q27496'), ('ename', 'Western Europe')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q979160'), ('ename', 'Proto-Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q1404472'), ('ename', 'Italian Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q1133779'), ('ename', 'Renaissance art')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q7112776'), ('ename', 'outline of the Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2041543'), ('bname', 'Ottův slovník naučný'), ('rena', 'http://www.wikidata.org/entity/Q602358'), ('ename', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q12554'), ('ename', 'Middle Ages')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q27496'), ('ename', 'Western Europe')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q979160'), ('ename', 'Proto-Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q1404472'), ('ename', 'Italian Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q1133779'), ('ename', 'Renaissance art')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q7112776'), ('ename', 'outline of the Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q2657718'), ('bname', 'Armenian Soviet Encyclopedia'), ('rena', 'http://www.wikidata.org/entity/Q602358'), ('ename', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q12554'), ('ename', 'Middle Ages')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q27496'), ('ename', 'Western Europe')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q979160'), ('ename', 'Proto-Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q1404472'), ('ename', 'Italian Renaissance')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q1133779'), ('ename', 'Renaissance art')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2614483'), ('rname', 'Pre-romanticism'), ('bar', 'http://www.wikidata.org/entity/Q3181656'), ('bname', 'The Nuttall Encyclopædia'), ('rena', 'http://www.wikidata.org/entity/Q7112776'), ('ename', 'outline of the Renaissance')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?roman ?rname ?bar ?bname ?rena ?ename \n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q37068 ?obj ?roman.\n",
    "    wd:Q37853 ?obj1 ?bar.\n",
    "    wd:Q4692 ?obj2 ?rena.\n",
    "   # get the label\n",
    "   ?roman sc:name ?rname.\n",
    "   ?bar sc:name ?bname.\n",
    "   ?rena sc:name ?ename.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a1638df1",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "b3e068b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1014'), ('rname', 'Art & Architecture Thesaurus ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1036'), ('rname', 'Dewey Decimal Classification')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1051'), ('rname', 'PSH ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1245'), ('rname', 'OmegaWiki Defined Meaning')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1296'), ('rname', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1343'), ('rname', 'described by source')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1417'), ('rname', 'Encyclopædia Britannica Online ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P155'), ('rname', 'follows')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P156'), ('rname', 'followed by')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P18'), ('rname', 'image')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P1807'), ('rname', 'Great Aragonese Encyclopedia ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P227'), ('rname', 'GND ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P2347'), ('rname', 'YSO ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P244'), ('rname', 'Library of Congress authority ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P2581'), ('rname', 'BabelNet ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P268'), ('rname', 'Bibliothèque nationale de France ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P2924'), ('rname', 'Great Russian Encyclopedia Online ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P2959'), ('rname', 'permanent duplicated item')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P31'), ('rname', 'instance of')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3219'), ('rname', 'Encyclopædia Universalis ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3222'), ('rname', 'NE.se ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3235'), ('rname', 'PhilPapers topic')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3365'), ('rname', 'Treccani ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3417'), ('rname', 'Quora topic ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P349'), ('rname', 'National Diet Library ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3553'), ('rname', 'Zhihu topic ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P373'), ('rname', 'Commons category')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P3827'), ('rname', 'JSTOR topic ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P4223'), ('rname', \"Treccani's Enciclopedia Italiana ID\")]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P443'), ('rname', 'pronunciation audio')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P486'), ('rname', 'MeSH descriptor ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P508'), ('rname', 'BNCF Thesaurus ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P527'), ('rname', 'has part')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P571'), ('rname', 'inception')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P580'), ('rname', 'start time')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P582'), ('rname', 'end time')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P6058'), ('rname', 'Larousse ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P6366'), ('rname', 'Microsoft Academic ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P6404'), ('rname', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P646'), ('rname', 'Freebase ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P6573'), ('rname', 'Klexikon article ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P7033'), ('rname', 'Australian Educational Vocabulary ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P7786'), ('rname', 'Joconde epoch ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P7818'), ('rname', 'French Vikidia ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P7832'), ('rname', 'Basque Vikidia ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P7993'), ('rname', \"Treccani's Dizionario di Filosofia ID\")]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P8168'), ('rname', 'FactGrid item ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P8406'), ('rname', 'Grove Art Online ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P8408'), ('rname', 'KBpedia ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P9070'), ('rname', 'Internet Encyclopedia of Ukraine ID')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P910'), ('rname', \"topic's main category\")]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P935'), ('rname', 'Commons gallery')]\n",
      "[('roman', 'http://www.wikidata.org/prop/direct/P950'), ('rname', 'Biblioteca Nacional de España ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1014'), ('bname', 'Art & Architecture Thesaurus ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1051'), ('bname', 'PSH ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1245'), ('bname', 'OmegaWiki Defined Meaning')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1296'), ('bname', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1343'), ('bname', 'described by source')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1417'), ('bname', 'Encyclopædia Britannica Online ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P155'), ('bname', 'follows')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P18'), ('bname', 'image')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P1807'), ('bname', 'Great Aragonese Encyclopedia ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P227'), ('bname', 'GND ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P2347'), ('bname', 'YSO ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P244'), ('bname', 'Library of Congress authority ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P2581'), ('bname', 'BabelNet ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P268'), ('bname', 'Bibliothèque nationale de France ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P2924'), ('bname', 'Great Russian Encyclopedia Online ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P31'), ('bname', 'instance of')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3219'), ('bname', 'Encyclopædia Universalis ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3241'), ('bname', 'Catholic Encyclopedia ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3365'), ('bname', 'Treccani ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3417'), ('bname', 'Quora topic ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3569'), ('bname', 'Cultureel Woordenboek ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P373'), ('bname', 'Commons category')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P3827'), ('bname', 'JSTOR topic ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P5019'), ('bname', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P5063'), ('bname', 'Interlingual Index ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P508'), ('bname', 'BNCF Thesaurus ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P527'), ('bname', 'has part')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P5604'), ('bname', 'archINFORM keyword ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P580'), ('bname', 'start time')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P582'), ('bname', 'end time')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P6058'), ('bname', 'Larousse ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P6366'), ('bname', 'Microsoft Academic ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P6404'), ('bname', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P6412'), ('bname', 'Gran Enciclopèdia de la Música ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P646'), ('bname', 'Freebase ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P6573'), ('bname', 'Klexikon article ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P737'), ('bname', 'influenced by')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P7786'), ('bname', 'Joconde epoch ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P7818'), ('bname', 'French Vikidia ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P7827'), ('bname', 'Spanish Vikidia ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P7982'), ('bname', 'Hrvatska enciklopedija ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8135'), ('bname', 'Encyclopedia of České Budějovice ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8349'), ('bname', 'Proleksis enciklopedija ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8406'), ('bname', 'Grove Art Online ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8432'), ('bname', 'Österreichisches Musiklexikon Online ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8519'), ('bname', 'RKD thesaurus ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P8814'), ('bname', 'WordNet 3.1 Synset ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P902'), ('bname', 'HDS ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P910'), ('bname', \"topic's main category\")]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P920'), ('bname', 'LEM ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P950'), ('bname', 'Biblioteca Nacional de España ID')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P989'), ('bname', 'spoken text audio')]\n",
      "[('bar', 'http://www.wikidata.org/prop/direct/P9779'), ('bname', 'abART term ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1014'), ('ename', 'Art & Architecture Thesaurus ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1051'), ('ename', 'PSH ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1151'), ('ename', \"topic's main Wikimedia portal\")]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1256'), ('ename', 'Iconclass notation')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1343'), ('ename', 'described by source')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1417'), ('ename', 'Encyclopædia Britannica Online ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1424'), ('ename', \"topic's main template\")]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P155'), ('ename', 'follows')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P156'), ('ename', 'followed by')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P18'), ('ename', 'image')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1807'), ('ename', 'Great Aragonese Encyclopedia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P1889'), ('ename', 'different from')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P227'), ('ename', 'GND ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P2347'), ('ename', 'YSO ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P244'), ('ename', 'Library of Congress authority ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P2579'), ('ename', 'studied by')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P268'), ('ename', 'Bibliothèque nationale de France ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P276'), ('ename', 'location')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P2924'), ('ename', 'Great Russian Encyclopedia Online ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P31'), ('ename', 'instance of')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P3222'), ('ename', 'NE.se ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P3241'), ('ename', 'Catholic Encyclopedia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P3417'), ('ename', 'Quora topic ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P349'), ('ename', 'National Diet Library ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P3553'), ('ename', 'Zhihu topic ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P373'), ('ename', 'Commons category')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P3827'), ('ename', 'JSTOR topic ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P4212'), ('ename', 'PACTOLS thesaurus ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P4342'), ('ename', 'Store norske leksikon ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P5008'), ('ename', 'on focus list of Wikimedia project')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P5063'), ('ename', 'Interlingual Index ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P508'), ('ename', 'BNCF Thesaurus ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P5125'), ('ename', 'Wikimedia outline')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P527'), ('ename', 'has part')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P580'), ('ename', 'start time')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P582'), ('ename', 'end time')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P6058'), ('ename', 'Larousse ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P6366'), ('ename', 'Microsoft Academic ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P6404'), ('ename', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P6412'), ('ename', 'Gran Enciclopèdia de la Música ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P646'), ('ename', 'Freebase ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P6573'), ('ename', 'Klexikon article ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7033'), ('ename', 'Australian Educational Vocabulary ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7786'), ('ename', 'Joconde epoch ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7818'), ('ename', 'French Vikidia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7827'), ('ename', 'Spanish Vikidia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7829'), ('ename', 'English Vikidia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7832'), ('ename', 'Basque Vikidia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7982'), ('ename', 'Hrvatska enciklopedija ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P7993'), ('ename', \"Treccani's Dizionario di Filosofia ID\")]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P8349'), ('ename', 'Proleksis enciklopedija ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P8406'), ('ename', 'Grove Art Online ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P8408'), ('ename', 'KBpedia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P8432'), ('ename', 'Österreichisches Musiklexikon Online ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P902'), ('ename', 'HDS ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P910'), ('ename', \"topic's main category\")]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P935'), ('ename', 'Commons gallery')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P8603'), ('ename', 'Istrapedia ID')]\n",
      "[('rena', 'http://www.wikidata.org/prop/direct/P4305'), ('ename', 'FOIH styles and cultures ID')]\n",
      "165\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?roman ?rname ?bar ?bname ?rena ?ename \n",
    "WHERE {\n",
    "    {\n",
    "    wd:Q37068 ?roman ?obj.\n",
    "    ?roman sc:name ?rname.\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    wd:Q37853 ?bar ?obj1.\n",
    "    ?bar sc:name ?bname.\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "    wd:Q4692 ?rena ?obj2.\n",
    "    ?rena sc:name ?ename.\n",
    "   }\n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "222c00aa",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for composer, painter, sculptor and poet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "3c87caa1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q21680663'), ('name', 'classical composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21680699'), ('name', 'operetta composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1415090'), ('name', 'film score composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2627699'), ('name', 'chess composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21680731'), ('name', 'opera composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q63536580'), ('name', 'video game composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q64356038'), ('name', 'musical theatre composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q108001849'), ('name', 'amateur composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28771895'), ('name', 'vocal composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4765165'), ('name', 'Anime composer')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER(REGEX(?name,\"composer\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "24ea009a-bf8b-4154-aedf-8e0072b15905",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10611691'), ('name', 'ornamental sculptor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q40749908'), ('name', 'bronze sculptor')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER(REGEX(?name,\"sculptor\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "dddb6354-bf2e-4fe7-8b83-b43f328f5460",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q17505911'), ('name', 'architectural painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11606844'), ('name', 'Buddhist painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q67200599'), ('name', 'Yōga painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q67649782'), ('name', 'finger painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1743189'), ('name', 'church-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q59938355'), ('name', 'flower painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q25616553'), ('name', 'marine painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15301511'), ('name', 'vase painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15303031'), ('name', 'black-figure vase painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15303045'), ('name', 'red-figure vase painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21282419'), ('name', 'Attic vase-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q41000669'), ('name', 'white-groud vase-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24692846'), ('name', 'Etruscan vase-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22669155'), ('name', 'fresco painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30144139'), ('name', 'Corinthian vase-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q108256086'), ('name', 'faience painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q59924426'), ('name', 'oil painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27469950'), ('name', 'laconian vase-painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q288728'), ('name', 'painter and varnisher')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER(REGEX(?name,\"painter\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "2c68f2d7-1dd7-414f-84e1-25127d0efe28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q106376813'), ('name', 'visual poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1209498'), ('name', 'poet lawyer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q482'), ('name', 'poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182357'), ('name', 'lyric poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11386386'), ('name', 'haiku poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11122954'), ('name', 'tanka poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23117687'), ('name', 'dithyrambic poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1237928'), ('name', 'poet laureate')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2293636'), ('name', 'slam poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7168247'), ('name', 'performance poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7207537'), ('name', 'poetry reading')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107714046'), ('name', 'performance poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107230508'), ('name', 'woman poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17378131'), ('name', 'dub poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104824215'), ('name', 'poetry teacher')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12901590'), ('name', 'poetaster')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2293670'), ('name', 'slam poetry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3401082'), ('name', 'war poet')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20528752'), ('name', 'concrete poet')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?obj wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER(REGEX(?name,\"poet\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "c097a8aa-61da-41f7-a230-44f42e4f148d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('com', 'http://www.wikidata.org/entity/Q17856046'), ('cname', 'member of the Reichstag of Nazi Germany')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q708038'), ('cname', 'Kaiser Wilhelm Society')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q22082717'), ('cname', 'eugenicist')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q10737'), ('cname', 'suicide')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q152838'), ('cname', 'University of Göttingen')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q188'), ('cname', 'German')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q210392'), ('cname', 'killed in action')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q2865'), ('cname', 'Kassel')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q39631'), ('cname', 'physician')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q41304'), ('cname', 'Weimar Republic')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q482980'), ('cname', 'author')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q499249'), ('cname', 'Walter')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q5'), ('cname', 'human')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q55044'), ('cname', 'Ludwig Maximilian University of Munich')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q64'), ('cname', 'Berlin')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q6581097'), ('cname', 'male')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q7318'), ('cname', 'Nazi Germany')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q7320'), ('cname', \"National Socialist German Workers' Party (Nazi Party)\")]\n",
      "[('com', 'http://www.wikidata.org/entity/Q82955'), ('cname', 'politician')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q153978'), ('cname', 'University of Tübingen')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q2628227'), ('cname', 'Doctor of Sciences')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q16755977'), ('cname', 'racial theorist')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q1969310'), ('cname', 'Nationalsozialistischer Deutscher Ärzte-Bund')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q14290163'), ('cname', 'Gross')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q15954665'), ('cname', 'antisemite')]\n",
      "[('com', 'http://www.wikidata.org/entity/Q574173'), ('cname', 'NSDAP Office of Racial Policy')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q98552221'), ('sname', 'plastic artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q5914426'), ('sname', 'Template:Infobox artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q12737077'), ('sname', 'occupation')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q28640'), ('sname', 'profession')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q30059240'), ('sname', \"Real'nyj slovar' klassicheskih drevnostej po Ljubkeru\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q860861'), ('sname', 'sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q11634'), ('sname', 'art of sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q3391743'), ('sname', 'visual artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q7022076'), ('sname', 'Category:Sculptors')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q8907444'), ('sname', 'Category:Wikipedia categories named after sculptors')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q1458549'), ('sname', 'list of sculptors')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q1027879'), ('pname', 'graphics')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q128538'), ('pname', 'Luke the Evangelist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q5914426'), ('pname', 'Template:Infobox artist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q6615720'), ('pname', 'Category:Painters')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q11629'), ('pname', 'art of painting')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q12737077'), ('pname', 'occupation')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q174705'), ('pname', 'oil painting')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q28640'), ('pname', 'profession')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q174219'), ('pname', 'paint')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q189085'), ('pname', 'pastel')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q3391743'), ('pname', 'visual artist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q193897'), ('pname', 'paintbrush')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q3300034'), ('pname', 'painting material')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q861259'), ('pname', 'painting surface')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q425548'), ('pname', 'palette')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q939611'), ('pname', 'easel')]\n",
      "[('paint', 'http://www.wikidata.org/entity/P4687'), ('pname', 'Dictionnaire des peintres belges ID')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q1375139'), ('pname', 'Malíř')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q8538537'), ('pname', 'Category:Wikipedia categories named after painters')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q106727050'), ('poname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q28640'), ('poname', 'profession')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q36180'), ('poname', 'writer')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q482'), ('poname', 'poetry')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1293108'), ('poname', 'Dichter')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q6487149'), ('poname', 'Category:Poets')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5509'), ('poname', 'MAPS poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5477'), ('poname', 'Les Voix de la poésie poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5506'), ('poname', 'Poetry In Voice poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5710'), ('poname', 'Recours au poème ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5430'), ('poname', 'Poetry International Web poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5343'), ('poname', 'Poets.org poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5609'), ('poname', 'Split This Rock poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q9579555'), ('poname', 'Category:Wikipedia categories named after poets')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5503'), ('poname', 'Poetry Society of America poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5344'), ('poname', 'Printemps des poètes poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5393'), ('poname', 'cipM poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5394'), ('poname', 'Poets & Writers author ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5465'), ('poname', 'Australian Poetry Library poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5341'), ('poname', 'Poetry Foundation ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5392'), ('poname', 'Poetry Archive poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5470'), ('poname', 'Scottish Poetry Library poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5478'), ('poname', 'RPO poet ID')]\n",
      "80\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?com ?cname ?scul ?sname ?paint ?pname ?poet ?poname\n",
    "WHERE {\n",
    "   {\n",
    "    wd:Q36843 ?obj ?com.\n",
    "    ?com sc:name ?cname.\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    wd:Q1281618 ?obj1 ?scul.\n",
    "    ?scul sc:name ?sname.\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "    wd:Q1028181 ?obj2 ?paint.\n",
    "    ?paint sc:name ?pname.\n",
    "   }\n",
    "   UNION \n",
    "    {\n",
    "    wd:Q49757 ?obj3 ?poet.\n",
    "    ?poet sc:name ?poname.\n",
    "   }\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "83682760",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "f156df01",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P9044'), ('cname', 'GEPRIS-Historisch ID (Person)')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1006'), ('cname', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1015'), ('cname', 'NORAF ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P102'), ('cname', 'member of political party')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P106'), ('cname', 'occupation')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P119'), ('cname', 'place of burial')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1196'), ('cname', 'manner of death')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1207'), ('cname', 'NUKAT ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1280'), ('cname', 'CONOR.SI ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1347'), ('cname', 'military casualty classification')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P1412'), ('cname', 'languages spoken, written or signed')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P18'), ('cname', 'image')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P19'), ('cname', 'place of birth')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P20'), ('cname', 'place of death')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P21'), ('cname', 'sex or gender')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P213'), ('cname', 'ISNI')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P214'), ('cname', 'VIAF ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P227'), ('cname', 'GND ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P244'), ('cname', 'Library of Congress authority ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P269'), ('cname', 'IdRef ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P27'), ('cname', 'country of citizenship')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P2949'), ('cname', 'WikiTree person ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P31'), ('cname', 'instance of')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P373'), ('cname', 'Commons category')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P39'), ('cname', 'position held')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P4293'), ('cname', 'PM20 folder ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P463'), ('cname', 'member of')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P512'), ('cname', 'academic degree')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P569'), ('cname', 'date of birth')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P570'), ('cname', 'date of death')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P646'), ('cname', 'Freebase ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P69'), ('cname', 'educated at')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P734'), ('cname', 'family name')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P735'), ('cname', 'given name')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P7859'), ('cname', 'WorldCat Identities ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P7902'), ('cname', 'Deutsche Biographie (GND) ID')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P800'), ('cname', 'notable work')]\n",
      "[('com', 'http://www.wikidata.org/prop/direct/P949'), ('cname', 'National Library of Israel ID')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q98552221'), ('sname', 'plastic artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q5914426'), ('sname', 'Template:Infobox artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q12737077'), ('sname', 'occupation')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q28640'), ('sname', 'profession')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q30059240'), ('sname', \"Real'nyj slovar' klassicheskih drevnostej po Ljubkeru\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q860861'), ('sname', 'sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q11634'), ('sname', 'art of sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q3391743'), ('sname', 'visual artist')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q7022076'), ('sname', 'Category:Sculptors')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q8907444'), ('sname', 'Category:Wikipedia categories named after sculptors')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q1458549'), ('sname', 'list of sculptors')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q1027879'), ('pname', 'graphics')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q128538'), ('pname', 'Luke the Evangelist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q5914426'), ('pname', 'Template:Infobox artist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q6615720'), ('pname', 'Category:Painters')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q11629'), ('pname', 'art of painting')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q12737077'), ('pname', 'occupation')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q174705'), ('pname', 'oil painting')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q28640'), ('pname', 'profession')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q174219'), ('pname', 'paint')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q189085'), ('pname', 'pastel')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q3391743'), ('pname', 'visual artist')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q193897'), ('pname', 'paintbrush')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q3300034'), ('pname', 'painting material')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q861259'), ('pname', 'painting surface')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q425548'), ('pname', 'palette')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q939611'), ('pname', 'easel')]\n",
      "[('paint', 'http://www.wikidata.org/entity/P4687'), ('pname', 'Dictionnaire des peintres belges ID')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q1375139'), ('pname', 'Malíř')]\n",
      "[('paint', 'http://www.wikidata.org/entity/Q8538537'), ('pname', 'Category:Wikipedia categories named after painters')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q106727050'), ('poname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q28640'), ('poname', 'profession')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q36180'), ('poname', 'writer')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q482'), ('poname', 'poetry')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1293108'), ('poname', 'Dichter')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q6487149'), ('poname', 'Category:Poets')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5509'), ('poname', 'MAPS poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5477'), ('poname', 'Les Voix de la poésie poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5506'), ('poname', 'Poetry In Voice poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5710'), ('poname', 'Recours au poème ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5430'), ('poname', 'Poetry International Web poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5343'), ('poname', 'Poets.org poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5609'), ('poname', 'Split This Rock poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q9579555'), ('poname', 'Category:Wikipedia categories named after poets')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5503'), ('poname', 'Poetry Society of America poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5344'), ('poname', 'Printemps des poètes poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5393'), ('poname', 'cipM poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5394'), ('poname', 'Poets & Writers author ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5465'), ('poname', 'Australian Poetry Library poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5341'), ('poname', 'Poetry Foundation ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5392'), ('poname', 'Poetry Archive poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5470'), ('poname', 'Scottish Poetry Library poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/entity/P5478'), ('poname', 'RPO poet ID')]\n",
      "91\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?com ?cname ?scul ?sname ?paint ?pname ?poet ?poname\n",
    "WHERE {\n",
    "   {\n",
    "    wd:Q36843 ?com ?obj.\n",
    "    ?com sc:name ?cname.\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    wd:Q1281618 ?obj1 ?scul.\n",
    "    ?scul sc:name ?sname.\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "    wd:Q1028181 ?obj2 ?paint.\n",
    "    ?paint sc:name ?pname.\n",
    "   }\n",
    "   UNION \n",
    "    {\n",
    "    wd:Q49757 ?obj3 ?poet.\n",
    "    ?poet sc:name ?poname.\n",
    "   }\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19c8aaeb",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "c84e3775-2607-4e78-88d4-9b7579e55ffa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('roman', 'http://www.wikidata.org/entity/Q106376813'), ('rname', 'visual poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q1209498'), ('rname', 'poet lawyer')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q482'), ('rname', 'poetry')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q49757'), ('rname', 'poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q182357'), ('rname', 'lyric poetry')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q11386386'), ('rname', 'haiku poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q11122954'), ('rname', 'tanka poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q23117687'), ('rname', 'dithyrambic poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q1237928'), ('rname', 'poet laureate')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2293636'), ('rname', 'slam poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q7168247'), ('rname', 'performance poetry')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q7207537'), ('rname', 'poetry reading')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q107714046'), ('rname', 'performance poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q107230508'), ('rname', 'woman poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q17378131'), ('rname', 'dub poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q104824215'), ('rname', 'poetry teacher')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q12901590'), ('rname', 'poetaster')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q2293670'), ('rname', 'slam poetry')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q3401082'), ('rname', 'war poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q20528752'), ('rname', 'concrete poet')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q73644030'), ('rname', 'urdu poets')]\n",
      "[('roman', 'http://www.wikidata.org/entity/Q104236711'), ('rname', 'modern poetry scholar')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# Considering Occupation ID for getting all professions \n",
    "#\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?roman ?rname \n",
    "WHERE {\n",
    "    ?r wdt:P106 ?roman.\n",
    "    ?roman sc:name ?rname.\n",
    "    FILTER(REGEX(?rname, \"poet\"^^xsd:string))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "6eccf2b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Num', '8'), ('ocup', 'http://www.wikidata.org/entity/Q1209498'), ('Romanticism', 'poet lawyer')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q59938438'), ('Romanticism', 'history painter')]\n",
      "[('Num', '7'), ('ocup', 'http://www.wikidata.org/entity/Q21600439'), ('Romanticism', 'landscape painter')]\n",
      "[('Num', '21'), ('ocup', 'http://www.wikidata.org/entity/Q36834'), ('Romanticism', 'composer')]\n",
      "[('Num', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('Romanticism', 'painter')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q21680663'), ('Romanticism', 'classical composer')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q2627699'), ('Romanticism', 'chess composer')]\n",
      "[('Num', '159'), ('ocup', 'http://www.wikidata.org/entity/Q49757'), ('Romanticism', 'poet')]\n",
      "[('Num', '14'), ('ocup', 'http://www.wikidata.org/entity/Q1281618'), ('Romanticism', 'sculptor')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q28947943'), ('Boroque', 'miniature painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q21600439'), ('Boroque', 'landscape painter')]\n",
      "[('Num', '12'), ('ocup1', 'http://www.wikidata.org/entity/Q36834'), ('Boroque', 'composer')]\n",
      "[('Num', '388'), ('ocup1', 'http://www.wikidata.org/entity/Q1028181'), ('Boroque', 'painter')]\n",
      "[('Num', '3'), ('ocup1', 'http://www.wikidata.org/entity/Q22669155'), ('Boroque', 'fresco painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q21680663'), ('Boroque', 'classical composer')]\n",
      "[('Num', '2'), ('ocup1', 'http://www.wikidata.org/entity/Q1183704'), ('Boroque', 'decorative painter')]\n",
      "[('Num', '330'), ('ocup1', 'http://www.wikidata.org/entity/Q1281618'), ('Boroque', 'sculptor')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q24056480'), ('Boroque', 'porcelain painter')]\n",
      "[('Num', '43'), ('ocup1', 'http://www.wikidata.org/entity/Q49757'), ('Boroque', 'poet')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q984276'), ('Boroque', 'court painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q288728'), ('Boroque', 'painter and varnisher')]\n",
      "[('Num', '1'), ('ocup2', 'http://www.wikidata.org/entity/Q1209498'), ('Renaissance', 'poet lawyer')]\n",
      "[('Num', '12'), ('ocup2', 'http://www.wikidata.org/entity/Q36834'), ('Renaissance', 'composer')]\n",
      "[('Num', '67'), ('ocup2', 'http://www.wikidata.org/entity/Q1028181'), ('Renaissance', 'painter')]\n",
      "[('Num', '3'), ('ocup2', 'http://www.wikidata.org/entity/Q22669155'), ('Renaissance', 'fresco painter')]\n",
      "[('Num', '26'), ('ocup2', 'http://www.wikidata.org/entity/Q1281618'), ('Renaissance', 'sculptor')]\n",
      "[('Num', '16'), ('ocup2', 'http://www.wikidata.org/entity/Q49757'), ('Renaissance', 'poet')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('NumOf', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('oname', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "queryString = \"\"\"\n",
    "SELECT  *\n",
    "WHERE {\n",
    "    {SELECT DISTINCT (COUNT(?roman) as ?Num) ?ocup (?oname as ?Romanticism)  WHERE\n",
    "    {\n",
    "    ?roman ?obj wd:Q37068;\n",
    "        wdt:P106 ?ocup.\n",
    "    ?roman sc:name ?rname.\n",
    "    ?ocup sc:name ?oname.\n",
    "    FILTER (REGEX(?oname, \"sculptor\"^^xsd:string) || REGEX(?oname, \"composer\"^^xsd:string ) || REGEX(?oname, \"poet\"^^xsd:string ) || REGEX(?oname, \"painter\"^^xsd:string ))\n",
    "    #FILTER (REGEX(?oname, \"painter\"^^xsd:string ))\n",
    "    #FILTER (?oname = 'sculptor'^^xsd:string || ?oname = 'painter'^^xsd:string) \n",
    "    } GROUP BY ?oname ?ocup\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    select distinct (COUNT(?bar) as ?Num) ?ocup1 (?oname1 as ?Boroque) where\n",
    "    {\n",
    "     ?bar ?obj1 wd:Q37853;\n",
    "         wdt:P106 ?ocup1.\n",
    "    #?bar sc:name ?bname.\n",
    "    ?ocup1 sc:name ?oname1.\n",
    "    FILTER (REGEX(?oname1, \"sculptor\"^^xsd:string ) || REGEX(?oname1, \"painter\"^^xsd:string ) || REGEX(?oname1, \"poet\"^^xsd:string)  || REGEX(?oname1, \"composer\"^^xsd:string ))\n",
    "    } GROUP BY ?oname1 ?ocup1\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    select distinct (COUNT(?rena) as ?Num) ?ocup2 ?oname2 as ?Renaissance\n",
    "    {\n",
    "     ?rena ?obj2 wd:Q4692;\n",
    "         wdt:P106 ?ocup2.\n",
    "    ?rena sc:name ?ename.\n",
    "    ?ocup2 sc:name ?oname2.\n",
    "    FILTER (REGEX(?oname2, \"sculptor\"^^xsd:string ) || REGEX(?oname2, \"painter\"^^xsd:string ) || REGEX(?oname2, \"poet\"^^xsd:string)  || REGEX(?oname2, \"composer\"^^xsd:string ))\n",
    "    #FILTER (?oname2 = \"sculptor\"^^xsd:string || ?oname2 = \"painter\"^^xsd:string) \n",
    "   } \n",
    "   GROUP BY ?oname2 ?ocup2\n",
    "   }\n",
    "   \n",
    "}  \n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f940edf",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 237,
   "id": "2349b3b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Num', '8'), ('ocup', 'http://www.wikidata.org/entity/Q1209498'), ('Romanticism', 'poet lawyer')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q59938438'), ('Romanticism', 'history painter')]\n",
      "[('Num', '7'), ('ocup', 'http://www.wikidata.org/entity/Q21600439'), ('Romanticism', 'landscape painter')]\n",
      "[('Num', '21'), ('ocup', 'http://www.wikidata.org/entity/Q36834'), ('Romanticism', 'composer')]\n",
      "[('Num', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('Romanticism', 'painter')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q21680663'), ('Romanticism', 'classical composer')]\n",
      "[('Num', '1'), ('ocup', 'http://www.wikidata.org/entity/Q2627699'), ('Romanticism', 'chess composer')]\n",
      "[('Num', '159'), ('ocup', 'http://www.wikidata.org/entity/Q49757'), ('Romanticism', 'poet')]\n",
      "[('Num', '14'), ('ocup', 'http://www.wikidata.org/entity/Q1281618'), ('Romanticism', 'sculptor')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q28947943'), ('Boroque', 'miniature painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q21600439'), ('Boroque', 'landscape painter')]\n",
      "[('Num', '12'), ('ocup1', 'http://www.wikidata.org/entity/Q36834'), ('Boroque', 'composer')]\n",
      "[('Num', '388'), ('ocup1', 'http://www.wikidata.org/entity/Q1028181'), ('Boroque', 'painter')]\n",
      "[('Num', '3'), ('ocup1', 'http://www.wikidata.org/entity/Q22669155'), ('Boroque', 'fresco painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q21680663'), ('Boroque', 'classical composer')]\n",
      "[('Num', '2'), ('ocup1', 'http://www.wikidata.org/entity/Q1183704'), ('Boroque', 'decorative painter')]\n",
      "[('Num', '330'), ('ocup1', 'http://www.wikidata.org/entity/Q1281618'), ('Boroque', 'sculptor')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q24056480'), ('Boroque', 'porcelain painter')]\n",
      "[('Num', '43'), ('ocup1', 'http://www.wikidata.org/entity/Q49757'), ('Boroque', 'poet')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q984276'), ('Boroque', 'court painter')]\n",
      "[('Num', '1'), ('ocup1', 'http://www.wikidata.org/entity/Q288728'), ('Boroque', 'painter and varnisher')]\n",
      "[('Num', '1'), ('ocup2', 'http://www.wikidata.org/entity/Q1209498'), ('Renaissance', 'poet lawyer')]\n",
      "[('Num', '12'), ('ocup2', 'http://www.wikidata.org/entity/Q36834'), ('Renaissance', 'composer')]\n",
      "[('Num', '67'), ('ocup2', 'http://www.wikidata.org/entity/Q1028181'), ('Renaissance', 'painter')]\n",
      "[('Num', '3'), ('ocup2', 'http://www.wikidata.org/entity/Q22669155'), ('Renaissance', 'fresco painter')]\n",
      "[('Num', '26'), ('ocup2', 'http://www.wikidata.org/entity/Q1281618'), ('Renaissance', 'sculptor')]\n",
      "[('Num', '16'), ('ocup2', 'http://www.wikidata.org/entity/Q49757'), ('Renaissance', 'poet')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('NumOf', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('oname', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "queryString = \"\"\"\n",
    "SELECT  *\n",
    "WHERE {\n",
    "    {SELECT DISTINCT (COUNT(?roman) as ?Num) ?ocup (?oname as ?Romanticism)  WHERE\n",
    "    {\n",
    "    ?roman ?obj wd:Q37068;\n",
    "        wdt:P106 ?ocup.\n",
    "    ?roman sc:name ?rname.\n",
    "    ?ocup sc:name ?oname.\n",
    "    FILTER (REGEX(?oname, \"sculptor\"^^xsd:string) || REGEX(?oname, \"composer\"^^xsd:string ) || REGEX(?oname, \"poet\"^^xsd:string ) || REGEX(?oname, \"painter\"^^xsd:string ))\n",
    "    #FILTER (REGEX(?oname, \"painter\"^^xsd:string ))\n",
    "    #FILTER (?oname = 'sculptor'^^xsd:string || ?oname = 'painter'^^xsd:string) \n",
    "    } GROUP BY ?oname ?ocup\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    select distinct (COUNT(?bar) as ?Num) ?ocup1 (?oname1 as ?Boroque) where\n",
    "    {\n",
    "     ?bar ?obj1 wd:Q37853;\n",
    "         wdt:P106 ?ocup1.\n",
    "    #?bar sc:name ?bname.\n",
    "    ?ocup1 sc:name ?oname1.\n",
    "    FILTER (REGEX(?oname1, \"sculptor\"^^xsd:string ) || REGEX(?oname1, \"painter\"^^xsd:string ) || REGEX(?oname1, \"poet\"^^xsd:string)  || REGEX(?oname1, \"composer\"^^xsd:string ))\n",
    "    } GROUP BY ?oname1 ?ocup1\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "    select distinct (COUNT(?rena) as ?Num) ?ocup2 ?oname2 as ?Renaissance\n",
    "    {\n",
    "     ?rena ?obj2 wd:Q4692;\n",
    "         wdt:P106 ?ocup2.\n",
    "    ?rena sc:name ?ename.\n",
    "    ?ocup2 sc:name ?oname2.\n",
    "    FILTER (REGEX(?oname2, \"sculptor\"^^xsd:string ) || REGEX(?oname2, \"painter\"^^xsd:string ) || REGEX(?oname2, \"poet\"^^xsd:string)  || REGEX(?oname2, \"composer\"^^xsd:string ))\n",
    "    #FILTER (?oname2 = \"sculptor\"^^xsd:string || ?oname2 = \"painter\"^^xsd:string) \n",
    "   } \n",
    "   GROUP BY ?oname2 ?ocup2\n",
    "   }\n",
    "   \n",
    "}  \n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f66f1bf9",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "adbf2ab8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P101'), ('sname', 'field of work')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P1056'), ('sname', 'product or material produced')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P106'), ('sname', 'occupation')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P136'), ('sname', 'genre')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P138'), ('sname', 'named after')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P144'), ('sname', 'based on')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P180'), ('sname', 'depicts')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P1889'), ('sname', 'different from')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P195'), ('sname', 'collection')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P2650'), ('sname', 'interested in')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P2670'), ('sname', 'has parts of the class')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P279'), ('sname', 'subclass of')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P301'), ('sname', \"category's main topic\")]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P31'), ('sname', 'instance of')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P360'), ('sname', 'is a list of')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P361'), ('sname', 'part of')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P366'), ('sname', 'use')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P4224'), ('sname', 'category contains')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P4330'), ('sname', 'contains')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P460'), ('sname', 'said to be the same as')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P527'), ('sname', 'has part')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P800'), ('sname', 'notable work')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P912'), ('sname', 'has facility')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P921'), ('sname', 'main subject')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P971'), ('sname', 'category combines topics')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P1074'), ('sname', 'fictional analog of')]\n",
      "[('scul', 'http://www.wikidata.org/prop/direct/P8225'), ('sname', 'is metaclass for')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?scul ?sname\n",
    "WHERE {\n",
    "     ?obj1 ?scul wd:Q860861.\n",
    "    ?scul sc:name ?sname.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 264,
   "id": "12480c41-b055-496c-9316-9f3091eea112",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('k', 'http://www.wikidata.org/entity/Q2933446'), ('sname', 'Calabuch')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('NumOf', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('oname', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('cname', 'http://www.wikidata.org/entity/Q38'), ('m', 'Italy')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?k ?sname\n",
    "WHERE {\n",
    "        ?k wdt:P162 wd:Q38.\n",
    "        ?k sc:name ?sname.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 260,
   "id": "4bff1a5e-e6e6-43f7-8ef4-bcbac06ba274",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Jean-Baptiste Carpeaux'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Étienne-Jules Ramey'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Constantin Daniel Rosenthal'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Edwin Landseer'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'John-Étienne Chaponnière'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Auguste Clésinger'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Eugène Devéria'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Joseph Félon'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Albert Bartholomé'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Antoine Wiertz'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Antonin Moine'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Ary Scheffer'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Théodore Géricault'), ('oname', 'movement')]\n",
      "[('Num', '1'), ('obj', 'http://www.wikidata.org/prop/direct/P135'), ('rname', 'Ștefan Ionescu-Valbudea'), ('oname', 'movement')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#[('NumOf', '156'), ('ocup', 'http://www.wikidata.org/entity/Q1028181'), ('oname', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
    "queryString = \"\"\"\n",
    "SELECT  DISTINCT (COUNT(?roman) as ?Num) ?obj ?rname ?oname ?connection \n",
    "WHERE {\n",
    "    ?roman ?obj wd:Q37068;\n",
    "        wdt:P106 wd:Q1281618.\n",
    "        \n",
    "      #wd:Q1281618 ?coun wd:Q38.\n",
    "        \n",
    "    ?roman sc:name ?rname.\n",
    "    ?obj sc:name ?oname.\n",
    "   # ?coun sc:name ?connection\n",
    "     \n",
    "   }\n",
    " \n",
    "GROUP BY ?obj ?rname ?oname ?connection\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "976f4ebc-764f-48bd-a651-a2c895adefea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('scul', 'http://www.wikidata.org/entity/Q2520013'), ('sname', 'sculpture in the round')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q8204840'), ('sname', 'Arqueta de Sant Cugat')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q13723412'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q13723458'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q13723472'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q7982492'), ('sname', 'Wendell Willkie')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15725481'), ('sname', 'Amar Ekushey')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15726558'), ('sname', 'Machine with Concrete')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15726575'), ('sname', 'equestrian statue of Maréchal Foch')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15732310'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15876145'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15876147'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q15876151'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q16008770'), ('sname', 'Cenotaph of Dante Alighieri')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q16013785'), ('sname', 'Font de Santa Eulàlia')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q16060269'), ('sname', 'Blessed Soul')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q46999400'), ('sname', 'Robert E. Lee Monument')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q5212750'), ('sname', 'Damned Soul')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17033155'), ('sname', 'Three Heads Six Arms')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17038687'), ('sname', 'Stevie Ray Vaughan Memorial')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17051597'), ('sname', 'Memoria Urbana Berlin')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17061947'), ('sname', 'Pangaea')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17066322'), ('sname', 'William the Silent')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17080367'), ('sname', 'Monument to Effort')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17194246'), ('sname', 'William Shakespeare')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17202021'), ('sname', 'Bust of Linnaeus, Hartekamp')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q85763829'), ('sname', 'Godzilla head')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17300630'), ('sname', 'Le Combat du duc de Clarence by Émilien de Nieuwerkerke')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17302062'), ('sname', 'Relief of the Rapture of Saint Ignatius from the Holy Cave of Manresa')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17320331'), ('sname', 'Still Life with Fruit')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17320510'), ('sname', 'Santa Maria del Parto a Mergellina - Presepe Giovanni da Nola')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17339379'), ('sname', 'Fontein Vismarkt, Leiden')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17347007'), ('sname', \"De l'en-dessous\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17452741'), ('sname', 'Eijsden Castle: sculpture group with peacocks')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17490497'), ('sname', 'La lechera (sculpture)')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17490530'), ('sname', 'Memorial to Ramón Pérez de Ayala')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17490551'), ('sname', 'Memorial of Rafael del Riego')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17496295'), ('sname', 'Memorial to Ramón Pérez de Ayala')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17509360'), ('sname', 'Benito Juárez')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q4404699'), ('sname', 'garden sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17581109'), ('sname', 'La femme au paon by Falguière-Ra 960')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17588604'), ('sname', 'Caçador de lleons')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17607118'), ('sname', 'Slotklooster: bust of Arnold Janssen')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17609601'), ('sname', 'Europa en Afrika')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17626342'), ('sname', 'John of Nepomuk statue in Bystrzyca Kłodzka')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17627668'), ('sname', 'Brutalitätenskulptur')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17627671'), ('sname', 'YP 1')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17627676'), ('sname', 'Recovered Memory')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17627684'), ('sname', '46 Charred Steps')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17629542'), ('sname', 'Endymion sleeping')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q17638098'), ('sname', 'Retable de Naves')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q4319509'), ('sname', 'Gedenknaald Baarn')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q11922308'), ('sname', \"Font d'Hèrcules\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18084708'), ('sname', 'Trowel II')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18084711'), ('sname', 'Crusoe Umbrella')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18084737'), ('sname', 'Saw, Sawing')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18084738'), ('sname', 'Torn Notebook')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18085992'), ('sname', 'statue of Sacred Heart of Jesus Christ')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18123493'), ('sname', 'A Pau Casals')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18144845'), ('sname', \"L'Amour à la folie\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18148326'), ('sname', 'Daniel Webster')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18150038'), ('sname', 'February One')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q18160018'), ('sname', 'Ecstasy')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q3007583'), ('sname', \"Cupid's Span\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q3476515'), ('sname', 'architectural sculpture')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q19298700'), ('sname', 'Maraş lion')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q19312121'), ('sname', 'Zur Schicht')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q19336295'), ('sname', 'Sleep')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q19338532'), ('sname', 'Monument to Michael the Brave')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q6063200'), ('sname', 'Hygieia-Brunnen, Hamburg')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q20971124'), ('sname', 'Mirabeau répondant à Dreux-Brézé')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q20972971'), ('sname', 'Equestrian Statue of Louis Botha')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21006153'), ('sname', 'The Completion of the Louvre. The Emperor Approving the Plans Presented by Monsieur Visconti.')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21011370'), ('sname', 'Fountain with Kneeling Youths')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21011679'), ('sname', 'Fountain of Kneeling Youths')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21012006'), ('sname', 'Fountain of Kneeling Youths')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21016110'), ('sname', 'The Pioneer Mother Memorial')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21016187'), ('sname', 'Singing Sky')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q56070905'), ('sname', 'Girl with Goat')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21644037'), ('sname', \"Fenêtre de l'hôtel Béringuier-Maynier\")]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21648015'), ('sname', 'Solidarity')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21648040'), ('sname', 'The Docker')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21648552'), ('sname', 'Omaggio al cosmonauta')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21777312'), ('sname', 'Quand même')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q21979792'), ('sname', 'Savacou')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22022317'), ('sname', 'Decanter')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22022599'), ('sname', 'George Washington')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22025936'), ('sname', 'Velosaurus')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22075395'), ('sname', 'Sappho sleeping')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22075450'), ('sname', 'Mermaid')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22080797'), ('sname', 'The Martyrdom of Saint Sebastian')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22080834'), ('sname', 'The Adoration of the Magi')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22081095'), ('sname', 'Human Passions')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22081772'), ('sname', 'Madonna with Censing Angels')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22081808'), ('sname', 'The Virgin and Child')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22081824'), ('sname', 'The Faint of Mary and The Descent from the Cross (fragment of a retable group)')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22085367'), ('sname', 'The great Relic Bearer')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22241733'), ('sname', 'The Prodigal Son')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22245571'), ('sname', 'Mother Grieving over her Dead Child')]\n",
      "[('scul', 'http://www.wikidata.org/entity/Q22246417'), ('sname', 'The Holy Women at the Tomb')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?scul ?sname\n",
    "WHERE {\n",
    "    ?scul ?obj wd:Q860861.\n",
    "    ?scul sc:name ?sname.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "410139c9",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d67e164b-e720-44e8-baf4-148fc25b0f8f",
   "metadata": {},
   "source": [
    "There is no any data of sculptures where it made ."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d1d91da0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/entity/Q1281618'), ('name', 'sculptor')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?scul ?sname\n",
    "WHERE {\n",
    "    ?scul ?obj wd:Q860861.\n",
    "    ?scul sc:name ?sname.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c337028",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 221,
   "id": "d5009f32",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cname', 'http://www.wikidata.org/entity/Q1410'), ('m', 'Gibraltar')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q142'), ('m', 'France')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q145'), ('m', 'United Kingdom')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q183'), ('m', 'Germany')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q184'), ('m', 'Belarus')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q189'), ('m', 'Iceland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q191'), ('m', 'Estonia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q20'), ('m', 'Norway')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q211'), ('m', 'Latvia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q212'), ('m', 'Ukraine')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q213'), ('m', 'Czech Republic')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q214'), ('m', 'Slovakia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q215'), ('m', 'Slovenia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q217'), ('m', 'Moldova')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q218'), ('m', 'Romania')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q219'), ('m', 'Bulgaria')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q221'), ('m', 'North Macedonia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q222'), ('m', 'Albania')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q224'), ('m', 'Croatia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q225'), ('m', 'Bosnia and Herzegovina')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q228'), ('m', 'Andorra')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q233'), ('m', 'Malta')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q235'), ('m', 'Monaco')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q236'), ('m', 'Montenegro')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q237'), ('m', 'Vatican City')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q238'), ('m', 'San Marino')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q25230'), ('m', 'Guernsey')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q27'), ('m', 'Ireland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q28'), ('m', 'Hungary')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q29'), ('m', 'Spain')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q31'), ('m', 'Belgium')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q32'), ('m', 'Luxembourg')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q33'), ('m', 'Finland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q34'), ('m', 'Sweden')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q347'), ('m', 'Liechtenstein')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q35'), ('m', 'Denmark')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q36'), ('m', 'Poland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q37'), ('m', 'Lithuania')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q38'), ('m', 'Italy')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q39'), ('m', 'Switzerland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q40'), ('m', 'Austria')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q403'), ('m', 'Serbia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q41'), ('m', 'Greece')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q45'), ('m', 'Portugal')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q4628'), ('m', 'Faroe Islands')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q55'), ('m', 'Netherlands')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q785'), ('m', 'Jersey')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q875134'), ('m', 'European Russia')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q9676'), ('m', 'Isle of Man')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q3405693'), ('m', 'Sark')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q5689'), ('m', 'Åland')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q842829'), ('m', 'Svalbard and Jan Mayen')]\n",
      "[('cname', 'http://www.wikidata.org/entity/Q19715270'), ('m', 'European Kazakhstan')]\n",
      "53\n"
     ]
    }
   ],
   "source": [
    "#Using Europe BGP from other task \n",
    "#[('p', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cname ?m \n",
    "WHERE {\n",
    "   # bind something\n",
    "     wd:Q46 wdt:P527 ?p.\n",
    "     ?p wdt:P527 ?cname.\n",
    "   # get the label\n",
    "   #?pn sc:name ?pname.\n",
    "   ?cname sc:name ?m.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 229,
   "id": "a344e11c-5c27-40c6-b245-1284fb8c4706",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1373516'), ('poname', 'Eugénio de Castro')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q589406'), ('poname', 'Empress Xiaoquancheng')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q610608'), ('poname', 'António Aleixo')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q710504'), ('poname', 'Bohuslav Balbín')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8188119'), ('poname', 'Adelina Lopes Vieira')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8201526'), ('poname', 'Antonio Márquez Salas')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8201629'), ('poname', 'Antonio Rendic')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8202094'), ('poname', 'Antônio de Castro Assumpção')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8246828'), ('poname', 'Bernat Català de Valleriola')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1191225'), ('poname', 'Tan Sitong')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q4790571'), ('poname', 'Arifin C. Noer')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q57257'), ('poname', 'Peter Cornelius')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q6143494'), ('poname', 'Lin Xu')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8353951'), ('poname', 'Darío Herrera Peo')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8447800'), ('poname', 'Xavier Rodríguez Barrio')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8462536'), ('poname', 'Hsu Fang')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q8463086'), ('poname', \"Chang Ch'ung-ho\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q159967'), ('poname', 'Augusto Roa Bastos')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q219862'), ('poname', 'Raymond Carver')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q231708'), ('poname', 'Edith Nesbit')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#BGP of poets for exploring\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?poname\n",
    "WHERE {\n",
    "   # bind something\n",
    "     ?poet ?o wd:Q49757.\n",
    "    ?poet sc:name ?poname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 231,
   "id": "97e49a18-852e-4836-98fb-9381c54379ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1005'), ('poname', 'Portuguese National Library ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1006'), ('poname', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1015'), ('poname', 'NORAF ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1038'), ('poname', 'relative')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P106'), ('poname', 'occupation')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P119'), ('poname', 'place of burial')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1196'), ('poname', 'manner of death')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1207'), ('poname', 'NUKAT ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1233'), ('poname', 'Internet Speculative Fiction Database author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1263'), ('poname', 'NNDB people ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1273'), ('poname', 'CANTIC ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1280'), ('poname', 'CONOR.SI ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1309'), ('poname', 'EGAXA ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1315'), ('poname', 'NLA Trove ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1343'), ('poname', 'described by source')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1412'), ('poname', 'languages spoken, written or signed')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1415'), ('poname', 'Oxford Dictionary of National Biography ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1417'), ('poname', 'Encyclopædia Britannica Online ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1430'), ('poname', 'OpenPlaques subject ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1472'), ('poname', 'Commons Creator page')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1477'), ('poname', 'birth name')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1559'), ('poname', 'name in native language')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1580'), ('poname', 'University of Barcelona authority ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1695'), ('poname', 'NLP ID (unique)')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P18'), ('poname', 'image')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1816'), ('poname', 'National Portrait Gallery (London) person ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1899'), ('poname', 'LibriVox author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P19'), ('poname', 'place of birth')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1938'), ('poname', 'Project Gutenberg author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1953'), ('poname', 'Discogs artist ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P20'), ('poname', 'place of death')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2031'), ('poname', 'work period (start)')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P21'), ('poname', 'sex or gender')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P213'), ('poname', 'ISNI')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P214'), ('poname', 'VIAF ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2163'), ('poname', 'FAST ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2191'), ('poname', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P22'), ('poname', 'father')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P227'), ('poname', 'GND ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P244'), ('poname', 'Library of Congress authority ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2533'), ('poname', 'WomenWriters ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P26'), ('poname', 'spouse')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2600'), ('poname', 'Geni.com profile ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P268'), ('poname', 'Bibliothèque nationale de France ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P269'), ('poname', 'IdRef ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P27'), ('poname', 'country of citizenship')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2799'), ('poname', 'BVMC person ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2949'), ('poname', 'WikiTree person ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P2966'), ('poname', 'National Library of Wales Authority ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3029'), ('poname', 'UK National Archives ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P31'), ('poname', 'instance of')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3154'), ('poname', 'Runeberg author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3222'), ('poname', 'NE.se ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3348'), ('poname', 'National Library of Greece ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3373'), ('poname', 'sibling')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3430'), ('poname', 'SNAC ARK ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P345'), ('poname', 'IMDb ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P349'), ('poname', 'National Diet Library ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3630'), ('poname', 'Babelio author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P373'), ('poname', 'Commons category')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3762'), ('poname', 'openMLOL author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P396'), ('poname', 'SBN author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P3987'), ('poname', 'SHARE Catalogue author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P409'), ('poname', 'Libraries Australia ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P434'), ('poname', 'MusicBrainz artist ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P4342'), ('poname', 'Store norske leksikon ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P4431'), ('poname', 'Google Doodle')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P4457'), ('poname', 'DAHR artist ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P4629'), ('poname', 'Online Books Page author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P463'), ('poname', 'member of')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P4985'), ('poname', 'TMDb person ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5034'), ('poname', 'National Library of Korea ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P535'), ('poname', 'Find A Grave memorial ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5357'), ('poname', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5392'), ('poname', 'Poetry Archive poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5478'), ('poname', 'RPO poet ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5570'), ('poname', 'NooSFere author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5587'), ('poname', 'Libris-URI')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P569'), ('poname', 'date of birth')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P570'), ('poname', 'date of death')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P5705'), ('poname', 'Los Angeles Review of Books author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6104'), ('poname', 'maintained by WikiProject')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P646'), ('poname', 'Freebase ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P648'), ('poname', 'Open Library ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6683'), ('poname', 'Alexander Turnbull Library ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6706'), ('poname', 'De Agostini ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6722'), ('poname', 'FemBio ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6745'), ('poname', 'Orlando author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6886'), ('poname', 'writing language')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P691'), ('poname', 'NKCR AUT ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P6984'), ('poname', 'Rupa Publications author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P723'), ('poname', 'Digitale Bibliotheek voor de Nederlandse Letteren author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7293'), ('poname', 'PLWABN ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P734'), ('poname', 'family name')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P735'), ('poname', 'given name')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P742'), ('poname', 'pseudonym')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7578'), ('poname', 'DUC ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7704'), ('poname', 'Europeana entity')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7859'), ('poname', 'WorldCat Identities ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7902'), ('poname', 'Deutsche Biographie (GND) ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P800'), ('poname', 'notable work')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P8234'), ('poname', 'LiederNet author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P856'), ('poname', 'official website')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P866'), ('poname', 'Perlentaucher ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P8849'), ('poname', 'CONOR.BG ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P8870'), ('poname', 'Hyperion Records person ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P8980'), ('poname', 'KANTO ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P906'), ('poname', 'SELIBR ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P9251'), ('poname', 'Cyprus University of Technology ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P9287'), ('poname', 'Cyprus Bibliography ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P9459'), ('poname', 'Rekhta author ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P949'), ('poname', 'National Library of Israel ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P950'), ('poname', 'Biblioteca Nacional de España ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P9686'), ('poname', 'Classical Archives composer ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P8085'), ('poname', 'Curran Index contributor ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P7504'), ('poname', 'Jeugdliteratuur ID')]\n",
      "[('poet', 'http://www.wikidata.org/prop/direct/P1564'), ('poname', 'At the Circulating Library ID')]\n",
      "117\n"
     ]
    }
   ],
   "source": [
    "#Exploring single poet\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?poname\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q231708 ?poet ?o.\n",
    "    ?poet sc:name ?poname.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 265,
   "id": "545301e6-c01d-455c-a440-922aa159b736",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q5932129'), ('poname', 'Joaquín José Cervino'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q5258787'), ('poname', 'Tobias Barreto'), ('coc', 'http://www.wikidata.org/entity/Q155'), ('cname', 'Brazil')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q5340521'), ('poname', 'Eduardo Asquerino'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q573223'), ('poname', 'Patricio de la Escosura'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q688529'), ('poname', 'Johannes Carsten Hauch'), ('coc', 'http://www.wikidata.org/entity/Q35'), ('cname', 'Denmark')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q597298'), ('poname', 'Antoni Edward Odyniec'), ('coc', 'http://www.wikidata.org/entity/Q34266'), ('cname', 'Russian Empire')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q645491'), ('poname', 'Yevhen Hrebinka'), ('coc', 'http://www.wikidata.org/entity/Q34266'), ('cname', 'Russian Empire')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q93343'), ('poname', 'Percy Bysshe Shelley'), ('coc', 'http://www.wikidata.org/entity/Q161885'), ('cname', 'Great Britain')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q93343'), ('poname', 'Percy Bysshe Shelley'), ('coc', 'http://www.wikidata.org/entity/Q174193'), ('cname', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q378133'), ('poname', 'Hendrik Conscience'), ('coc', 'http://www.wikidata.org/entity/Q31'), ('cname', 'Belgium')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q352914'), ('poname', 'Karel Jaromír Erben'), ('coc', 'http://www.wikidata.org/entity/Q131964'), ('cname', 'Austrian Empire')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q352914'), ('poname', 'Karel Jaromír Erben'), ('coc', 'http://www.wikidata.org/entity/Q28513'), ('cname', 'Austria-Hungary')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2621545'), ('poname', 'Alexander Polezhayev'), ('coc', 'http://www.wikidata.org/entity/Q34266'), ('cname', 'Russian Empire')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q4151323'), ('poname', 'Eduard Huber'), ('coc', 'http://www.wikidata.org/entity/Q34266'), ('cname', 'Russian Empire')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q60684'), ('poname', 'Novalis'), ('coc', 'http://www.wikidata.org/entity/Q156199'), ('cname', 'Electorate of Saxony')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q761705'), ('poname', 'Louis Bouilhet'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2980553'), ('poname', 'Antoinette Henriette Clémence Robert'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q27179260'), ('poname', 'Alexandre de Saint-Juan'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q49767'), ('poname', 'François-René de Chateaubriand'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q64652'), ('poname', 'Gaspar Núñez de Arce'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Using country of citizenship P27 for getting country of poets working for Romanticism\n",
    "#Q37068 - Romanticism\n",
    "#Q49757 - Poet\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?poname ?coc ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet ?obj wd:Q37068;\n",
    "   wdt:P106 wd:Q49757;\n",
    "    wdt:P27 ?coc.\n",
    "    ?poet sc:name ?poname.\n",
    "    ?coc sc:name ?cname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 266,
   "id": "450ab334-4cde-4721-af97-b7741cce7000",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q156199'), ('cname', 'Electorate of Saxony')]\n",
      "[('NumOfPoets', '4'), ('coc', 'http://www.wikidata.org/entity/Q218'), ('cname', 'Romania')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q222'), ('cname', 'Albania')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q28'), ('cname', 'Hungary')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q958291'), ('cname', 'United Principalities')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q12560'), ('cname', 'Ottoman Empire')]\n",
      "[('NumOfPoets', '9'), ('coc', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('NumOfPoets', '7'), ('coc', 'http://www.wikidata.org/entity/Q174193'), ('cname', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfPoets', '3'), ('coc', 'http://www.wikidata.org/entity/Q31'), ('cname', 'Belgium')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q403'), ('cname', 'Serbia')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q221457'), ('cname', 'Congress Poland')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q699923'), ('cname', 'Illyrian Provinces')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q172107'), ('cname', 'Polish–Lithuanian Commonwealth')]\n",
      "[('NumOfPoets', '48'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q80702'), ('cname', 'Spanish Empire')]\n",
      "[('NumOfPoets', '16'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('NumOfPoets', '8'), ('coc', 'http://www.wikidata.org/entity/Q161885'), ('cname', 'Great Britain')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q10957559'), ('cname', 'Principality of Moldavia')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q227'), ('cname', 'Azerbaijan')]\n",
      "[('NumOfPoets', '4'), ('coc', 'http://www.wikidata.org/entity/Q45'), ('cname', 'Portugal')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Restricting Countries to Europe only\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?poet) AS ?NumOfPoets) ?coc ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet ?obj wd:Q37068;\n",
    "   wdt:P106 wd:Q49757;\n",
    "    wdt:P27 ?coc.\n",
    "    ?coc wdt:P30 wd:Q46.\n",
    "    #?poet sc:name ?poname.\n",
    "    ?coc sc:name ?cname.\n",
    "}\n",
    "GROUP BY ?coc ?cname\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68444f22",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "id": "ea0c8c4f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q156199'), ('cname', 'Electorate of Saxony')]\n",
      "[('NumOfPoets', '4'), ('coc', 'http://www.wikidata.org/entity/Q218'), ('cname', 'Romania')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q222'), ('cname', 'Albania')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q28'), ('cname', 'Hungary')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q958291'), ('cname', 'United Principalities')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q12560'), ('cname', 'Ottoman Empire')]\n",
      "[('NumOfPoets', '9'), ('coc', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('NumOfPoets', '7'), ('coc', 'http://www.wikidata.org/entity/Q174193'), ('cname', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfPoets', '3'), ('coc', 'http://www.wikidata.org/entity/Q31'), ('cname', 'Belgium')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q403'), ('cname', 'Serbia')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q221457'), ('cname', 'Congress Poland')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q699923'), ('cname', 'Illyrian Provinces')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q172107'), ('cname', 'Polish–Lithuanian Commonwealth')]\n",
      "[('NumOfPoets', '48'), ('coc', 'http://www.wikidata.org/entity/Q29'), ('cname', 'Spain')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q80702'), ('cname', 'Spanish Empire')]\n",
      "[('NumOfPoets', '16'), ('coc', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('NumOfPoets', '8'), ('coc', 'http://www.wikidata.org/entity/Q161885'), ('cname', 'Great Britain')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q10957559'), ('cname', 'Principality of Moldavia')]\n",
      "[('NumOfPoets', '1'), ('coc', 'http://www.wikidata.org/entity/Q227'), ('cname', 'Azerbaijan')]\n",
      "[('NumOfPoets', '4'), ('coc', 'http://www.wikidata.org/entity/Q45'), ('cname', 'Portugal')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?poet) AS ?NumOfPoets) ?coc ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet ?obj wd:Q37068;\n",
    "   wdt:P106 wd:Q49757;\n",
    "    wdt:P27 ?coc.\n",
    "    ?coc wdt:P30 wd:Q46.\n",
    "    #?poet sc:name ?poname.\n",
    "    ?coc sc:name ?cname.\n",
    "}\n",
    "GROUP BY ?coc ?cname\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "915bdbae",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 293,
   "id": "e0ad0bae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'has part'), ('name', 'Department of Sculptures of the Louvre'), ('p', 'http://www.wikidata.org/entity/Q3044772'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Exploring Louvre Museum BGP\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19675 ?obj ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   FILTER(REGEX(?name,\"Sculptures\"^^xsd:string))\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "e0b7afee-6beb-4a88-a9af-f632badceab2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('name', \"category's main topic\"), ('obj', 'http://www.wikidata.org/entity/Q8723838'), ('oname', 'Category:Sculptures of the Louvre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q17451496'), ('oname', 'Nymph with a Scorpion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q106350990'), ('oname', 'Farnese Flora')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q18147625'), ('oname', 'Farnese Flora')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q18147637'), ('oname', 'Theseus Fighting the Minotaur')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q18147662'), ('oname', 'Tiber')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q18147663'), ('oname', 'Nile')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19301715'), ('oname', 'Sculptures italiennes et espagnoles, salle 160, Entresol, Denon')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19338575'), ('oname', 'Room 206')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19338577'), ('oname', 'Room 207')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19338711'), ('oname', 'Room 211')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19338719'), ('oname', 'Room 216')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q19347123'), ('oname', 'Bacchant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q22946196'), ('oname', 'Amour de Saly')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q2962628'), ('oname', 'Sculpted Andirons')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q19120283'), ('oname', 'Hurt Niobid')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q19120310'), ('oname', 'Satyre et bacchante by James Pradier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19280253'), ('oname', 'French sculptures, room 29')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant'), ('obj', 'http://www.wikidata.org/entity/Q19341368'), ('oname', 'Room 221')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection'), ('obj', 'http://www.wikidata.org/entity/Q19753091'), ('oname', 'Diana')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Exploring Department of Sculptures of the Louvre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?obj ?p wd:Q3044772.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 220,
   "id": "a1986c7a-9817-4eb0-bbdc-522230ae9714",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q40446'), ('name', 'nude'), ('obj', 'http://www.wikidata.org/prop/direct/P136'), ('oname', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q318741'), ('name', 'Jean-Antoine Houdon'), ('obj', 'http://www.wikidata.org/prop/direct/P170'), ('oname', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10791'), ('name', 'nudity'), ('obj', 'http://www.wikidata.org/prop/direct/P180'), ('oname', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132543'), ('name', 'Diana'), ('obj', 'http://www.wikidata.org/prop/direct/P180'), ('oname', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46311'), ('name', 'bow'), ('obj', 'http://www.wikidata.org/prop/direct/P180'), ('oname', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45922'), ('name', 'arrow'), ('obj', 'http://www.wikidata.org/prop/direct/P180'), ('oname', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q327496'), ('name', 'hairstyle'), ('obj', 'http://www.wikidata.org/prop/direct/P180'), ('oname', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q34095'), ('name', 'bronze'), ('obj', 'http://www.wikidata.org/prop/direct/P186'), ('oname', 'made from material')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3044772'), ('name', 'Department of Sculptures of the Louvre'), ('obj', 'http://www.wikidata.org/prop/direct/P195'), ('oname', 'collection')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19280253'), ('name', 'French sculptures, room 29'), ('obj', 'http://www.wikidata.org/prop/direct/P276'), ('oname', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q860861'), ('name', 'sculpture'), ('obj', 'http://www.wikidata.org/prop/direct/P31'), ('oname', 'instance of')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "#Getting Specific Collection for exploring\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q19753091 ?obj ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 276,
   "id": "0ab6843a-bd39-4468-9960-7f6c5937c6bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'field of work'), ('name', 'art of sculpture'), ('p', 'http://www.wikidata.org/entity/Q11634'), ('obj', 'http://www.wikidata.org/prop/direct/P101')]\n",
      "[('oname', 'described by source'), ('name', 'Metropolitan Museum of Art Tagging Vocabulary'), ('p', 'http://www.wikidata.org/entity/Q106727050'), ('obj', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('oname', 'different from'), ('name', 'art of sculpture'), ('p', 'http://www.wikidata.org/entity/Q11634'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'properties for this type'), ('name', 'Vanderkrogt.net Statues ID'), ('p', 'http://www.wikidata.org/entity/P3711'), ('obj', 'http://www.wikidata.org/prop/direct/P1963')]\n",
      "[('oname', 'fabrication method'), ('name', 'sculpture technique'), ('p', 'http://www.wikidata.org/entity/Q21711025'), ('obj', 'http://www.wikidata.org/prop/direct/P2079')]\n",
      "[('oname', 'subclass of'), ('name', 'visual artwork'), ('p', 'http://www.wikidata.org/entity/Q4502142'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'subclass of'), ('name', 'physical object'), ('p', 'http://www.wikidata.org/entity/Q223557'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'subclass of'), ('name', 'small monument'), ('p', 'http://www.wikidata.org/entity/Q1746392'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'Wikimedia outline'), ('name', 'outline of sculpture'), ('p', 'http://www.wikidata.org/entity/Q7112723'), ('obj', 'http://www.wikidata.org/prop/direct/P5125')]\n",
      "[('oname', \"topic's main category\"), ('name', 'Category:Sculptures'), ('p', 'http://www.wikidata.org/entity/Q6928659'), ('obj', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Exploring sculpture BGP\n",
    "#[('p', 'http://www.wikidata.org/entity/Q860861'), ('name', 'sculpture')\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q860861 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12452c40",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 275,
   "id": "32cfa687-0e0b-4501-a0d8-9be64f3a0228",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'described by source'), ('name', 'The Nuttall Encyclopædia'), ('p', 'http://www.wikidata.org/entity/Q3181656'), ('obj', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('oname', 'described by source'), ('name', \"Riemann's Music Dictionary (1901–1904)\"), ('p', 'http://www.wikidata.org/entity/Q27680201'), ('obj', 'http://www.wikidata.org/prop/direct/P1343')]\n",
      "[('oname', 'follows'), ('name', 'neoclassicism'), ('p', 'http://www.wikidata.org/entity/Q14378'), ('obj', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('oname', 'follows'), ('name', 'Pre-romanticism'), ('p', 'http://www.wikidata.org/entity/Q2614483'), ('obj', 'http://www.wikidata.org/prop/direct/P155')]\n",
      "[('oname', 'followed by'), ('name', 'Post-romanticism'), ('p', 'http://www.wikidata.org/entity/Q1125039'), ('obj', 'http://www.wikidata.org/prop/direct/P156')]\n",
      "[('oname', 'instance of'), ('name', 'literary movement'), ('p', 'http://www.wikidata.org/entity/Q3326717'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'instance of'), ('name', 'architectural style'), ('p', 'http://www.wikidata.org/entity/Q32880'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'instance of'), ('name', 'art style'), ('p', 'http://www.wikidata.org/entity/Q1792644'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'instance of'), ('name', 'art movement'), ('p', 'http://www.wikidata.org/entity/Q968159'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'instance of'), ('name', 'cultural movement'), ('p', 'http://www.wikidata.org/entity/Q2198855'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'has part'), ('name', 'Romantic music'), ('p', 'http://www.wikidata.org/entity/Q207591'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('oname', 'has part'), ('name', 'Romantic painting'), ('p', 'http://www.wikidata.org/entity/Q3088366'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('oname', 'has part'), ('name', 'romantic drama'), ('p', 'http://www.wikidata.org/entity/Q3038946'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('oname', 'has part'), ('name', 'Romantic philosophy'), ('p', 'http://www.wikidata.org/entity/Q12775412'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('oname', 'has part'), ('name', 'romantic literature'), ('p', 'http://www.wikidata.org/entity/Q5977111'), ('obj', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('oname', \"topic's main category\"), ('name', 'Category:Romanticism'), ('p', 'http://www.wikidata.org/entity/Q7154269'), ('obj', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q37068 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   #FILTER(REGEX(?name,\"sculpture\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 279,
   "id": "021ed5a4-e80d-4ec9-8f7b-480b0b47c1eb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', \"topic's main template\"), ('name', 'Template:Infobox art movement'), ('p', 'http://www.wikidata.org/entity/Q14412130'), ('obj', 'http://www.wikidata.org/prop/direct/P1424')]\n",
      "[('oname', 'different from'), ('name', 'art group'), ('p', 'http://www.wikidata.org/entity/Q4502119'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'has list'), ('name', 'list of art movements'), ('p', 'http://www.wikidata.org/entity/Q1293970'), ('obj', 'http://www.wikidata.org/prop/direct/P2354')]\n",
      "[('oname', 'subclass of'), ('name', 'art'), ('p', 'http://www.wikidata.org/entity/Q735'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'subclass of'), ('name', 'cultural movement'), ('p', 'http://www.wikidata.org/entity/Q2198855'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', \"topic's main category\"), ('name', 'Category:Art movements'), ('p', 'http://www.wikidata.org/entity/Q7458526'), ('obj', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#Exploring art style\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q968159 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   #FILTER(REGEX(?name,\"sculpture\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 280,
   "id": "74a73e22-0aaa-4bc0-b96d-f96efd340a5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'field of work'), ('name', 'art'), ('p', 'http://www.wikidata.org/entity/Q735'), ('obj', 'http://www.wikidata.org/prop/direct/P101')]\n",
      "[('oname', 'different from'), ('name', 'art society'), ('p', 'http://www.wikidata.org/entity/Q12160242'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'different from'), ('name', 'artist collective'), ('p', 'http://www.wikidata.org/entity/Q1400264'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'different from'), ('name', 'art genre'), ('p', 'http://www.wikidata.org/entity/Q1792379'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'different from'), ('name', 'art movement'), ('p', 'http://www.wikidata.org/entity/Q968159'), ('obj', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('oname', 'subclass of'), ('name', 'group of humans'), ('p', 'http://www.wikidata.org/entity/Q16334295'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'subclass of'), ('name', 'voluntary organization'), ('p', 'http://www.wikidata.org/entity/Q48204'), ('obj', 'http://www.wikidata.org/prop/direct/P279')]\n",
      "[('oname', 'instance of'), ('name', 'organization'), ('p', 'http://www.wikidata.org/entity/Q43229'), ('obj', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('oname', 'model item'), ('name', 'Les XX'), ('p', 'http://www.wikidata.org/entity/Q463283'), ('obj', 'http://www.wikidata.org/prop/direct/P5869')]\n",
      "[('oname', \"topic's main category\"), ('name', 'Category:Artist groups and collectives'), ('p', 'http://www.wikidata.org/entity/Q6417957'), ('obj', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#Exploring art style\n",
    "#Exploring art group\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q4502119 ?obj ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   #FILTER(REGEX(?name,\"sculpture\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 284,
   "id": "abea8371-4d92-486f-a3bd-7f1c3fd08f09",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'visual art'), ('name', 'instance of'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('obj', 'http://www.wikidata.org/entity/Q36649')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#Exploring art style - art group - art genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "     ?obj ?p wd:Q1792379.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   FILTER(REGEX(?oname,\"visual\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 285,
   "id": "5669b974-ff25-4cec-91d3-a1f845f9ce2c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'Pori city board of visual arts'), ('name', 'field of work'), ('p', 'http://www.wikidata.org/prop/direct/P101'), ('obj', 'http://www.wikidata.org/entity/Q21607642')]\n",
      "[('oname', 'visual artist'), ('name', 'product or material produced'), ('p', 'http://www.wikidata.org/prop/direct/P1056'), ('obj', 'http://www.wikidata.org/entity/Q3391743')]\n",
      "[('oname', 'visual art of the United States'), ('name', 'facet of'), ('p', 'http://www.wikidata.org/prop/direct/P1269'), ('obj', 'http://www.wikidata.org/entity/Q2311158')]\n",
      "[('oname', 'Armenian visual arts'), ('name', 'facet of'), ('p', 'http://www.wikidata.org/prop/direct/P1269'), ('obj', 'http://www.wikidata.org/entity/Q4198730')]\n",
      "[('oname', 'visual artwork'), ('name', 'different from'), ('p', 'http://www.wikidata.org/prop/direct/P1889'), ('obj', 'http://www.wikidata.org/entity/Q4502142')]\n",
      "[('oname', 'visual music'), ('name', 'subclass of'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('obj', 'http://www.wikidata.org/entity/Q7936612')]\n",
      "[('oname', 'visual art of the 2nd half of 20th-century'), ('name', 'subclass of'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('obj', 'http://www.wikidata.org/entity/Q11998967')]\n",
      "[('oname', 'visual artist'), ('name', 'field of this occupation'), ('p', 'http://www.wikidata.org/prop/direct/P425'), ('obj', 'http://www.wikidata.org/entity/Q3391743')]\n",
      "[('oname', 'Brain networks for visual creativity: a functional connectivity study of planning a visual artwork.'), ('name', 'main subject'), ('p', 'http://www.wikidata.org/prop/direct/P921'), ('obj', 'http://www.wikidata.org/entity/Q37518887')]\n",
      "[('oname', 'Image and Narrative: online magazine of the visual narrative'), ('name', 'main subject'), ('p', 'http://www.wikidata.org/prop/direct/P921'), ('obj', 'http://www.wikidata.org/entity/Q15756017')]\n",
      "[('oname', 'The sculpted word : Keats, ekphrasis, and the visual arts'), ('name', 'main subject'), ('p', 'http://www.wikidata.org/prop/direct/P921'), ('obj', 'http://www.wikidata.org/entity/Q101161141')]\n",
      "[('oname', 'Allegory of the visual arts and music'), ('name', 'main subject'), ('p', 'http://www.wikidata.org/prop/direct/P921'), ('obj', 'http://www.wikidata.org/entity/Q100926444')]\n",
      "[('oname', 'Rebeca: Revista Brasileira de Estudos de Cinema e Audiovisual'), ('name', 'main subject'), ('p', 'http://www.wikidata.org/prop/direct/P921'), ('obj', 'http://www.wikidata.org/entity/Q50816837')]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#Exploring art style - art group - art genre - visual art\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "     ?obj ?p wd:Q36649.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   FILTER(REGEX(?oname,\"visual\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 291,
   "id": "0b16639a-db13-45f9-8c5f-f3157c5f674c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('oname', 'sculpture'), ('name', 'subclass of'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('obj', 'http://www.wikidata.org/entity/Q860861')]\n",
      "[('oname', 'Model and Surrealist Sculpture (Modele et sculpture surrealiste)'), ('name', 'instance of'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('obj', 'http://www.wikidata.org/entity/Q91941050')]\n",
      "[('oname', 'Political Prisoner (maquette for sculpture)'), ('name', 'instance of'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('obj', 'http://www.wikidata.org/entity/Q91931714')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
    "#Exploring art style - art group - art genre - visual art - visual artwork\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?oname ?name ?p ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "      ?obj ?p wd:Q4502142.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oname.\n",
    "   FILTER(REGEX(?oname,\"sculpture\"^^xsd:string))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "883fa2c5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
