{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c8df61ea",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e4bf9dd9",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-08bdb103fb-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8e900203",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Sherlock Holmes explorative search\") \n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> Investigate the canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes) and which are the films and tv series related to the canon. We are also interested in the Emmy Awards and hiw many awards each film won. \n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wd:Q35610` | Arthur Conan Doyle        | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q35610 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Arthur Conan Doyle**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes)\n",
    "\n",
    "2. Identify the BGP for film\n",
    "\n",
    "3. Identify the BGP for television series\n",
    "\n",
    "4. Return the year of publication (take the first one if there are more publication dates) for each film and television series related to the canon of Sherlock Holmes (the result set must be a list of triples film/tv series IRI, label and year).\n",
    "\n",
    "5. Find who acted in more than one film or tv series related to the canon of Sherlock Holmes (the result set must be a list of triples actor/actress IRI, label and #film).\n",
    "\n",
    "6. Identify the BGP for Primetime Emmy Award\n",
    "\n",
    "7. Return all the types of Primetime Emmy Award (the result set must be a list of couples award IRI and label).\n",
    "\n",
    "8. For each film and television series related to the canon of Sherlock Holmes, return the number of Primetime Emmy Awards they won (return also the objects who did not win an Award) (the result set must be a list of triples film/tv series IRI, label and #award)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1eddc02d",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for canon of Sherlock Holmes (see https://en.wikipedia.org/wiki/Canon_of_Sherlock_Holmes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c8249fe8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('canon', 'http://www.wikidata.org/entity/Q2316684'), ('name', 'canon of Sherlock Holmes')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q35610 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q35610 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "# he author hass a \"notable work\" property IRI P800. Let's explore its objects\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q35610 wdt:P800 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# canon of Sherlock Holmes is one of the objects. It's IRI is Q2316684. Let's look at its propeties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "#Let's check the instance of property objects\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2316684 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We can see it's a book series IRI Q277759. We can write our final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?canon ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?canon wdt:P31 wd:Q277759 .\n",
    "   # get the label\n",
    "   ?canon sc:name ?name.\n",
    "   FILTER regex(?name, \"canon of Sherlock Holmes\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c24082d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "a9472b34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('canon', 'http://www.wikidata.org/entity/Q2316684'), ('name', 'canon of Sherlock Holmes')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?canon ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?canon wdt:P31 wd:Q277759 .\n",
    "   # get the label\n",
    "   ?canon sc:name ?name.\n",
    "   FILTER regex(?name, \"canon of Sherlock Holmes\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "103a0587",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for film"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "18b3cfca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# let's try to find subjects with \"film\" in the name\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p ?obj .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   FILTER regex(?name, \"film\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# The subject \"film poster\" IRI P3383 might help us because each film should have a poster.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P3383 ?obj .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Cool! we found some films. Let's take \"The Paradine Case\" an see if it's an instance of film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q506638 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We found the film entity IRI Q11424. Let's see what it's an instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11424 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# No results were returned. let's try the subclass property\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11424 wdt:P279 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# \"Moving image\" seems like a good super class to use.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P279 wd:Q10301427 .\n",
    "   # get the label\n",
    "   ?film sc:name ?name.\n",
    "   FILTER regex(?name, \"film\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67c7d873",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "42d90edc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P279 wd:Q10301427 .\n",
    "   # get the label\n",
    "   ?film sc:name ?name.\n",
    "   FILTER regex(?name, \"film\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "91ad8e0c",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for television series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "02f4a8d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# let's try to find subjects with \"television series\" in the name\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P279 wd:Q10301427 .\n",
    "   # get the label\n",
    "   ?film sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We have television pprogram IRI Q15416. Maybe television series is a subclass of it. Let's find out\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?tvs wdt:P279 wd:Q15416 .\n",
    "   # get the label\n",
    "   ?tvs sc:name ?name.\n",
    "   FILTER regex(?name, \".*series.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We found it! let's optimize the filter\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?tvs wdt:P279 wd:Q15416 .\n",
    "   # get the label\n",
    "   ?tvs sc:name ?name.\n",
    "   FILTER regex(?name, \"^television series$\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a410eb23",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "442d79f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?tvs wdt:P279 wd:Q15416 .\n",
    "   # get the label\n",
    "   ?tvs sc:name ?name.\n",
    "   FILTER regex(?name, \"^television series$\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c030290",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return the year of publication (take the first one if there are more publication dates) for each film and television series related to the canon of Sherlock Holmes (the result set must be a list of triples film/tv series IRI, label and year)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "aa117d82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q4523158'), ('name', 'Sherlock Holmes'), ('year', '2013')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q200396'), ('name', 'Sherlock Holmes'), ('year', '2009')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q247643'), ('name', 'Elementary'), ('year', '2013')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q192837'), ('name', 'Sherlock'), ('year', '2010')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q604180'), ('name', 'The Private Life of Sherlock Holmes'), ('year', '1970')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q387306'), ('name', 'Sherlock Holmes'), ('year', '1984')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243643'), ('name', 'Sherlock Holmes: A Game of Shadows'), ('year', '2011')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's fetch all films and tv series that are related to the canon of Sherlock Holmes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Now let's fetch the publication year\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name MIN(?date) as ?date\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P577 ?date} .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Some films are missing the publication year. Let's check if they the \"incepion\" property\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name MIN(?date) as ?date\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P577 ?date} .\n",
    "   OPTIONAL {?s wdt:P571 ?date} .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Some dates are still missing. For the title Sherlock Holmes Q4523158 for example. let's see if we can find a property to use\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4523158 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# The property \"start time\" IRI P580 could be the solution. Let's try it\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name MIN(?date) as ?date\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P577 ?date} .\n",
    "   OPTIONAL {?s wdt:P571 ?date} .\n",
    "   OPTIONAL {?s wdt:P580 ?date} .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We have all the dates. Let's pick out the year only\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name MIN(year(?date) as ?date) as ?year\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P577 ?date} .\n",
    "   OPTIONAL {?s wdt:P571 ?date} .\n",
    "   OPTIONAL {?s wdt:P580 ?date} .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "80256a06",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "54424a26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q4523158'), ('name', 'Sherlock Holmes'), ('year', '2013')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q200396'), ('name', 'Sherlock Holmes'), ('year', '2009')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q247643'), ('name', 'Elementary'), ('year', '2013')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q192837'), ('name', 'Sherlock'), ('year', '2010')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q604180'), ('name', 'The Private Life of Sherlock Holmes'), ('year', '1970')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q387306'), ('name', 'Sherlock Holmes'), ('year', '1984')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243643'), ('name', 'Sherlock Holmes: A Game of Shadows'), ('year', '2011')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name MIN(year(?date) as ?date) as ?year\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P577 ?date} .\n",
    "   OPTIONAL {?s wdt:P571 ?date} .\n",
    "   OPTIONAL {?s wdt:P580 ?date} .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6bbd47e0",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find who acted in more than one film or tv series related to the canon of Sherlock Holmes (the result set must be a list of triples actor/actress IRI, label and #film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c3e9ddd2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('act', 'http://www.wikidata.org/entity/Q236167'), ('name', 'Kelly Reilly'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q440926'), ('name', 'Geraldine James'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q190386'), ('name', 'Rachel McAdams'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q45647'), ('name', 'Eddie Marsan'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q1102002'), ('name', 'Clive Russell'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q160432'), ('name', 'Jude Law'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q165219'), ('name', 'Robert Downey Jr.'), ('works', '2')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's use the 2009 \"Sherlock Holmes\" movie tofind the actors and actresses of it\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?ps ?psName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   ?s ?ps ?obj .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?ps sc:name ?psName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# The \"cast member\" property IRI P161 will give us what we need\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?act ?name count(?s) as ?works\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   ?s wdt:P161 ?act .\n",
    "   # get the label\n",
    "   ?act sc:name ?name.\n",
    "}\n",
    "GROUP BY ?act ?name\n",
    "HAVING (count(?s) > 1)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "891f3a85",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "daaed76d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('act', 'http://www.wikidata.org/entity/Q236167'), ('name', 'Kelly Reilly'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q440926'), ('name', 'Geraldine James'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q190386'), ('name', 'Rachel McAdams'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q45647'), ('name', 'Eddie Marsan'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q1102002'), ('name', 'Clive Russell'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q160432'), ('name', 'Jude Law'), ('works', '2')]\n",
      "[('act', 'http://www.wikidata.org/entity/Q165219'), ('name', 'Robert Downey Jr.'), ('works', '2')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?act ?name count(?s) as ?works\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   ?s wdt:P161 ?act .\n",
    "   # get the label\n",
    "   ?act sc:name ?name.\n",
    "}\n",
    "GROUP BY ?act ?name\n",
    "HAVING (count(?s) > 1)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f54a419",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Identify the BGP for Primetime Emmy Award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "957942b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q1044427'), ('name', 'Primetime Emmy Award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's find all subjects that have Primetime Emmy Award in the name\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p ?obj .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   FILTER regex(?name, \"Primetime Emmy Award\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We found \"Primetime Emmy Award for Outstanding Unstructured Reality Program\" IRI Q18153303. Let's explore it\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q18153303 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# It's in instance of Primetime Emmy Award IRI Q1044427\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1044427 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Which in turn is an instanxe of Emmy Award IRI Q123737\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q123737 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "   FILTER regex(?name, \"^Primetime Emmy Award$\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c882bcea",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "cb892fa5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q1044427'), ('name', 'Primetime Emmy Award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q123737 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "   FILTER regex(?name, \"^Primetime Emmy Award$\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fc77aba0",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Return all the types of Primetime Emmy Award (the result set must be a list of couples award IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a0a403f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q18153303'), ('name', 'Primetime Emmy Award for Outstanding Unstructured Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445729'), ('name', 'Primetime Emmy Award for Outstanding Actress in a Short Form Comedy or Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989439'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2604800'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243506'), ('name', 'Primetime Emmy Award for Outstanding Made for Television Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1277961'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3123491'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20714679'), ('name', 'Primetime Emmy Award for Outstanding Limited Miniseries')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17048589'), ('name', 'Primetime Emmy Award for Outstanding Narrator')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989447'), ('name', 'Primetime Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285970'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q530923'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989442'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243507'), ('name', 'Primetime Emmy Award for Outstanding Original Main Title Theme Music')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285504'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2981152'), ('name', 'Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q583972'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q945887'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989453'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1286639'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# We just retunr all instances of Primetime Emmy Award \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q1044427 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16c758ee",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "f18d85a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q18153303'), ('name', 'Primetime Emmy Award for Outstanding Unstructured Reality Program')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q28445729'), ('name', 'Primetime Emmy Award for Outstanding Actress in a Short Form Comedy or Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989439'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2604800'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243506'), ('name', 'Primetime Emmy Award for Outstanding Made for Television Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1277961'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3123491'), ('name', 'Primetime Emmy Award for Outstanding Writing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20714679'), ('name', 'Primetime Emmy Award for Outstanding Limited Miniseries')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17048589'), ('name', 'Primetime Emmy Award for Outstanding Narrator')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989447'), ('name', 'Primetime Emmy Award for Outstanding Lead Actress in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285970'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q530923'), ('name', 'Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989442'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7243507'), ('name', 'Primetime Emmy Award for Outstanding Original Main Title Theme Music')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1285504'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2981152'), ('name', 'Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q583972'), ('name', 'Primetime Emmy Award for Outstanding Directing for a Drama Series')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q945887'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q989453'), ('name', 'Primetime Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1286639'), ('name', 'Primetime Emmy Award for Outstanding Supporting Actor in a Drama Series')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q1044427 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f9c1c65",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "For each film and television series related to the canon of Sherlock Holmes, return the number of Primetime Emmy Awards they won (return also the objects who did not win an Award) (the result set must be a list of triples film/tv series IRI, label and #award)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "e3f0c132",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q4523158'), ('name', 'Sherlock Holmes'), ('awards', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q200396'), ('name', 'Sherlock Holmes'), ('awards', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q247643'), ('name', 'Elementary'), ('awards', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q192837'), ('name', 'Sherlock'), ('awards', '8')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q604180'), ('name', 'The Private Life of Sherlock Holmes'), ('awards', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q387306'), ('name', 'Sherlock Holmes'), ('awards', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243643'), ('name', 'Sherlock Holmes: A Game of Shadows'), ('awards', '0')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Exploring the propeties connecting a film or series to the award\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pa ?paname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   ?s ?pa ?award .\n",
    "   ?award wdt:P31 wd:Q1044427 .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "   ?pa sc:name ?paname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# The property \"award received\" IRI P166 is what we need\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name ?award\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P166 ?award . ?award wdt:P31 wd:Q1044427 } .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# Let's group and count them\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name count(?award) as ?awards\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P166 ?award . ?award wdt:P31 wd:Q1044427 } .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fbeb0b42",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "7db7da51",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q4523158'), ('name', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q200396'), ('name', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q247643'), ('name', 'Elementary'), ('award', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q192837'), ('name', 'Sherlock'), ('award', '8')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q604180'), ('name', 'The Private Life of Sherlock Holmes'), ('award', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q387306'), ('name', 'Sherlock Holmes'), ('award', '0')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243643'), ('name', 'Sherlock Holmes: A Game of Shadows'), ('award', '0')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name count(?award) as ?award\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?s wdt:P31 wd:Q5398426} UNION {?s wdt:P31 wd:Q11424} .\n",
    "   ?s ?p wd:Q2316684 .\n",
    "   OPTIONAL {?s wdt:P166 ?award . ?award wdt:P31 wd:Q1044427 } .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "GROUP BY ?s ?name\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
