{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c95811f2",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "0f8d0be6",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-2f5532311b-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9932a2a7",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Euro explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the Euro currency, which are the countries that currently use the Euro and which were their currencies before the Euro. Take a look also to other currencies and find which are the most used."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09dad505",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q38`| Italy   | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d7f4c78c",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q38 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Italy**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for currency\n",
    "\n",
    "2. Return the countries which currently use Euro\n",
    "\n",
    "3. Return the countries belonging to the European Union, with a currency different from the Euro (return also their currency).\n",
    "\n",
    "4. For each country that now uses Euro return which was the currencies used before\n",
    "\n",
    "5. Return all types of dollar in the world (US Dollar, Australian Dollar, ecc...)\n",
    "\n",
    "6. Return the currencies used in at least 2 different countries (return also the number of countries using each currency).\n",
    "\n",
    "7. Consider the currencies obtained in task 6, for each currency return the number of people using that currency (hint: consider the maximum popolation available for each country)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67fc8030",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for currency"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "571c4779",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4591'), ('name', 'Cape Verdean escudo')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q17436613'), ('name', 'Java rupiah')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5802556'), ('name', 'dena')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q22078645'), ('name', \"Chang'an coin\")]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q22907080'), ('name', 'Carthaginian currency')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1542162'), ('name', 'Tarì')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3658911'), ('name', 'Carlino')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q383187'), ('name', 'notgeld')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q487060'), ('name', 'Denga')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q503370'), ('name', 'Kraków złoty')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q7567738'), ('name', 'South Korean won')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q8047970'), ('name', 'Korean won')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q172524'), ('name', 'Serbian dinar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4241612'), ('name', 'Fiume krone')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q788472'), ('name', 'Dutch guilder')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2282987'), ('name', 'Aargau frank')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2299665'), ('name', 'French Indian rupee')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2753547'), ('name', 'Örtug')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16837804'), ('name', 'French sol')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Let's filter the properties to see if there's a currency property.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER regex(?name, \".*currency.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Greate! we found the currency property IRI P38. Let's look at the objects of the triple\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 wdt:P38 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "#We found the euro. We will check its propeties to see what makes it a currency.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# The Euro is an instance of currency. The BGP of currency should be all the instances of currency IRI Q8142\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f26e30ba",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "79ccc8bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4591'), ('name', 'Cape Verdean escudo')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q17436613'), ('name', 'Java rupiah')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5802556'), ('name', 'dena')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q22078645'), ('name', \"Chang'an coin\")]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q22907080'), ('name', 'Carthaginian currency')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1542162'), ('name', 'Tarì')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3658911'), ('name', 'Carlino')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q383187'), ('name', 'notgeld')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q487060'), ('name', 'Denga')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q503370'), ('name', 'Kraków złoty')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q7567738'), ('name', 'South Korean won')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q8047970'), ('name', 'Korean won')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q172524'), ('name', 'Serbian dinar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4241612'), ('name', 'Fiume krone')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q788472'), ('name', 'Dutch guilder')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2282987'), ('name', 'Aargau frank')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2299665'), ('name', 'French Indian rupee')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2753547'), ('name', 'Örtug')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16837804'), ('name', 'French sol')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c402d2ad",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Return the countries which currently use Euro"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "0441ccee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q237'), ('name', 'Vatican City')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q238'), ('name', 'San Marino')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q27'), ('name', 'Ireland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q41'), ('name', 'Greece')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q55'), ('name', 'Netherlands')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# When we looked at all the properties of the euro, we found a property \"country\" IRI P17.\n",
    "# We can use it to find all the countries that use the euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ed6ab84",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "8ec89a19",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q237'), ('name', 'Vatican City')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q238'), ('name', 'San Marino')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q27'), ('name', 'Ireland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q41'), ('name', 'Greece')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q55'), ('name', 'Netherlands')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b221dfd6",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Return the countries belonging to the European Union, with a currency different from the Euro (return also their currency)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "2a2a71a4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q36'), ('name', 'Poland'), ('currecny', 'http://www.wikidata.org/entity/Q123213'), ('currecnyName', 'złoty')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria'), ('currecny', 'http://www.wikidata.org/entity/Q172540'), ('currecnyName', 'Bulgarian lev')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28'), ('name', 'Hungary'), ('currecny', 'http://www.wikidata.org/entity/Q47190'), ('currecnyName', 'forint')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania'), ('currecny', 'http://www.wikidata.org/entity/Q131645'), ('currecnyName', 'Romanian leu')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom'), ('currecny', 'http://www.wikidata.org/entity/Q25224'), ('currecnyName', 'pound sterling')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia'), ('currecny', 'http://www.wikidata.org/entity/Q26360'), ('currecnyName', 'Croatian kuna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic'), ('currecny', 'http://www.wikidata.org/entity/Q131016'), ('currecnyName', 'Czech koruna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('name', 'Denmark'), ('currecny', 'http://www.wikidata.org/entity/Q25417'), ('currecnyName', 'Danish krone')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('name', 'Sweden'), ('currecny', 'http://www.wikidata.org/entity/Q122922'), ('currecnyName', 'Swedish krona')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's try to find what makes Italy part of the european union\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "# Let's filter to see if there's a \"member\" propety\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER regex(?name, \".*member.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# There actually is a \"member of\" property IRI P463. I wasn't expecting to find it that easily if I'm being honest.\n",
    "# Let's see what's on the other side of the predicate and filter for the European Union\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 wdt:P463 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "   FILTER regex(?name, \".*European Union.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We found the European Union it's IRI is Q458.\n",
    "# Now let's fetch all European countries and thier currencies\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currecny ?currecnyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?country wdt:P463 wd:Q458 ;\n",
    "            wdt:P38 ?currecny .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currecny sc:name ?currecnyName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# And finaly we execllude countries that use the Euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currecny ?currecnyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?country wdt:P463 wd:Q458 ;\n",
    "            wdt:P38 ?currecny .}\n",
    "   MINUS\n",
    "   {?country wdt:P463 wd:Q458 ;\n",
    "            wdt:P38 wd:Q4916 .}\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currecny sc:name ?currecnyName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8d6c1bbd",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "92b15e9f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q36'), ('name', 'Poland'), ('currecny', 'http://www.wikidata.org/entity/Q123213'), ('currecnyName', 'złoty')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria'), ('currecny', 'http://www.wikidata.org/entity/Q172540'), ('currecnyName', 'Bulgarian lev')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28'), ('name', 'Hungary'), ('currecny', 'http://www.wikidata.org/entity/Q47190'), ('currecnyName', 'forint')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania'), ('currecny', 'http://www.wikidata.org/entity/Q131645'), ('currecnyName', 'Romanian leu')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom'), ('currecny', 'http://www.wikidata.org/entity/Q25224'), ('currecnyName', 'pound sterling')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia'), ('currecny', 'http://www.wikidata.org/entity/Q26360'), ('currecnyName', 'Croatian kuna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic'), ('currecny', 'http://www.wikidata.org/entity/Q131016'), ('currecnyName', 'Czech koruna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('name', 'Denmark'), ('currecny', 'http://www.wikidata.org/entity/Q25417'), ('currecnyName', 'Danish krone')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('name', 'Sweden'), ('currecny', 'http://www.wikidata.org/entity/Q122922'), ('currecnyName', 'Swedish krona')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currecny ?currecnyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {?country wdt:P463 wd:Q458 ;\n",
    "            wdt:P38 ?currecny .}\n",
    "   MINUS\n",
    "   {?country wdt:P463 wd:Q458 ;\n",
    "            wdt:P38 wd:Q4916 .}\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currecny sc:name ?currecnyName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6b7623ca",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "For each country that now uses Euro return which was the currencies used before"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "id": "e6e3f27e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2356178'), ('currencyName', 'French Polynesian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q214393'), ('currencyName', 'CFP Franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2616592'), ('currencyName', 'French West African franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2356117'), ('currencyName', 'New Caledonian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany'), ('currency', 'http://www.wikidata.org/entity/Q16068'), ('currencyName', 'Deutsche Mark')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia'), ('currency', 'http://www.wikidata.org/entity/Q129983'), ('currencyName', 'Estonian kroon')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia'), ('currency', 'http://www.wikidata.org/entity/Q133011'), ('currencyName', 'Latvian lats')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia'), ('currency', 'http://www.wikidata.org/entity/Q178874'), ('currencyName', 'Slovak koruna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia'), ('currency', 'http://www.wikidata.org/entity/Q208133'), ('currencyName', 'Slovenian tolar')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra'), ('currency', 'http://www.wikidata.org/entity/Q189097'), ('currencyName', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus'), ('currency', 'http://www.wikidata.org/entity/Q193716'), ('currencyName', 'Cypriot pound')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta'), ('currency', 'http://www.wikidata.org/entity/Q174467'), ('currencyName', 'Maltese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta'), ('currency', 'http://www.wikidata.org/entity/Q3658911'), ('currencyName', 'Carlino')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco'), ('currency', 'http://www.wikidata.org/entity/Q1047040'), ('currencyName', 'Monegasque franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q237'), ('name', 'Vatican City'), ('currency', 'http://www.wikidata.org/entity/Q183354'), ('currencyName', 'Vatican lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q238'), ('name', 'San Marino'), ('currency', 'http://www.wikidata.org/entity/Q1063029'), ('currencyName', 'Sammarinese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q2836792'), ('currencyName', 'bora')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q1402037'), ('currencyName', 'Spanish dinero')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q15634537'), ('currencyName', 'Spanish Guinea peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q1620502'), ('currencyName', 'Catalan peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q189097'), ('currencyName', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium'), ('currency', 'http://www.wikidata.org/entity/Q232415'), ('currencyName', 'Belgian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium'), ('currency', 'http://www.wikidata.org/entity/Q13437153'), ('currencyName', 'Belga')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg'), ('currency', 'http://www.wikidata.org/entity/Q213940'), ('currencyName', 'Luxembourg franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland'), ('currency', 'http://www.wikidata.org/entity/Q203354'), ('currencyName', 'Finnish markka')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania'), ('currency', 'http://www.wikidata.org/entity/Q1130620'), ('currencyName', 'Lithuanian talonas')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania'), ('currency', 'http://www.wikidata.org/entity/Q25627'), ('currencyName', 'Lithuanian litas')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's first get the countries that use the euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# Now we get all the currencies of each country\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currency  ?currencyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   ?currency wdt:P31 wd:Q8142 ; \n",
    "             wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currency sc:name ?currencyName.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# And finally we filter out the euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currency  ?currencyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   ?currency wdt:P31 wd:Q8142 ; \n",
    "             wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currency sc:name ?currencyName.\n",
    "   FILTER (str(?currencyName) != \"euro\")\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ae490b5c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "id": "9755f25c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2356178'), ('currencyName', 'French Polynesian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q214393'), ('currencyName', 'CFP Franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2616592'), ('currencyName', 'French West African franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q2356117'), ('currencyName', 'New Caledonian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany'), ('currency', 'http://www.wikidata.org/entity/Q16068'), ('currencyName', 'Deutsche Mark')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia'), ('currency', 'http://www.wikidata.org/entity/Q129983'), ('currencyName', 'Estonian kroon')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia'), ('currency', 'http://www.wikidata.org/entity/Q133011'), ('currencyName', 'Latvian lats')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia'), ('currency', 'http://www.wikidata.org/entity/Q178874'), ('currencyName', 'Slovak koruna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia'), ('currency', 'http://www.wikidata.org/entity/Q208133'), ('currencyName', 'Slovenian tolar')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra'), ('currency', 'http://www.wikidata.org/entity/Q189097'), ('currencyName', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus'), ('currency', 'http://www.wikidata.org/entity/Q193716'), ('currencyName', 'Cypriot pound')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta'), ('currency', 'http://www.wikidata.org/entity/Q3658911'), ('currencyName', 'Carlino')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta'), ('currency', 'http://www.wikidata.org/entity/Q174467'), ('currencyName', 'Maltese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco'), ('currency', 'http://www.wikidata.org/entity/Q1047040'), ('currencyName', 'Monegasque franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco'), ('currency', 'http://www.wikidata.org/entity/Q184172'), ('currencyName', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q237'), ('name', 'Vatican City'), ('currency', 'http://www.wikidata.org/entity/Q183354'), ('currencyName', 'Vatican lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q238'), ('name', 'San Marino'), ('currency', 'http://www.wikidata.org/entity/Q1063029'), ('currencyName', 'Sammarinese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q2836792'), ('currencyName', 'bora')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q1402037'), ('currencyName', 'Spanish dinero')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q15634537'), ('currencyName', 'Spanish Guinea peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q1620502'), ('currencyName', 'Catalan peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('currency', 'http://www.wikidata.org/entity/Q189097'), ('currencyName', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium'), ('currency', 'http://www.wikidata.org/entity/Q232415'), ('currencyName', 'Belgian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium'), ('currency', 'http://www.wikidata.org/entity/Q13437153'), ('currencyName', 'Belga')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg'), ('currency', 'http://www.wikidata.org/entity/Q213940'), ('currencyName', 'Luxembourg franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland'), ('currency', 'http://www.wikidata.org/entity/Q203354'), ('currencyName', 'Finnish markka')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania'), ('currency', 'http://www.wikidata.org/entity/Q1130620'), ('currencyName', 'Lithuanian talonas')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania'), ('currency', 'http://www.wikidata.org/entity/Q25627'), ('currencyName', 'Lithuanian litas')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name ?currency  ?currencyName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4916 wdt:P17 ?country .\n",
    "   ?currency wdt:P31 wd:Q8142 ; \n",
    "             wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?country sc:name ?name.\n",
    "   ?currency sc:name ?currencyName.\n",
    "   FILTER (str(?currencyName) != \"euro\")\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "065df48e",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return all types of dollar in the world (US Dollar, Australian Dollar, ecc...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "8fe2246d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712659'), ('name', 'Texas Dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q209792'), ('name', 'Jamaican dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1104069'), ('name', 'Canadian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4597'), ('name', 'Solomon Islands dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2411666'), ('name', 'Newfoundland dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q242988'), ('name', 'Liberian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q261447'), ('name', 'Straits dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4592'), ('name', 'Fijian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712663'), ('name', 'Antigua dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712665'), ('name', 'Nevisian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2407759'), ('name', 'Malaya and British Borneo dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2414453'), ('name', 'Sarawak dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1323382'), ('name', 'New Brunswick dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q242890'), ('name', 'Trinidad and Tobago dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q942092'), ('name', 'British West Indies dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q15039722'), ('name', 'spanish dollar')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# That's easy, we just filter for currencies with \"dollar\" in the name\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "   FILTER regex(?name, \".*dollar.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19f3e0ed",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "059483c6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712659'), ('name', 'Texas Dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q209792'), ('name', 'Jamaican dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1104069'), ('name', 'Canadian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4597'), ('name', 'Solomon Islands dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2411666'), ('name', 'Newfoundland dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q242988'), ('name', 'Liberian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q261447'), ('name', 'Straits dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4592'), ('name', 'Fijian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712663'), ('name', 'Antigua dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3712665'), ('name', 'Nevisian dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2407759'), ('name', 'Malaya and British Borneo dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2414453'), ('name', 'Sarawak dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1323382'), ('name', 'New Brunswick dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q242890'), ('name', 'Trinidad and Tobago dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q942092'), ('name', 'British West Indies dollar')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q15039722'), ('name', 'spanish dollar')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "   FILTER regex(?name, \".*dollar.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8dfb4e6",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Return the currencies used in at least 2 different countries (return also the number of countries using each currency)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "77496798",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1852872'), ('name', 'New Hebrides franc'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4124886'), ('name', 'Red Army won'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3658911'), ('name', 'Carlino'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro'), ('countries', '23')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q618653'), ('name', 'North Yemeni rial'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q106615825'), ('name', 'valadia'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1983857'), ('name', 'Abkhazian apsar'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q373429'), ('name', 'Yugoslav dinar'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5639749'), ('name', 'Haitian livre'), ('countries', '4')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q19953480'), ('name', 'chuzan-tsuho'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2273865'), ('name', 'Italian Somaliland somalo'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q207669'), ('name', 'Hungarian pengő'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2329625'), ('name', 'Austrian krone'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1415602'), ('name', 'Kopeck'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q56374559'), ('name', 'Manat'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5527593'), ('name', 'Gaucho'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q786009'), ('name', 'Montenegrin perper'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q861690'), ('name', 'West African CFA franc'), ('countries', '8')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# First we find all currencies and their countries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name ?country ?countryName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "   ?country sc:name ?countryName.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# Now we count the countries of each currency\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name count(?country) as ?countries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "GROUP BY ?currency ?name\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# Lastly we remove currencies used in less than two countries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name count(?country) as ?countries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "GROUP BY ?currency ?name\n",
    "HAVING (COUNT(?country) >= 2)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61ef2a75",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "id": "9cb7a0e2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1852872'), ('name', 'New Hebrides franc'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4124886'), ('name', 'Red Army won'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3658911'), ('name', 'Carlino'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro'), ('countries', '23')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q618653'), ('name', 'North Yemeni rial'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q106615825'), ('name', 'valadia'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1983857'), ('name', 'Abkhazian apsar'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q373429'), ('name', 'Yugoslav dinar'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5639749'), ('name', 'Haitian livre'), ('countries', '4')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q19953480'), ('name', 'chuzan-tsuho'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2273865'), ('name', 'Italian Somaliland somalo'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q207669'), ('name', 'Hungarian pengő'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q2329625'), ('name', 'Austrian krone'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1415602'), ('name', 'Kopeck'), ('countries', '3')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q56374559'), ('name', 'Manat'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q5527593'), ('name', 'Gaucho'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q786009'), ('name', 'Montenegrin perper'), ('countries', '2')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q861690'), ('name', 'West African CFA franc'), ('countries', '8')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name count(?country) as ?countries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "GROUP BY ?currency ?name\n",
    "HAVING (COUNT(?country) >= 2)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c5fb1688",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider the currencies obtained in task 6, for each currency return the number of people using that currency (hint: consider the maximum popolation available for each country)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "id": "0d07054c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q201799'), ('name', 'ngultrum'), ('population', '807610')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q186794'), ('name', 'Botswana pula'), ('population', '2291661')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q926028'), ('name', 'Brazilian cruzado'), ('population', '213317639')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1983857'), ('name', 'Abkhazian apsar'), ('population', '3959100')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4154909'), ('name', 'Danzig mark'), ('population', '366730')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3053201'), ('name', 'Colombian real'), ('population', '49065615')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q240292'), ('name', 'South Vietnamese đồng'), ('population', '19582000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q214393'), ('name', 'CFP Franc'), ('population', '67063703')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q855244'), ('name', 'Biafran pound'), ('population', '13500000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q211694'), ('name', 'Malawian kwacha'), ('population', '18622104')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q700109'), ('name', 'Danzig gulden'), ('population', '366730')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q199886'), ('name', 'Tajikistani somoni'), ('population', '8921343')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q572213'), ('name', 'East Timor centavo coins'), ('population', '1296311')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q207514'), ('name', 'Paraguayan guaraní'), ('population', '6811297')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1249084'), ('name', 'quinarius'), ('population', '50000000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q200753'), ('name', 'Mozambican metical'), ('population', '29668834')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q21531507'), ('name', 'Belarusian ruble'), ('population', '9349645')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q645246'), ('name', 'Argenteus'), ('population', '50000000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4588'), ('name', 'Samoan tālā'), ('population', '196440')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q132643'), ('name', 'Norwegian krone'), ('population', '5391369')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's fetch the populations of the countries of the last task. We will use only the euro for now to validate the results\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name ?country  ?countryName ?population\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   ?country wdt:P1082 ?population .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "   ?country sc:name ?countryName.\n",
    "   FILTER regex(?name, \"euro\", \"i\")\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# Now we can group by the currency and su the populations of all the countries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name sum(?population) as ?population\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   ?country wdt:P1082 ?population .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "   FILTER regex(?name, \"euro\", \"i\")\n",
    "}\n",
    "GROUP BY ?currency ?name \n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "# Now we remove the filter for euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name sum(?population) as ?population\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   ?country wdt:P1082 ?population .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "GROUP BY ?currency ?name \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "99455d6f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "id": "ce83f4ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currency', 'http://www.wikidata.org/entity/Q201799'), ('name', 'ngultrum'), ('population', '807610')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q186794'), ('name', 'Botswana pula'), ('population', '2291661')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q926028'), ('name', 'Brazilian cruzado'), ('population', '213317639')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1983857'), ('name', 'Abkhazian apsar'), ('population', '3959100')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4154909'), ('name', 'Danzig mark'), ('population', '366730')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q3053201'), ('name', 'Colombian real'), ('population', '49065615')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q240292'), ('name', 'South Vietnamese đồng'), ('population', '19582000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q214393'), ('name', 'CFP Franc'), ('population', '67063703')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q855244'), ('name', 'Biafran pound'), ('population', '13500000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q211694'), ('name', 'Malawian kwacha'), ('population', '18622104')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q700109'), ('name', 'Danzig gulden'), ('population', '366730')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q199886'), ('name', 'Tajikistani somoni'), ('population', '8921343')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q572213'), ('name', 'East Timor centavo coins'), ('population', '1296311')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q207514'), ('name', 'Paraguayan guaraní'), ('population', '6811297')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q1249084'), ('name', 'quinarius'), ('population', '50000000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q200753'), ('name', 'Mozambican metical'), ('population', '29668834')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q21531507'), ('name', 'Belarusian ruble'), ('population', '9349645')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q645246'), ('name', 'Argenteus'), ('population', '50000000')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q4588'), ('name', 'Samoan tālā'), ('population', '196440')]\n",
      "[('currency', 'http://www.wikidata.org/entity/Q132643'), ('name', 'Norwegian krone'), ('population', '5391369')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currency ?name sum(?population) as ?population\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?currency wdt:P31 wd:Q8142 ;\n",
    "            wdt:P17 ?country .\n",
    "   ?country wdt:P1082 ?population .\n",
    "   # get the label\n",
    "   ?currency sc:name ?name.\n",
    "}\n",
    "GROUP BY ?currency ?name \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
