{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-86c32028f0-## \n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "       results = sparql.query()\n",
    "       json_results = results.convert()\n",
    "       if len(json_results['results']['bindings'])==0:\n",
    "          print(\"Empty\")\n",
    "          return 0\n",
    "    \n",
    "       for bindings in json_results['results']['bindings']:\n",
    "          print( [ (var, value['value'])  for var, value in bindings.items() ] )\n",
    "\n",
    "       return len(json_results['results']['bindings'])\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Tv series explorative search\") \n",
    "\n",
    "## Workflow 4\n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> we are interested in the TV series \"How I met your mother\" and we want to investigate the main aspects related to the actors and directors involved in the production, know the numerber of seasons and check what are the episodes which got the higher success/impact.\n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P4969`    | derivative work      | predicate |\n",
    "| `wd:Q147235` | How I met your mother        | node |\n",
    "| `wd:Q23831` | The Office (US)        | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q23831 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Office (US)**\n",
    "\n",
    "The workload should\n",
    "\n",
    "\n",
    "1. Return the number of seasons and episodes per season of the tv series\n",
    "\n",
    "2. Get the number of episodes in which the cast members played a role. Who are the most present actors?\n",
    "\n",
    "3. Check who is the actor who acted in more films while working on \"How I met your mother\" and who is the actor who participated in more films after the end of the tv series.\n",
    "\n",
    "4. Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members.\n",
    "\n",
    "5. Return how many of the actors who are members of the cast of the tv series have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "24a853ab-830c-422c-afd3-e9e015b8b8ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "# start your workflow here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('pName', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pName', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find predicate of the cast member ->P161\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE { \n",
    "\n",
    "wd:Q23831 ?p ?o .  FILTER(!isLiteral(?o))\n",
    "\n",
    "?p <http://schema.org/name> ?pName .\n",
    "\n",
    "} \n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "89780e10-645d-4cc8-9d63-8e06cf0a5805",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q5398426'), ('pName', 'television series')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find television series-> Q5398426\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE { \n",
    "\n",
    "wd:Q23831 wdt:P31 ?p .  FILTER(!isLiteral(?o))\n",
    "\n",
    "?p <http://schema.org/name> ?pName .\n",
    "\n",
    "} \n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "843a666e-2f78-4c56-84b1-7664589d76b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1154217'), ('pName', 'Ironfist Chinmi')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q691528'), ('pName', 'Wallace and Gromit')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8193809'), ('pName', 'Shomuni')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q33323'), ('pName', 'Everybody Hates Chris')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q500769'), ('pName', 'Freaks and Geeks')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find all tv series\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE { \n",
    "\n",
    "?p wdt:P31 wd:Q5398426.\n",
    "\n",
    "?p <http://schema.org/name> ?pName .\n",
    "\n",
    "} \n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "032c1b40-415a-4141-833e-cd4619fa87cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1110'), ('pName', 'attendance')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('pName', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2032'), ('pName', 'work period (end)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('pName', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2360'), ('pName', 'intended public')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4111'), ('pName', 'danskefilm TV Christmas calendar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4794'), ('pName', 'season starts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('pName', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('pName', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6118'), ('pName', 'season ends')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find properties of tv series   (number of episodes->P1113 , number of seasons->P2437) \n",
    "# (start time -> P580 , end time -> P582)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE { \n",
    "\n",
    "?tvseries wdt:P31 wd:Q5398426;\n",
    "            ?p ?o.\n",
    "\n",
    "?p <http://schema.org/name> ?pName .\n",
    "filter regex(?pName,\"start|end\",'i')\n",
    "} \n",
    "Order by ?p\n",
    "LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "fb27eb26-91df-4156-9235-dcf1fba8d118",
   "metadata": {},
   "outputs": [],
   "source": [
    "1. Return the number of seasons and episodes per season of the tv series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "55150863-ff27-4012-9393-227ca7037c4c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('episodes', '88'), ('season', '4')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('episodes', '18'), ('season', '1')]\n",
      "[('tvseriesName', 'Recess'), ('episodes', '129'), ('season', '3')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('episodes', '1758'), ('season', '1')]\n",
      "[('tvseriesName', 'Prime Minister and I'), ('episodes', '17'), ('season', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get number of seasons and episodes per season\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseriesName ?episodes ?season\n",
    "WHERE { \n",
    "\n",
    "    ?tvseries wdt:P31 wd:Q5398426;\n",
    "              wdt:P1113 ?episodes;\n",
    "              wdt:P2437 ?season.\n",
    "\n",
    " ?tvseries <http://schema.org/name> ?tvseriesName .\n",
    "\n",
    "} \n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "3d64e67a-28bd-4e26-aa96-0d8c0779238e",
   "metadata": {},
   "outputs": [],
   "source": [
    "2. Get the number of episodes in which the cast members played a role. Who are the most present actors?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7828ceb8-109d-4a43-acd7-2ebed71e26e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('pName', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1881'), ('pName', 'list of characters')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "2"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find chracter characters-P674\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?p ?pName\n",
    " WHERE { \n",
    "\n",
    "            \n",
    "                       \n",
    "         wd:Q147235 ?p ?o    .  \n",
    "         ?p <http://schema.org/name> ?pName .\n",
    "         filter regex(?pName,\"character\",'i')\n",
    "        \n",
    "        } \n",
    "  order by ?pName\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "bb117a61-9579-4030-aae5-d0890fa0cc03",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3630'), ('pName', 'Babelio author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('pName', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('pName', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('pName', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('pName', 'Fandom article ID')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find the preformer ID -> P175\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?p ?pName\n",
    " WHERE { \n",
    "\n",
    "        \n",
    "         \n",
    "         wd:Q147235 wdt:P674 ?role .\n",
    "                     \n",
    "         ?role ?p ?o.            \n",
    "         ?p <http://schema.org/name> ?pName .\n",
    "         \n",
    "        \n",
    "        } \n",
    "  order by ?pName\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 182,
   "id": "801f656e-4196-4861-991d-8802c784dec5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmemberName', 'Željko Ivanek'), ('numberoffilms', '1907')]\n",
      "[('castmemberName', 'Šimon Caban'), ('numberoffilms', '118')]\n",
      "[('castmemberName', 'Şevval Sam'), ('numberoffilms', '110')]\n",
      "[('castmemberName', 'Łukasz Simlat'), ('numberoffilms', '382')]\n",
      "[('castmemberName', 'Łukasz Lewandowski'), ('numberoffilms', '3300')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 182,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the number of episodes which the cast members played a role\n",
    "queryString = \"\"\"\n",
    "\n",
    " SELECT DISTINCT ?castmemberName (sum(?episodes) as ?numberoffilms)\n",
    " \n",
    "         WHERE { \n",
    "                 {\n",
    "                     SELECT DISTINCT ?castmemberName ?tvseries ?episodes\n",
    "\n",
    "                             WHERE { \n",
    "                                            ?role wdt:P175 ?castmember.\n",
    "                                            ?tvseries wdt:P161 ?castmember;\n",
    "                                                    wdt:P1113 ?episodes.FILTER(isNumeric(?episodes))\n",
    "\n",
    "                                             ?castmember <http://schema.org/name> ?castmemberName .\n",
    "                                             \n",
    "                                             \n",
    "                                           \n",
    "\n",
    "                                    } \n",
    "            }\n",
    "        }\n",
    "\n",
    "\n",
    "order by desc (?castmemberName)\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 180,
   "id": "4cafd886-9a87-4b6b-903b-fecaf4baca03",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmemberName', 'Claus Bue'), ('numberoffilms', '27')]\n",
      "[('castmemberName', 'Kurt Ravn'), ('numberoffilms', '25')]\n",
      "[('castmemberName', 'Solbjørg Højfeldt'), ('numberoffilms', '24')]\n",
      "[('castmemberName', 'Henning Jensen'), ('numberoffilms', '23')]\n",
      "[('castmemberName', 'Kjeld Norgaard'), ('numberoffilms', '23')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 180,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# the most present actors in films\n",
    "queryString = \"\"\"\n",
    "\n",
    " SELECT DISTINCT ?castmemberName (count(?castmemberName) as ?numberoffilms)\n",
    " \n",
    "         WHERE { \n",
    "                 {\n",
    "                     SELECT DISTINCT ?castmemberName ?tvseries\n",
    "\n",
    "                             WHERE { \n",
    "                                            ?role wdt:P175 ?castmember.\n",
    "                                            ?tvseries wdt:P161 ?castmember;\n",
    "                                                    wdt:P1113 ?episodes.\n",
    "\n",
    "                                             ?castmember <http://schema.org/name> ?castmemberName .\n",
    "\n",
    "                                    } \n",
    "            }\n",
    "        }\n",
    "\n",
    "#group by ?tvseries\n",
    "order by desc (?numberoffilms)\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "2cf6ea3d-4462-4134-b773-7e51f707f792",
   "metadata": {},
   "outputs": [
    {
     "ename": "SyntaxError",
     "evalue": "invalid syntax (3165244330.py, line 1)",
     "output_type": "error",
     "traceback": [
      "\u001b[0;36m  File \u001b[0;32m\"/tmp/ipykernel_21409/3165244330.py\"\u001b[0;36m, line \u001b[0;32m1\u001b[0m\n\u001b[0;31m    3. Check who is the actor who acted in more films while working on \"How I met your mother\" and who is the actor who participated in more films after the end of the tv series.\u001b[0m\n\u001b[0m           ^\u001b[0m\n\u001b[0;31mSyntaxError\u001b[0m\u001b[0;31m:\u001b[0m invalid syntax\n"
     ]
    }
   ],
   "source": [
    "3. Check who is the actor who acted in more films while working on \"How I met your mother\" and who is the actor who participated in more films after the end of the tv series."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "596a3d40-ae73-4315-a3f0-f71ac042fb57",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('start', '2005-09-19T00:00:00Z'), ('end', '2014-03-31T00:00:00Z')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find start an end of \"How I met your mother\" (start:2005 , end: 2014)\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?start ?end\n",
    " WHERE { \n",
    "\n",
    "            wd:Q147235 wdt:P31 wd:Q5398426;\n",
    "                       wdt:P161 ?castmember;\n",
    "                       wdt:P580 ?start ;\n",
    "                       wdt:P582 ?end .\n",
    "                       \n",
    "        } \n",
    "  \n",
    "LIMIT 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "70ae5fd4-e431-4c26-83ab-069d93bfe86c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q594265'), ('castmemberName', 'Neil Jackson'), ('start', '2006-06-28T00:00:00Z'), ('end', '2006-09-13T00:00:00Z')]\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q454698'), ('castmemberName', 'Darcy Rose Byrnes'), ('start', '2006-09-24T00:00:00Z'), ('end', '2011-05-08T00:00:00Z')]\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q3943077'), ('castmemberName', 'Ryan Michelle Bathe'), ('start', '2007-09-26T00:00:00Z'), ('end', '2013-01-22T00:00:00Z')]\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q454698'), ('castmemberName', 'Darcy Rose Byrnes'), ('start', '2005-09-20T00:00:00Z'), ('end', '2009-05-14T00:00:00Z')]\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q635974'), ('castmemberName', 'Michael Trucco'), ('start', '2011-01-20T00:00:00Z'), ('end', '2012-06-15T00:00:00Z')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# actor who acted in more films while working on \"How I met your mother\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castmember ?castmemberName ?start ?end\n",
    "   WHERE { \n",
    "   \n",
    "\n",
    "                    ?tvseries wdt:P31 wd:Q5398426;\n",
    "                                wdt:P161 ?castmember;\n",
    "                                wdt:P580 ?start ;\n",
    "                                wdt:P582 ?end .\n",
    "\n",
    "        {\n",
    "          SELECT DISTINCT ?castmember \n",
    "                 WHERE { \n",
    "                        wd:Q147235 wdt:P31 wd:Q5398426;\n",
    "                                     wdt:P161 ?castmember.\n",
    "                        }\n",
    "                        group by ?castmember\n",
    "\n",
    "         }  \n",
    "\n",
    "       FILTER(?start > \"2005-09-19\"^^xsd:dateTime && ?end < \"2014-03-31\"^^xsd:dateTime).\n",
    "       \n",
    "       ?castmember <http://schema.org/name> ?castmemberName .\n",
    "                \n",
    "  }              \n",
    " group by ?castmemberName\n",
    "\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "09280173-1785-4e2c-8200-8e95b2b2a1a1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmemberName', 'Amy Acker'), ('numberoffilm', '6')]\n",
      "[('castmemberName', 'Virginia Williams'), ('numberoffilm', '4')]\n",
      "[('castmemberName', 'Todd Stashwick'), ('numberoffilm', '4')]\n",
      "[('castmemberName', 'Mircea Monroe'), ('numberoffilm', '4')]\n",
      "[('castmemberName', 'Phill Lewis'), ('numberoffilm', '4')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the number of actor who acted in more films while working on \"How I met your mother\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castmemberName  (Count(?castmember ) AS ?numberoffilm)\n",
    "   WHERE { \n",
    "   \n",
    "\n",
    "       ?tvseries wdt:P31 wd:Q5398426;\n",
    "                 wdt:P161 ?castmember;\n",
    "                 wdt:P580 ?start ;\n",
    "                 wdt:P582 ?end .\n",
    "\n",
    "        {\n",
    "            SELECT DISTINCT ?castmember \n",
    "                 WHERE { \n",
    "                        wd:Q147235 wdt:P31 wd:Q5398426;\n",
    "                                     wdt:P161 ?castmember.\n",
    "\n",
    "                        }\n",
    "                        group by ?castmember\n",
    "         }  \n",
    "         \n",
    "         \n",
    "         \n",
    "       FILTER(?start > \"2005-09-19\"^^xsd:dateTime && ?end < \"2014-03-31\"^^xsd:dateTime).\n",
    "\n",
    "       ?castmember <http://schema.org/name> ?castmemberName .\n",
    "                \n",
    "  }              \n",
    "order by desc (?numberoffilm)\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0ff5a7f2-e30e-4021-82c3-4c1b591a9c36",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmemberName', 'Matt Frewer'), ('numberoffilm', '4')]\n",
      "[('castmemberName', 'Kal Penn'), ('numberoffilm', '4')]\n",
      "[('castmemberName', 'Camryn Manheim'), ('numberoffilm', '3')]\n",
      "[('castmemberName', 'Scoot McNairy'), ('numberoffilm', '3')]\n",
      "[('castmemberName', 'Michael Gladis'), ('numberoffilm', '3')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# get the number of actor who acted in more films after \"How I met your mother\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castmemberName  (Count(?castmember ) AS ?numberoffilm)\n",
    "   WHERE { \n",
    "   \n",
    "\n",
    "                    ?tvseries wdt:P31 wd:Q5398426;\n",
    "                                wdt:P161 ?castmember;\n",
    "                                wdt:P580 ?start ;\n",
    "                                wdt:P582 ?end .\n",
    "\n",
    "        {\n",
    "            SELECT DISTINCT ?castmember \n",
    "                 WHERE { \n",
    "                        wd:Q147235 wdt:P31 wd:Q5398426;\n",
    "                                     wdt:P161 ?castmember.\n",
    "\n",
    "                        }\n",
    "                        group by ?castmember\n",
    "\n",
    "         }\n",
    "         \n",
    "\n",
    "       FILTER(?start > \"2014-03-31\"^^xsd:dateTime).\n",
    "\n",
    "       ?castmember <http://schema.org/name> ?castmemberName .\n",
    "                \n",
    "  }              \n",
    "order by desc (?numberoffilm)\n",
    "LIMIT 5\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b884acaa-879d-4e5d-8f1d-31f3fa3f50a7",
   "metadata": {},
   "outputs": [],
   "source": [
    "4. Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "03e0438f-d83b-42a5-a62e-ef9b46bea69c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseriesName', 'How I Met Your Mother'), ('episodes', '208'), ('season', '9'), ('numberofcastmember', '480')]\n",
      "[('tvseriesName', 'The Office'), ('episodes', '201'), ('season', '9'), ('numberofcastmember', '25')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "2"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseriesName ?episodes  ?season (Count(?castmember ) AS ?numberofcastmember)\n",
    "   WHERE { \n",
    "   \n",
    "   Values ?tvseries{ wd:Q147235 wd:Q23831 }\n",
    "   \n",
    "       ?tvseries wdt:P31 wd:Q5398426;\n",
    "                 wdt:P161 ?castmember;\n",
    "                 wdt:P1113 ?episodes;\n",
    "                 wdt:P2437 ?season.\n",
    "\n",
    "\n",
    "\n",
    "       ?tvseries <http://schema.org/name> ?tvseriesName .\n",
    "                \n",
    "  }              \n",
    "order by desc (?numberofcastmember)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6b403f85-d754-43df-8c85-9fed35a6a664",
   "metadata": {},
   "outputs": [],
   "source": [
    "5. Return how many of the actors who are members of the cast of the tv series have Kavin Bacon number equal to 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "31825f8c-b59a-4e04-a1fa-0e887b706d6d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmember', 'http://www.wikidata.org/entity/Q3454165'), ('castmemberName', 'Kevin Bacon')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 186,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find Kevin Bacon->Q3454165\n",
    "queryString = \"\"\"\n",
    "\n",
    "        SELECT DISTINCT ?castmember ?castmemberName\n",
    "        WHERE { \n",
    "\n",
    "            ?tvseries wdt:P31 wd:Q5398426;\n",
    "                       wdt:P161 ?castmember.\n",
    "      \n",
    "         ?castmember <http://schema.org/name> ?castmemberName .\n",
    "        filter regex(?castmemberName,\"Kevin Bacon\",'i')\n",
    "\n",
    "        } \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 247,
   "id": "2697e1b0-7842-4721-b7ad-ea90b4178c4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Adán Canto')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Aldis Hodge')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Amanda Clayton')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Annie Parisse')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Connie Nielsen')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Gregg Henry')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'James Purefoy')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Jere Shea')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Jeremy Rudd')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Jessica Stroup')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Jill Hennessy')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Jonathan Tucker')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Kevin Bacon')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Kevin Bacon')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', 'Kevin Chapman')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Kyle Catlett')]\n",
      "[('tvseriesName', 'City on a Hill'), ('castmemberName', \"Mark O'Brien\")]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Michael Ealy')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Natalie Zea')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Nico Tortorella')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Sam Underwood')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Shawn Ashmore')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Tiffany Boone')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Valorie Curry')]\n",
      "[('tvseriesName', 'The Following'), ('castmemberName', 'Zuleikha Robinson')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "25"
      ]
     },
     "execution_count": 247,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#find all  members of the cast of the tv series have Kavin Bacon number equal to 1\n",
    "queryString = \"\"\"\n",
    "\n",
    "        SELECT DISTINCT ?tvseriesName  ?castmemberName  \n",
    "        WHERE { \n",
    "\n",
    "          ?tvseries wdt:P31 wd:Q5398426;\n",
    "                      wdt:P161 wd:Q3454165.\n",
    "                      \n",
    "         ?tvseries wdt:P161 ?castmember.\n",
    "         \n",
    "         ?tvseries <http://schema.org/name> ?tvseriesName .\n",
    "         ?castmember <http://schema.org/name> ?castmemberName .\n",
    "         \n",
    "         \n",
    "       \n",
    "        } \n",
    "order by ?castmemberName\n",
    "limit 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 251,
   "id": "233a89bc-37e5-48a8-8c7c-9e10dd7a46d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q51236439'), ('tvseriesName', '.exe')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1308592'), ('tvseriesName', '100 Girls')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q52262982'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q222867'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q98131145'), ('tvseriesName', '2 Hearts')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q214013'), ('tvseriesName', '21 Grams')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q3525931'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q229636'), ('tvseriesName', '3 Needles')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q276071'), ('tvseriesName', '90210')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q108946'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q72276'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q114076'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23816407'), ('tvseriesName', 'A New York Love Story')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q4659446'), ('tvseriesName', 'A Shine of Rainbows')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q300560'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q4664493'), ('tvseriesName', 'Abby Singer')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13522795'), ('tvseriesName', 'About Last Night')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13428258'), ('tvseriesName', 'Act of God')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q30753727'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q4690807'), ('tvseriesName', 'Aftershock')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q30605938'), ('tvseriesName', 'Alex')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1032169'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q58201277'), ('tvseriesName', 'All Relative')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13217606'), ('tvseriesName', 'Almost Human')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q22906308'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13429336'), ('tvseriesName', 'American Dream')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q464060'), ('tvseriesName', 'American Dreamz')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q27536767'), ('tvseriesName', 'American Fable')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q16526429'), ('tvseriesName', 'American Pastoral')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q482425'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q4753356'), ('tvseriesName', 'And So It Goes')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q16203055'), ('tvseriesName', 'Anesthesia')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13429628'), ('tvseriesName', 'Angel')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q960125'), ('tvseriesName', 'Animal House')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q548388'), ('tvseriesName', 'Animorphs')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q27957904'), ('tvseriesName', 'Anon')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q2752839'), ('tvseriesName', 'Any Day Now')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13430239'), ('tvseriesName', 'Apocrypha')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q106428'), ('tvseriesName', 'Apollo 13')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q20382729'), ('tvseriesName', 'Arrival')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q19363543'), ('tvseriesName', 'Ask Me Anything')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q31540'), ('tvseriesName', 'Assassination Games')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13430885'), ('tvseriesName', 'Atonement')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1125349'), ('tvseriesName', 'Autumn in New York')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q48741294'), ('tvseriesName', 'Baby Blue')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q48742522'), ('tvseriesName', 'Bad Code')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q798673'), ('tvseriesName', 'Bad Company')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q17861569'), ('tvseriesName', 'Bad Faith')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q63881148'), ('tvseriesName', 'Ball in the House')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q789477'), ('tvseriesName', 'Ballistic: Ecks vs. Sever')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 251,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find all tv series played by cast memebrs which have Kavin Bacon number equal to 1\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName\n",
    "  WHERE {\n",
    "                 ?tvseries wdt:P161 ?castmember.\n",
    "                     {\n",
    "                             SELECT DISTINCT  ?castmember \n",
    "                                      WHERE { \n",
    "                                               ?tvseries wdt:P31 wd:Q5398426;\n",
    "                                                             wdt:P161 wd:Q3454165.\n",
    "\n",
    "                                                 ?tvseries wdt:P161 ?castmember.\n",
    "                                            }\n",
    "                    }\n",
    "            \n",
    "                 \n",
    "         \n",
    "         ?tvseries <http://schema.org/name> ?tvseriesName .\n",
    "         ?castmember <http://schema.org/name> ?castmemberName .\n",
    "         \n",
    "         \n",
    "       \n",
    "        } \n",
    "order by ?tvseriesName\n",
    "limit 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 253,
   "id": "4b3bdfe4-3691-40d7-ba0d-4a41f0713f2d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castmemberName', 'Sarah Shahi'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Brett Cullen'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Ebon Moss-Bachrach'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Kevin Chapman'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Jim Caviezel'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Michael Emerson'), ('tvseriesName', '.exe')]\n",
      "[('castmemberName', 'Emmanuelle Chriqui'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Aimee Graham'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Jonathan Tucker'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Jaime Pressly'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Marissa Ribisi'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Katherine Heigl'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Larisa Oleynik'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'James DeBello'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Kristina Anapau'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Eric Szmanda'), ('tvseriesName', '100 Girls')]\n",
      "[('castmemberName', 'Dennis Haysbert'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Carlos Bernard'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Kevin Chapman'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Leslie Hope'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Željko Ivanek'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Kiefer Sutherland'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Sarah Clarke'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Xander Berkeley'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Dennis Hopper'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Jude Ciccolella'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Penny Johnson Jerald'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Elisha Cuthbert'), ('tvseriesName', '11:00 pm\\xa0- 12:00 am')]\n",
      "[('castmemberName', 'Devon Aoki'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Kerry Rossall'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Marc Macaulay'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'James Remar'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'John Cenatiempo'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Mark Boone Junior'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Paul Walker'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Cole Hauser'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Thom Barry'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Neal H. Moritz'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Amaury Nolasco'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Tyrese Gibson'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Eva Mendes'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Drew Sidora'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'MC Jin'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Michael Ealy'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Ludacris'), ('tvseriesName', '2 Fast 2 Furious')]\n",
      "[('castmemberName', 'Adán Canto'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Kari Matchett'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Radha Mitchell'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Tahmoh Penikett'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Tiera Skovbye'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Jacob Elordi'), ('tvseriesName', '2 Hearts')]\n",
      "[('castmemberName', 'Annie Corley'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Naomi Watts'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Benicio del Toro'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Stephen Bridgewater'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Eddie Marsan'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Clea DuVall'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Charlotte Gainsbourg'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Catherine Dent'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Tom Irwin'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Kevin Chapman'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Melissa Leo'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Danny Huston'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Sean Penn'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Lew Temple'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'John Rubinstein'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', \"Denis O'Hare\"), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Paul Calderón'), ('tvseriesName', '21 Grams')]\n",
      "[('castmemberName', 'Tómas Lemarquis'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Richard Sammel'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Eriq Ebouaney'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Kevin Costner'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Connie Nielsen'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Tao Okamoto'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Hiroyuki Sanada'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Rila Fukushima'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Marc Andréoni'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Dragana Atlija'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Amber Heard'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Jonas Bloquet'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Hailee Steinfeld'), ('tvseriesName', '3 Days to Kill')]\n",
      "[('castmemberName', 'Olympia Dukakis'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Chloë Sevigny'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Sandra Oh'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Lucy Liu'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Shawn Ashmore'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Stockard Channing'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Cory Bowles'), ('tvseriesName', '3 Needles')]\n",
      "[('castmemberName', 'Matt Lanter'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Shenae Grimes'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Ryan Eggold'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Rob Estes'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Jessica Walter'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Jessica Stroup'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Lori Loughlin'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'AnnaLynne McCord'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Dustin Milligan'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Trevor Donovan'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Jessica Lowndes'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Tristan Wilds'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Gillian Zinser'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Michael Steger'), ('tvseriesName', '90210')]\n",
      "[('castmemberName', 'Cuba Gooding Jr.'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Aaron Sorkin'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Kiefer Sutherland'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Matt Craven'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'John M. Jackson'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'David Bowe'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'J. A. Preston'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Wolfgang Bodison'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Geoffrey Nauffts'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Alex Wexo'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Noah Wyle'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Christopher Guest'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Michael DeLorenzo'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Kevin Bacon'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Cameron Thor'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Kevin Pollak'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Xander Berkeley'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Tom Cruise'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'James Marshall'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Jack Nicholson'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Demi Moore'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'J. T. Walsh'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Joshua Malina'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Ron Ostrow'), ('tvseriesName', 'A Few Good Men')]\n",
      "[('castmemberName', 'Aksel Hennie'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Bruce Willis'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'April Grace'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Iván Kamarás'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Mary Elizabeth Winstead'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Jai Courtney'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Cole Hauser'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Pavel Lychnikoff'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Amaury Nolasco'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Scott Michael Campbell'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Aldis Hodge'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Sebastian Koch'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Mike Dopud'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Roman Luknár'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Rasha Bukvic'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Sergey Kolesnikov'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Yuliya Snigir'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Attila Árpa'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Ján Gallovič'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Megalyn Echikunwoke'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Anne Vyalitsyna'), ('tvseriesName', 'A Good Day to Die Hard')]\n",
      "[('castmemberName', 'Olivia Williams'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Alan Tudyk'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Alice Bendová'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Upír Krejčí'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Christopher Cazenove'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Rudolf Kubík'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Nick Brimble'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Shannyn Sossamon'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Paul Bettany'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Laura Fraser'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', \"Steven O'Donnell\"), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Bérénice Bejo'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Rufus Sewell'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Daniel Rous'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Mark Addy'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Scott Handy'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'James Purefoy'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Heath Ledger'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'David Schneider'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Karel Dobrý'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Roger Ashton-Griffiths'), ('tvseriesName', \"A Knight's Tale\")]\n",
      "[('castmemberName', 'Sam Underwood'), ('tvseriesName', 'A New York Love Story')]\n",
      "[('castmemberName', 'Apolla Echino'), ('tvseriesName', 'A New York Love Story')]\n",
      "[('castmemberName', 'Thomas Beaudoin'), ('tvseriesName', 'A New York Love Story')]\n",
      "[('castmemberName', 'Siobhan Flynn'), ('tvseriesName', 'A New York Love Story')]\n",
      "[('castmemberName', 'Connie Nielsen'), ('tvseriesName', 'A Shine of Rainbows')]\n",
      "[('castmemberName', 'Aidan Quinn'), ('tvseriesName', 'A Shine of Rainbows')]\n",
      "[('castmemberName', 'Jack Gleeson'), ('tvseriesName', 'A Shine of Rainbows')]\n",
      "[('castmemberName', 'Shirley MacLaine'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Greg Kinnear'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Lauren Holly'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'France Nuyen'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Christopher McDonald'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Joan Cusack'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Jay Thomas'), ('tvseriesName', 'A Smile Like Yours')]\n",
      "[('castmemberName', 'Jodie Foster'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Lloyd Kaufman'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Robin Tunney'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Taye Diggs'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Don Cheadle'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Patrick Swayze'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'John Waters'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Jennifer Aniston'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Patricia Arquette'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Robert Redford'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Matt Dillon'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Kieran Culkin'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Jake Gyllenhaal'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Jay O. Sanders'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Daniel Day-Lewis'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Jeff Goldblum'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Brad Pitt'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Stockard Channing'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Adam Carolla'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Mark Borchardt'), ('tvseriesName', 'Abby Singer')]\n",
      "[('castmemberName', 'Kevin V. Hard'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Regina Hall'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Paula Patton'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Christopher McDonald'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Adam Rodríguez'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Joy Bryant'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Bryan Callen'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Michael Ealy'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Jessica Lu'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Terrell Owens'), ('tvseriesName', 'About Last Night')]\n",
      "[('castmemberName', 'Reade Kelly'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'John McLoughlin'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Sam Waterston'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'S. Epatha Merkerson'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Steve Harris'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Jerry Orbach'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Lynn Cohen'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Robert John Burke'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Stephen Singer'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Chris Noth'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Steven Hill'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Jordan Lund'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Paul Austin'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Skipp Sudduth'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Melinda Mullins'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'John Newton'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Larry Attile'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Randy Danson'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Ralph Byers'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Mike Cicchetti'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'William Wise'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Frank Savino'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Andrew Pang'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Bob Leddy Jr.'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Darci Picoult'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Colleen Gallagher'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Michael Garfield'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'John Younger'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Mark McDonough'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Andrew Marks'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Ileen Getz'), ('tvseriesName', 'Act of God')]\n",
      "[('castmemberName', 'Sean Brosnan'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Mike Epps'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Bruce Willis'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Sophia Bush'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Cole Hauser'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Shawn Ashmore'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Ashton Holmes'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Patrick St. Esprit'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Rotimi'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Boyd Kestner'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Melissa Bolona'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Tiffany Brouwer'), ('tvseriesName', 'Acts of Violence')]\n",
      "[('castmemberName', 'Billy Otis'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Sam Waterston'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Chris Bauer'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jerry Grayson'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'S. Epatha Merkerson'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Joe Lisi'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jerry Orbach'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jennifer Garner'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Madison Arnold'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Benjamin Bratt'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Erin Daniels'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'John Fiore'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Sharon Angela'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Steven Hill'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Paul Austin'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Len Cariou'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Carolyn McCormick'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Gil Rogers'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jim Moody'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'David Edward Jones'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Tom Riis Farrell'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Charles Dumas'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Merri Ann Milwe'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Jennifer Estlin'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Mal Z. Lawrence'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Michael Hannon'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Andrew Weems'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'JoAnna Beckson'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Susan Willis'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'David Bryant'), ('tvseriesName', 'Aftershock')]\n",
      "[('castmemberName', 'Gregg Henry'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'David Hoflin'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Jeremy Jordan'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Chris Wood'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Melissa Benoist'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Teri Hatcher'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'David Harewood'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Chyler Leigh'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Curtis Lum'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Floriana Lima'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Katie McGrath'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Zayne Emory'), ('tvseriesName', 'Alex')]\n",
      "[('castmemberName', 'Katharine Isabelle'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Ona Grauer'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Jim Beaver'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Chad Lindberg'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Fredric Lehne'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Aldis Hodge'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Jeffrey Dean Morgan'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Samantha Smith'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Samantha Ferris'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Jessica Harmon'), ('tvseriesName', 'All Hell Breaks Loose')]\n",
      "[('castmemberName', 'Connie Nielsen'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Jonathan Sadowski'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'David Aaron Baker'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Erin Wilhelmi'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Sara Paxton'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Sarah Steele'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Al Thompson'), ('tvseriesName', 'All Relative')]\n",
      "[('castmemberName', 'Minka Kelly'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Karl Urban'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Gina Carano'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Lili Taylor'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Michael Ealy'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Mackenzie Crook'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Michael Irby'), ('tvseriesName', 'Almost Human')]\n",
      "[('castmemberName', 'Dichen Lachman'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Will Yun Lee'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Katie Stuart'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Olga Fonda'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Daniel Bernhardt'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Tamara Taylor'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Matt Frewer'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Marlene Forte'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'James Purefoy'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Michael Eklund'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Byron Mann'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Hiro Kanagawa'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Renée Elise Goldsberry'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Ato Essandoh'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Adam Busch'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Joel Kinnaman'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Kristin Lehman'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Martha Higareda'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Tahmoh Penikett'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Arnold Pinnock'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Andre Tricoteux'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Hayley Law'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Chris Conner'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Waleed Zuaiter'), ('tvseriesName', 'Altered Carbon')]\n",
      "[('castmemberName', 'Michael Moriarty'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'George Bartenieff'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Margaret Hilton'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Paul Hoover'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Josh Pais'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'S. Epatha Merkerson'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Jerry Orbach'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Željko Ivanek'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Sophie Hayden'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Matt Malloy'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'John Fiore'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Bernie McInerney'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Chris Noth'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Scott Sowers'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Steven Hill'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Chester A. Sims II'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Carolyn McCormick'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Guy Davis'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Stephen Payne'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'La Donna Mabry'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Charles Major'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Norma Fire'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Bernie Passeltiner'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Jeff Robins'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Jane Caldwell'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Joel Blake'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Mark Tymchyshyn'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Tanny McDonald'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Vic Noto'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Stephen Myles Berger'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'Kay Walbye'), ('tvseriesName', 'American Dream')]\n",
      "[('castmemberName', 'John Cho'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Willem Dafoe'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Marcia Gay Harden'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Carmen Electra'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Noureen DeWulf'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Chris Klein'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Andrew Divoff'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Dennis Quaid'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Perrey Reeves'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Tony Yalda'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Seth Meyers'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Judy Greer'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Jennifer Coolidge'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Mandy Moore'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Aldis Hodge'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Shohreh Aghdashloo'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Hugh Grant'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Michael D. Roberts'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Bernard White'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Haaz Sleiman'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Sam Golzari'), ('tvseriesName', 'American Dreamz')]\n",
      "[('castmemberName', 'Zuleikha Robinson'), ('tvseriesName', 'American Fable')]\n",
      "[('castmemberName', 'Richard Schiff'), ('tvseriesName', 'American Fable')]\n",
      "[('castmemberName', 'Kip Pardue'), ('tvseriesName', 'American Fable')]\n",
      "[('castmemberName', 'Gavin MacIntosh'), ('tvseriesName', 'American Fable')]\n",
      "[('castmemberName', 'Mandy Patinkin'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Dan Hedaya'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'David Strathairn'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Ewan McGregor'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Rupert Evans'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Jennifer Connelly'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Dakota Fanning'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Molly Parker'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Samantha Mathis'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Uzo Aduba'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Lyndon B. Johnson'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Peter Riegert'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Valorie Curry'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'David F. Case'), ('tvseriesName', 'American Pastoral')]\n",
      "[('castmemberName', 'Swoosie Kurtz'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'Jonathan Tucker'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'John Hurt'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'Richard Joseph Paul'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'Cynthia Nixon'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', \"Denis O'Hare\"), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'Stephen Guarino'), ('tvseriesName', 'An Englishman in New York')]\n",
      "[('castmemberName', 'Scott Shepherd'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Frances Sternhagen'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Diane Keaton'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Yaya DaCosta'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Annie Parisse'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Frankie Valli'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Michael Douglas'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Rob Reiner'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Margret Völker'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Amirah Vann'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Paloma Guzman'), ('tvseriesName', 'And So It Goes')]\n",
      "[('castmemberName', 'Katie Chang'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Sam Waterston'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Richard Thomas'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Corey Stoll'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Hannah Marks'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Mickey Sumner'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Glenn Close'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Yul Vazquez'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Annie Parisse'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Lucas Hedges'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Jessica Hecht'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Kristen Stewart'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Tim Blake Nelson'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Scott Cohen'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Michael K. Williams'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Natasha Gregson Wagner'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'K. Todd Freeman'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Gretchen Mol'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Lee Wilkof'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'David Aaron Baker'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Gloria Reuben'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Doris McCarthy'), ('tvseriesName', 'Anesthesia')]\n",
      "[('castmemberName', 'Michael Dolan'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Sam Waterston'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'S. Epatha Merkerson'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Jerry Orbach'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Fisher Stevens'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Benjamin Bratt'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Jill Hennessy'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'John Fiore'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Joan Copeland'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Steven Hill'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Ralph Buckley'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Carolyn McCormick'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Michael Willis'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Jon Lee'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'John C. Havens'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Danton Stone'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Elizabeth Connors'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Mimi Bensinger'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Tresha Rodriguez'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Keely Eastley'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Anthony Mangano'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Nelson Vasquez'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Tim Ewing'), ('tvseriesName', 'Angel')]\n",
      "[('castmemberName', 'Sunny Johnson'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Cesare Danova'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Stephen Furst'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Tim Matheson'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Tom Hulce'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Bruce McGill'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'John Belushi'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Kevin Bacon'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Mark Metcalf'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'John Vernon'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Donald Sutherland'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Karen Allen'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Douglas C. Kenney'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Verna Bloom'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Peter Riegert'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'James Widdoes'), ('tvseriesName', 'Animal House')]\n",
      "[('castmemberName', 'Mary Louise Weller'), ('tvseriesName', 'Animal House')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "500"
      ]
     },
     "execution_count": 253,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#find all  members of the cast of the tv series have Kavin Bacon number equal to 2\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?castmemberName ?tvseriesName\n",
    "       WHERE { \n",
    "              ?tvseries wdt:P161 ?castmember.\n",
    "              {\n",
    "                             SELECT DISTINCT ?tvseries\n",
    "                                WHERE {\n",
    "                                             ?tvseries wdt:P161 ?castmember.\n",
    "                                              {\n",
    "                                                  SELECT DISTINCT  ?castmember \n",
    "                                                      WHERE { \n",
    "                                                              ?tvseries wdt:P31 wd:Q5398426;\n",
    "                                                                        wdt:P161 wd:Q3454165.\n",
    "\n",
    "                                                              ?tvseries wdt:P161 ?castmember.\n",
    "                                                            }\n",
    "                                             }\n",
    "                                     }\n",
    "                 }\n",
    "                 MINUS{\n",
    "                        SELECT DISTINCT ?castmember\n",
    "                                WHERE {\n",
    "                                             ?tvseries wdt:P161 ?castmember.\n",
    "                                              {\n",
    "                                                  SELECT DISTINCT  ?castmember \n",
    "                                                      WHERE { \n",
    "                                                          ?tvseries wdt:P31 wd:Q5398426;\n",
    "                                                                    wdt:P161 wd:Q3454165.\n",
    "\n",
    "                                                          ?tvseries wdt:P161 ?castmember.\n",
    "\n",
    "                                                            }\n",
    "                                             }\n",
    "                                      }\n",
    "                              }\n",
    "                 \n",
    "                ?tvseries <http://schema.org/name> ?tvseriesName .\n",
    "                ?castmember <http://schema.org/name> ?castmemberName .\n",
    "             }\n",
    "               \n",
    "\n",
    "order by ?tvseriesName         \n",
    "limit 500\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0d68c5b5-5838-4b0d-b5e5-bf25574348e6",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
