{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "11e5e0d1",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "c3427c63",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-ed2c25a00e-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "089b56fa",
   "metadata": {},
   "source": [
    "# Sport Workflow Series (Basketball and NBA finals explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the world of basketball. Compare italian teams and US teams, country of citizenship of NBA players, and teams which won NBA finals."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8f9b3ed6",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q36159`| Lebron James      | node |\n",
    "| `wd:Q29545`| Kevin Durant      | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "080b9051",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q36159 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Lebron James**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for basketball player.\n",
    "\n",
    "2. Identify the BGP for basketball.\n",
    "\n",
    "3. Identify the BGP for basketball team.\n",
    "\n",
    "4. Return all italian basketball teams born before 1945 (the result set must be a list of triples basketball team IRI, label and year of inception).\n",
    "\n",
    "5. Identify the BGP for NBA finals\n",
    "\n",
    "6. Consider only the basketball teams which Kevin Durant and Lebron James played. Return the number of NBA finals won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team).\n",
    "\n",
    "7. Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, labels and #players)\n",
    "\n",
    "8. Identify the BGP for the NBA Most Valuable Player Award (MVP) (see https://en.wikipedia.org/wiki/NBA_Most_Valuable_Player_Award)\n",
    "\n",
    "9. Consider the players who won the NBA Most Valuable Player Award. Return for these players the number of NBA Most Valuable Player Award won in their career (the result set must be triples of player IRI, label and #victories)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fa132001",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for basketball player."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "16612281",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('name', 'league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1285'), ('name', 'Munzinger Sport number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1447'), ('name', 'Sports-Reference.com Olympic athlete ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1618'), ('name', 'sport number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8525451e-e331-4b02-ac7e-9004f9f8901c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10798782'), ('objname', 'television actor')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28389'), ('objname', 'screenwriter')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('objname', 'basketball player')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?name ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 wdt:P106 ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "39493d96-7644-4627-a26b-0001dea68b40",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18536342'), ('oname', 'competitive player')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4557'), ('oname', 'Indiana Basketball Hall of Fame ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28640'), ('oname', 'profession')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2685'), ('oname', 'Basketball Reference NBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3647'), ('oname', 'NBA.com player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3696'), ('oname', 'Sports-Reference.com college basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4561'), ('oname', 'Basketball Reference WNBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4744'), ('oname', 'Basketball-Reference.com NBA G League player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2066131'), ('oname', 'athlete')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3957'), ('oname', 'RealGM basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q48890'), ('oname', 'college basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3685'), ('oname', 'ESPN.com NBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P6063'), ('oname', 'Scoresway basketball person ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P5722'), ('oname', 'Greek Basket League ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P5725'), ('oname', 'Baloncesto Superior Nacional ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4796'), ('oname', 'Basketball-Reference.com NBL player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4612'), ('oname', 'LKL player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3525'), ('oname', 'ACB.com player ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('objname', 'basketball player')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q3665646 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   UNION {\n",
    "   ?obj ?p wd:Q3665646.\n",
    "   ?obj sc:name ?oname.\n",
    "   \n",
    "   }\n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5aa7893f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a80fa485",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18536342'), ('oname', 'competitive player')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4557'), ('oname', 'Indiana Basketball Hall of Fame ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28640'), ('oname', 'profession')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2685'), ('oname', 'Basketball Reference NBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3647'), ('oname', 'NBA.com player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3696'), ('oname', 'Sports-Reference.com college basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4561'), ('oname', 'Basketball Reference WNBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4744'), ('oname', 'Basketball-Reference.com NBA G League player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2066131'), ('oname', 'athlete')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3957'), ('oname', 'RealGM basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q48890'), ('oname', 'college basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3685'), ('oname', 'ESPN.com NBA player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P6063'), ('oname', 'Scoresway basketball person ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P5722'), ('oname', 'Greek Basket League ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P5725'), ('oname', 'Baloncesto Superior Nacional ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4796'), ('oname', 'Basketball-Reference.com NBL player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4612'), ('oname', 'LKL player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3525'), ('oname', 'ACB.com player ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('objname', 'basketball player')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q3665646 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   UNION {\n",
    "   ?obj ?p wd:Q3665646.\n",
    "   ?obj sc:name ?oname.\n",
    "   } \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eb649fc2",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for basketball."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f6d9685f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "fd00ffa9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2341939'), ('oname', 'basketball court')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15304953'), ('oname', 'WikiProject African diaspora')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q212434'), ('oname', 'Olympic sport')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q216048'), ('oname', 'team sport')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q31629'), ('oname', 'type of sport')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q46343203'), ('oname', \"men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q877517'), ('oname', 'ball game')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q5372 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   UNION {\n",
    "   ?obj ?p wd:Q5372.\n",
    "   ?obj sc:name ?oname.\n",
    "   } \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b94663e",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for basketball team."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b790f732",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "22b0b2c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q51747567'), ('oname', 'squad')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5137571'), ('oname', 'basketball coach')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q847017'), ('oname', 'sports club')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5648512'), ('oname', 'Template:Infobox basketball club')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5647277'), ('oname', 'Category:Basketball teams')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8206968'), ('oname', 'Hebraica y Macabi')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5144784'), ('oname', \"Colgate Raiders men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7051115'), ('oname', \"Norfolk State Spartans men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7397248'), ('oname', \"Sacred Heart Pioneers men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15725839'), ('oname', 'A.S. Kentavros Neas Kallikrateias')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q107876527'), ('oname', \"Iowa Western Reivers men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15927936'), ('oname', 'Westchester Knicks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q810271'), ('oname', 'BC Zepter Vienna')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q100320348'), ('oname', \"East Central Tigers men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16201949'), ('oname', \"DePaul Blue Demons women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16969750'), ('oname', 'Jackson State Tigers basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16982503'), ('oname', 'Grand Rapids Drive')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4025635'), ('oname', 'İstanbul Teknik Üniversitesi B.K.')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4705333'), ('oname', \"Alabama State Hornets men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q923137'), ('oname', 'Wellington Saints')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17022966'), ('oname', 'ŽKK Srbobran')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17023856'), ('oname', 'Anhui Wenyi')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17064173'), ('oname', 'Blackwater Elite')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5974122'), ('oname', 'Levharti Chomutov')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q107876648'), ('oname', \"Calvin Knights men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20537231'), ('oname', 'Raptors 905')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7496291'), ('oname', 'Shiga Lakestars')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3833194'), ('oname', 'Lions de Genève')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3905889'), ('oname', 'Pittsburgh Piranhas')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3930226'), ('oname', 'Rapla KK')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16531388'), ('oname', 'Virtus Basket Ariano')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16586535'), ('oname', 'Pallacanestro Brindisi')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17628455'), ('oname', 'Cóndores de Cundinamarca')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18286220'), ('oname', 'Metros de Santiago')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5506768'), ('oname', 'Frøya Ambassadors')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15784291'), ('oname', 'Melco Ieper')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18126454'), ('oname', 'Leeds Force')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7058420'), ('oname', \"Northern Illinois Huskies women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1466375'), ('oname', 'Zalakeramia-ZTE KK')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q12816085'), ('oname', 'Soproni KC')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18379744'), ('oname', 'Cafe France Bakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20988430'), ('oname', 'Hatay Büyükşehir Belediye Gençlik ve Spor Kulübü')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q21019222'), ('oname', 'Tokyo Hachioji Trains')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q21451950'), ('oname', 'Halifax Hurricanes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q26160627'), ('oname', 'Club Deportivo Hispano Americano')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3786822'), ('oname', 'Horsens IC')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4705232'), ('oname', \"Alabama Crimson Tide women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6378703'), ('oname', 'Kauhajoen Karhu')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19577197'), ('oname', 'KK Karpoš Sokoli')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5009372'), ('oname', 'Club de Baloncesto Bahía San Agustín')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22080113'), ('oname', 'CB Ciudad de Valladolid')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22199661'), ('oname', \"RFM-Swift's\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22935676'), ('oname', \"Al-Mina'a\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22949008'), ('oname', 'Louaize Club')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7396990'), ('oname', 'California Heatwave')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q23302448'), ('oname', \"UNC Wilmington Seahawks men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q676815'), ('oname', 'Starwings Basket Regio Basel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q85746459'), ('oname', \"Bellarmine Knights men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q26840607'), ('oname', 'CB Agustinos Eras')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16328558'), ('oname', 'Faros Keratsiniou B.C.')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27206254'), ('oname', \"Aias Evosmou (women's basketball)\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30325815'), ('oname', \"Illinois State Redbirds women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30325821'), ('oname', \"Idaho Vandals women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30325830'), ('oname', \"Coastal Carolina Chanticleers women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30325916'), ('oname', \"Furman Paladins women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30325921'), ('oname', \"Wichita State Shockers women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30484057'), ('oname', 'Capital City Go-Go')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30668302'), ('oname', 'ÍS')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3891951'), ('oname', 'Pallacanestro Livorno')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14947971'), ('oname', 'Columbus Quest')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1541588'), ('oname', 'Sacramento Monarchs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19863871'), ('oname', \"Auburn Tigers women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q266588'), ('oname', 'Ratiopharm Ulm')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28444632'), ('oname', \"Marshall Thundering Herd women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3376166'), ('oname', 'Perth Lynx')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3547347'), ('oname', 'ZVVZ USK Prague')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3615392'), ('oname', \"UCLA Bruins men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5330566'), ('oname', \"Eastern Washington Eagles men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7080913'), ('oname', \"Ohio State Buckeyes women's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7082332'), ('oname', \"Oklahoma Sooners men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q910444'), ('oname', 'Club Ferro Carril Oeste')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q297826'), ('oname', 'ASK Riga')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q484762'), ('oname', 'Changwon LG Sakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6141541'), ('oname', 'Tenerife AB')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q660650'), ('oname', 'BC Krasnye Krylia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7055048'), ('oname', \"North Dakota State Bison men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7245013'), ('oname', \"Princeton Tigers men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q795707'), ('oname', 'BCM Gravelines')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q952819'), ('oname', 'Mersey Tigers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1033853'), ('oname', 'Canton Charge')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1075934'), ('oname', 'Cholet Basket')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1441137'), ('oname', 'KK Šibenik')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15055268'), ('oname', \"Maryland Terrapins men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16969608'), ('oname', \"Marshall Thundering Herd men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16969659'), ('oname', \"Saint Louis Billikens men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2725675'), ('oname', 'Akron Wingfoots')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2979993'), ('oname', 'CSM Târgoviște')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q13393265 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   UNION {\n",
    "   ?obj ?p wd:Q13393265.\n",
    "   ?obj sc:name ?oname.\n",
    "   } \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6f6a2a6e",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return all italian basketball teams born before 1945 (the result set must be a list of triples basketball team IRI, label and year of inception)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "489deece",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7617484'), ('oname', 'Category:Basketball teams in Georgia (country)')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "# write your final query\n",
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q13393265 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   UNION {\n",
    "   ?obj ?p wd:Q13393265.\n",
    "   ?obj sc:name ?oname.\n",
    "   }\n",
    "   FILTER(REGEX(?oname ,\".*country*\"^^xsd:string))\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "682b95c7-1a8d-4fe8-b57b-f3b24e15b57c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4167836'), ('objname', 'Wikimedia category'), ('oname', 'instance of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('objname', 'basketball team'), ('oname', 'category combines topics')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19360703'), ('objname', 'by country'), ('oname', 'category combines topics')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6256'), ('objname', 'country'), ('oname', 'category combines topics')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q9384767 ?p ?obj.\n",
    "    #?s ?p wd:Q16826020.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?oname.\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?oname ,\"country*\"^^xsd:string))\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "7d0bc50a-3db9-4036-b341-06089b02d9a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/P6087'), ('objname', 'coach of sports team'), ('p', 'http://www.wikidata.org/prop/direct/P1687'), ('oname', 'Wikidata property')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P54'), ('objname', 'member of sports team'), ('p', 'http://www.wikidata.org/prop/direct/P1687'), ('oname', 'Wikidata property')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q847017'), ('objname', 'sports club'), ('p', 'http://www.wikidata.org/prop/direct/P1889'), ('oname', 'different from')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P634'), ('objname', 'captain'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('oname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P505'), ('objname', 'general manager'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('oname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P831'), ('objname', 'parent club'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('oname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q327245'), ('objname', 'team'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2066131'), ('objname', 'athlete'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('oname', 'has part')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4087622'), ('objname', 'Category:Sports teams'), ('p', 'http://www.wikidata.org/prop/direct/P910'), ('oname', \"topic's main category\")]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?p ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q12973014 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?oname.\n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "4d29741b-9852-4ed1-bae4-5ea957466697",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4438121 wdt:P279 ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "075261e1-1274-438c-9cf2-2355f77a2b0d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6190581'), ('objname', 'Template:Infobox organization'), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6688962'), ('objname', 'Template:Aspects of organizations'), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q57971242'), ('objname', 'Template:Infobox organization/Wikidata'), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3535173'), ('objname', 'organizational life cycle'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17197366'), ('objname', 'type of organisation'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q730573'), ('objname', 'organizational culture'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q852998'), ('objname', 'stakeholder'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3738275'), ('objname', 'adaptive capacity'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1430172'), ('objname', 'organizational learning'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q53281408'), ('objname', \"organisation's goals\"), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q759524'), ('objname', 'organizational structure'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19483216'), ('objname', 'organizational behavior'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7102013'), ('objname', 'workplace conflict'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1937189'), ('objname', 'organizational communication'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q25048163'), ('objname', 'organizational identity'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2727939'), ('objname', 'organizational memory'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1268'), ('objname', 'represents'), ('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q36993249'), ('objname', 'arranging'), ('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3500'), ('objname', 'Ringgold ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P213'), ('objname', 'ISNI'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1705'), ('objname', 'native label'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3549'), ('objname', 'Australian Company Number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1278'), ('objname', 'Legal Entity Identifier'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1320'), ('objname', 'OpenCorporates ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1056'), ('objname', 'product or material produced'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1329'), ('objname', 'phone number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P159'), ('objname', 'headquarters location'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2657'), ('objname', 'EU Transparency Register ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P17'), ('objname', 'country'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P112'), ('objname', 'founded by'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P571'), ('objname', 'inception'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1128'), ('objname', 'employees'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P131'), ('objname', 'located in the administrative territorial entity'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P527'), ('objname', 'has part'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P856'), ('objname', 'official website'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P355'), ('objname', 'subsidiary'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P740'), ('objname', 'location of formation'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1813'), ('objname', 'short name'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1616'), ('objname', 'SIREN number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3215'), ('objname', 'SIRET number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1830'), ('objname', 'owner of'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P749'), ('objname', 'parent organization'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1297'), ('objname', 'IRS Employer Identification Number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2541'), ('objname', 'operating area'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P452'), ('objname', 'industry'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P463'), ('objname', 'member of'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1961'), ('objname', 'CTHS society ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P169'), ('objname', 'chief executive officer'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1454'), ('objname', 'legal form'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P807'), ('objname', 'separated from'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4290'), ('objname', 'official app'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P154'), ('objname', 'logo image'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2189'), ('objname', 'BiblioNet publisher ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3163'), ('objname', 'Scottish Charity number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3273'), ('objname', 'Actorenregister ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3534'), ('objname', 'Australian Government Organisations Register ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3642'), ('objname', 'ARCHON code'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2900'), ('objname', 'fax number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2813'), ('objname', 'house publication'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3393'), ('objname', 'LittleSis organization ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2088'), ('objname', 'Crunchbase organization ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2388'), ('objname', 'office held by head of the organization'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1546'), ('objname', 'motto'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1662'), ('objname', 'DOI prefix'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2740'), ('objname', 'ResearchGate institute ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P2391'), ('objname', 'OKPO ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P1789'), ('objname', 'chief operating officer'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3797'), ('objname', 'autonomous system number'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3914'), ('objname', 'GuideStar Israel organization ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4090'), ('objname', 'Biodiversity Repository ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P3220'), ('objname', 'KvK company ID'), ('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6671777'), ('objname', 'structure'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16334295'), ('objname', 'group of humans'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q106559804'), ('objname', 'person or organization'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10756188'), ('objname', 'treasury'), ('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8103926'), ('objname', 'Category:Wikipedia categories named after organizations'), ('p', 'http://www.wikidata.org/prop/direct/P6186'), ('pname', 'category for eponymous categories')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5613113'), ('objname', 'Category:Organizations'), ('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\")]\n",
      "77\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43229 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "c0ea44c6-231b-4e05-8b8d-db1e89731364",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q210036'), ('pname', 'Chechen Republic of Ichkeria')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1065073'), ('pname', 'Song')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q244165'), ('pname', 'Republic of Artsakh')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1008'), ('pname', 'Ivory Coast')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1009'), ('pname', 'Cameroon')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1019'), ('pname', 'Madagascar')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1028'), ('pname', 'Morocco')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1029'), ('pname', 'Mozambique')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1030'), ('pname', 'Namibia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1033'), ('pname', 'Nigeria')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1072012'), ('pname', 'international')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q117'), ('pname', 'Ghana')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1206012'), ('pname', 'German Reich')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q1246'), ('pname', 'Kosovo')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q133356'), ('pname', 'Ukrainian Soviet Socialist Republic')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q13426199'), ('pname', 'Republic of China 1912–1949')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q142'), ('pname', 'France')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q145'), ('pname', 'United Kingdom')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q148'), ('pname', \"People's Republic of China\")]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q15180'), ('pname', 'Soviet Union')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q155'), ('pname', 'Brazil')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q159'), ('pname', 'Russia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q16'), ('pname', 'Canada')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q17'), ('pname', 'Japan')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q174193'), ('pname', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q183'), ('pname', 'Germany')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q184'), ('pname', 'Belarus')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q189'), ('pname', 'Iceland')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q191'), ('pname', 'Estonia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q20'), ('pname', 'Norway')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q207272'), ('pname', 'Second Polish Republic')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q211'), ('pname', 'Latvia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q212'), ('pname', 'Ukraine')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q213'), ('pname', 'Czech Republic')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q214'), ('pname', 'Slovakia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q215'), ('pname', 'Slovenia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q218'), ('pname', 'Romania')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q219'), ('pname', 'Bulgaria')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q219060'), ('pname', 'State of Palestine')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q222'), ('pname', 'Albania')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q224'), ('pname', 'Croatia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q229'), ('pname', 'Cyprus')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q2305208'), ('pname', 'Russian Socialist Federative Soviet Republic')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q235'), ('pname', 'Monaco')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q241'), ('pname', 'Cuba')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q252'), ('pname', 'Indonesia')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q258'), ('pname', 'South Africa')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q26'), ('pname', 'Northern Ireland')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q262'), ('pname', 'Algeria')]\n",
      "[('countryname', 'http://www.wikidata.org/entity/Q27'), ('pname', 'Ireland')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?countryname ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q43229;\n",
    "       wdt:P17 ?countryname.\n",
    "    \n",
    "   \n",
    "   # get the label \n",
    "   #?s sc:name ?objname.\n",
    "   ?countryname sc:name ?pname.\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "690dee4f-b39f-4664-b0f8-24a7a59c4f96",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q16586535'), ('objname', 'Pallacanestro Brindisi'), ('name', 'Italy'), ('k', '1945-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3093425'), ('objname', 'Libertas Trogylos Basket'), ('name', 'Italy'), ('k', '1970-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3515600'), ('objname', 'Taranto Cras Basket'), ('name', 'Italy'), ('k', '1961-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36231'), ('objname', 'S.S. Felice Scandone'), ('name', 'Italy'), ('k', '1948-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36251'), ('objname', 'Pallacanestro Biella'), ('name', 'Italy'), ('k', '1994-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36419'), ('objname', 'Pallacanestro Reggiana'), ('name', 'Italy'), ('k', '1974-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3967121'), ('objname', 'RB Montecatini Terme'), ('name', 'Italy'), ('k', '1949-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48969'), ('objname', 'Scaligera Basket Verona'), ('name', 'Italy'), ('k', '1951-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50196'), ('objname', 'Andrea Costa Imola'), ('name', 'Italy'), ('k', '1967-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50884'), ('objname', 'Pallacanestro Trieste'), ('name', 'Italy'), ('k', '1975-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q94444'), ('objname', 'Roseto Sharks'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1132514'), ('objname', 'Fabriano Basket'), ('name', 'Italy'), ('k', '1966-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2708666'), ('objname', 'Nuova AMG Sebastiani Basket Napoli'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36391'), ('objname', 'Sutor Basket Montegranaro'), ('name', 'Italy'), ('k', '1947-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3891980'), ('objname', 'Nuova Pallacanestro Pavia'), ('name', 'Italy'), ('k', '1943-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4004859'), ('objname', 'U.C.C.'), ('name', 'Italy'), ('k', '1977-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50200'), ('objname', 'Basket Ferentino'), ('name', 'Italy'), ('k', '1977-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36462'), ('objname', 'Pallacanestro Virtus Roma'), ('name', 'Italy'), ('k', '1960-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36551'), ('objname', 'Pallacanestro Varese'), ('name', 'Italy'), ('k', '1945-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q745603'), ('objname', 'Viola Reggio Calabria'), ('name', 'Italy'), ('k', '1966-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1139737'), ('objname', 'Fortitudo Pallacanestro Bologna'), ('name', 'Italy'), ('k', '1932-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q24942205'), ('objname', 'Pallacanestro Piacentina'), ('name', 'Italy'), ('k', '2011-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36482'), ('objname', 'Polisportiva Dinamo'), ('name', 'Italy'), ('k', '1960-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q51142'), ('objname', 'Fulgor Libertas Forlì'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q654461'), ('objname', 'Basket Livorno'), ('name', 'Italy'), ('k', '1947-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3891961'), ('objname', 'Pallacanestro Messina'), ('name', 'Italy'), ('k', '1976-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q51211'), ('objname', 'Orlandina Basket'), ('name', 'Italy'), ('k', '1978-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36277'), ('objname', 'New Basket Brindisi'), ('name', 'Italy'), ('k', '1992-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42437'), ('objname', 'Pistoia Basket 2000'), ('name', 'Italy'), ('k', '2000-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36362'), ('objname', 'Olimpia Milano'), ('name', 'Italy'), ('k', '1936-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36500'), ('objname', 'Mens Sana Basket'), ('name', 'Italy'), ('k', '1861-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q810281'), ('objname', 'Basket Napoli'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q277016'), ('objname', 'Teramo Basket'), ('name', 'Italy'), ('k', '1973-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2819414'), ('objname', 'Basket Parma'), ('name', 'Italy'), ('k', '1962-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36264'), ('objname', 'Virtus Pallacanestro Bologna'), ('name', 'Italy'), ('k', '1927-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36311'), ('objname', 'Pallacanestro Cantù'), ('name', 'Italy'), ('k', '1936-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36326'), ('objname', 'Juvecaserta Basket'), ('name', 'Italy'), ('k', '1951-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42474'), ('objname', 'Societa Veroli Basket'), ('name', 'Italy'), ('k', '1968-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42454'), ('objname', 'Scafati Basket'), ('name', 'Italy'), ('k', '1969-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q766443'), ('objname', 'Pallacanestro Treviso'), ('name', 'Italy'), ('k', '1954-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2048000'), ('objname', 'Pallalcesto Amatori Udine'), ('name', 'Italy'), ('k', '1999-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36406'), ('objname', 'Victoria Libertas Pesaro'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q810279'), ('objname', 'Rinascita Basket Rimini'), ('name', 'Italy'), ('k', '1947-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3831719'), ('objname', 'Libertas Livorno'), ('name', 'Italy'), ('k', '1947-11-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7127695'), ('objname', 'Pallacanestro Pavia'), ('name', 'Italy'), ('k', '1943-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3754192'), ('objname', 'Fulgor Omegna'), ('name', 'Italy'), ('k', '1937-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42408'), ('objname', 'A.S. Junior Pallacanestro Casale'), ('name', 'Italy'), ('k', '1956-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q512988'), ('objname', 'Basket Femminile Le Mura Lucca'), ('name', 'Italy'), ('k', '2005-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36572'), ('objname', 'Reyer Venezia Mestre'), ('name', 'Italy'), ('k', '1925-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3707653'), ('objname', 'Dike Basket Napoli'), ('name', 'Italy'), ('k', '2005-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3748793'), ('objname', 'Fortitudo Agrigento'), ('name', 'Italy'), ('k', '1969-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3628058'), ('objname', 'Athletic Genova'), ('name', 'Italy'), ('k', '1968-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q51167'), ('objname', 'Aquila Basket Trento'), ('name', 'Italy'), ('k', '1995-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3881666'), ('objname', 'Olimpia Cagliari'), ('name', 'Italy'), ('k', '1953-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1438692'), ('objname', 'Basket Club Ferrara'), ('name', 'Italy'), ('k', '1999-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36345'), ('objname', 'Guerino Vanoli Basket'), ('name', 'Italy'), ('k', '1999-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1091431'), ('objname', 'AS Vicenza'), ('name', 'Italy'), ('k', '1958-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3635915'), ('objname', 'Basket Recanati'), ('name', 'Italy'), ('k', '1982-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3641118'), ('objname', 'Blu Basket 1971'), ('name', 'Italy'), ('k', '1971-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3664188'), ('objname', 'Celana Basket Bergamo'), ('name', 'Italy'), ('k', '1948-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3892001'), ('objname', 'Pallacanestro Trapani'), ('name', 'Italy'), ('k', '1964-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3759159'), ('objname', 'Geas Basket'), ('name', 'Italy'), ('k', '1955-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3891941'), ('objname', 'Kleb Basket Ferrara'), ('name', 'Italy'), ('k', '2011-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48976'), ('objname', 'Aurora Basket Jesi'), ('name', 'Italy'), ('k', '1966-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1841959'), ('objname', 'PF Umbertide'), ('name', 'Italy'), ('k', '2008-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2828738'), ('objname', 'Basket Draghi Novara'), ('name', 'Italy'), ('k', '1972-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q961782'), ('objname', 'Pallacanestro Petrarca Padova'), ('name', 'Italy'), ('k', '1934-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3064877'), ('objname', 'PF Schio'), ('name', 'Italy'), ('k', '1973-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2113828'), ('objname', 'CUS Cagliari Pallacanestro'), ('name', 'Italy'), ('k', '1947-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50905'), ('objname', 'Basket Brescia Leonessa'), ('name', 'Italy'), ('k', '2009-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3892004'), ('objname', \"Pallacanestro Sant'Antimo\"), ('name', 'Italy'), ('k', '1989-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17562457'), ('objname', 'Universo Treviso Basket'), ('name', 'Italy'), ('k', '2012-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17628735'), ('objname', 'Derthona Basket'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18288536'), ('objname', 'Legnano Knights'), ('name', 'Italy'), ('k', '1966-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3635870'), ('objname', 'Basket Brescia'), ('name', 'Italy'), ('k', '1957-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3881663'), ('objname', 'Olimpia Basket Pistoia'), ('name', 'Italy'), ('k', '1965-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q26086434'), ('objname', 'PMS Torino'), ('name', 'Italy'), ('k', '2011-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3881660'), ('objname', 'Olimpia Basket Matera'), ('name', 'Italy'), ('k', '1960-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3972903'), ('objname', 'Stella Azzurra Roma'), ('name', 'Italy'), ('k', '1938-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3888124'), ('objname', 'PMS Torino'), ('name', 'Italy'), ('k', '2009-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q64936252'), ('objname', 'Basket Torino'), ('name', 'Italy'), ('k', '2019-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3625728'), ('objname', 'Latina Basket'), ('name', 'Italy'), ('k', '1968-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42525'), ('objname', 'Basket Barcellona'), ('name', 'Italy'), ('k', '1976-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48814013'), ('objname', 'Poderosa Pallacanestro Montegranaro'), ('name', 'Italy'), ('k', '1993-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3635911'), ('objname', 'Basket Mestre 1958'), ('name', 'Italy'), ('k', '1958-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2667374'), ('objname', 'Partenope Napoli'), ('name', 'Italy'), ('k', '1957-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q24942233'), ('objname', 'Pallacanestro Forlì 2.015'), ('name', 'Italy'), ('k', '2015-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q51327338'), ('objname', 'Gruppo Sportivo Bernocchi'), ('name', 'Italy'), ('k', '1945-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3601018'), ('objname', 'AMG Sebastiani Basket Rieti'), ('name', 'Italy'), ('k', '1946-01-01T00:00:00Z')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3747654'), ('objname', 'F.C. Internazionale Milano (basketball)'), ('name', 'Italy'), ('k', '1908-01-01T00:00:00Z')]\n",
      "90\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#Copy Inception from above for date [('obj', 'http://www.wikidata.org/entity/P571'), ('objname', 'inception')\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#[('countryname', 'http://www.wikidata.org/entity/Q38'), ('pname', 'Italy')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?objname ?name ?k\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q13393265;\n",
    "       wdt:P17 ?d;\n",
    "       wdt:P571 ?k.\n",
    "   \n",
    "   # get the label \n",
    "   ?s sc:name ?objname.\n",
    "   ?d sc:name ?name.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?name ,\"Italy*\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "723d7ee3",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "106b02f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3891980'), ('TeamName', 'Nuova Pallacanestro Pavia'), ('Date', '1943')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1139737'), ('TeamName', 'Fortitudo Pallacanestro Bologna'), ('Date', '1932')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q36362'), ('TeamName', 'Olimpia Milano'), ('Date', '1936')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q36500'), ('TeamName', 'Mens Sana Basket'), ('Date', '1861')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q36264'), ('TeamName', 'Virtus Pallacanestro Bologna'), ('Date', '1927')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q36311'), ('TeamName', 'Pallacanestro Cantù'), ('Date', '1936')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q7127695'), ('TeamName', 'Pallacanestro Pavia'), ('Date', '1943')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3754192'), ('TeamName', 'Fulgor Omegna'), ('Date', '1937')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q36572'), ('TeamName', 'Reyer Venezia Mestre'), ('Date', '1925')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q961782'), ('TeamName', 'Pallacanestro Petrarca Padova'), ('Date', '1934')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3972903'), ('TeamName', 'Stella Azzurra Roma'), ('Date', '1938')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3747654'), ('TeamName', 'F.C. Internazionale Milano (basketball)'), ('Date', '1908')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#Copy Inception from above for date [('obj', 'http://www.wikidata.org/entity/P571'), ('objname', 'inception')\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#[('countryname', 'http://www.wikidata.org/entity/Q38'), ('pname', 'Italy')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?TeamName (YEAR(?k) as ?Date)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?IRI wdt:P31 wd:Q13393265;\n",
    "       wdt:P17 ?d;\n",
    "       wdt:P571 ?k.\n",
    "   \n",
    "   # get the label \n",
    "   ?IRI sc:name ?TeamName.\n",
    "   ?d sc:name ?countryname.\n",
    "   \n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?countryname ,\"Italy*\"^^xsd:string))\n",
    "   FILTER( YEAR(?k) < 1945 )\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a8a2d10",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Identify the BGP for NBA finals"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "d5afe91d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2657718'), ('objname', 'Armenian Soviet Encyclopedia'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19467997'), ('objname', 'Template:Infobox athletics club'), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10730006'), ('objname', 'Template:Infobox sports team'), ('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4999'), ('objname', 'number of clubs'), ('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('objname', 'sports team'), ('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q51747567'), ('objname', 'squad'), ('p', 'http://www.wikidata.org/prop/direct/P2670'), ('pname', 'has parts of the class')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q988108'), ('objname', 'club'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), ('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9717774'), ('objname', 'Category:Sports clubs'), ('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\")]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "#('obj', 'http://www.wikidata.org/entity/Q847017'), ('oname', 'sports club')]\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?p ?pname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q847017 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"NBA*\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "0cf06fd6-3728-4aff-adc2-fd0497da963e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4438121'), ('objname', 'sports organization'), \n",
    "#('p', 'http://www.wikidata.org/prop/direct/P279'), ('oname', 'subclass of')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q8797519'), ('oname', 'Category:Sports teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q9384767'), ('oname', 'Category:Basketball teams by country')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q16826020'), ('oname', '1954 Milan High School basketball team')]\n",
    "#Nationality -> wdt:P27\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "#('obj', 'http://www.wikidata.org/entity/Q847017'), ('oname', 'sports club')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/P4999'), ('objname', 'number of clubs')\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   ?obj wdt:P4999 wd:Q4438121.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"NBA*\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "f9d17862-fa12-4f4a-ac9c-ee0edf9c332e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8192401'), ('objname', 'Aitor Zárate')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13708767'), ('objname', 'Aristide Landi')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15477486'), ('objname', 'Małgorzata Janowicz')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15737093'), ('objname', 'Jarrett Durham')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15843419'), ('objname', 'Ryan Brooks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15850750'), ('objname', 'Thomas Hering')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15856626'), ('objname', 'Ama Degbeon')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15870814'), ('objname', 'Josef Klíma')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15879801'), ('objname', 'Niels Vorenhout')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15881370'), ('objname', 'Roel Aarts')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15889301'), ('objname', 'Charlie Westbrook')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15908865'), ('objname', 'Jordan Adams')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18044481'), ('objname', 'Zoran Krstanovic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20057565'), ('objname', 'Josef Klíma')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3542640'), ('objname', 'Ty Walker')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4027073'), ('objname', 'Darnell Hinson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16008261'), ('objname', 'Ned Nelson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16012731'), ('objname', 'Carl Austing')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16013083'), ('objname', 'Ken Rosemond')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16013805'), ('objname', 'Jim Bredar')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16014141'), ('objname', 'Bob Naber')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16014413'), ('objname', 'Raimonds Karnītis')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16018101'), ('objname', 'Dwaine Dillard')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16018191'), ('objname', 'Shelby Linville')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16019056'), ('objname', 'Julio Gallardo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q47765591'), ('objname', 'Gerhard Biller')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1153881'), ('objname', 'Doug Bruno')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13049223'), ('objname', 'Javier Marín Ayerbe')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16171040'), ('objname', 'Sami Eerola')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16171669'), ('objname', 'Aïda Diagne')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16174955'), ('objname', 'Kim Byong-chul')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16189514'), ('objname', 'Sajjan Singh Cheema')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16197295'), ('objname', 'Alyssa Valdez')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16197773'), ('objname', 'Terry Brooks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16199050'), ('objname', 'Deron Feldhaus')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16199340'), ('objname', 'Mark Binstein')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16200491'), ('objname', 'Mike Brennan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16203552'), ('objname', 'Jamion Christian')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16204406'), ('objname', 'Danny Jones')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16205673'), ('objname', 'Martin Keane')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16208266'), ('objname', 'Ante Đugum')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16209386'), ('objname', 'Damen Bell-Holter')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16209407'), ('objname', 'Biboy Ravanes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16209513'), ('objname', 'Ben Brust')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16209587'), ('objname', 'Larry Chapman')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16210220'), ('objname', 'Ramon Kaju')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16211572'), ('objname', 'Rosa Gala')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16212622'), ('objname', 'Christina Schwab')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16215315'), ('objname', 'Ismael García Moreno')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16215332'), ('objname', 'Julius Joseph')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16216169'), ('objname', 'Lou White')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16216580'), ('objname', 'Melanie Hall')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16216835'), ('objname', 'Ozell Wells')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16218575'), ('objname', 'Kang Ji-sook')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16221246'), ('objname', 'Damond L. Williams')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16221247'), ('objname', 'Lance Williams')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16221343'), ('objname', 'Hu Xiaotao')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16222028'), ('objname', 'Aerick Sanders')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16222186'), ('objname', 'Louise Gamman')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16223361'), ('objname', 'Roberto Mena Pérez')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16224785'), ('objname', 'Raffy Reyes')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16226767'), ('objname', 'Ryan Boatright')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16226896'), ('objname', 'Chris Cooper')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16226912'), ('objname', 'Gravelle Craig')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227008'), ('objname', 'Cody Ellis')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227014'), ('objname', 'Tyler Ennis')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227112'), ('objname', 'Kiwi Gardner')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227116'), ('objname', 'Amir Garrett')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227156'), ('objname', \"Omm'A Givens\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227294'), ('objname', 'Rufus Harris')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227518'), ('objname', 'Jeremy Ingram')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227600'), ('objname', 'Keith Jensen')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227637'), ('objname', 'Garrison Johnson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227850'), ('objname', 'Jerry Koch')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16227920'), ('objname', 'Lasan Kromah')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16228417'), ('objname', 'Jordan McRae')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16228471'), ('objname', 'Anthony Miles')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16228675'), ('objname', 'Derrick Nix')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16228967'), ('objname', 'Mike Preaseau')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16228970'), ('objname', 'Dion Prewster')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16229109'), ('objname', 'Jeff Robinson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16229485'), ('objname', 'Maurice Sutton')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16229528'), ('objname', 'Chase Tapley')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16229562'), ('objname', 'Xavier Thames')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16231676'), ('objname', 'Deolinda Gimo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16231887'), ('objname', 'Eliud Poligrates')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16232048'), ('objname', 'Ronalds Zaķis')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16232095'), ('objname', 'Chris Exciminiano')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16232444'), ('objname', 'Lele Hardy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16232781'), ('objname', 'Nick Minnerath')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16233167'), ('objname', 'RR Garcia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16233299'), ('objname', 'Sean Kilpatrick')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16233994'), ('objname', 'Sam Marata')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16236541'), ('objname', 'Sindarius Thornwell')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18211238'), ('objname', 'Kia Nurse')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2337837'), ('objname', 'Elsa Hosk')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30658586'), ('objname', 'Dylan Ennis')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4021733'), ('objname', 'Xavi Crespo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4746395'), ('objname', 'Aminata Sininta')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   ?obj ?p wd:Q3665646.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"james\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "id": "0f5d68c6-5300-4ecf-8011-13c8f2b531d6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P106'), ('objname', 'occupation')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1532'), ('objname', 'country for sport')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1889'), ('objname', 'different from')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P19'), ('objname', 'place of birth')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P2067'), ('objname', 'mass')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P2094'), ('objname', 'competition class')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P21'), ('objname', 'sex or gender')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P2671'), ('objname', 'Google Knowledge Graph ID')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P27'), ('objname', 'country of citizenship')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P31'), ('objname', 'instance of')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P3527'), ('objname', 'Eurobasket.com player ID')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P3696'), ('objname', 'Sports-Reference.com college basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P3957'), ('objname', 'RealGM basketball player ID')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P413'), ('objname', 'position played on team / speciality')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P569'), ('objname', 'date of birth')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P641'), ('objname', 'sport')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P69'), ('objname', 'educated at')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P734'), ('objname', 'family name')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P735'), ('objname', 'given name')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P8548'), ('objname', 'Proballers ID')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q55216167 ?obj ?p.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"james\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "id": "946c4f7b-3f8f-4c1d-a7a0-59dd084fe31e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q351478'), ('objname', 'NBA')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   ?p wdt:P118 ?obj .\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?objname ,\"NBA\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "52896fac-9a8f-4d83-b3ac-9cddfa2e1cdb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q125'), ('objname', 'November')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q46343203'), ('objname', \"men's basketball\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
      "[('obj', 'http://www.wikidata.org/entity/P4744'), ('objname', 'Basketball-Reference.com NBA G League player ID')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q623109'), ('objname', 'sports league')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1933075'), ('objname', 'Rio Grande Valley Vipers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30079437'), ('objname', '2017–18 NBA Gatorade League season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7485512'), ('objname', 'Category:NBA G League')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q351478'), ('objname', 'NBA')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "    wd:Q842793 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"james\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "id": "609a73f3-5b28-46a4-a07e-3f8f6f5dbb7f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1591'), ('objname', 'defendant')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1423'), ('objname', 'template has topic')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P101'), ('objname', 'field of work')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P108'), ('objname', 'employer')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1269'), ('objname', 'facet of')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P127'), ('objname', 'owned by')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1343'), ('objname', 'described by source')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1366'), ('objname', 'replaced by')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P137'), ('objname', 'operator')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P264'), ('objname', 'record label')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P301'), ('objname', \"category's main topic\")]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P3450'), ('objname', 'sports season of league or competition')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P361'), ('objname', 'part of')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P466'), ('objname', 'occupant')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P664'), ('objname', 'organizer')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P710'), ('objname', 'participant')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P921'), ('objname', 'main subject')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P971'), ('objname', 'category combines topics')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1027'), ('objname', 'conferred by')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P2499'), ('objname', 'league level above')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1629'), ('objname', 'Wikidata item of this property')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P1855'), ('objname', 'Wikidata property example')]\n",
      "[('obj', 'http://www.wikidata.org/prop/direct/P9073'), ('objname', \"applicable 'stated in' value\")]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     ?p ?obj wd:Q155223.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?pname ,\"james\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "id": "6fbc96ed-7f24-448a-9238-12ec3099b4a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q600389'), ('objname', '1990–91 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2264531'), ('objname', '1967–68 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q241834'), ('objname', '1989–90 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q602553'), ('objname', '1969–70 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2294127'), ('objname', '1971–72 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q113619'), ('objname', '2012–13 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16191100'), ('objname', '2014-15 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19862716'), ('objname', '2015–16 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q918054'), ('objname', 'NBA Coach of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q631240'), ('objname', '1979–80 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1418596'), ('objname', 'NBA Sportsmanship Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1142320'), ('objname', '2005–06 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4566866'), ('objname', '1950 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4575074'), ('objname', '1972 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4588662'), ('objname', '1993 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4598928'), ('objname', '2001 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q281094'), ('objname', '1949–50 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q222047'), ('objname', 'NBA Most Valuable Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q31391'), ('objname', 'NBA All-Star Game Kobe Bryant Most Valuable Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52702755'), ('objname', '2018–19 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q644357'), ('objname', 'NBA Rookie of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q845884'), ('objname', 'NBA Defensive Player of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1125399'), ('objname', 'NBA Most Improved Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1121549'), ('objname', '2007–08 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1432855'), ('objname', '2003 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1517510'), ('objname', '2004 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2264502'), ('objname', '1961–62 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072451'), ('objname', '1960 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072455'), ('objname', '1961 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072460'), ('objname', '1962 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072461'), ('objname', '1963 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072477'), ('objname', '1984 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072478'), ('objname', '1985 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072479'), ('objname', '1986 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072482'), ('objname', '1987 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2069853'), ('objname', '1983–84 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2264540'), ('objname', '1975–76 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q548783'), ('objname', '1977–78 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q29098111'), ('objname', '2017–18 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1314911'), ('objname', '1998 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3469281'), ('objname', '2013 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3869414'), ('objname', '2010–11 NBA Development League season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4896830'), ('objname', 'Best WNBA Player ESPY Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q388970'), ('objname', 'NBA Executive of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1255750'), ('objname', '2011–12 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2069810'), ('objname', '1980–81 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1132622'), ('objname', '2001–02 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1132641'), ('objname', '1999–2000 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1132659'), ('objname', '2003–04 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1132667'), ('objname', '2000–01 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1135932'), ('objname', '2002–03 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1164506'), ('objname', '1992–93 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1164516'), ('objname', '1994–95 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1165925'), ('objname', '1993–94 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321737'), ('objname', '1995–96 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321749'), ('objname', '1996–97 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321776'), ('objname', '1998–99 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q925570'), ('objname', '1997–98 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q941115'), ('objname', '2004–05 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1999389'), ('objname', '1952–53 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11144228'), ('objname', '2013–14 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16154045'), ('objname', '2014 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q104762984'), ('objname', '2020–21 NBA G League season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4579314'), ('objname', '1980 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q63637259'), ('objname', '2019–20 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q96083208'), ('objname', '2020–21 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2069819'), ('objname', '1985–86 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4567490'), ('objname', '1952 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4567780'), ('objname', '1953 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4568101'), ('objname', '1954 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4575625'), ('objname', '1973 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4578767'), ('objname', '1979 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4589592'), ('objname', '1994 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4590500'), ('objname', '1995 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27783253'), ('objname', '2014–15 LNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2036161'), ('objname', '2008 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1130071'), ('objname', '2009–10 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1130082'), ('objname', '2008–09 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1143957'), ('objname', '2010–11 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q23939796'), ('objname', '2016–17 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2264628'), ('objname', '1964–65 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30079437'), ('objname', '2017–18 NBA Gatorade League season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2264617'), ('objname', '1962–63 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q844517'), ('objname', 'NBA Sixth Man of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1626930'), ('objname', '2011 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q997459'), ('objname', '2006–07 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q389447'), ('objname', '1972–73 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170590'), ('objname', '2006 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1539241'), ('objname', '2009 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1524095'), ('objname', '2001 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1810665'), ('objname', '2005 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22094750'), ('objname', '2016 WNBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2552745'), ('objname', '2007 NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2886405'), ('objname', '1983 NBA World Championship Series')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q517679'), ('objname', '1991–92 NBA season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3869419'), ('objname', '2011–12 NBA Development League season')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2294141'), ('objname', '1966–67 NBA season')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     ?obj wdt:P1346 ?p.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?objname ,\"NBA\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 174,
   "id": "8350e5da-4ae0-4629-a006-0c140c6d8e49",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q842375'), ('objname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q121783'), ('objname', 'Los Angeles Lakers')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     wd:Q4600307 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "\n",
    "   \n",
    "   #FILTER(REGEX(?objname ,\"NBA\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 144,
   "id": "b5139f10-2764-43d7-85c3-bd6f44e45b1c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1366722'), ('objname', 'final')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q118'), ('objname', 'April')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15275719'), ('objname', 'recurring event')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14335327'), ('objname', 'Template:Infobox basketball final')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8663431'), ('objname', 'Category:National Basketball Association Finals')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842375'), ('objname', 'NBA Finals')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     wd:Q842375 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d0f6a55c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "id": "28fa04a2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1366722'), ('objname', 'final')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q118'), ('objname', 'April')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15275719'), ('objname', 'recurring event')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14335327'), ('objname', 'Template:Infobox basketball final')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8663431'), ('objname', 'Category:National Basketball Association Finals')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     wd:Q842375 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   }\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75e90ed1",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Consider only the basketball teams which Kevin Durant and Lebron James played. Return the number of NBA finals won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "5dc62897",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q180950'), ('objname', 'Oklahoma City Thunder'), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q235326'), ('objname', 'Seattle SuperSonics'), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q572134'), ('objname', 'Brooklyn Nets'), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q169138'), ('objname', 'Miami Heat'), ('s', 'http://www.wikidata.org/entity/Q36159'), ('pname', 'LeBron James')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7707830'), ('objname', \"Texas Longhorns men's basketball\"), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q244847'), ('objname', \"United States men's national basketball team\"), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q121783'), ('objname', 'Los Angeles Lakers'), ('s', 'http://www.wikidata.org/entity/Q36159'), ('pname', 'LeBron James')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157376'), ('objname', 'Golden State Warriors'), ('s', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q162990'), ('objname', 'Cleveland Cavaliers'), ('s', 'http://www.wikidata.org/entity/Q36159'), ('pname', 'LeBron James')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "##[('obj', 'http://www.wikidata.org/entity/Q842375'), ('objname', 'NBA Finals')]\n",
    "#wd:Q36159\tLebron James\tnode\n",
    "#wd:Q29545\tKevin Durant\tnode\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?s ?pname\n",
    "WHERE {\n",
    "   \n",
    "   # bind something\n",
    "    ?s wdt:P54 ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?s sc:name ?pname.\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "   \n",
    "  \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "9551832c-5129-432d-a2f8-9e3cb4f5510b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q121783'), ('objname', 'Los Angeles Lakers'), ('pname', 'winner')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q842375'), ('objname', 'NBA Finals'), ('pname', 'instance of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball'), ('pname', 'sport')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "##[('obj', 'http://www.wikidata.org/entity/Q842375'), ('objname', 'NBA Finals')]\n",
    "#wd:Q36159\tLebron James\tnode\n",
    "#wd:Q29545\tKevin Durant\tnode\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?pname\n",
    "WHERE {\n",
    "   \n",
    "   # bind something\n",
    "    wd:Q4600307 ?p ?obj.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "   #VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "   \n",
    "  \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "id": "3c1fce98-f7a9-42c1-bb9a-21e5016a8513",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4598928'), ('objname', '2001 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4588662'), ('objname', '1993 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q555100'), ('pname', 'Cedric Maxwell')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q352162'), ('pname', 'Dennis Johnson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q179051'), ('pname', 'Kareem Abdul-Jabbar')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q134183'), ('pname', 'Magic Johnson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q169452'), ('pname', \"Shaquille O'Neal\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q182455'), ('pname', 'Wilt Chamberlain')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q190152'), ('pname', 'Larry Bird')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q193020'), ('pname', 'Tim Duncan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q25369'), ('pname', 'Kobe Bryant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q298512'), ('pname', 'Isiah Thomas')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q311195'), ('pname', 'Jerry West')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q31683'), ('pname', 'Dwyane Wade')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q36159'), ('pname', 'LeBron James')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q380515'), ('pname', 'Willis Reed')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q41421'), ('pname', 'Michael Jordan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q434824'), ('pname', 'Rick Barry')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q44068'), ('pname', 'Dirk Nowitzki')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q273256'), ('pname', 'Hakeem Olajuwon')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q926248'), ('pname', 'Kawhi Leonard')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q193108'), ('pname', 'Tony Parker')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q348598'), ('pname', 'Joe Dumars')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q363246'), ('pname', 'Bill Walton')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q456776'), ('pname', 'Wes Unseld')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q298531'), ('pname', 'Chauncey Billups')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q598416'), ('pname', 'Jo Jo White')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q316179'), ('pname', 'Moses Malone')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q71127'), ('pname', 'John Havlicek')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q362872'), ('pname', 'James Worthy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q136816'), ('pname', 'Andre Iguodala')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award'), ('p', 'http://www.wikidata.org/entity/Q121647'), ('pname', 'Paul Pierce')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4589592'), ('objname', '1994 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q161345'), ('pname', 'Houston Rockets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4590500'), ('objname', '1995 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q161345'), ('pname', 'Houston Rockets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2036161'), ('objname', '2008 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q131371'), ('pname', 'Boston Celtics')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170590'), ('objname', '2006 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169138'), ('pname', 'Miami Heat')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2552745'), ('objname', '2007 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q159729'), ('pname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4584557'), ('objname', '1988 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4587787'), ('objname', '1992 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4592651'), ('objname', '1997 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19877916'), ('objname', '2015 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q157376'), ('pname', 'Golden State Warriors')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4604623'), ('objname', '2005 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q159729'), ('pname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4586134'), ('objname', '1990 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169661'), ('pname', 'Detroit Pistons')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4593827'), ('objname', '1998 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4586976'), ('objname', '1991 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1959941'), ('objname', '2009 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4591549'), ('objname', '1996 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q128109'), ('pname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1006129'), ('objname', '2003 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q159729'), ('pname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16481622'), ('objname', '2014 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q159729'), ('pname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13405328'), ('objname', '2013 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169138'), ('pname', 'Miami Heat')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2628013'), ('objname', '2012 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169138'), ('pname', 'Miami Heat')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1022085'), ('objname', '2004 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169661'), ('pname', 'Detroit Pistons')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4594932'), ('objname', '1999 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q159729'), ('pname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4597667'), ('objname', '2000 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3072473'), ('objname', '1974 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q131371'), ('pname', 'Boston Celtics')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q644353'), ('objname', '2010 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q121783'), ('pname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4585299'), ('objname', '1989 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q169661'), ('pname', 'Detroit Pistons')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1320332'), ('objname', '2011 NBA Finals'), ('p', 'http://www.wikidata.org/entity/Q132893'), ('pname', 'Dallas Mavericks')]\n",
      "60\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?p ?pname\n",
    "WHERE {{\n",
    "   # bind something\n",
    "     ?obj wdt:P1346 ?p.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "   }\n",
    "   FILTER(REGEX(?objname ,\"NBA Final\"^^xsd:string))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "id": "f5c2848c-914d-4fa7-9010-1c5e27f2e504",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13405328'), ('objname', '2013 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q1366722'), ('Fname', 'final')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2628013'), ('objname', '2012 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4584557'), ('objname', '1988 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q644353'), ('objname', '2010 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170590'), ('objname', '2006 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1959941'), ('objname', '2009 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4598928'), ('objname', '2001 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19877916'), ('objname', '2015 NBA Finals'), ('team_name', 'Golden State Warriors'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4597667'), ('objname', '2000 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?team_name ?Fin ?Fname\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?s wdt:P54 ?k.\n",
    "    ?obj wdt:P1346 ?k.\n",
    "    ?obj wdt:P31 ?Fin.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   ?k sc:name ?team_name.\n",
    "   ?Fin sc:name ?Fname.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?objname ,\"NBA Final\"^^xsd:string))\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 185,
   "id": "8ecf3dec-de54-4640-a30c-705e48971e67",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2628013'), ('objname', '2012 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4600307'), ('objname', '2002 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4584557'), ('objname', '1988 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4598928'), ('objname', '2001 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q644353'), ('objname', '2010 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4597667'), ('objname', '2000 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13405328'), ('objname', '2013 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q1366722'), ('Fname', 'final'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170590'), ('objname', '2006 NBA Finals'), ('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1959941'), ('objname', '2009 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19877916'), ('objname', '2015 NBA Finals'), ('team_name', 'Golden State Warriors'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objnam ?team_name ?Fin ?Fname (COUNT (?k) as ?winners)\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?s wdt:P54 ?k.\n",
    "    ?obj wdt:P1346 ?k.\n",
    "    ?obj wdt:P31 ?Fin.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   ?k sc:name ?team_name.\n",
    "   ?Fin sc:name ?Fname.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?objname ,\"NBA Final\"^^xsd:string))\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "\n",
    "}\n",
    "Group by ?objname ?team_name ?Fname ?Fin ?obj\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "a1e6cc06-ae4e-4eae-a657-cef15d88aedb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '16')]\n",
      "[('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '2')]\n",
      "[('team_name', 'Golden State Warriors'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '4')]\n",
      "[('team_name', 'Seattle SuperSonics'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team_name ?Fin ?Fname (COUNT (?k) as ?winners)\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?s wdt:P54 ?k.\n",
    "    ?obj wdt:P1346 ?k.\n",
    "    ?obj wdt:P31 ?Fin.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   ?k sc:name ?team_name.\n",
    "   ?Fin sc:name ?Fname.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?Fname ,\"NBA Final\"^^xsd:string))\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "\n",
    "}\n",
    "Group by  ?team_name ?Fname ?Fin \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 171,
   "id": "b23a6825-f27d-494a-9754-1660f39899ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('objname', '2000 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "[('objname', '2001 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "[('objname', '2006 NBA Finals'), ('team_name', 'Miami Heat'), ('winners', '1')]\n",
      "[('objname', '2015 NBA Finals'), ('team_name', 'Golden State Warriors'), ('winners', '1')]\n",
      "[('objname', '2012 NBA Finals'), ('team_name', 'Miami Heat'), ('winners', '1')]\n",
      "[('objname', '2002 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "[('objname', '1988 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "[('objname', '2009 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "[('objname', '2013 NBA Finals'), ('team_name', 'Miami Heat'), ('winners', '1')]\n",
      "[('objname', '2010 NBA Finals'), ('team_name', 'Los Angeles Lakers'), ('winners', '1')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q55216167'), ('objname', 'Steven Cook')]\n",
    "##[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?objname ?team_name (COUNT (?k) as ?winners)\n",
    "WHERE {\n",
    "   # bind something\n",
    "\n",
    "    ?s wdt:P54 ?k.\n",
    "    \n",
    "    OPTIONAL{\n",
    "    ?obj wdt:P1346 ?k.\n",
    "    }\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   ?k sc:name ?team_name.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?objname ,\"NBA Final\"^^xsd:string))\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "\n",
    "}\n",
    "Group by ?team_name ?objname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ecd4bb2f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "c29efd8f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team_name', 'Los Angeles Lakers'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '16')]\n",
      "[('team_name', 'Miami Heat'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '2')]\n",
      "[('team_name', 'Golden State Warriors'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '4')]\n",
      "[('team_name', 'Seattle SuperSonics'), ('Fin', 'http://www.wikidata.org/entity/Q842375'), ('Fname', 'NBA Finals'), ('winners', '1')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team_name ?Fin ?Fname (COUNT (?k) as ?winners)\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?s wdt:P54 ?k.\n",
    "    ?obj wdt:P1346 ?k.\n",
    "    ?obj wdt:P31 ?Fin.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   #?p sc:name ?pname.\n",
    "   ?k sc:name ?team_name.\n",
    "   ?Fin sc:name ?Fname.\n",
    "\n",
    "   \n",
    "   FILTER(REGEX(?Fname ,\"NBA Final\"^^xsd:string))\n",
    "   VALUES ?s {wd:Q36159 wd:Q29545}\n",
    "\n",
    "}\n",
    "Group by  ?team_name ?Fname ?Fin \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "55ab04aa",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, labels and #players)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "f5a37118",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q131364'), ('objname', 'New York Knicks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q162954'), ('objname', 'Denver Nuggets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q167253'), ('objname', 'Portland Trail Blazers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q180950'), ('objname', 'Oklahoma City Thunder')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q976396'), ('objname', 'Los Angeles Clippers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q166105'), ('objname', 'Sacramento Kings')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170649'), ('objname', 'Utah Jazz')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q138089'), ('objname', 'Philadelphia 76ers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q161345'), ('objname', 'Houston Rockets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q164177'), ('objname', 'Phoenix Suns')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q172339'), ('objname', 'New Orleans Pelicans')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q161337'), ('objname', 'Orlando Magic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q159729'), ('objname', 'San Antonio Spurs')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q572134'), ('objname', 'Brooklyn Nets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q159893'), ('objname', 'Atlanta Hawks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q169138'), ('objname', 'Miami Heat')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3360254'), ('objname', 'Anderson Packers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q121783'), ('objname', 'Los Angeles Lakers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q128109'), ('objname', 'Chicago Bulls')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157376'), ('objname', 'Golden State Warriors')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q163480'), ('objname', 'Charlotte Hornets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q169165'), ('objname', 'Washington Wizards')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q169637'), ('objname', 'Milwaukee Bucks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q131371'), ('objname', 'Boston Celtics')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q162990'), ('objname', 'Cleveland Cavaliers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q165529'), ('objname', 'Memphis Grizzlies')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q132880'), ('objname', 'Toronto Raptors')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q132893'), ('objname', 'Dallas Mavericks')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q169661'), ('objname', 'Detroit Pistons')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170558'), ('objname', 'Minnesota Timberwolves')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170329'), ('objname', 'Indiana Pacers')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2928124'), ('objname', 'Baltimore Bullets')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2354728'), ('objname', 'Sheboygan Red Skins')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q513372'), ('objname', 'Indianapolis Olympians')]\n",
      "34\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "    ?obj wdt:P31 wd:Q13393265;\n",
    "        wdt:P118 wd:Q155223.\n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "id": "2a34b117-4965-4680-a1ca-82fb2f2296c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2277'), ('objname', 'Roman Empire'), ('p', 'http://www.wikidata.org/prop/direct/P131'), ('pname', 'located in the administrative territorial entity')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2320005'), ('objname', 'Ptolemaic Kingdom'), ('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20987778'), ('objname', 'Sasanian Egypt'), ('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1747689'), ('objname', 'Ancient Rome'), ('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2277'), ('objname', 'Roman Empire'), ('p', 'http://www.wikidata.org/prop/direct/P2348'), ('pname', 'time period')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q15'), ('objname', 'Africa'), ('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q182547'), ('objname', 'Roman province'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q87'), ('objname', 'Alexandria'), ('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1003997'), ('objname', 'Judaea'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q692775'), ('objname', 'Creta et Cyrenaica'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q221353'), ('objname', 'Arabia Petraea'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8678273'), ('objname', 'Category:Roman Egypt'), ('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\")]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#('s', 'http://www.wikidata.org/prop/direct/P17'), ('oname', 'country')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "    wd:Q202311 ?p ?obj.\n",
    "        \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 209,
   "id": "423d5973-357f-46ac-8619-321e82932b77",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q46'), ('Cont_name', 'Europe'), ('Players', '300')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q538'), ('Cont_name', 'Insular Oceania'), ('Players', '3770')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q15'), ('Cont_name', 'Africa'), ('Players', '60')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q48'), ('Cont_name', 'Asia'), ('Players', '73')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q5401'), ('Cont_name', 'Eurasia'), ('Players', '17')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q18'), ('Cont_name', 'South America'), ('Players', '37')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q49'), ('Cont_name', 'North America'), ('Players', '3820')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "\n",
    "# write your queries\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P118'), ('objname', 'league')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q842793'), ('objname', 'NBA G League')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q155223'), ('objname', 'National Basketball Association')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P54'), ('objname', 'member of sports team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
    "# wdt:P106\tprofession\tpredicate\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Cont ?Cont_name (COUNT (DISTINCT ?pl) as ?Players)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "    ?obj wdt:P31 wd:Q13393265;\n",
    "        wdt:P118 wd:Q155223.\n",
    "        \n",
    "    ?pl wdt:P31 wd:Q5;\n",
    "        wdt:P106 wd:Q3665646;\n",
    "        wdt:P54 ?obj;\n",
    "        wdt:P27 ?c.\n",
    "    \n",
    "    ?c wdt:P30 ?Cont.\n",
    "    \n",
    "    ?Cont sc:name ?Cont_name\n",
    "\n",
    "}\n",
    "Group by (?Cont) (?Cont_name)\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a03ddcd",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "15bf7f92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q46'), ('Cont_name', 'Europe'), ('Players', '300')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q538'), ('Cont_name', 'Insular Oceania'), ('Players', '3770')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q15'), ('Cont_name', 'Africa'), ('Players', '60')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q48'), ('Cont_name', 'Asia'), ('Players', '73')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q5401'), ('Cont_name', 'Eurasia'), ('Players', '17')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q18'), ('Cont_name', 'South America'), ('Players', '37')]\n",
      "[('Cont', 'http://www.wikidata.org/entity/Q49'), ('Cont_name', 'North America'), ('Players', '3820')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Cont ?Cont_name (COUNT (DISTINCT ?pl) as ?Players)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "    ?obj wdt:P31 wd:Q13393265;\n",
    "        wdt:P118 wd:Q155223.\n",
    "        \n",
    "    ?pl wdt:P31 wd:Q5;\n",
    "        wdt:P106 wd:Q3665646;\n",
    "        wdt:P54 ?obj;\n",
    "        wdt:P27 ?c.\n",
    "    \n",
    "    ?c wdt:P30 ?Cont.\n",
    "    \n",
    "    ?Cont sc:name ?Cont_name\n",
    "\n",
    "}\n",
    "Group by (?Cont) (?Cont_name)\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75c06dfc",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Identify the BGP for the NBA Most Valuable Player Award (MVP) (see https://en.wikipedia.org/wiki/NBA_Most_Valuable_Player_Award)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "16962000",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q273256'), ('sname', 'Hakeem Olajuwon'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q298512'), ('sname', 'Isiah Thomas'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q362872'), ('sname', 'James Worthy'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q182455'), ('sname', 'Wilt Chamberlain'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q298531'), ('sname', 'Chauncey Billups'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q380515'), ('sname', 'Willis Reed'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q134183'), ('sname', 'Magic Johnson'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q348598'), ('sname', 'Joe Dumars'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31683'), ('sname', 'Dwyane Wade'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q316179'), ('sname', 'Moses Malone'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193020'), ('sname', 'Tim Duncan'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q434824'), ('sname', 'Rick Barry'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q179051'), ('sname', 'Kareem Abdul-Jabbar'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36159'), ('sname', 'LeBron James'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q456776'), ('sname', 'Wes Unseld'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q169452'), ('sname', \"Shaquille O'Neal\"), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71127'), ('sname', 'John Havlicek'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25369'), ('sname', 'Kobe Bryant'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q44068'), ('sname', 'Dirk Nowitzki'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q136816'), ('sname', 'Andre Iguodala'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q311195'), ('sname', 'Jerry West'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q926248'), ('sname', 'Kawhi Leonard'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q190152'), ('sname', 'Larry Bird'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q598416'), ('sname', 'Jo Jo White'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41421'), ('sname', 'Michael Jordan'), ('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award')\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p wd:Q739499.\n",
    "   \n",
    "   # get the label \n",
    "   ?s sc:name ?sname.\n",
    "   ?p sc:name ?pname.\n",
    "  \n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "a8d905d4-efc7-487c-ba50-5a06425822c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7865896'), ('objname', 'USBWA National Freshman of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1418009'), ('objname', 'NBA All-Rookie Team')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1641970'), ('objname', 'John R. Wooden Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q222047'), ('objname', 'NBA Most Valuable Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q31391'), ('objname', 'NBA All-Star Game Kobe Bryant Most Valuable Player Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4835465'), ('objname', 'BET Award for Athlete of the Century')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4896724'), ('objname', 'Best Male Athlete ESPY Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q644357'), ('objname', 'NBA Rookie of the Year Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q674359'), ('objname', 'All-NBA Team')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q943106'), ('objname', 'Best NBA Player ESPY Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4896727'), ('objname', 'Best Male College Athlete ESPY Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4904894'), ('objname', \"Big 12 Conference Men's Basketball Player of the Year\")]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "#('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
    "# write your queries\n",
    "\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award')\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q29545 wdt:P166 ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   \n",
    "  \n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "ed20d495-8364-436f-9fef-290c99c808be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q29545'), ('objname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q205326'), ('objname', 'Derrick Rose')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q192707'), ('objname', 'Charles Barkley')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q192955'), ('objname', 'Steve Nash')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q182455'), ('objname', 'Wilt Chamberlain')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q380515'), ('objname', 'Willis Reed')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8991894'), ('objname', 'Giannis Antetokounmpo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q209921'), ('objname', 'Julius Erving')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q134183'), ('objname', 'Magic Johnson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q273256'), ('objname', 'Hakeem Olajuwon')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q190094'), ('objname', 'Allen Iverson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q316179'), ('objname', 'Moses Malone')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q25369'), ('objname', 'Kobe Bryant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q647516'), ('objname', 'Zach Brown')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q36159'), ('objname', 'LeBron James')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q196185'), ('objname', 'Russell Westbrook')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q456776'), ('objname', 'Wes Unseld')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q179051'), ('objname', 'Kareem Abdul-Jabbar')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q368561'), ('objname', 'Bob Pettit')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17717'), ('objname', 'Oscar Robertson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q553232'), ('objname', 'Bob McAdoo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q199896'), ('objname', 'Karl Malone')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q352159'), ('objname', 'Stephen Curry')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q264393'), ('objname', 'Dave Cowens')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q190152'), ('objname', 'Larry Bird')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q211876'), ('objname', 'David Robinson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27662581'), ('objname', 'Alex Caruso')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q312643'), ('objname', 'Bob Cousy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193020'), ('objname', 'Tim Duncan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q363246'), ('objname', 'Bill Walton')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q189240'), ('objname', 'Kevin Garnett')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q44068'), ('objname', 'Dirk Nowitzki')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41421'), ('objname', 'Michael Jordan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q136678'), ('objname', 'James Harden')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q242185'), ('objname', 'Bill Russell')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q652965'), ('objname', 'most valuable player award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "#('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
    "# write your queries\n",
    "\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award')\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q222047'), ('objname', 'NBA Most Valuable Player Award')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q222047 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9c4fcec",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "2e60dcbd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q29545'), ('objname', 'Kevin Durant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q205326'), ('objname', 'Derrick Rose')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q192707'), ('objname', 'Charles Barkley')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q192955'), ('objname', 'Steve Nash')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q182455'), ('objname', 'Wilt Chamberlain')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q380515'), ('objname', 'Willis Reed')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8991894'), ('objname', 'Giannis Antetokounmpo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q209921'), ('objname', 'Julius Erving')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q134183'), ('objname', 'Magic Johnson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q273256'), ('objname', 'Hakeem Olajuwon')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q190094'), ('objname', 'Allen Iverson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q316179'), ('objname', 'Moses Malone')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q25369'), ('objname', 'Kobe Bryant')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q647516'), ('objname', 'Zach Brown')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q36159'), ('objname', 'LeBron James')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q196185'), ('objname', 'Russell Westbrook')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q456776'), ('objname', 'Wes Unseld')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q179051'), ('objname', 'Kareem Abdul-Jabbar')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q368561'), ('objname', 'Bob Pettit')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17717'), ('objname', 'Oscar Robertson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q553232'), ('objname', 'Bob McAdoo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q199896'), ('objname', 'Karl Malone')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q352159'), ('objname', 'Stephen Curry')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q264393'), ('objname', 'Dave Cowens')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q190152'), ('objname', 'Larry Bird')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q211876'), ('objname', 'David Robinson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27662581'), ('objname', 'Alex Caruso')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q312643'), ('objname', 'Bob Cousy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193020'), ('objname', 'Tim Duncan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q363246'), ('objname', 'Bill Walton')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q189240'), ('objname', 'Kevin Garnett')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q44068'), ('objname', 'Dirk Nowitzki')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41421'), ('objname', 'Michael Jordan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q136678'), ('objname', 'James Harden')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q242185'), ('objname', 'Bill Russell')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q652965'), ('objname', 'most valuable player award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5372'), ('objname', 'basketball')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q222047 ?p ?obj.\n",
    "   \n",
    "   # get the label \n",
    "   ?obj sc:name ?objname.\n",
    "   ?p sc:name ?pname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "39e0a53f",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Consider the players who won the NBA Most Valuable Player Award. Return for these players the number of NBA Most Valuable Player Award won in their career (the result set must be triples of player IRI, label and #victories)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "efe17d2f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q264393'), ('pname', 'Dave Cowens'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380515'), ('pname', 'Willis Reed'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q192955'), ('pname', 'Steve Nash'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q136678'), ('pname', 'James Harden'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q179051'), ('pname', 'Kareem Abdul-Jabbar'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q25369'), ('pname', 'Kobe Bryant'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q36159'), ('pname', 'LeBron James'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q41421'), ('pname', 'Michael Jordan'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q196185'), ('pname', 'Russell Westbrook'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q205326'), ('pname', 'Derrick Rose'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q190152'), ('pname', 'Larry Bird'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q193020'), ('pname', 'Tim Duncan'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q312643'), ('pname', 'Bob Cousy'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q352159'), ('pname', 'Stephen Curry'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q363246'), ('pname', 'Bill Walton'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17281073'), ('pname', 'Nikola Jokić'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q199896'), ('pname', 'Karl Malone'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q368561'), ('pname', 'Bob Pettit'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q211876'), ('pname', 'David Robinson'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8991894'), ('pname', 'Giannis Antetokounmpo'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q169452'), ('pname', \"Shaquille O'Neal\"), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17717'), ('pname', 'Oscar Robertson'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q190094'), ('pname', 'Allen Iverson'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q134183'), ('pname', 'Magic Johnson'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q192707'), ('pname', 'Charles Barkley'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q29545'), ('pname', 'Kevin Durant'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q316179'), ('pname', 'Moses Malone'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182455'), ('pname', 'Wilt Chamberlain'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q209921'), ('pname', 'Julius Erving'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44068'), ('pname', 'Dirk Nowitzki'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q273256'), ('pname', 'Hakeem Olajuwon'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q456776'), ('pname', 'Wes Unseld'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q189240'), ('pname', 'Kevin Garnett'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q242185'), ('pname', 'Bill Russell'), ('callret-2', '1')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q553232'), ('pname', 'Bob McAdoo'), ('callret-2', '1')]\n",
      "35\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
    "# write your queries\n",
    "\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q739499'), ('objname', 'Bill Russell NBA Finals Most Valuable Player Award')\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q222047'), ('objname', 'NBA Most Valuable Player Award')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
    "#[('obj', 'http://www.wikidata.org/prop/direct/P1346'), ('objname', 'winner')]\n",
    "# wdt:P106\tprofession\tpredicate\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname COUNT((wd:Q222047) as ?awards)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P106 wd:Q3665646;\n",
    "   wdt:P166 wd:Q222047.   \n",
    "   # get the label \n",
    "   ?p sc:name ?pname.\n",
    "   #VALUES ?k {}\n",
    "}\n",
    "Group by ?p ?pname\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2d284351-8749-43b3-8134-d3134b2e2fe4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "fc389db0",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8dda7bf3",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
