{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d5984128",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "cbc6cb30",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-f5249dead5-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "edfec996",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Movie Workflow Series (\"Tv series HIMYM explorative search\") \n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> we are interested in the TV series \"How I met your mother\" and we want to investigate the main aspects related to the actors and directors involved in the production, know the numerber of seasons and check what are the episodes which got the higher success/impact.\n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P4969`    | derivative work      | predicate |\n",
    "| `wd:Q147235` | How I met your mother        | node |\n",
    "| `wd:Q23831` | The Office (US)        | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q23831 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Office (US)**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should\n",
    "\n",
    "1. Identify the BGP for tv series\n",
    "\n",
    "2. Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes).\n",
    "\n",
    "3. Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)\n",
    "\n",
    "4. Check who is the actor who acted in more films while working on \"How I met your mother\" (the result set must be a list of triples actor/actress IRI, label and #films).\n",
    "\n",
    "5. Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members).\n",
    "\n",
    "6. Return how many of the actors who are members of the cast of the tv series have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label).\n",
    "\n",
    "7. Consider the actors who are members of the cast of HIMYM. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ecd06747",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for tv series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f38b3151",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed timed out\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "#Q23831 the Office\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q23831 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67e6ec1d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "bb27fbbd-c6cc-44a9-be7f-cbbed814efc0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objName', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "#Q23831 the Office\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q23831 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "803e1630",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "cf80b981",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2438066'), ('objName', 'How I Met Your Mother, season 6')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2715578'), ('objName', 'How I Met Your Mother, season 1')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q13567027'), ('objName', 'How I Met Your Mother, season 9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2567330'), ('objName', 'How I Met Your Mother, season 4')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q338715'), ('objName', 'How I Met Your Mother, season 8')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q582332'), ('objName', 'How I Met Your Mother, season 5')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q3468515'), ('objName', 'How I Met Your Mother, season 2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2555117'), ('objName', 'How I Met Your Mother, season 3')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2472427'), ('objName', 'How I Met Your Mother, season 7')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Q147235\tHow I met your mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   filter regex(?objName, \"season\").\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "3c82780c-2b3b-49cf-a508-c8412636c316",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2715578'), ('objName', 'How I Met Your Mother, season 1')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q3468515'), ('objName', 'How I Met Your Mother, season 2')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2555117'), ('objName', 'How I Met Your Mother, season 3')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2567330'), ('objName', 'How I Met Your Mother, season 4')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q582332'), ('objName', 'How I Met Your Mother, season 5')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2438066'), ('objName', 'How I Met Your Mother, season 6')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2472427'), ('objName', 'How I Met Your Mother, season 7')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q338715'), ('objName', 'How I Met Your Mother, season 8')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q13567027'), ('objName', 'How I Met Your Mother, season 9')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Q147235\tHow I met your mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   filter regex(?objName, \"season\").\n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "5bda8bb9-9226-4445-af94-1b15c4251025",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6381'), ('name', 'iTunes TV season ID')]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "# Q2567330 'How I Met Your Mother, season 4'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2567330 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2000271f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "75255e8d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2715578'), ('objName', 'How I Met Your Mother, season 1'), ('numeberEpisode', '22')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q3468515'), ('objName', 'How I Met Your Mother, season 2'), ('numeberEpisode', '22')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2555117'), ('objName', 'How I Met Your Mother, season 3'), ('numeberEpisode', '20')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2567330'), ('objName', 'How I Met Your Mother, season 4'), ('numeberEpisode', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q582332'), ('objName', 'How I Met Your Mother, season 5'), ('numeberEpisode', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2438066'), ('objName', 'How I Met Your Mother, season 6'), ('numeberEpisode', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q2472427'), ('objName', 'How I Met Your Mother, season 7'), ('numeberEpisode', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q338715'), ('objName', 'How I Met Your Mother, season 8'), ('numeberEpisode', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q13567027'), ('objName', 'How I Met Your Mother, season 9'), ('numeberEpisode', '24')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# P1113 number of episodes\n",
    "# Q147235\tHow I met your mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName ?numeberEpisode \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "   ?obj wdt:P1113 ?numeberEpisode.\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   filter regex(?objName, \"season\").\n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c67f1cb",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "47808f55",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q8349'), ('objName', '\"Weird Al\" Yankovic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q24576840'), ('objName', 'Aaron Hendry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q667979'), ('objName', 'Aaron Hill')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q2708237'), ('objName', 'Abby Elliott')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q50736659'), ('objName', 'Abhi Sinha')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q321131'), ('objName', 'Abigail Spencer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q50736705'), ('objName', 'Adam Paul')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q151866'), ('objName', 'Adriana Lima')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q2827706'), ('objName', \"Ahna O'Reilly\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q2827976'), ('objName', 'Ailsa Marshall')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q50385499'), ('objName', 'Aisha Kabia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q277895'), ('objName', 'Alan Thicke')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q9600735'), ('objName', 'Alec Medlock')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q929985'), ('objName', 'Alex Trebek')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q366322'), ('objName', 'Alexis Denisof')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q199927'), ('objName', 'Alyson Hannigan')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q450496'), ('objName', 'Alyssa Shafer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q50736838'), ('objName', 'Alyssa Smith')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q4739684'), ('objName', 'Amanda Loncar')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('obj', 'http://www.wikidata.org/entity/Q131332'), ('objName', 'Amanda Peet')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q147235\tHow I met your mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   filter regex(?name, \"cast\").\n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "fd44adc4-b4e3-47b3-9b5b-0bef597dfeb1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name'), ('obj', 'http://www.wikidata.org/entity/Q453722'), ('objName', 'Amanda')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion'), ('obj', 'http://www.wikidata.org/entity/Q5043'), ('objName', 'Christianity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at'), ('obj', 'http://www.wikidata.org/entity/Q49088'), ('objName', 'Columbia University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse'), ('obj', 'http://www.wikidata.org/entity/Q503997'), ('objName', 'David Benioff')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed'), ('obj', 'http://www.wikidata.org/entity/Q1860'), ('objName', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at'), ('obj', 'http://www.wikidata.org/entity/Q5504210'), ('objName', 'Friends Seminary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion'), ('obj', 'http://www.wikidata.org/entity/Q9268'), ('objName', 'Judaism')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth'), ('obj', 'http://www.wikidata.org/entity/Q60'), ('objName', 'New York City')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source'), ('obj', 'http://www.wikidata.org/entity/Q67311526'), ('objName', 'Obalky knih.cz')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name'), ('obj', 'http://www.wikidata.org/entity/Q29048747'), ('objName', 'Peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother'), ('obj', 'http://www.wikidata.org/entity/Q22925648'), ('objName', 'Penny Peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship'), ('obj', 'http://www.wikidata.org/entity/Q30'), ('objName', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of'), ('obj', 'http://www.wikidata.org/entity/Q64260'), ('objName', 'Uta Hagen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1340'), ('name', 'eye color'), ('obj', 'http://www.wikidata.org/entity/Q17122834'), ('objName', 'blue')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender'), ('obj', 'http://www.wikidata.org/entity/Q6581072'), ('objName', 'female')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q10800557'), ('objName', 'film actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q5'), ('objName', 'human')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q214917'), ('objName', 'playwright')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q177220'), ('objName', 'singer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q2259451'), ('objName', 'stage actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q10798782'), ('objName', 'television actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q578109'), ('objName', 'television producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q36180'), ('objName', 'writer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID'), ('obj', '301251045')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID'), ('obj', '4080487')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID'), ('obj', 'n2009158154')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID'), ('obj', '389712')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID'), ('obj', 'celebrity/amanda_peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID'), ('obj', '966/000031873')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID'), ('obj', '32764')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID'), ('obj', 'a10445444')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID'), ('obj', 'Amanda-Peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1649'), ('name', 'KMDb person ID'), ('obj', '00049033')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)'), ('obj', 'A20574782')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID'), ('obj', 'person/amanda-peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image'), ('obj', 'http://commons.wikimedia.org/wiki/Special:FilePath/Amanda%20Peet%20%40%20TIFF%2001-2.jpg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image'), ('obj', 'http://commons.wikimedia.org/wiki/Special:FilePath/Amanda%20Peet%20September%202014%20%28cropped%29.jpg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image'), ('obj', 'http://commons.wikimedia.org/wiki/Special:FilePath/Amanda%20Peet%20at%20Light%20Up%20a%20Life.jpg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID'), ('obj', 'p215968')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)'), ('obj', '1995-01-01T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI'), ('obj', '0000 0001 1476 6187')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID'), ('obj', '85549417')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID'), ('obj', '237671')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID'), ('obj', '137325622')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID'), ('obj', '954145')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('name', 'PORT person ID'), ('obj', '25570')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID'), ('obj', 'no2003027741')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2519'), ('name', 'Scope.dk person ID'), ('obj', '5799')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID'), ('obj', '22153')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID'), ('obj', '9755')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2626'), ('name', 'Danish National Filmography person ID'), ('obj', '148182')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID'), ('obj', 'people/amanda-peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2639'), ('name', 'Filmportal ID'), ('obj', 'c10ae4da874641e8984e381a5fc1185e')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID'), ('obj', '140550437')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2688'), ('name', 'Box Office Mojo person ID'), ('obj', 'amandapeet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID'), ('obj', '140324925')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3056'), ('name', 'TCM Movie Database person ID'), ('obj', '348995')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3142'), ('name', 'EDb person ID'), ('obj', 'n0000035')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3368'), ('name', 'Prabook ID'), ('obj', '181995')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('name', 'SNAC ARK ID'), ('obj', 'w6kd2twk')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID'), ('obj', 'nm0001605')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category'), ('obj', 'Amanda Peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P434'), ('name', 'MusicBrainz artist ID'), ('obj', '8ebb3500-3ddc-4a54-8adc-ff0dcd961773')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID'), ('obj', '2956')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5033'), ('name', 'Filmweb.pl person ID'), ('obj', '7803')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5534'), ('name', 'Open Media Database person ID'), ('obj', '2956')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5617'), ('name', 'Evene ID'), ('obj', 'amanda-peet-42203')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth'), ('obj', '1972-01-11T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID'), ('obj', '4040-69397')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6255'), ('name', 'SinemaTürk person ID'), ('obj', '15668-amanda-peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('obj', '/m/03m8lq')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID'), ('obj', 'xx0039793')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7214'), ('name', 'Allcinema person ID'), ('obj', '77881')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID'), ('obj', '9810568054405606')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7803'), ('name', 'Decine21 person ID'), ('obj', '5813')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID'), ('obj', 'lccn-no2003027741')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7902'), ('name', 'Deutsche Biographie (GND) ID'), ('obj', '137325622')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8013'), ('name', 'Trakt.tv ID'), ('obj', 'people/amanda-peet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8971'), ('name', 'Cinémathèque québécoise person ID'), ('obj', '153829')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9305'), ('name', 'Max Movie person ID'), ('obj', 'P000043142')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9404'), ('name', 'OFDb person ID'), ('obj', '901')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9463'), ('name', 'MovieMeter person ID'), ('obj', '2956')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID'), ('obj', 'XX1541125')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9662'), ('name', 'LdiF person ID'), ('obj', '142268')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID'), ('obj', '107Zzr2RC3')]\n",
      "85\n"
     ]
    }
   ],
   "source": [
    "#P161  'cast member'\n",
    "#Q131332 'Amanda Peet'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q131332 ?p ?obj .\n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "e8a12c5b-8bd3-4276-8146-0dc1de7ac43f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2684'), ('name', 'Kijkwijzer rating'), ('obj', 'http://www.wikidata.org/entity/Q23649982'), ('objName', '9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746256'), ('objName', 'Bass Player Wanted')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746317'), ('objName', 'Bedtime Stories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746145'), ('objName', 'Coming Back')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16738646'), ('objName', 'Daisy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show'), ('obj', 'http://www.wikidata.org/entity/Q1860'), ('objName', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16745693'), ('objName', 'Gary Blauman')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series'), ('obj', 'http://www.wikidata.org/entity/Q147235'), ('objName', 'How I Met Your Mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q15983482'), ('objName', 'How Your Mother Met Me')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746204'), ('objName', 'Knight Vision')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q48986965'), ('objName', 'Last Forever, Part I')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q48986998'), ('objName', 'Last Forever, Part II')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746202'), ('objName', 'Last Time in New York')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746251'), ('objName', 'Mom and Dad')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746203'), ('objName', 'No Questions Asked')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746255'), ('objName', 'Platonish')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q15919313'), ('objName', 'Rally')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q15846040'), ('objName', 'Slapsgiving 3: Slappointment in Slapmarra')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q15983495'), ('objName', 'Sunrise')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746190'), ('objName', 'The Broken Code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746366'), ('objName', 'The End of the Aisle')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746250'), ('objName', 'The Lighthouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746127'), ('objName', 'The Locket')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16744027'), ('objName', 'The Poker Game')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746318'), ('objName', 'The Rehearsal Dinner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q15846036'), ('objName', 'Unpause')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q16746365'), ('objName', 'Vesuvius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format'), ('obj', 'http://www.wikidata.org/entity/Q54820071'), ('objName', 'digital download')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by'), ('obj', 'http://www.wikidata.org/entity/Q9589'), ('objName', 'iTunes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q3464665'), ('objName', 'television series season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format'), ('obj', 'http://www.wikidata.org/entity/Q723685'), ('objName', 'video on demand')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes'), ('obj', '24')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID'), ('obj', 'tv/how_i_met_your_mother/s09')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID'), ('obj', 'tv/how-i-met-your-mother/season-9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID'), ('obj', '496074')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID'), ('obj', 'shows/how-i-met-your-mother/season-9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID'), ('obj', '10.5240/5A62-0A5D-6312-007B-0505-0')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID'), ('obj', '77907')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time'), ('obj', '2013-09-23T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time'), ('obj', '2014-03-31T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('obj', '/m/0v_xks9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website'), ('obj', 'http://www.cbs.com/primetime/how_i_met_your_mother/')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6381'), ('name', 'iTunes TV season ID'), ('obj', '686812133')]\n",
      "43\n"
     ]
    }
   ],
   "source": [
    "#Q13567027 'How I Met Your Mother, season 9'\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q13567027 ?p ?obj .\n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "4190b434-ccc8-4cff-8846-82b43ede5007",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show'), ('obj', 'http://www.wikidata.org/entity/Q1860'), ('objName', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series'), ('obj', 'http://www.wikidata.org/entity/Q147235'), ('objName', 'How I Met Your Mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4908'), ('name', 'season'), ('obj', 'http://www.wikidata.org/entity/Q13567027'), ('objName', 'How I Met Your Mother, season 9')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director'), ('obj', 'http://www.wikidata.org/entity/Q460221'), ('objName', 'Pamela Fryman')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by'), ('obj', 'http://www.wikidata.org/entity/Q15846040'), ('objName', 'Slapsgiving 3: Slappointment in Slapmarra')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows'), ('obj', 'http://www.wikidata.org/entity/Q16746318'), ('objName', 'The Rehearsal Dinner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q21191270'), ('objName', 'television series episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID'), ('obj', 'tv/how_i_met_your_mother/s09/e13')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title'), ('obj', 'Bass Player Wanted')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID'), ('obj', 'v609362')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID'), ('obj', '496087')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID'), ('obj', 'shows/how-i-met-your-mother/bass-player-wanted-2991994')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID'), ('obj', '10.5240/422D-1287-076E-8909-80ED-I')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN'), ('obj', '0000-0002-2949-00B2-M-0000-0000-8')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID'), ('obj', '77920')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID'), ('obj', 'tt3382270')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID'), ('obj', '695205')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date'), ('obj', '2013-12-16T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('obj', '/m/0xn3hvr')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# Q16746256  'Bass Player Wanted'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   \n",
    "   wd:Q16746256 ?p ?obj .\n",
    "  \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "16fec640-2891-4512-9660-7558e9732b45",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P31'), ('objName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q15416'), ('objName', 'television program')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q1261214'), ('objName', 'television special')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P1476'), ('objName', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q1983062'), ('objName', 'episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q1983062'), ('objName', 'episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q21664088'), ('objName', 'two-part episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of'), ('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objName', 'television series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of'), ('obj', 'http://www.wikidata.org/entity/Q3464665'), ('objName', 'television series season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P577'), ('objName', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q2431196'), ('objName', 'audiovisual work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P179'), ('objName', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject'), ('obj', 'http://www.wikidata.org/entity/Q8485793'), ('objName', 'WikiProject Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P161'), ('objName', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q29555881'), ('objName', 'segment of a television episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q7453224'), ('objName', 'Category:Television episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q18606012'), ('objName', 'Template:The Simpsons episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P2364'), ('objName', 'production code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P4908'), ('objName', 'season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P57'), ('objName', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P58'), ('objName', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q106942341'), ('objName', 'talk show episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q1464125'), ('objName', 'webisode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q39239591'), ('objName', 'number of episodes at the end of the current season or of the last season aired')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q39242248'), ('objName', 'number of episodes aired')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q39242358'), ('objName', 'number of episodes produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q50062923'), ('objName', 'three-part episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q50914552'), ('objName', 'four-part episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q59180636'), ('objName', 'episode title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q7880352'), ('objName', 'Template:Infobox television episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q99079902'), ('objName', 'five-part episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q25989841')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class'), ('obj', 'https://schema.org/TVEpisode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID'), ('obj', '05041170n')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID'), ('obj', 'Tv-Series-Episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID'), ('obj', '/m/01xrzlb')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID'), ('obj', 'TelevisionEpisode')]\n",
      "37\n"
     ]
    }
   ],
   "source": [
    "# Q21191270  'television series episode' \n",
    "#P161 'cast member'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   \n",
    "   wd:Q21191270 ?p ?obj .\n",
    "  \n",
    "   # get the label\n",
    "   ?p sc:name ?name\n",
    "   optional{?obj sc:name ?objName.}\n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "779a607b-117b-4f49-a702-6be515fc42c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# P161 cast member\n",
    "# Q16746256  'Bass Player Wanted'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName \n",
    "WHERE {\n",
    "   \n",
    "   wd:Q16746256 wdt:P161 ?obj .\n",
    "  \n",
    "   # get the label\n",
    "   \n",
    "   optional{?obj sc:name ?objName.}\n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "05d82496-7692-4a83-ab54-503ec23c3b15",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Virginia Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Virginia Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Return of the Shirt'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Pilot'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Purple Giraffe'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Sweet Taste of Liberty'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Life Among the Gorillas'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Cupcake'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Come On'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Mary the Paralegal'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Milk'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Duel'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Limo'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Pineapple Incident'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Zip, Zip, Zip'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Best Prom Ever'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Matchmaker'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Slutty Pumpkin'), ('castName', 'Cobie Smulders')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Cupcake'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Zip, Zip, Zip'), ('castName', 'Ashley Williams')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Elizabeth Bogush')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Samm Levine')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Jayma Mays')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'George Cheung')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Bill Fagerbakke')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Alyssa Shafer')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Limo'), ('castName', 'Kathleen Rose Perkins')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Come On'), ('castName', 'Amy Acker')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Return of the Shirt'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Pilot'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Purple Giraffe'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Sweet Taste of Liberty'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Life Among the Gorillas'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Cupcake'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Come On'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Mary the Paralegal'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Milk'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Duel'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Limo'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Pineapple Incident'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Zip, Zip, Zip'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Best Prom Ever'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Matchmaker'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Slutty Pumpkin'), ('castName', 'Neil Patrick Harris')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Matchmaker'), ('castName', 'Camryn Manheim')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Return of the Shirt'), ('castName', 'Charlene Amoia')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Milk'), ('castName', 'Charlene Amoia')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Return of the Shirt'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Pilot'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Purple Giraffe'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Sweet Taste of Liberty'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Life Among the Gorillas'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Cupcake'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Come On'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Mary the Paralegal'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Milk'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Duel'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Limo'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Pineapple Incident'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Zip, Zip, Zip'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Best Prom Ever'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Matchmaker'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Slutty Pumpkin'), ('castName', 'Josh Radnor')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Suzie Plakson')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Suzie Plakson')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Nothing Good Happens After 2 A.M.'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Okay Awesome'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Return of the Shirt'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Pilot'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Purple Giraffe'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Sweet Taste of Liberty'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Game Night'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Drumroll, Please'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Life Among the Gorillas'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Cupcake'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'The Wedding'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Belly Full of Turkey'), ('castName', 'Alyson Hannigan')]\n",
      "[('seasonName', 'How I Met Your Mother, season 1'), ('epName', 'Come On'), ('castName', 'Alyson Hannigan')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#Q13567027 'How I Met Your Mother, season 9'\n",
    "# P527 has part\n",
    " \n",
    "## Q147235\tHow I met your mother\n",
    "\n",
    "queryString = \"\"\" \n",
    "SELECT DISTINCT  ?seasonName ?epName ?castName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 wdt:P527 ?season.\n",
    "   \n",
    "   ?season wdt:P527 ?ep. # trovo gli episodi della serie\n",
    "   \n",
    "   ?ep wdt:P161 ?cast.\n",
    "       \n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   #?people sc:name ?peopleName.\n",
    "   ?ep sc:name ?epName.\n",
    "   ?cast sc:name ?castName.\n",
    "   ?season sc:name ?seasonName.\n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?seasonName )\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f5135f9",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "01cfe19d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q8349'), ('castName', '\"Weird Al\" Yankovic'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q667979'), ('castName', 'Aaron Hill'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q321131'), ('castName', 'Abigail Spencer'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q151866'), ('castName', 'Adriana Lima'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2827976'), ('castName', 'Ailsa Marshall'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2636696'), ('castName', 'Alan Fudge'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q277895'), ('castName', 'Alan Thicke'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q16729414'), ('castName', 'Alec Gray'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q366322'), ('castName', 'Alexis Denisof'), ('countEp', '5')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q199927'), ('castName', 'Alyson Hannigan'), ('countEp', '143')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q450496'), ('castName', 'Alyssa Shafer'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q131332'), ('castName', 'Amanda Peet'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q444146'), ('castName', 'Amber Stevens'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2842824'), ('castName', 'America Olivo'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q152773'), ('castName', 'Amy Acker'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2844557'), ('castName', 'Amy Gumenick'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q236918'), ('castName', 'Anne Dudek'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q465556'), ('castName', 'Annie Ilonzeh'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q264787'), ('castName', 'April Bowlby'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q435839'), ('castName', 'Ashley Williams'), ('countEp', '9')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q17428816'), ('castName', 'Austin Majors'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q770841'), ('castName', 'Ben Vereen'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q258237'), ('castName', 'Beth Riesgraf'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q458582'), ('castName', 'Betsy Rue'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q591238'), ('castName', 'Bill Fagerbakke'), ('countEp', '9')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q247064'), ('castName', 'Bill Macy'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2903362'), ('castName', 'Bill Suplee'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q888178'), ('castName', 'Bob Odenkirk'), ('countEp', '7')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q333544'), ('castName', 'Bob Saget'), ('countEp', '142')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q733691'), ('castName', 'Brad Rowe'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q11975'), ('castName', 'Britney Spears'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459839'), ('castName', \"Brooke D'Orsay\"), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q254775'), ('castName', 'Brooke Nevin'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q968718'), ('castName', 'Bruce Gray'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1139526'), ('castName', 'Bryan Callen'), ('countEp', '6')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q23547'), ('castName', 'Bryan Cranston'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q235740'), ('castName', 'Busy Philipps'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q234514'), ('castName', 'Camryn Manheim'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q39574'), ('castName', 'Candice King'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1809038'), ('castName', 'Caroline Lagerfelt'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q215546'), ('castName', 'Carrie Underwood'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2656047'), ('castName', 'Carter Bays'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2942050'), ('castName', 'Catherine Reitman'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q16149506'), ('castName', 'Charlene Amoia'), ('countEp', '17')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q456258'), ('castName', 'Charles Robinson'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q471128'), ('castName', 'Chi McBride'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q377424'), ('castName', 'Chris Elliott'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q741909'), ('castName', 'Chris Kattan'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3675563'), ('castName', 'Chris Romano'), ('countEp', '4')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238117'), ('castName', 'Christina Pickles'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q290156'), ('castName', 'Christine Woods'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q200566'), ('castName', 'Cobie Smulders'), ('countEp', '145')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2604240'), ('castName', 'Collette Wolfe'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q761697'), ('castName', 'Connie Sawyer'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1189095'), ('castName', 'Courtney Ford'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3002075'), ('castName', 'Craig Thomas'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5186320'), ('castName', 'Cristin Milioti'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238425'), ('castName', 'Cristine Rose'), ('countEp', '5')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5213110'), ('castName', 'Dan Bakkedahl'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q44442'), ('castName', 'Dan Castellaneta'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1159104'), ('castName', 'Dan Lauria'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q242949'), ('castName', 'Danica McKellar'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q230176'), ('castName', 'Danneel Ackles'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q192165'), ('castName', 'Danny Glover'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q784009'), ('castName', 'Danny Strong'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q448484'), ('castName', 'Darby Stanchfield'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q454698'), ('castName', 'Darcy Rose Byrnes'), ('countEp', '5')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q984397'), ('castName', 'David Burtka'), ('countEp', '5')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q297128'), ('castName', 'David Henrie'), ('countEp', '48')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q348986'), ('castName', 'Davis Cleveland'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q279816'), ('castName', 'Dawn Olivieri'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q240720'), ('castName', 'Deanna Russo'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q924222'), ('castName', 'Diane Salinger'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3306283'), ('castName', 'Dwight Hicks'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q439070'), ('castName', 'E. E. Bell'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5334589'), ('castName', 'Ed Brigadier'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q444480'), ('castName', 'Elizabeth Bogush'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3052368'), ('castName', 'Emily Baldoni'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q922264'), ('castName', 'Eric Allan Kramer'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q614851'), ('castName', 'Eric Braeden'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2633899'), ('castName', 'Erin Cahill'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q289330'), ('castName', 'Erin Cardillo'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q525572'), ('castName', 'Erinn Bartlett'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q260184'), ('castName', 'Eva Amurri'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q4993338'), ('castName', 'Ezra Buzzington'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q233882'), ('castName', 'Frances Conroy'), ('countEp', '3')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q376031'), ('castName', 'Gary Anthony Williams'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3099305'), ('castName', 'Gattlin Griffith'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q255293'), ('castName', 'Geoff Stults'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3045427'), ('castName', 'George Cheung'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q566885'), ('castName', 'Harry Groener'), ('countEp', '2')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q446481'), ('castName', 'Harvey Fierstein'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q229349'), ('castName', 'Heather Morris'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q60036'), ('castName', 'Heidi Klum'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1402293'), ('castName', 'Italia Ricci'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1459918'), ('castName', 'James Tupper'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q313392'), ('castName', 'James Van Der Beek'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q234715'), ('castName', 'Jamie-Lynn Sigler'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q123849'), ('castName', 'Jane Seymour'), ('countEp', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1255263'), ('castName', 'Jason Jones'), ('countEp', '4')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# P527 has part\n",
    "# Q2472427 \n",
    "## Q147235\tHow I met your mother\n",
    "\n",
    "queryString = \"\"\" \n",
    "SELECT DISTINCT ?cast ?castName (count(distinct ?ep) as ?countEp)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 wdt:P527 ?season.\n",
    "   \n",
    "   ?season wdt:P527 ?ep. # trovo gli episodi della serie\n",
    "   \n",
    "   ?ep wdt:P161 ?cast.\n",
    "       \n",
    "  \n",
    "   \n",
    "   # get the label\n",
    "   #?people sc:name ?peopleName.\n",
    "   ?ep sc:name ?epName.\n",
    "   ?cast sc:name ?castName.\n",
    "   ?season sc:name ?seasonName.\n",
    "   \n",
    "   \n",
    "}\n",
    "\n",
    "group by ?cast ?castName\n",
    "order by ?castName\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ecdc332",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Check who is the actor who acted in more films while working on \"How I met your mother\" (the result set must be a list of triples actor/actress IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "f462bf81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q465556')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q269891')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q4888924')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q446031')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q469579')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q516659')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q522856')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q200566')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q435839')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# troviamo la lista dei film \n",
    "# P161  'cast member' \n",
    "# wd:Q147235 HIMYM\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?actor ?actorName\n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "  \n",
    "  \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "cc6ef9ea-1e5c-423b-9956-252448b1752e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q50737052'), ('actorName', 'K.T. Tatara'), ('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q167696'), ('actorName', 'Nicole Scherzinger'), ('film', 'http://www.wikidata.org/entity/Q327713'), ('filmName', 'Men in Black 3')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2633899'), ('actorName', 'Erin Cahill'), ('film', 'http://www.wikidata.org/entity/Q6176596'), ('filmName', 'Jekyll')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q485310'), ('actorName', 'Neil Patrick Harris'), ('film', 'http://www.wikidata.org/entity/Q3480575'), ('filmName', 'Return of the Shirt')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q44442'), ('actorName', 'Dan Castellaneta'), ('film', 'http://www.wikidata.org/entity/Q797839'), ('filmName', 'Baby Daddy')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q433355'), ('actorName', 'Patricia Belcher'), ('film', 'http://www.wikidata.org/entity/Q1123479'), ('filmName', 'The Number 23')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q40715'), ('actorName', 'Jennifer Lopez'), ('film', 'http://www.wikidata.org/entity/Q945456'), ('filmName', 'Feel the Noise')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q39574'), ('actorName', 'Candice King'), ('film', 'http://www.wikidata.org/entity/Q28537'), ('filmName', 'The Vampire Diaries')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q471018'), ('actorName', 'Ernie Hudson'), ('film', 'http://www.wikidata.org/entity/Q1754442'), ('filmName', 'The Watcher')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705'), ('actorName', 'John Cho'), ('film', 'http://www.wikidata.org/entity/Q20649291'), ('filmName', 'Get a Job')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# troviamo la lista dei film \n",
    "# P161  'cast member' \n",
    "# wd:Q147235 HIMYM\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?actor ?actorName  ?film ?filmName\n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?film wdt:P161 ?actor.\n",
    "  \n",
    "  ?actor sc:name ?actorName.\n",
    "  ?film sc:name ?filmName.\n",
    "  \n",
    "}\n",
    "group by ?actor ?actorName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "82f027fe-9cf7-4fd0-89a9-afac76dea194",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time'), ('obj', '2005-09-19T00:00:00Z')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   filter regex (?name , \"start time\").\n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "9907ed3e-73c8-4743-b1f0-457409e4f47a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time'), ('obj', '2014-03-31T00:00:00Z')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q147235 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   filter regex (?name , \"end time\").\n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f4a90a5e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "b3d4497e-29a5-499e-903d-27c0aee56687",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3306283'), ('actorName', 'Dwight Hicks'), ('film', 'http://www.wikidata.org/entity/Q733960'), ('filmName', 'Cold Case')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q289330'), ('actorName', 'Erin Cardillo'), ('film', 'http://www.wikidata.org/entity/Q139849'), ('filmName', 'The Suite Life on Deck')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q231091'), ('actorName', 'Morena Baccarin'), ('film', 'http://www.wikidata.org/entity/Q470111'), ('filmName', 'Medium')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q469579'), ('actorName', 'Mircea Monroe'), ('film', 'http://www.wikidata.org/entity/Q2293'), ('filmName', 'Chuck')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3943077'), ('actorName', 'Ryan Michelle Bathe'), ('film', 'http://www.wikidata.org/entity/Q283393'), ('filmName', 'Private Practice')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2627090'), ('actorName', 'Dave Thomas'), ('film', 'http://www.wikidata.org/entity/Q23609'), ('filmName', 'Weeds')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1319539'), ('actorName', 'Thomas Lennon'), ('film', 'http://www.wikidata.org/entity/Q13218438'), ('filmName', 'Sean Saves the World')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill'), ('film', 'http://www.wikidata.org/entity/Q10290188'), ('filmName', 'Glory Daze')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q255293'), ('actorName', 'Geoff Stults'), ('film', 'http://www.wikidata.org/entity/Q1891872'), ('filmName', 'October Road')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q234152'), ('actorName', 'Becki Newton'), ('film', 'http://www.wikidata.org/entity/Q966757'), ('filmName', 'The Goodwin Games')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# P582 'end time'\n",
    "# P580 'start time'\n",
    "# write your queries\n",
    "# troviamo la lista dei film \n",
    "# P161  'cast member' \n",
    "# wd:Q147235 HIMYM\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?actor ?actorName  ?film ?filmName\n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?film wdt:P161 ?actor;\n",
    "       wdt:P582 ?endTimeFilm.\n",
    "   wd:Q147235 wdt:P580 ?startTime;\n",
    "       wdt:P582 ?endTime.\n",
    "    \n",
    "  \n",
    "  ?actor sc:name ?actorName.\n",
    "  ?film sc:name ?filmName.\n",
    "  \n",
    "  filter (?startTime < ?endTimeFilm && ?endTime > ?endTimeFilm).\n",
    "  \n",
    "}\n",
    "group by ?actor ?actorName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "34765278-5999-47ea-9728-de4f0b5fe2a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3306283'), ('actorName', 'Dwight Hicks'), ('numFilm', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q234152'), ('actorName', 'Becki Newton'), ('numFilm', '3')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q233042'), ('actorName', 'Nancy Travis'), ('numFilm', '2')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q635974'), ('actorName', 'Michael Trucco'), ('numFilm', '5')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q926420'), ('actorName', 'Robbie Amell'), ('numFilm', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1459918'), ('actorName', 'James Tupper'), ('numFilm', '4')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1806933'), ('actorName', 'Rhys Darby'), ('numFilm', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q73346'), ('actorName', 'Ralph Macchio'), ('numFilm', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2842824'), ('actorName', 'America Olivo'), ('numFilm', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q463673'), ('actorName', 'Regis Philbin'), ('numFilm', '2')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# P582 'end time'\n",
    "# P580 'start time'\n",
    "# write your queries\n",
    "# troviamo la lista dei film \n",
    "# P161  'cast member' \n",
    "# wd:Q147235 HIMYM\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?actor ?actorName  (count (?film) as ?numFilm )\n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?film wdt:P161 ?actor;\n",
    "       wdt:P582 ?endTimeFilm.\n",
    "   wd:Q147235 wdt:P580 ?startTime;\n",
    "       wdt:P582 ?endTime.\n",
    "    \n",
    "  \n",
    "  ?actor sc:name ?actorName.\n",
    "  ?film sc:name ?filmName.\n",
    "  \n",
    "  filter (?startTime < ?endTimeFilm && ?endTime > ?endTimeFilm).\n",
    "  \n",
    "}\n",
    "group by ?actor ?actorName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e3ee8878",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6fd06820",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('numSeasonHIMYM', '9')]\n",
      "[('numSeasonTheOffice', '9')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q23831` | The Office (US)  \n",
    "\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "    SELECT DISTINCT (count (?obj) as ?numSeasonHIMYM)\n",
    "            WHERE {\n",
    "               # bind something\n",
    "               wd:Q23831 ?p ?obj .\n",
    "\n",
    "\n",
    "               # get the label\n",
    "               ?p sc:name ?name\n",
    "               optional{?obj sc:name ?objName.}\n",
    "               filter regex(?objName, \"season\").\n",
    "\n",
    "            }\n",
    "            \n",
    "            LIMIT 20\n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT DISTINCT (count (?obj) as ?numSeasonTheOffice)\n",
    "            WHERE {\n",
    "               # bind something\n",
    "               wd:Q147235 ?p ?obj .\n",
    "\n",
    "\n",
    "               # get the label\n",
    "               ?p sc:name ?name\n",
    "               optional{?obj sc:name ?objName.}\n",
    "               filter regex(?objName, \"season\").\n",
    "\n",
    "            }\n",
    "            \n",
    "            LIMIT 20\n",
    "}\n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "98f1d4a1-4366-43ef-bc36-f115b445c79f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q147235'), ('HIMYM', 'How I Met Your Mother'), ('numSeasonHIMYM', '9')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q23831'), ('TheOffice', 'The Office'), ('numSeasonTheOffice', '9')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q23831` | The Office (US)  \n",
    "\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "    SELECT ?IRI ?HIMYM (count (?obj) as ?numSeasonHIMYM)\n",
    "            WHERE {\n",
    "               # bind something\n",
    "               wd:Q147235 ?p ?obj .\n",
    "\n",
    "\n",
    "               # get the label\n",
    "               \n",
    "               ?p sc:name ?name.\n",
    "               wd:Q147235 sc:name ?HIMYM.\n",
    "               \n",
    "               optional{?obj sc:name ?objName.}\n",
    "               filter regex(?objName, \"season\").\n",
    "               \n",
    "               BIND ((wd:Q147235) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?HIMYM ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?IRI ?TheOffice (count (?obj) as ?numSeasonTheOffice)\n",
    "            WHERE {\n",
    "               # bind something\n",
    "               wd:Q23831 ?p ?obj .\n",
    "\n",
    "\n",
    "               # get the label\n",
    "               ?p sc:name ?name.\n",
    "               wd:Q23831 sc:name ?TheOffice.\n",
    "               \n",
    "               optional{?obj sc:name ?objName.}\n",
    "               filter regex(?objName, \"season\").\n",
    "               \n",
    "               BIND ((wd:Q23831) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?TheOffice ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "5f6cad6e-adbb-499c-b6c3-80284ec00ffb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q147235'), ('HIMYM', 'How I Met Your Mother'), ('numSeasonHIMYM', '208'), ('epCount', '208')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q23831'), ('TheOffice', 'The Office'), ('numSeasonTheOffice', '9')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q23831` | The Office (US)  \n",
    "\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "#P527 'has part'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "    SELECT ?IRI ?HIMYM (count (?season) as ?numSeasonHIMYM) (count (?ep) as ?epCount)\n",
    "            WHERE {\n",
    "               \n",
    "               wd:Q147235 wdt:P527 ?season.\n",
    "               ?season wdt:P527 ?ep.\n",
    "\n",
    "              \n",
    "               wd:Q147235 sc:name ?HIMYM.\n",
    "               BIND ((wd:Q147235) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?HIMYM ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?IRI ?TheOffice (count (?obj) as ?numSeasonTheOffice)\n",
    "            WHERE {\n",
    "               # bind something\n",
    "               wd:Q23831 ?p ?obj .\n",
    "\n",
    "\n",
    "               # get the label\n",
    "               ?p sc:name ?name.\n",
    "               wd:Q23831 sc:name ?TheOffice.\n",
    "               \n",
    "               optional{?obj sc:name ?objName.}\n",
    "               filter regex(?objName, \"season\").\n",
    "               \n",
    "               BIND ((wd:Q23831) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?TheOffice ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78faba8d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "41a0c6cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q147235'), ('HIMYM', 'How I Met Your Mother'), ('numSeasonHIMYM', '208'), ('epCount', '208')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q23831'), ('epCount', '216'), ('TheOffice', 'The Office'), ('numSeasonTheOffice', '216')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#wd:Q23831` | The Office (US)  \n",
    "\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "#P527 'has part'\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "    SELECT ?IRI ?HIMYM (count (?season) as ?numSeasonHIMYM) (count (?ep) as ?epCount)\n",
    "            WHERE {\n",
    "               \n",
    "               wd:Q147235 wdt:P527 ?season.\n",
    "               ?season wdt:P527 ?ep.\n",
    "\n",
    "              \n",
    "               wd:Q147235 sc:name ?HIMYM.\n",
    "               BIND ((wd:Q147235) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?HIMYM ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?IRI ?TheOffice (count (?season) as ?numSeasonTheOffice)(count (?ep) as ?epCount)\n",
    "            WHERE {\n",
    "              \n",
    "               wd:Q23831 ?p ?season.\n",
    "               ?season wdt:P527 ?ep.\n",
    "\n",
    "               wd:Q23831 sc:name ?TheOffice.\n",
    "               BIND ((wd:Q23831) AS ?IRI).\n",
    "\n",
    "            }\n",
    "            GROUP BY ?TheOffice ?IRI\n",
    "            LIMIT 20\n",
    "            \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3ac70549",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "Return how many of the actors who are members of the cast of the tv series have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fc97bcd6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q8349'), ('objName', '\"Weird Al\" Yankovic')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q24576840'), ('objName', 'Aaron Hendry')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q667979'), ('objName', 'Aaron Hill')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2708237'), ('objName', 'Abby Elliott')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q50736659'), ('objName', 'Abhi Sinha')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q321131'), ('objName', 'Abigail Spencer')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q50736705'), ('objName', 'Adam Paul')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q151866'), ('objName', 'Adriana Lima')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2827706'), ('objName', \"Ahna O'Reilly\")]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2827976'), ('objName', 'Ailsa Marshall')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# Return a list of actor of the cast\n",
    "\n",
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?objName \n",
    "WHERE {\n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor .\n",
    "  \n",
    "\n",
    "   ?actor sc:name ?objName.\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "c9aae6d6-3fbd-400a-9dfc-963ddf077a05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('nameActor', 'Kevin Bacon')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# trovare Kevin Bacon\n",
    "# Return a list of actor of the cast\n",
    "\n",
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?nameActor \n",
    "WHERE {\n",
    "   \n",
    "    ?film wdt:P161 ?actor .\n",
    "  \n",
    "\n",
    "   ?actor sc:name ?nameActor.\n",
    "   filter regex(?nameActor,\"Kevin Bacon\").\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "51d8726b-123a-4c73-9407-c97e453f6b89",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q48742976'), ('filmName', 'City on a Hill'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('nameActor', \"Mark O'Brien\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1189631'), ('filmName', 'The Following'), ('actor', 'http://www.wikidata.org/entity/Q16185788'), ('nameActor', 'Kyle Catlett')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q519490'), ('filmName', 'Crazy, Stupid, Love.'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('nameActor', 'Julianna Guill')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q16971610'), ('filmName', 'Black Mass'), ('actor', 'http://www.wikidata.org/entity/Q391359'), ('nameActor', 'David Harbour')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q611535'), ('filmName', 'Novocaine'), ('actor', 'http://www.wikidata.org/entity/Q449580'), ('nameActor', 'Lynne Thigpen')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q990987'), ('filmName', 'My One and Only'), ('actor', 'http://www.wikidata.org/entity/Q918866'), ('nameActor', 'Troy Garity')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q691672'), ('filmName', 'Frost/Nixon'), ('actor', 'http://www.wikidata.org/entity/Q1101612'), ('nameActor', 'Clint Howard')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1917925'), ('filmName', 'My Dog Skip'), ('actor', 'http://www.wikidata.org/entity/Q1101612'), ('nameActor', 'Clint Howard')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1724723'), ('filmName', 'End of the Line'), ('actor', 'http://www.wikidata.org/entity/Q1101612'), ('nameActor', 'Clint Howard')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q106428'), ('filmName', 'Apollo 13'), ('actor', 'http://www.wikidata.org/entity/Q1101612'), ('nameActor', 'Clint Howard')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Q3454165 Kevin Bacon\n",
    "# film di kevin bacon\n",
    "#lista attori con keni bacon 1\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmName ?actor ?nameActor\n",
    "WHERE {\n",
    "   \n",
    "    ?film wdt:P161 wd:Q3454165;\n",
    "        wdt:P161 ?actor.\n",
    "    \n",
    "  \n",
    "\n",
    "   ?film sc:name ?filmName.\n",
    "   ?actor sc:name ?nameActor.\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "67745861-b476-4164-8ebb-86147edba058",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q519490'), ('filmName', 'Crazy, Stupid, Love.'), ('actor2', 'http://www.wikidata.org/entity/Q269891'), ('nameActor2', 'Julianna Guill')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q370893'), ('filmName', 'The Air I Breathe'), ('actor2', 'http://www.wikidata.org/entity/Q312705'), ('nameActor2', 'John Cho')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q16167570'), ('filmName', 'Skum Rocks!'), ('actor2', 'http://www.wikidata.org/entity/Q234715'), ('nameActor2', 'Jamie-Lynn Sigler')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q627533'), ('filmName', 'Footloose'), ('actor2', 'http://www.wikidata.org/entity/Q311271'), ('nameActor2', 'John Lithgow')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1476932'), ('filmName', 'Queens Logic'), ('actor2', 'http://www.wikidata.org/entity/Q234137'), ('nameActor2', 'Megan Mullally')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q223596'), ('filmName', 'X-Men: First Class'), ('actor2', 'http://www.wikidata.org/entity/Q530646'), ('nameActor2', 'Ray Wise')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q975358'), ('filmName', 'Stir of Echoes'), ('actor2', 'http://www.wikidata.org/entity/Q199929'), ('nameActor2', 'Jennifer Morrison')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17508638'), ('filmName', 'The Darkness'), ('actor2', 'http://www.wikidata.org/entity/Q199929'), ('nameActor2', 'Jennifer Morrison')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q514348'), ('filmName', 'Flatliners'), ('actor2', 'http://www.wikidata.org/entity/Q433355'), ('nameActor2', 'Patricia Belcher')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q19824612'), ('filmName', 'Cop Car'), ('actor2', 'http://www.wikidata.org/entity/Q234514'), ('nameActor2', 'Camryn Manheim')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Q3454165 Kevin Bacon\n",
    "# film di kevin bacon\n",
    "#lista attori con keni bacon 2\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor2 ?nameActor2\n",
    "WHERE {\n",
    "   \n",
    "    ?film wdt:P161 wd:Q3454165;\n",
    "        wdt:P161 ?actor1.\n",
    "    \n",
    "  \n",
    "     wd:Q147235 wdt:P161 ?actor2.\n",
    "     ?film wdt:P161 ?actor1;\n",
    "         wdt:P161 ?actor2.\n",
    "     \n",
    "    \n",
    "   ?actor2 sc:name ?nameActor2.\n",
    "   \n",
    "   ?film sc:name ?filmName.\n",
    "   ?actor1 sc:name ?nameActor.\n",
    "   \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bfeecafe",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "d374868c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q566037'), ('nameActor2', 'Scoot McNairy')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q1992967'), ('nameActor2', 'John Getz')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q260184'), ('nameActor2', 'Eva Amurri')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q450496'), ('nameActor2', 'Alyssa Shafer')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q231006'), ('nameActor2', 'Jayma Mays')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q454698'), ('nameActor2', 'Darcy Rose Byrnes')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q312705'), ('nameActor2', 'John Cho')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q4888924'), ('nameActor2', 'Benjamin Koldyke')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q235740'), ('nameActor2', 'Busy Philipps')]\n",
      "[('actor2', 'http://www.wikidata.org/entity/Q943613'), ('nameActor2', 'Samm Levine')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#vado a togliere gli attori che hanno il numero 1 di kevin Bacon\n",
    "\n",
    "#Q3454165 Kevin Bacon\n",
    "# film di kevin bacon\n",
    "#lista attori con keni bacon 2\n",
    "# Q147235\tHow I met your mother\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor2 ?nameActor2\n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "    ?film1 wdt:P161 wd:Q3454165;\n",
    "        wdt:P161 ?actor1.\n",
    "    \n",
    "  \n",
    "     wd:Q147235 wdt:P161 ?actor2.\n",
    "     ?film wdt:P161 ?actor1;\n",
    "         wdt:P161 ?actor2.\n",
    "     \n",
    "    \n",
    "   ?actor2 sc:name ?nameActor2.\n",
    "   \n",
    "   ?film sc:name ?filmName.\n",
    "   ?actor1 sc:name ?nameActor.\n",
    "   \n",
    "   FILTER(?actor1 != ?actor2).\n",
    "  \n",
    " \n",
    "   \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0720f32d",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider the actors who are members of the cast of HIMYM. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "78f3f281",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q500769'), ('televisionSeriesName', 'Freaks and Geeks')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q17049828'), ('televisionSeriesName', 'Bad Samaritans')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q15072819'), ('televisionSeriesName', 'Halt and Catch Fire')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q15931555'), ('televisionSeriesName', 'Fargo')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q18151386'), ('televisionSeriesName', 'Kirby Buckets')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q643894'), ('televisionSeriesName', 'Suddenly Susan')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q111756'), ('televisionSeriesName', \"Kickin' It\")]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q22908690'), ('televisionSeriesName', 'The Good Place')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q22908828'), ('televisionSeriesName', 'Haters Back Off')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q210676'), ('televisionSeriesName', 'Nashville')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "# Q5398426 'television series'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?televisionSeries ?televisionSeriesName\n",
    "WHERE {\n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?televisionSeries wdt:P161 ?actor;\n",
    "       ?type wd:Q5398426.\n",
    "  \n",
    "\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "bcf7b692-6c3a-44eb-b7c0-e9494f6ff5b1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q7168625'), ('oName', 'historical drama')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q157443'), ('oName', 'comedy film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q859369'), ('oName', 'comedy-drama')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q102430221'), ('oName', 'coming-of-age television program')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q775344'), ('oName', 'teen drama')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q3045762'), ('oName', 'Primetime Emmy Award for Outstanding Writing for a Comedy Series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q7669614'), ('oName', 'TCA Award for Outstanding Achievement in Drama')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q7669620'), ('oName', 'TCA Award for Outstanding New Program')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q7669628'), ('oName', 'TCA Heritage Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q7243495'), ('oName', 'Primetime Emmy Award for Outstanding Casting for a Comedy Series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q234204'), ('oName', 'Linda Cardellini')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q943613'), ('oName', 'Samm Levine')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q6184097'), ('oName', 'Jerry Messing')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q235740'), ('oName', 'Busy Philipps')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q2313940'), ('oName', 'Becky Ann Baker')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q360663'), ('oName', 'Thomas F. Wilson')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q930117'), ('oName', 'Joe Flaherty')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q463489'), ('oName', 'Natasha Melnick')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q342636'), ('oName', 'John Francis Daley')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q220308'), ('oName', 'Seth Rogen')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "# Q5398426 'television series'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?televisionSeries wdt:P161 ?actor;\n",
    "       ?type wd:Q5398426.\n",
    "    ?televisionSeries ?p ?o.\n",
    "  \n",
    "\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?objName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "49c0cb17-ab86-47c9-b212-2d2829d24249",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1064766'), ('televisionSeriesName', 'Mad TV'), ('award', '8')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1571652'), ('televisionSeriesName', 'Dog with a Blog'), ('award', '1')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q117590'), ('televisionSeriesName', 'Beverly Hills, 90210'), ('award', '30')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q184342'), ('televisionSeriesName', 'Wizards of Waverly Place'), ('award', '4')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1061246'), ('televisionSeriesName', 'Growing Pains'), ('award', '2')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1584299'), ('televisionSeriesName', 'Happy Endings'), ('award', '1')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q23609'), ('televisionSeriesName', 'Weeds'), ('award', '240')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q139849'), ('televisionSeriesName', 'The Suite Life on Deck'), ('award', '3')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1068952'), ('televisionSeriesName', 'St. Elsewhere'), ('award', '15')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q366375'), ('televisionSeriesName', 'Good luck, Charlie!'), ('award', '2')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# P1411 'nominated for'\n",
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "# Q5398426 'television series'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?televisionSeries ?televisionSeriesName (count (?award) as ?award)\n",
    "WHERE {\n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?televisionSeries wdt:P161 ?actor;\n",
    "       ?type wd:Q5398426.\n",
    "    ?televisionSeries wdt:P1411 ?award.\n",
    "  \n",
    "\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    "   \n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "073eaa25",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "06b0921e-12eb-4835-87bc-15611c7e1e33",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1066201'), ('televisionSeriesName', 'Make It or Break It'), ('awards', '6')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q564345'), ('televisionSeriesName', 'Person of Interest'), ('awards', '16')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q187239'), ('televisionSeriesName', 'Zeke and Luther'), ('awards', '2')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q366375'), ('televisionSeriesName', 'Good luck, Charlie!'), ('awards', '2')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q193462'), ('televisionSeriesName', 'Gilmore Girls'), ('awards', '156')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q386880'), ('televisionSeriesName', 'Castle'), ('awards', '78')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q1027097'), ('televisionSeriesName', 'Call Me Fitz'), ('awards', '2')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q390405'), ('televisionSeriesName', 'Nikita'), ('awards', '2')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q18925'), ('televisionSeriesName', \"I'm in the Band\"), ('awards', '3')]\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q485668'), ('televisionSeriesName', 'Scrubs'), ('awards', '98')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# P1411 'nominated for'\n",
    "# P161 cast member\n",
    "# Q147235  'HIMYM'\n",
    "# Q5398426 'television series'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?televisionSeries ?televisionSeriesName (count (?award) as ?awards)\n",
    "WHERE {\n",
    "   \n",
    "   wd:Q147235 wdt:P161 ?actor.\n",
    "   ?televisionSeries wdt:P161 ?actor;\n",
    "       ?type wd:Q5398426.\n",
    "    ?televisionSeries wdt:P1411 ?award.\n",
    "  \n",
    "\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    " \n",
    "  \n",
    "   \n",
    "}\n",
    "GROUP BY ?televisionSeries ?televisionSeriesName\n",
    "HAVING (count (?award) > 1)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
