{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "import sys\n",
    "import os\n",
    "import json\n",
    "import pandas as pd\n",
    "sys.path.insert(1, '/locale/data/jupyter/prando/notebook/sparqlthesis/')\n",
    "import modules.evaluation as evaluation\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-movie1-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Film Genre and composer explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the composers for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for composer\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many films are been released in the United States of America from 2010-01-01 to 2015-31-12 for each film genre available (the result set must be genre IRI, label and #films).\n",
    "\n",
    "5. Consider the timespan from 2001-01-01 to nowadays. Find the number of films released in this timespan divided by film genre and return only those with more than 50 films released every year (the result set must be genre IRI and label).\n",
    "\n",
    "6. Consider the composers of Western films and their country of citizenship. Count the number of Western Films on which worked a composer grouped by country of citizenship and return the top-10 (the result set must be country IRI, label and #films).. \n",
    "\n",
    "7. Consider the decades from 1961 to 1970, and from 2001 to 2010 and compare the total number of western films released in each one (the result set must be two couples decade and #western films of that decade).\n",
    "\n",
    "8. Consider the decades from 1961 to 1970, and from 2001 to 2010 and select only western films. Then, for each decade, compare the average cast members size per film (the result set must be two couples decade and average cast members size of that decade)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "500a4b33",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n"
     ]
    }
   ],
   "source": [
    "## startup the evaluation\n",
    "# setup the file and create the empty json\n",
    "ipname = \"m1.ipynb\"\n",
    "pt = os.getcwd()+os.sep+ipname\n",
    "evaluation.setup(pt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "130c4e78-ec70-48c2-aba0-5bb0d0f63286",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "0ab917a4-54d4-4a58-ad3c-e89b3dd3d083",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('name', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('name', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1309'), ('name', 'EGAXA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1317'), ('name', 'floruit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1455'), ('name', 'list of works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1477'), ('name', 'birth name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1607'), ('name', 'Dialnet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1728'), ('name', 'AllMusic artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1816'), ('name', 'National Portrait Gallery (London) person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1819'), ('name', 'genealogics.org person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1969'), ('name', 'MovieMeter director ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1977'), ('name', 'Les Archives du Spectacle Person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2174'), ('name', 'Museum of Modern Art artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2188'), ('name', 'BiblioNet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2190'), ('name', 'C-SPAN person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2191'), ('name', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('name', 'PORT person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P245'), ('name', 'Union List of Artist Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2469'), ('name', 'Theatricalia person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2519'), ('name', 'Scope.dk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2626'), ('name', 'Danish National Filmography person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2688'), ('name', 'Box Office Mojo person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P271'), ('name', 'CiNii author ID (books)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2734'), ('name', 'Unz Review author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2963'), ('name', 'Goodreads author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3056'), ('name', 'TCM Movie Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3065'), ('name', 'RERO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3136'), ('name', 'elCinema person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3142'), ('name', 'EDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3280'), ('name', 'BAnQ author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3305'), ('name', 'KINENOTE person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3348'), ('name', 'National Library of Greece ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('name', 'SNAC ARK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3478'), ('name', 'Songkick artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3630'), ('name', 'Babelio author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3762'), ('name', 'openMLOL author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3782'), ('name', 'Artnet artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3788'), ('name', 'BNMM authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3846'), ('name', 'DBC author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P396'), ('name', 'SBN author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3987'), ('name', 'SHARE Catalogue author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4104'), ('name', 'Carnegie Hall agent ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4208'), ('name', 'Billboard artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4293'), ('name', 'PM20 folder ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P434'), ('name', 'MusicBrainz artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4456'), ('name', 'Internet Off-Broadway Database creditable entity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4619'), ('name', 'National Library of Brazil ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4638'), ('name', 'The Peerage person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4657'), ('name', 'The Numbers person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5033'), ('name', 'Filmweb.pl person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5034'), ('name', 'National Library of Korea ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5068'), ('name', 'Flanders Arts Institute person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5121'), ('name', 'All About Jazz musician ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5284'), ('name', 'Douban movie celebrity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5312'), ('name', 'Kino-teatr.ua person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5361'), ('name', 'BNB person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5414'), ('name', 'The Paris Review interviewee ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5419'), ('name', 'NYRB contributor ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5421'), ('name', 'Trading Card Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5491'), ('name', \"BD Gest' author ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5534'), ('name', 'Open Media Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5587'), ('name', 'Libris-URI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5617'), ('name', 'Evene ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5739'), ('name', 'Pontificia Università della Santa Croce ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5882'), ('name', 'Muziekweb performer ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6150'), ('name', 'Academy Awards Database nominee ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6181'), ('name', 'Disney A to Z ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6394'), ('name', 'ELNET ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6656'), ('name', 'BHCL ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6706'), ('name', 'De Agostini ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6844'), ('name', 'abART person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6870'), ('name', 'Latvian National Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7029'), ('name', 'National Library of Russia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7084'), ('name', 'related category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7214'), ('name', 'Allcinema person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7369'), ('name', 'National Library of Chile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7400'), ('name', 'LibraryThing author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7699'), ('name', 'National Library of Lithuania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7700'), ('name', 'Slovak National Library ID (VIAF)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7803'), ('name', 'Decine21 person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7865'), ('name', 'CoBiS author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7902'), ('name', 'Deutsche Biographie (GND) ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7929'), ('name', 'Roglo person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8094'), ('name', 'GeneaStar person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8179'), ('name', 'Canadiana NCF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8189'), ('name', 'National Library of Israel J9U ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8385'), ('name', 'IDU person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8625'), ('name', 'bibliography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P866'), ('name', 'Perlentaucher ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8796'), ('name', 'FilmPolski press collection ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8971'), ('name', 'Cinémathèque québécoise person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8974'), ('name', 'SAPA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8980'), ('name', 'KANTO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9037'), ('name', 'BHCL UUID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P906'), ('name', 'SELIBR ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9141'), ('name', 'Portal da Literatura ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9807'), ('name', 'SNK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4283'), ('name', 'LUMIERE director ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8929'), ('name', 'religion or world view')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3144'), ('name', 'elFilm person ID')]\n",
      "201\n"
     ]
    }
   ],
   "source": [
    "# properties of Woody Allen\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE { \n",
    "    wd:Q25089 ?p ?obj.\n",
    "    ?p sc:name ?name.\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2650'), ('name', 'interested in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('name', \"category's main topic\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P825'), ('name', 'dedicated to')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P971'), ('name', 'category combines topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('name', 'Wikidata property example')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P87'), ('name', 'librettist')]\n",
      "28\n"
     ]
    }
   ],
   "source": [
    "# Allen as object of the triples, properties incoming\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE { \n",
    "    ?obj ?p wd:Q25089.\n",
    "    ?p sc:name ?name.\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ce545fc8-725e-4f7f-a29c-a23f9f9d63dd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q206124'), ('name', 'Midnight in Paris')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q682262'), ('name', 'Alice')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14511869'), ('name', 'Magic in the Moonlight')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q806092'), ('name', 'Bananas')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1004531'), ('name', 'Bullets Over Broadway')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321004'), ('name', 'You Will Meet a Tall Dark Stranger')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q729026'), ('name', 'Broadway Danny Rose')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q733677'), ('name', 'Match Point')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q740143'), ('name', 'Husbands and Wives')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use director\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?obj wdt:P57 wd:Q25089 .\n",
    "    ?obj sc:name ?name.\n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "bee0141c-1144-45ab-90c7-a7f958aee772",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q506240'), ('name', 'television film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24862'), ('name', 'short film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q47467768'), ('name', 'operatic production')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# instance of films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?obj wdt:P57 wd:Q25089 ;\n",
    "        wdt:P31 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8bdf6583",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 1 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q11424\"\n",
    "og_name = \"film\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"1\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1df13e2-d7cb-417e-b171-95a9206f5380",
   "metadata": {},
   "source": [
    "`wd:Q11424` -> film"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ef2ed3c7-1a8a-4ec9-937e-4f8701021e2b",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ea089d1f-7b9d-4cb2-a2e9-d9babf258e41",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7003'), ('name', 'ACMI web ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7118'), ('name', 'AMPAS collections film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6151'), ('name', 'ANICA ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9032'), ('name', 'AVN movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7194'), ('name', 'AZLyrics.com artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9283'), ('name', 'AaRC title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6145'), ('name', 'Academy Awards Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6150'), ('name', 'Academy Awards Database nominee ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7777'), ('name', 'AdoroCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5083'), ('name', 'Adult Film Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9701'), ('name', 'African Film Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4513'), ('name', 'Africultures movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8895'), ('name', 'All the Tropes identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1729'), ('name', 'AllMusic album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1267'), ('name', 'AlloCiné series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5749'), ('name', 'Amazon Standard Identification Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8055'), ('name', 'Amazon.com Prime Video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3502'), ('name', 'Ameblo username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5646'), ('name', 'AniDB anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8729'), ('name', 'AniList anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1934'), ('name', 'Animator.ru film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1985'), ('name', 'Anime News Network anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1984'), ('name', 'Anime News Network manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5845'), ('name', 'AnimeClick anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5860'), ('name', 'AnimeClick drama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5849'), ('name', 'AnimeClick manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2281'), ('name', 'Apple Music album ID (U.S. version)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9751'), ('name', 'Apple TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5218'), ('name', 'Armenian Cinema ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9629'), ('name', 'Armeniapedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8294'), ('name', 'AusStage work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8295'), ('name', 'AustLit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3156'), ('name', 'Australian Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8326'), ('name', 'Australian Classification ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3218'), ('name', 'Auñamendi ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3293'), ('name', 'BALaT object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9086'), ('name', 'BAMID film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3280'), ('name', 'BAnQ author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1823'), ('name', 'BAnQ work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6200'), ('name', 'BBC News topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P827'), ('name', 'BBC programme ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2629'), ('name', 'BBFC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8794'), ('name', 'BBFC reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4438'), ('name', 'BFI Films, TV and people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2703'), ('name', 'BFI National Archive work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6211'), ('name', 'BIBSYS work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3976'), ('name', 'BVMC work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6196'), ('name', 'Badtaste ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6367'), ('name', \"Bahamut Gamer's Community ACG Database ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3997'), ('name', 'Bait La Zemer Ha-Ivri artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3821'), ('name', 'Bangla Movie Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7448'), ('name', 'Basis Wien object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4965'), ('name', 'Behind The Voice Actors video game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5384'), ('name', 'Behind The Voice Actors film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5382'), ('name', 'Behind The Voice Actors franchise ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5387'), ('name', 'Behind The Voice Actors TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4254'), ('name', 'Bengali Banglapedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4440'), ('name', 'Biblioteca Nacional de México ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4933'), ('name', 'Big Cartoon Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6456'), ('name', 'Bilibili video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6175'), ('name', 'Bitraga work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5499'), ('name', 'Boijmans work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8674'), ('name', 'Bollywood Hungama movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7923'), ('name', 'Bollywood Hungama person alphabetic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8856'), ('name', 'British Phonographic Industry ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4845'), ('name', 'Bulbapedia article')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7685'), ('name', 'CALS Encyclopedia of Arkansas ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6452'), ('name', 'CBFC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1890'), ('name', 'CCAB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6657'), ('name', 'CHVRS Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8908'), ('name', 'CINE21 film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9146'), ('name', 'CITWF title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3458'), ('name', 'CNC authorization number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2758'), ('name', 'CNC film rating (France)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3402'), ('name', 'CNC film rating (Romania)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7037'), ('name', 'COURAGE ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5395'), ('name', 'Canadian Encyclopedia article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1670'), ('name', 'Canadiana Authorities ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8179'), ('name', 'Canadiana NCF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4104'), ('name', 'Carnegie Hall agent ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5229'), ('name', 'Carnegie Hall work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3241'), ('name', 'Catholic Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9857'), ('name', 'Center for Turkish Cinema Studies film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4861'), ('name', 'Charity Navigator ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5737'), ('name', 'Chinese Moegirlpedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3128'), ('name', 'CiNetMag film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1739'), ('name', 'CiNii book ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9203'), ('name', 'CineFAN.ro title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7593'), ('name', 'CinePT film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8296'), ('name', 'Cinema Context ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5146'), ('name', 'Cinema Project (Israel) ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3445'), ('name', 'Cinema of Israel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9204'), ('name', 'CinemaRX title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9848'), ('name', 'Cinemaitaliano film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3851'), ('name', 'Cinenacional.com movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7177'), ('name', 'Cinestaan film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5791'), ('name', 'Cineuropa film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7679'), ('name', 'Cinépolis KLIC ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8958'), ('name', 'ClassInd audiovisual work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3216'), ('name', 'ClassInd rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7132'), ('name', 'ComingSoon.it film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7091'), ('name', 'Common Sense Media ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1612'), ('name', 'Commons Institution page')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4765'), ('name', 'Commons compatible image available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2011'), ('name', 'Cooper-Hewitt Person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6359'), ('name', 'Crew United title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2088'), ('name', 'Crunchbase organization ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4110'), ('name', 'Crunchyroll ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5318'), ('name', 'César Award film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1707'), ('name', 'DAAO ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5510'), ('name', 'DEFA film database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1292'), ('name', 'DNB editions')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P356'), ('name', 'DOI')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2942'), ('name', 'Dailymotion channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8708'), ('name', 'Danish educational institution number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6706'), ('name', 'De Agostini ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7978'), ('name', 'Decine21 film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6164'), ('name', 'Depósito Legal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4834'), ('name', 'Deutsche Synchronkartei series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8359'), ('name', 'Dewey Decimal Classification (works and editions)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7872'), ('name', 'Diccionari del cinema a Catalunya ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9186'), ('name', 'DicoPolHiS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3794'), ('name', 'Dictionary of Sydney ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1954'), ('name', 'Discogs master ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2206'), ('name', 'Discogs release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6181'), ('name', 'Disney A to Z ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7595'), ('name', 'Disney+ movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7596'), ('name', 'Disney+ series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5284'), ('name', 'Douban movie celebrity ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7236'), ('name', 'Dove.org work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7306'), ('name', 'Downdetector ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9461'), ('name', 'DzygaMDB film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7892'), ('name', 'EFIS film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2756'), ('name', 'EIRIN film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7222'), ('name', 'Eiga.com movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2897'), ('name', 'Eldoblaje Movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4746'), ('name', 'Elhuyar ZTH ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6010'), ('name', 'Encyclopedia of Alabama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9281'), ('name', 'Encyclopedia of Greater Philadelphia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3338'), ('name', 'Encyclopedia of Surfing ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7686'), ('name', 'Encyclopedia of the Great Plains ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6679'), ('name', 'Encyklopedia Teatru Polskiego play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3121'), ('name', 'Epguides ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8800'), ('name', 'European Film Awards ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7704'), ('name', 'Europeana entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7665'), ('name', 'FMV World ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4437'), ('name', 'FPB rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8680'), ('name', 'FVLB work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4003'), ('name', 'Facebook page ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9118'), ('name', 'Family Video Game Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5693'), ('name', 'Fandango film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8125'), ('name', 'Fandango person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5820'), ('name', 'Film Indonesia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6762'), ('name', 'FilmFreeway ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8796'), ('name', 'FilmPolski press collection ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3495'), ('name', 'FilmPolski.pl ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5255'), ('name', 'FilmTv.it TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5253'), ('name', 'FilmTv.it movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9367'), ('name', 'Filmitalia film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7519'), ('name', 'Filmový přehled film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5233'), ('name', 'Filmow ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2639'), ('name', 'Filmportal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8531'), ('name', 'Filmstarts title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8928'), ('name', 'Filmstriben film-ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3995'), ('name', 'Filmweb.pl ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9478'), ('name', 'Finna ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3267'), ('name', 'Flickr user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3589'), ('name', 'GCD series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3367'), ('name', 'GECD film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2725'), ('name', 'GOG application ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7175'), ('name', 'Gaana.com album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4769'), ('name', 'GameFAQs game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6623'), ('name', 'Gamepedia article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6218'), ('name', 'Genius song ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6420'), ('name', 'Georgian National Filmography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5986'), ('name', 'Getty Iconography Authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5247'), ('name', 'Giant Bomb ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4013'), ('name', 'Giphy username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1842'), ('name', 'Global Anabaptist Mennonite Encyclopedia Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3962'), ('name', 'Global Trade Item Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2969'), ('name', 'Goodreads version/edition ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8383'), ('name', 'Goodreads work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4702'), ('name', 'Google Arts & Culture partner ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4701'), ('name', 'Google Arts & Culture asset ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4431'), ('name', 'Google Doodle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5337'), ('name', 'Google News topics ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2847'), ('name', 'Google+ ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9863'), ('name', 'Gujarati Vishwakosh entry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8298'), ('name', 'HBO Max ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5909'), ('name', 'HKCAN ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2883'), ('name', 'HKMDB film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5091'), ('name', 'HanCinema drama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5108'), ('name', 'HanCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8874'), ('name', 'Hong Kong film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6868'), ('name', 'Hoopla artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5680'), ('name', 'Hoopla title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2816'), ('name', 'HowLongToBeat ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6466'), ('name', 'Hulu movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6467'), ('name', 'Hulu series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9067'), ('name', 'Hungarian Film Archive ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5098'), ('name', 'IAFD film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5128'), ('name', 'ICAA film catalogue ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3306'), ('name', 'ICAA rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7741'), ('name', 'IDFA film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7573'), ('name', 'IFCO rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5150'), ('name', 'IGAC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5865'), ('name', 'IGN film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5201'), ('name', 'IMDA rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6992'), ('name', 'IMFDB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3194'), ('name', 'INA video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3428'), ('name', 'INCAA film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4483'), ('name', 'INDUCKS story ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P898'), ('name', 'IPA transcription')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1297'), ('name', 'IRS Employer Identification Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P957'), ('name', 'ISBN-10')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P212'), ('name', 'ISBN-13')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1274'), ('name', 'ISFDB title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3110'), ('name', 'ISzDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5987'), ('name', 'Indiancine.ma film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7953'), ('name', 'Indiegogo project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6748'), ('name', 'Interactive Fiction Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P724'), ('name', 'Internet Archive ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1218'), ('name', 'Internet Broadway Database production ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1219'), ('name', 'Internet Broadway Database show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5794'), ('name', 'Internet Game Database game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7932'), ('name', 'Irish playography play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3906'), ('name', 'Ishim ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5151'), ('name', 'Israel Film Fund ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4399'), ('name', 'Itaú Cultural ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2400'), ('name', 'JMDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3650'), ('name', 'JMK film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P888'), ('name', 'JSTOR article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5152'), ('name', 'KAVI rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3750'), ('name', 'KMDb documentary film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3704'), ('name', 'KMDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1649'), ('name', 'KMDb person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3818'), ('name', 'KMRB film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8921'), ('name', 'KOBIS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7985'), ('name', 'Kanopy ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8019'), ('name', 'Kickstarter project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2684'), ('name', 'Kijkwijzer rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7458'), ('name', 'Kinematoscope film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2970'), ('name', 'Kinopolis film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8847'), ('name', 'Kinorium movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6760'), ('name', 'Know Your Meme ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3340'), ('name', 'Kvikmyndir film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7211'), ('name', 'LINE BLOG user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9525'), ('name', 'LMIC musician ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3192'), ('name', 'Last.fm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8999'), ('name', 'Lexikon zum Literatur- und Kulturbetrieb im Österreich der Zwischenkriegszeit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7107'), ('name', 'LezWatch.TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8360'), ('name', 'Library of Congress Classification (works and editions)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4953'), ('name', 'Library of Congress Genre/Form Terms ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1144'), ('name', 'Library of Congress Control Number (LCCN) (bibliographic)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2089'), ('name', 'Library of Congress JukeBox ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1085'), ('name', 'LibraryThing work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6614'), ('name', 'Libreflix ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3258'), ('name', 'LiveJournal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6520'), ('name', 'Lokalhistoriewiki.no ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7597'), ('name', 'Lutris game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7212'), ('name', 'LyricsTranslate ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1657'), ('name', 'MPAA film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7631'), ('name', 'MPPDA Digital Archive film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8889'), ('name', 'MTRCB rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7299'), ('name', 'MUBI film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4779'), ('name', 'MYmovies actor ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4780'), ('name', 'MYmovies movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7204'), ('name', 'Mafab.hu film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8918'), ('name', 'Max Movie film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1942'), ('name', 'McCune-Reischauer romanization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6368'), ('name', 'Media Arts Database anime ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7117'), ('name', 'Media Arts Database console games ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7886'), ('name', 'Media Arts Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9022'), ('name', 'Mediafilm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2826'), ('name', 'Megogo ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6922'), ('name', 'Metro topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2624'), ('name', 'MetroLyrics ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5885'), ('name', 'Microsoft Store product ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2636'), ('name', 'Minkultury film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7335'), ('name', 'Mixer game ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1933'), ('name', 'MobyGames game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9365'), ('name', 'Modernist Commons ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5495'), ('name', 'Mormon Literature and Creative Arts Database Works ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5925'), ('name', 'Moviepilot.de series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4784'), ('name', 'Movieplayer TV-series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4783'), ('name', 'Movieplayer film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5990'), ('name', 'Movies Anywhere ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8920'), ('name', 'Movist film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6458'), ('name', 'Mtime movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6464'), ('name', 'Mtime people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2014'), ('name', 'Museum of Modern Art work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P434'), ('name', 'MusicBrainz artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4404'), ('name', 'MusicBrainz recording ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5813'), ('name', 'MusicBrainz release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P436'), ('name', 'MusicBrainz release group ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1407'), ('name', 'MusicBrainz series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P435'), ('name', 'MusicBrainz work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5882'), ('name', 'Muziekweb performer ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4086'), ('name', 'MyAnimeList anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4087'), ('name', 'MyAnimeList manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3868'), ('name', 'MyDramaList title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3265'), ('name', 'Myspace ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7140'), ('name', 'München Wiki article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2475'), ('name', 'NAVA ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1055'), ('name', 'NLM Unique ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2363'), ('name', 'NMHH film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3959'), ('name', 'NNL item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6549'), ('name', 'NZ On Screen work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4606'), ('name', 'National Film Board of Canada film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4683'), ('name', 'National Gallery of Art artwork ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4619'), ('name', 'National Library of Brazil ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8189'), ('name', 'National Library of Israel J9U ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7369'), ('name', 'National Library of Chile ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7699'), ('name', 'National Library of Lithuania ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6152'), ('name', 'National Portrait Gallery (United States) object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7506'), ('name', 'Naver Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8673'), ('name', 'Naver movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8652'), ('name', 'Netflix maturity rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4903'), ('name', 'New Georgia Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6900'), ('name', 'NicoNicoPedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7749'), ('name', 'Nomenclature for Museum Cataloging')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1439'), ('name', 'Norwegian filmography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P243'), ('name', 'OCLC control number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5331'), ('name', 'OCLC work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7327'), ('name', 'OFLC classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5163'), ('name', 'Odnoklassniki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8286'), ('name', 'Olympedia people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1430'), ('name', 'OpenPlaques subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6337'), ('name', 'PCGamingWiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1236'), ('name', 'Parsons code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4643'), ('name', 'Philadelphia Museum of Art work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3836'), ('name', 'Pinterest username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5833'), ('name', 'Playbill production ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4515'), ('name', 'Prisma ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2637'), ('name', 'RARS rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6658'), ('name', 'RCQ classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3065'), ('name', 'RERO ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6081'), ('name', 'RIA Novosti reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3705'), ('name', 'RITVA Program ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3834'), ('name', 'RTC film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8392'), ('name', 'Rate Your Music release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7775'), ('name', 'RationalWiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5290'), ('name', 'Redump.org ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6228'), ('name', 'RegiowikiAT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6554'), ('name', 'Represent Me ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5875'), ('name', 'ResearchGate publication ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2001'), ('name', 'Revised Romanization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6932'), ('name', 'RogerEbert.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2678'), ('name', 'Russiancinema.ru film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P906'), ('name', 'SELIBR ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7523'), ('name', 'SK cinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1025'), ('name', 'SUDOC editions')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9322'), ('name', 'SVKKL authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6817'), ('name', 'SVT Play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P370'), ('name', 'Sandbox-String')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7839'), ('name', 'Saregama artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6584'), ('name', 'Scripts.com script ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2908'), ('name', 'SecondHandSongs work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6133'), ('name', 'Siamzone film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5338'), ('name', 'SilentEra.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3579'), ('name', 'Sina Weibo user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6256'), ('name', 'SinemaTürk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9205'), ('name', 'Sinemalar title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2984'), ('name', 'Snapchat username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3478'), ('name', 'Songkick artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3040'), ('name', 'SoundCloud ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3854'), ('name', 'Soundtrack Collector ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3139'), ('name', 'SourehCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1447'), ('name', 'Sports-Reference.com Olympic athlete ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2205'), ('name', 'Spotify album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3145'), ('name', 'Sratim ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1482'), ('name', 'Stack Exchange tag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1733'), ('name', 'Steam application ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8256'), ('name', 'Super Mario Wiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1316'), ('name', 'Swedish Media Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6474'), ('name', 'Swiss Films ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6219'), ('name', 'TASS reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2613'), ('name', 'TED talk ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4983'), ('name', 'TMDb TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8600'), ('name', 'TV Maze series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6383'), ('name', 'TV Spielfilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6643'), ('name', 'TV Spielfilm series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7611'), ('name', 'Taiwan Cinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5829'), ('name', 'Television Academy Foundation show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8144'), ('name', 'Ternopil Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6134'), ('name', 'Thaifilm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9584'), ('name', 'The Criterion Collection film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7952'), ('name', 'The First Amendment Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7284'), ('name', 'The Independent topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3634'), ('name', 'The Met object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5159'), ('name', 'The New Fund for Cinema and Television (Israel) ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7691'), ('name', 'The Oregon Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4204'), ('name', 'The Times of India topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7043'), ('name', 'TheTVDB episode ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4835'), ('name', 'TheTVDB.com series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1242'), ('name', 'Theatricalia play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7085'), ('name', 'TikTok username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8013'), ('name', 'Trakt.tv ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9760'), ('name', \"Treccani's Enciclopedia del Cinema ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3134'), ('name', 'TripAdvisor ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7760'), ('name', 'Tubi movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3943'), ('name', 'Tumblr username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6552'), ('name', 'Twitter user numeric ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2699'), ('name', 'URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7555'), ('name', 'UVL game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9821'), ('name', 'Unconsenting Media ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3961'), ('name', 'Unifrance film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3929'), ('name', 'V&A item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5659'), ('name', 'VGMdb product ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3185'), ('name', 'VK ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2191'), ('name', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7591'), ('name', 'VideoGameGeek game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4015'), ('name', 'Vimeo identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3180'), ('name', 'Visual Novel Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7334'), ('name', 'Vudu video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6738'), ('name', 'Whitney Museum of American Art artwork ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6517'), ('name', 'WhoSampled artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8344'), ('name', 'WikiTrek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4656'), ('name', 'Wikimedia import URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P600'), ('name', 'Wine AppDB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4839'), ('name', 'Wolfram Language entity code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5505'), ('name', 'WorldCat Registry ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7285'), ('name', 'Writers Guild of America project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8823'), ('name', 'Xfinity Stream ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2819'), ('name', 'Yandex Music release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3108'), ('name', 'Yelp ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7193'), ('name', 'YesAsia author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3414'), ('name', 'Yle Areena item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2397'), ('name', 'YouTube channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4300'), ('name', 'YouTube playlist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1651'), ('name', 'YouTube video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7228'), ('name', 'access restriction status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5202'), ('name', 'adapted by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6291'), ('name', 'advertises')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P945'), ('name', 'allegiance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4970'), ('name', 'alternate names')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6942'), ('name', 'animator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6949'), ('name', 'announcement date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1065'), ('name', 'archive URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2960'), ('name', 'archive date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3174'), ('name', 'art director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5126'), ('name', 'assistant director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1110'), ('name', 'attendance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P51'), ('name', 'audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P990'), ('name', \"audio recording of the subject's spoken voice\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7501'), ('name', 'audio system')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2093'), ('name', 'author name string')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2208'), ('name', 'average shot length')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5732'), ('name', 'bgm.tv subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5733'), ('name', 'bilibili ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3301'), ('name', 'broadcast by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7936'), ('name', 'business model')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4312'), ('name', 'camera setup')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4082'), ('name', 'captured with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6476'), ('name', 'castingvideos ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P972'), ('name', 'catalog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P528'), ('name', 'catalog code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6251'), ('name', 'catchphrase')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P971'), ('name', 'category combines topics')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1754'), ('name', 'category related to list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8670'), ('name', 'character designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P453'), ('name', 'character role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1809'), ('name', 'choreographer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4786'), ('name', 'cinematografo film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2860'), ('name', 'cites work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1638'), ('name', 'codename')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2716'), ('name', 'collage image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P547'), ('name', 'commemorates')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1801'), ('name', 'commemorative plaque image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P88'), ('name', 'commissioned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1027'), ('name', 'conferred by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2789'), ('name', 'connects with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4330'), ('name', 'contains')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P767'), ('name', 'contributor to the creative work or subject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3931'), ('name', 'copyright holder')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P275'), ('name', 'copyright license')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6216'), ('name', 'copyright status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2130'), ('name', 'cost')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2515'), ('name', 'costume designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P736'), ('name', 'cover art by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1029'), ('name', 'crew member(s)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1013'), ('name', 'criterion used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4022'), ('name', 'danskefilm TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4021'), ('name', 'danskefilm animated film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3785'), ('name', 'danskefilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3787'), ('name', 'danskefilm silent film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4209'), ('name', 'danskfilmogtv title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3575'), ('name', 'data size')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2913'), ('name', 'date depicted')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5204'), ('name', 'date of commercialization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1191'), ('name', 'date of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3999'), ('name', 'date of official closure')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1619'), ('name', 'date of official opening')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P825'), ('name', 'dedicated to')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P287'), ('name', 'designed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1444'), ('name', 'destination point')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P178'), ('name', 'developer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2386'), ('name', 'diameter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1037'), ('name', 'director / manager')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3113'), ('name', 'does not have part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1028'), ('name', 'donated by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6086'), ('name', 'dramaturge')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P393'), ('name', 'edition number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P629'), ('name', 'edition or translation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P98'), ('name', 'editor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3135'), ('name', 'elCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3136'), ('name', 'elCinema person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P968'), ('name', 'email address')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8001'), ('name', 'endorsed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2257'), ('name', 'event interval')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P608'), ('name', 'exhibition history')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2755'), ('name', 'exploitation visa number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6524'), ('name', 'expression of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2236'), ('name', 'external subproperty')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2079'), ('name', 'fabrication method')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5327'), ('name', 'fernsehserien.de ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2701'), ('name', 'file format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3092'), ('name', 'film crew member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3383'), ('name', 'film poster')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3816'), ('name', 'film script')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6603'), ('name', 'film-documentaire.fr author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3673'), ('name', 'film-documentaire.fr film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1922'), ('name', 'first line')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1317'), ('name', 'floruit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1686'), ('name', 'for work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7937'), ('name', 'form of creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1080'), ('name', 'from narrative universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P953'), ('name', 'full work available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8324'), ('name', 'funder')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6195'), ('name', 'funding scheme')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6418'), ('name', 'funk channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P404'), ('name', 'game mode')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P828'), ('name', 'has cause')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1479'), ('name', 'has contributing factor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P747'), ('name', 'has edition or translation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1542'), ('name', 'has effect')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P912'), ('name', 'has facility')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6439'), ('name', 'has lyrics')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1625'), ('name', 'has melody')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2670'), ('name', 'has parts of the class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2572'), ('name', 'hashtag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2048'), ('name', 'height')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1435'), ('name', 'heritage designation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P504'), ('name', 'home port')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6381'), ('name', 'iTunes TV season ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P110'), ('name', 'illustrator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P479'), ('name', 'input method')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2360'), ('name', 'intended public')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P217'), ('name', 'inventory number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P360'), ('name', 'is a list of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P121'), ('name', 'item operated')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2936'), ('name', 'language used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3132'), ('name', 'last line')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2043'), ('name', 'length')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6224'), ('name', 'level of description')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3308'), ('name', 'lib.reviews ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P87'), ('name', 'librettist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5026'), ('name', 'lighting designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1881'), ('name', 'list of characters')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P669'), ('name', 'located on street')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1071'), ('name', 'location of creation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4647'), ('name', 'location of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P740'), ('name', 'location of formation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P676'), ('name', 'lyrics by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8035'), ('name', 'm3db.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P186'), ('name', 'made from material')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P126'), ('name', 'maintained by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4805'), ('name', 'make-up artist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1557'), ('name', 'manifestation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P176'), ('name', 'manufacturer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2899'), ('name', 'minimum age')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5059'), ('name', 'modified version of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1451'), ('name', 'motto text')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3300'), ('name', 'musical conductor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2561'), ('name', 'name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1814'), ('name', 'name in kana')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1810'), ('name', 'named as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6962'), ('name', 'narrative motif')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2438'), ('name', 'narrator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1705'), ('name', 'native label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1449'), ('name', 'nickname')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4353'), ('name', 'nominated by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6500'), ('name', 'non-free artwork image URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1350'), ('name', 'number of matches played/races/starts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1104'), ('name', 'number of pages')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1132'), ('name', 'number of participants')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2635'), ('name', 'number of parts of this work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5436'), ('name', 'number of viewers/listeners')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1581'), ('name', 'official blog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1448'), ('name', 'official name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P306'), ('name', 'operating system')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P137'), ('name', 'operator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P449'), ('name', 'original broadcaster')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3803'), ('name', 'original film format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P127'), ('name', 'owned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1923'), ('name', 'participating team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1246'), ('name', 'patent number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1766'), ('name', 'place name sign')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P291'), ('name', 'place of publication')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P400'), ('name', 'platform')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9177'), ('name', 'playDB play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5940'), ('name', 'plot expanded in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P585'), ('name', 'point in time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1142'), ('name', 'political ideology')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4634'), ('name', 'premiere type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5072'), ('name', 'presented in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P371'), ('name', 'presenter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2284'), ('name', 'price')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2849'), ('name', 'produced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4733'), ('name', 'produced sound')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2364'), ('name', 'production code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2754'), ('name', 'production date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P742'), ('name', 'pseudonym')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3893'), ('name', 'public domain date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1433'), ('name', 'published in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P123'), ('name', 'publisher')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6166'), ('name', 'quotes work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4271'), ('name', 'rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P483'), ('name', 'recorded at studio or venue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8546'), ('name', 'recording location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2550'), ('name', 'recording or performance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1652'), ('name', 'referee')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P854'), ('name', 'reference URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8371'), ('name', 'references work, tradition or theory')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6802'), ('name', 'related image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P611'), ('name', 'religious order')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1366'), ('name', 'replaced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2675'), ('name', 'reply to')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4646'), ('name', 'representation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1875'), ('name', 'represented by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P444'), ('name', 'review score')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P447'), ('name', 'review score by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5707'), ('name', 'samples from work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1752'), ('name', 'scale')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4608'), ('name', 'scenographer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5555'), ('name', 'schematic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4908'), ('name', 'season')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1659'), ('name', 'see also')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8278'), ('name', 'serial identifier on SerialZone')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1545'), ('name', 'series ordinal')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2512'), ('name', 'series spin-off')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3030'), ('name', 'sheet music')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1813'), ('name', 'short name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2407'), ('name', 'short-term exposure limit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7340'), ('name', 'sixpackfilmdata film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8687'), ('name', 'social media followers')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5028'), ('name', 'sound designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P406'), ('name', 'soundtrack release')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1896'), ('name', 'source website for the property')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1427'), ('name', 'start point')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7512'), ('name', 'startrek.com Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P248'), ('name', 'stated in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P805'), ('name', 'statement is subject of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3275'), ('name', 'storyboard artist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P963'), ('name', 'streaming media URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1680'), ('name', 'subtitle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P942'), ('name', 'theme music')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2139'), ('name', 'total revenue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5051'), ('name', 'towards')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P658'), ('name', 'tracklist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P655'), ('name', 'translator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2739'), ('name', 'typeface/font used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2737'), ('name', 'union of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P366'), ('name', 'use')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7261'), ('name', 'use restriction status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9182'), ('name', 'uta-net.com song ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8351'), ('name', 'vglist video game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P10'), ('name', 'video')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P478'), ('name', 'volume')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1019'), ('name', 'web feed URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2049'), ('name', 'width')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2032'), ('name', 'work period (end)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "924\n"
     ]
    }
   ],
   "source": [
    "# properties of films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        ?prop ?obj.\n",
    "    ?prop sc:name ?name.\n",
    "}\n",
    "ORDER BY ?name\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "3fba6aca-0c47-4342-92a7-e30d6cdccec2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11720172'), ('name', 'Janusz Grudziński')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11767762'), ('name', 'Marcin Pospieszalski')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11817456'), ('name', 'Piotr Figiel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13036911'), ('name', 'Aleksandër Lalo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3299298'), ('name', 'Avni Mula')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4759658'), ('name', 'Andrzej Markowski')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7196950'), ('name', 'Piotr Hertel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9285011'), ('name', 'Hajg Zaharian')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9312585'), ('name', 'Roman Rewakowicz')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q159250'), ('name', 'Daniel Landa')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10287874'), ('name', 'Gabriel Migliori')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1692106'), ('name', 'Johan Zachrisson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10327605'), ('name', 'Mauro Senise')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11912173'), ('name', 'Vladivojna La Chia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1261038'), ('name', 'Richard A. Whiting')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1564988'), ('name', 'Radamés Gnattali')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5248182'), ('name', 'Deborah Blando')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5570555'), ('name', 'Tord Benner')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5961437'), ('name', 'Lille Bror Söderlundh')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6200457'), ('name', 'Jules Sylvain')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#use the property P86 to list some composers\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P86 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c2e1d6f3-a261-4ffb-b32f-ab00941f72a1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1415090'), ('name', 'film score composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680731'), ('name', 'opera composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680663'), ('name', 'classical composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680699'), ('name', 'operetta composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24256060'), ('name', 'professor of music composition')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q64356038'), ('name', 'musical theatre composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8008937'), ('name', 'Category:Composers')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q63536580'), ('name', 'video game composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5156675'), ('name', 'Compo')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# look at their occupation\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P86 ?obj.\n",
    "    ?obj wdt:P106 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"ompo\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "2cfefbf8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 2 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q36834\"\n",
    "og_name = \"composer\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"2\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4447c692-1a81-4d25-9930-093047bd3444",
   "metadata": {},
   "source": [
    "Find `wd:Q36834` -> composer"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d1b629d5-6005-4825-9784-c69940b5e249",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7c214c4b-c5b0-4a8a-a278-5e36500ffb28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1054574'), ('name', 'romance film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q369747'), ('name', 'war film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52162262'), ('name', 'film based on literature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q645928'), ('name', 'biographical film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q846544'), ('name', 'disaster film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52207399'), ('name', 'film based on a novel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17013749'), ('name', 'historical film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1196408'), ('name', 'historical fiction')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q136472'), ('name', 'historical literature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2561438'), ('name', 'slice of life')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2642760'), ('name', 'vigilante film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20656232'), ('name', 'science fiction action film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1548170'), ('name', 'musical comedy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193979'), ('name', 'farce')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157394'), ('name', 'fantasy film')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# use the property genre (P136) found some queries above\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P136 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "9ceff288-68a7-4961-9f12-83f989a4f28a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108329096'), ('name', 'genre by art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5937792'), ('name', 'crime fiction')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1194240'), ('name', 'science fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q223393'), ('name', 'literary genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1792379'), ('name', 'art genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20076756'), ('name', 'speculative fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108465955'), ('name', 'fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15961987'), ('name', 'television genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q7777573'), ('name', 'theatrical genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5151404'), ('name', 'comedic genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20656220'), ('name', 'thriller genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5188177'), ('name', 'cross-genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q188451'), ('name', 'music genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1437361'), ('name', 'form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q759853'), ('name', 'film format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15961983'), ('name', 'radio genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4263830'), ('name', 'literary form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q483394'), ('name', 'genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1053916'), ('name', 'theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q621993'), ('name', 'literary class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8187769'), ('name', 'economic activity')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q862597'), ('name', 'musical form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q89362829'), ('name', 'non-music')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108466143'), ('name', 'non-fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20644555'), ('name', 'fantasy genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4178140'), ('name', 'anime and manga genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q49148153'), ('name', 'pornography genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108317211'), ('name', 'novel genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108368282'), ('name', 'genre by literary form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167410'), ('name', 'Wikimedia disambiguation page')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q659563'), ('name', 'video game genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q60539481'), ('name', 'negative emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11862829'), ('name', 'academic discipline')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2604680'), ('name', 'target audience')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3326717'), ('name', 'literary movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1415395'), ('name', 'film industry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q31629'), ('name', 'type of sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4356073'), ('name', 'spectator sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q9415'), ('name', 'emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1920219'), ('name', 'social issue')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q103110540'), ('name', 'anime genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3516833'), ('name', 'animation technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q45971958'), ('name', 'performing arts genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4894405'), ('name', 'journalism genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1001378'), ('name', 'cinematic technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5484828'), ('name', 'cyberpunk derivative form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q101352'), ('name', 'family name')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20643324'), ('name', 'opera genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q589183'), ('name', 'radio format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q13406463'), ('name', 'Wikimedia list article')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q745775'), ('name', 'narrative mode')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1288568'), ('name', 'modern language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q33742'), ('name', 'natural language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q34770'), ('name', 'language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q152559'), ('name', 'macrolanguage')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56055944'), ('name', 'art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q22808320'), ('name', 'Wikimedia human name disambiguation page')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q16695773'), ('name', 'WikiProject')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q16748888'), ('name', 'advanced emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q97430452'), ('name', 'performing arts industry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24856'), ('name', 'film series')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1969448'), ('name', 'term')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4671286'), ('name', 'academic major')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36649'), ('name', 'visual art')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11921029'), ('name', 'music style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q107356781'), ('name', 'song type')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q506240'), ('name', 'television film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4220920'), ('name', 'filmmaking occupation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20087698'), ('name', 'comics genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q59126'), ('name', 'xiaoshuo')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1126006'), ('name', 'public broadcaster')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('name', 'concept')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q41719'), ('name', 'hypothesis')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1047698'), ('name', 'superpower')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q179661'), ('name', 'treatment')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1047113'), ('name', 'specialty')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q331769'), ('name', 'mood')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2738074'), ('name', 'political movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3001152'), ('name', 'movement in cinema')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q482994'), ('name', 'album')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q191328'), ('name', 'tonal language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3305213'), ('name', 'painting')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q9332'), ('name', 'behavior')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108306867'), ('name', 'tone (work)')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1149305'), ('name', 'disposition')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q622645'), ('name', 'attitude')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('name', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q636497'), ('name', 'stock character')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q17305127'), ('name', 'fictional profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q842284'), ('name', 'skateboarding')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q215380'), ('name', 'musical group')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1792644'), ('name', 'art style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q103112098'), ('name', 'manga genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3624078'), ('name', 'sovereign state')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4209223'), ('name', 'Rechtsstaat')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43702'), ('name', 'federation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q619610'), ('name', 'social state')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q63791824'), ('name', 'country bordering the Baltic Sea')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q7270'), ('name', 'republic')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q67515288'), ('name', 'cinema of country or region')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3233738'), ('name', 'Golden age')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q576639'), ('name', 'essentially contested concept')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q107357104'), ('name', 'type of dance')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28820001'), ('name', 'music scene')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q42907216'), ('name', 'video game theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5257307'), ('name', 'prize')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3445707'), ('name', 'tax policy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q515244'), ('name', 'administrative procedure')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3024240'), ('name', 'historical country')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q483677'), ('name', 'pseudoscience')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2728698'), ('name', 'religious belief')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q170835'), ('name', 'cosmogony')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4430243'), ('name', 'social organization')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q6055843'), ('name', 'internet genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q89522629'), ('name', 'poetic form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1406161'), ('name', 'artistic theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q26971562'), ('name', 'comic format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q212434'), ('name', 'Olympic sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q134556'), ('name', 'single')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q6647660'), ('name', 'literary element')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q18011171'), ('name', 'unfinished or abandoned film project')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q50572323'), ('name', 'fantastic literature genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15831596'), ('name', 'class of fictional entities')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2465832'), ('name', 'branch of science')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4502142'), ('name', 'visual artwork')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2695280'), ('name', 'technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1209283'), ('name', 'electronic media')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20742825'), ('name', 'cultural depiction')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q264965'), ('name', 'subculture')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19116554'), ('name', 'youth subculture')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q49447'), ('name', 'world view')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2915955'), ('name', 'philosophical movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5303685'), ('name', 'doxastic attitude')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3377406'), ('name', 'political catch phrase')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q13442814'), ('name', 'scholarly article')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q12737077'), ('name', 'occupation')]\n",
      "142\n"
     ]
    }
   ],
   "source": [
    "# use the property genre (P136) found some queries above and get the class\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P136 ?obj.\n",
    "    ?obj wdt:P31 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "26fa7cc5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# film genre (wd:Q201658)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    BIND(wd:Q201658 AS ?inst).\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "54a4c500",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 3 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q201658\"\n",
    "og_name = \"film genre\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"3\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "afe07349-690c-423d-8919-69ac8f9067e2",
   "metadata": {},
   "source": [
    "Found `wd:Q201658` -> film genre"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b169cd6c-63f3-48e5-b417-765615a5a788",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 4"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0af0da8b-dc1c-402e-ba3b-35e63da2353c",
   "metadata": {},
   "source": [
    "Need to find date of release and also the country of release"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "67280618-a51c-49e5-b326-9983d2aab3b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2754'), ('name', 'production date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3893'), ('name', 'public domain date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2913'), ('name', 'date depicted')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1191'), ('name', 'date of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1619'), ('name', 'date of official opening')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6949'), ('name', 'announcement date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3999'), ('name', 'date of official closure')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2960'), ('name', 'archive date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5204'), ('name', 'date of commercialization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "# find the date and the country\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        ?prop ?obj.\n",
    "    ?prop sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"date\") || REGEX(?name,\"ountr\") ).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "ab1ec41c-da85-48c8-a35e-04e2f1a4d3ac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q42537'), ('name', 'flag of the United States')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q165230'), ('name', 'flag of the Soviet Union')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q380675'), ('name', 'cinema of the United States')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q36704'), ('name', 'Yugoslavia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41304'), ('name', 'Weimar Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q717'), ('name', 'Venezuela')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q265'), ('name', 'Uzbekistan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q77'), ('name', 'Uruguay')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q174193'), ('name', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170468'), ('name', 'United Arab Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q878'), ('name', 'United Arab Emirates')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193619'), ('name', 'Union of South Africa')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27190661'), ('name', 'Umoma')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q133356'), ('name', 'Ukrainian Soviet Socialist Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q243610'), ('name', \"Ukrainian People's Republic\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q212'), ('name', 'Ukraine')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1036'), ('name', 'Uganda')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q874'), ('name', 'Turkmenistan')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. But first need to find United States\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"[U,u]\")).\n",
    "}\n",
    "ORDER BY DESC (?name)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "c7776467-a95f-449d-958c-2d4333f2d253",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q93204'), ('name', 'documentary film'), ('counts', '1648')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama'), ('counts', '1584')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film'), ('counts', '687')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film'), ('counts', '663')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film'), ('counts', '573')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q2484376'), ('name', 'thriller film'), ('counts', '521')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q471839'), ('name', 'science fiction film'), ('counts', '318')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q20442589'), ('name', 'LGBT-related film'), ('counts', '311')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q859369'), ('name', 'comedy-drama'), ('counts', '290')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q959790'), ('name', 'crime film'), ('counts', '288')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. USA (Q30)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?genre ?name COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 wd:Q30;\n",
    "        wdt:P136 ?genre;\n",
    "        wdt:P577 ?date.\n",
    "    ?genre wdt:P31 wd:Q201658.\n",
    "    FILTER ( isLiteral(?date) ) .\n",
    "    FILTER(?date>=xsd:date(\"2010-01-01\") && ?date<xsd:date(\"2016-01-01\")).\n",
    "    ?genre sc:name ?name.\n",
    "}\n",
    "GROUP BY ?genre ?name\n",
    "ORDER BY DESC (?counts)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "4e7a8733-340a-4de5-9132-8d51ec240844",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama'), ('counts', '339')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film'), ('counts', '124')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film'), ('counts', '81')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q860626'), ('name', 'romantic comedy'), ('counts', '81')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q172980'), ('name', 'Western film'), ('counts', '77')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q369747'), ('name', 'war film'), ('counts', '71')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q842256'), ('name', 'musical film'), ('counts', '66')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q471839'), ('name', 'science fiction film'), ('counts', '58')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q959790'), ('name', 'crime film'), ('counts', '52')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q1054574'), ('name', 'romance film'), ('counts', '50')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. USA (Q30)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?genre ?name COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 wd:Q30;\n",
    "        wdt:P136 ?genre;\n",
    "        wdt:P577 ?date.\n",
    "    ?genre wdt:P31 wd:Q201658.\n",
    "    FILTER ( isLiteral(?date) ) .\n",
    "    FILTER(?date>=xsd:date(\"1960-01-01\") && ?date<xsd:date(\"1965-01-01\")).\n",
    "    ?genre sc:name ?name.\n",
    "}\n",
    "GROUP BY ?genre ?name\n",
    "ORDER BY DESC (?counts)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b3e2c8d8-00c5-4a9b-934c-496894810a44",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## single literal associated to an URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    val = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= val\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"4\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c2390c90-2ea8-4661-8caa-86388cff7f69",
   "metadata": {},
   "source": [
    "## Task 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "aed06d55",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('max_year', '2018')]\n",
      "[('max_year', '2019')]\n",
      "[('max_year', '2021')]\n",
      "[('max_year', '2020')]\n",
      "[('max_year', '2022')]\n",
      "[('max_year', '2023')]\n",
      "[('max_year', '2115')]\n",
      "[('max_year', '2040')]\n",
      "[('max_year', '2100')]\n",
      "[('max_year', '2024')]\n",
      "[('max_year', '2188')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "# look at the year\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT(YEAR(?date)) AS ?max_year\n",
    "WHERE {\n",
    "   ?film wdt:P577 ?date ;\n",
    "         wdt:P136 ?genre .\n",
    "   ?genre wdt:P31 wd:Q201658 .\n",
    "   FILTER(isLiteral(?date)).\n",
    "   FILTER(?date >=\"2018-01-01T00:00:00Z\"^^xsd:dateTime)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "11014ef3-dbc4-474f-b31d-6bdd3ffa3167",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q2484376'), ('g_name', 'thriller film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q959790'), ('g_name', 'crime film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q93204'), ('g_name', 'documentary film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q188473'), ('g_name', 'action film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q157443'), ('g_name', 'comedy film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q130232'), ('g_name', 'drama')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q319221'), ('g_name', 'adventure film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q200092'), ('g_name', 'horror film')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# find all the genres from 2001 to now that have more than 50 films for each year\n",
    "# we consider films publicated up to 2021 given that the instance of Wikidata is from 2021\n",
    "queryString = \"\"\"\n",
    "SELECT ?genre ?g_name \n",
    "WHERE{\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT ?genre YEAR(?date) AS ?year (COUNT(?film) AS ?films)\n",
    "        WHERE {\n",
    "           ?film wdt:P577 ?date ;\n",
    "                 wdt:P136 ?genre .\n",
    "           ?genre wdt:P31 wd:Q201658 .\n",
    "           FILTER(?date >=\"2001-01-01T00:00:00Z\"^^xsd:dateTime && ?date <=\"2022-01-01T00:00:00Z\"^^xsd:dateTime)\n",
    "        }\n",
    "        GROUP BY ?genre YEAR(?date)\n",
    "    }\n",
    "    ?genre sc:name ?g_name .\n",
    "    FILTER (?films > 50)\n",
    "}\n",
    "GROUP BY ?genre ?g_name\n",
    "HAVING (COUNT(DISTINCT ?year) >20)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "02b53763",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "obj = [{\"uri\":r[0][1],\"name\":r[1][1]} for r in x]\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"5\", evaluation.TYPE_SET ,\"uri\", obj)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4db5f104-507f-48ba-a577-d918d8ee4a5c",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "ddda36fd-21b9-4abc-ba53-66abc9ce2dd2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America'), ('counts', '1024')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom'), ('counts', '54')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34266'), ('name', 'Russian Empire'), ('counts', '45')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy'), ('counts', '40')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany'), ('counts', '38')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria'), ('counts', '36')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q15180'), ('name', 'Soviet Union'), ('counts', '36')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28513'), ('name', 'Austria-Hungary'), ('counts', '31')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q172579'), ('name', 'Kingdom of Italy'), ('counts', '31')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('counts', '20')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# find top-10 composers of western films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P86 ?composer;\n",
    "        wdt:P136 wd:Q172980.\n",
    "    ?composer wdt:P27 ?country.\n",
    "    ?country sc:name ?name.\n",
    "}\n",
    "GROUP BY ?country ?name\n",
    "ORDER BY DESC (?counts)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "8f8cd554",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_5\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow2_5.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## single literal associated to an URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    val = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= val\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"6\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5bc107ce-746c-4b72-ac54-c4875bb63381",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "1e878b4a-4822-4363-a20d-b178488e8c52",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('counts', '265')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# compare the decades\n",
    "queryString = \"\"\"\n",
    "SELECT COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P136 wd:Q172980 ;\n",
    "        wdt:P31 wd:Q11424;\n",
    "        wdt:P577 ?date.\n",
    "    FILTER(?date>=xsd:date(\"1961-01-01\") && ?date<xsd:date(\"1971-01-01\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "680cf5f4-fa91-4553-839b-333f8fe90bc7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('counts', '65')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# compare the decades\n",
    "queryString = \"\"\"\n",
    "SELECT COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P136 wd:Q172980 ;\n",
    "        wdt:P31 wd:Q11424;\n",
    "        wdt:P577 ?date.\n",
    "    FILTER(?date>=xsd:date(\"2001-01-01\") && ?date<xsd:date(\"2011-01-01\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "658d5877-45dc-4eba-8c22-0936d7883e88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('decade', '2001-2010'), ('films', '64')]\n",
      "[('decade', '1961-1970'), ('films', '250')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# find n_western films between 1961-1970 and 2001-2010 \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?decade (COUNT( DISTINCT ?film) AS ?films)\n",
    "        WHERE {\n",
    "           ?film wdt:P136 wd:Q172980 ;\n",
    "                 wdt:P31 wd:Q11424 ;\n",
    "                 wdt:P577 ?date .\n",
    "           FILTER((YEAR(?date) > 1960 && YEAR(?date) <= 1970) || (YEAR(?date) > 2000 && YEAR(?date) <= 2010))\n",
    "           BIND (if(YEAR(?date) > 1960 && YEAR(?date) <= 1970,\"1961-1970\", \"2001-2010\") AS ?decade)\n",
    "        }\n",
    "        GROUP BY ?decade\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6cff0aa8",
   "metadata": {},
   "source": [
    "### Task 8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "46e2e19f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('decade', '2001-2010'), ('avg_cast', '12.272727272727273')]\n",
      "[('decade', '1961-1970'), ('avg_cast', '13.259414225941423')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# find average cast members size for western films between 1961-1970 and 2001-2010\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?decade (AVG(?cast_size) AS ?avg_cast)\n",
    "WHERE {\n",
    "    {\n",
    "        SELECT DISTINCT ?decade ?film (COUNT(?cast) AS ?cast_size)\n",
    "        WHERE {\n",
    "           ?film wdt:P136 wd:Q172980 ;\n",
    "                 wdt:P31 wd:Q11424 ;\n",
    "                 wdt:P577 ?date ;\n",
    "                 wdt:P161 ?cast .\n",
    "           FILTER((YEAR(?date) > 1960 && YEAR(?date) <= 1970) || (YEAR(?date) > 2000 && YEAR(?date) <= 2010))\n",
    "           BIND (if(YEAR(?date) > 1960 && YEAR(?date) <= 1970,\"1961-1970\",\"2001-2010\") AS ?decade)\n",
    "        }\n",
    "    }\n",
    "}\n",
    "GROUP BY ?decade\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "aaca18c8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
