{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "da3c0dd4",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "46bbb34a",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "import sys\n",
    "import os\n",
    "import json\n",
    "import pandas as pd\n",
    "sys.path.insert(1, '../../../../src/')\n",
    "import gt_modules.evaluation as evaluation\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-movie1-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04943af6",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Film Genre and directors explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the directors for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "104f3c71",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n",
    "| `wd:Q3772`| Quentin Tarantino      | node |\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b67ae6f",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for director\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films).\n",
    "\n",
    "5. Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films). \n",
    "\n",
    "6. Identify the BGP for Academy Awards \n",
    "\n",
    "7. Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won).\n",
    "\n",
    "8. Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "9ff8b628",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n"
     ]
    }
   ],
   "source": [
    "## startup the evaluation\n",
    "# setup the file and create the empty json\n",
    "ipname = \"m7.ipynb\"\n",
    "pt = os.getcwd()+os.sep+ipname\n",
    "evaluation.setup(pt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68fda7ac",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "14c91470",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2650'), ('name', 'interested in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('name', \"category's main topic\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P825'), ('name', 'dedicated to')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P971'), ('name', 'category combines topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('name', 'Wikidata property example')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P87'), ('name', 'librettist')]\n",
      "28\n"
     ]
    }
   ],
   "source": [
    "# properties incoming Allen\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE { \n",
    "    ?obj ?p wd:Q25089.\n",
    "    ?p sc:name ?name.\n",
    "    FILTER(!isLiteral(?obj)).\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "1a85a626",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q206124'), ('name', 'Midnight in Paris')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q682262'), ('name', 'Alice')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14511869'), ('name', 'Magic in the Moonlight')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q806092'), ('name', 'Bananas')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1004531'), ('name', 'Bullets Over Broadway')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321004'), ('name', 'You Will Meet a Tall Dark Stranger')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q729026'), ('name', 'Broadway Danny Rose')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q733677'), ('name', 'Match Point')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q740143'), ('name', 'Husbands and Wives')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use director to find the films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?obj wdt:P57 wd:Q25089 .\n",
    "    ?obj sc:name ?name.\n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "148d60fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q506240'), ('name', 'television film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5398426'), ('name', 'television series')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24862'), ('name', 'short film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q47467768'), ('name', 'operatic production')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# instance of to find film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?obj wdt:P57 wd:Q25089 ;\n",
    "        wdt:P31 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "10aafe16",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 1 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q11424\"\n",
    "og_name = \"film\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"1\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9e27f208",
   "metadata": {},
   "source": [
    "`wd:Q11424` -> film"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af38fbb6",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "2c30a5d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7003'), ('name', 'ACMI web ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7118'), ('name', 'AMPAS collections film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6151'), ('name', 'ANICA ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9032'), ('name', 'AVN movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7194'), ('name', 'AZLyrics.com artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9283'), ('name', 'AaRC title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6145'), ('name', 'Academy Awards Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6150'), ('name', 'Academy Awards Database nominee ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7777'), ('name', 'AdoroCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5083'), ('name', 'Adult Film Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9701'), ('name', 'African Film Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4513'), ('name', 'Africultures movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8895'), ('name', 'All the Tropes identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1729'), ('name', 'AllMusic album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1267'), ('name', 'AlloCiné series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5749'), ('name', 'Amazon Standard Identification Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8055'), ('name', 'Amazon.com Prime Video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3502'), ('name', 'Ameblo username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5646'), ('name', 'AniDB anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8729'), ('name', 'AniList anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1934'), ('name', 'Animator.ru film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1985'), ('name', 'Anime News Network anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1984'), ('name', 'Anime News Network manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5845'), ('name', 'AnimeClick anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5860'), ('name', 'AnimeClick drama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5849'), ('name', 'AnimeClick manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2281'), ('name', 'Apple Music album ID (U.S. version)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9751'), ('name', 'Apple TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5218'), ('name', 'Armenian Cinema ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9629'), ('name', 'Armeniapedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8294'), ('name', 'AusStage work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8295'), ('name', 'AustLit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3156'), ('name', 'Australian Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8326'), ('name', 'Australian Classification ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3218'), ('name', 'Auñamendi ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3293'), ('name', 'BALaT object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9086'), ('name', 'BAMID film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3280'), ('name', 'BAnQ author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1823'), ('name', 'BAnQ work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6200'), ('name', 'BBC News topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P827'), ('name', 'BBC programme ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2629'), ('name', 'BBFC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8794'), ('name', 'BBFC reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4438'), ('name', 'BFI Films, TV and people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2703'), ('name', 'BFI National Archive work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6211'), ('name', 'BIBSYS work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3976'), ('name', 'BVMC work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6196'), ('name', 'Badtaste ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6367'), ('name', \"Bahamut Gamer's Community ACG Database ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3997'), ('name', 'Bait La Zemer Ha-Ivri artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3821'), ('name', 'Bangla Movie Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7448'), ('name', 'Basis Wien object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4965'), ('name', 'Behind The Voice Actors video game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5384'), ('name', 'Behind The Voice Actors film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5382'), ('name', 'Behind The Voice Actors franchise ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5387'), ('name', 'Behind The Voice Actors TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4254'), ('name', 'Bengali Banglapedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4440'), ('name', 'Biblioteca Nacional de México ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4933'), ('name', 'Big Cartoon Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6456'), ('name', 'Bilibili video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6175'), ('name', 'Bitraga work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5499'), ('name', 'Boijmans work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8674'), ('name', 'Bollywood Hungama movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7923'), ('name', 'Bollywood Hungama person alphabetic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8856'), ('name', 'British Phonographic Industry ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4845'), ('name', 'Bulbapedia article')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7685'), ('name', 'CALS Encyclopedia of Arkansas ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6452'), ('name', 'CBFC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1890'), ('name', 'CCAB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6657'), ('name', 'CHVRS Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8908'), ('name', 'CINE21 film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9146'), ('name', 'CITWF title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3458'), ('name', 'CNC authorization number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2758'), ('name', 'CNC film rating (France)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3402'), ('name', 'CNC film rating (Romania)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7037'), ('name', 'COURAGE ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5395'), ('name', 'Canadian Encyclopedia article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1670'), ('name', 'Canadiana Authorities ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8179'), ('name', 'Canadiana NCF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4104'), ('name', 'Carnegie Hall agent ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5229'), ('name', 'Carnegie Hall work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3241'), ('name', 'Catholic Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9857'), ('name', 'Center for Turkish Cinema Studies film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4861'), ('name', 'Charity Navigator ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5737'), ('name', 'Chinese Moegirlpedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3128'), ('name', 'CiNetMag film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1739'), ('name', 'CiNii book ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9203'), ('name', 'CineFAN.ro title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7593'), ('name', 'CinePT film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8296'), ('name', 'Cinema Context ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5146'), ('name', 'Cinema Project (Israel) ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3445'), ('name', 'Cinema of Israel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9204'), ('name', 'CinemaRX title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9848'), ('name', 'Cinemaitaliano film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3851'), ('name', 'Cinenacional.com movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7177'), ('name', 'Cinestaan film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5791'), ('name', 'Cineuropa film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7679'), ('name', 'Cinépolis KLIC ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8958'), ('name', 'ClassInd audiovisual work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3216'), ('name', 'ClassInd rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7132'), ('name', 'ComingSoon.it film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7091'), ('name', 'Common Sense Media ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1612'), ('name', 'Commons Institution page')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4765'), ('name', 'Commons compatible image available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2011'), ('name', 'Cooper-Hewitt Person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6359'), ('name', 'Crew United title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2088'), ('name', 'Crunchbase organization ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4110'), ('name', 'Crunchyroll ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5318'), ('name', 'César Award film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1707'), ('name', 'DAAO ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5510'), ('name', 'DEFA film database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1292'), ('name', 'DNB editions')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P356'), ('name', 'DOI')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2942'), ('name', 'Dailymotion channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8708'), ('name', 'Danish educational institution number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6706'), ('name', 'De Agostini ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7978'), ('name', 'Decine21 film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6164'), ('name', 'Depósito Legal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4834'), ('name', 'Deutsche Synchronkartei series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8359'), ('name', 'Dewey Decimal Classification (works and editions)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7872'), ('name', 'Diccionari del cinema a Catalunya ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9186'), ('name', 'DicoPolHiS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3794'), ('name', 'Dictionary of Sydney ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1954'), ('name', 'Discogs master ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2206'), ('name', 'Discogs release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6181'), ('name', 'Disney A to Z ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7595'), ('name', 'Disney+ movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7596'), ('name', 'Disney+ series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5284'), ('name', 'Douban movie celebrity ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7236'), ('name', 'Dove.org work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7306'), ('name', 'Downdetector ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9461'), ('name', 'DzygaMDB film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7892'), ('name', 'EFIS film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2756'), ('name', 'EIRIN film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7222'), ('name', 'Eiga.com movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2897'), ('name', 'Eldoblaje Movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4746'), ('name', 'Elhuyar ZTH ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6010'), ('name', 'Encyclopedia of Alabama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9281'), ('name', 'Encyclopedia of Greater Philadelphia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3338'), ('name', 'Encyclopedia of Surfing ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7686'), ('name', 'Encyclopedia of the Great Plains ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6679'), ('name', 'Encyklopedia Teatru Polskiego play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3121'), ('name', 'Epguides ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8800'), ('name', 'European Film Awards ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7704'), ('name', 'Europeana entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7665'), ('name', 'FMV World ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4437'), ('name', 'FPB rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8680'), ('name', 'FVLB work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4003'), ('name', 'Facebook page ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9118'), ('name', 'Family Video Game Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5693'), ('name', 'Fandango film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8125'), ('name', 'Fandango person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5820'), ('name', 'Film Indonesia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6762'), ('name', 'FilmFreeway ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8796'), ('name', 'FilmPolski press collection ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3495'), ('name', 'FilmPolski.pl ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5255'), ('name', 'FilmTv.it TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5253'), ('name', 'FilmTv.it movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9367'), ('name', 'Filmitalia film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7519'), ('name', 'Filmový přehled film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5233'), ('name', 'Filmow ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2639'), ('name', 'Filmportal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8531'), ('name', 'Filmstarts title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8928'), ('name', 'Filmstriben film-ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3995'), ('name', 'Filmweb.pl ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9478'), ('name', 'Finna ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3267'), ('name', 'Flickr user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3589'), ('name', 'GCD series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3367'), ('name', 'GECD film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2725'), ('name', 'GOG application ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7175'), ('name', 'Gaana.com album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4769'), ('name', 'GameFAQs game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6623'), ('name', 'Gamepedia article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6218'), ('name', 'Genius song ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6420'), ('name', 'Georgian National Filmography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5986'), ('name', 'Getty Iconography Authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5247'), ('name', 'Giant Bomb ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4013'), ('name', 'Giphy username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1842'), ('name', 'Global Anabaptist Mennonite Encyclopedia Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3962'), ('name', 'Global Trade Item Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2969'), ('name', 'Goodreads version/edition ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8383'), ('name', 'Goodreads work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4702'), ('name', 'Google Arts & Culture partner ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4701'), ('name', 'Google Arts & Culture asset ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4431'), ('name', 'Google Doodle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5337'), ('name', 'Google News topics ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2847'), ('name', 'Google+ ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9863'), ('name', 'Gujarati Vishwakosh entry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8298'), ('name', 'HBO Max ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5909'), ('name', 'HKCAN ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2883'), ('name', 'HKMDB film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5091'), ('name', 'HanCinema drama ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5108'), ('name', 'HanCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8874'), ('name', 'Hong Kong film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6868'), ('name', 'Hoopla artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5680'), ('name', 'Hoopla title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2816'), ('name', 'HowLongToBeat ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6466'), ('name', 'Hulu movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6467'), ('name', 'Hulu series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9067'), ('name', 'Hungarian Film Archive ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5098'), ('name', 'IAFD film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5128'), ('name', 'ICAA film catalogue ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3306'), ('name', 'ICAA rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7741'), ('name', 'IDFA film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7573'), ('name', 'IFCO rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5150'), ('name', 'IGAC rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5865'), ('name', 'IGN film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5201'), ('name', 'IMDA rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6992'), ('name', 'IMFDB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3194'), ('name', 'INA video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3428'), ('name', 'INCAA film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4483'), ('name', 'INDUCKS story ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P898'), ('name', 'IPA transcription')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1297'), ('name', 'IRS Employer Identification Number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P957'), ('name', 'ISBN-10')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P212'), ('name', 'ISBN-13')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1274'), ('name', 'ISFDB title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3110'), ('name', 'ISzDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5987'), ('name', 'Indiancine.ma film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7953'), ('name', 'Indiegogo project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6748'), ('name', 'Interactive Fiction Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P724'), ('name', 'Internet Archive ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1218'), ('name', 'Internet Broadway Database production ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1219'), ('name', 'Internet Broadway Database show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5794'), ('name', 'Internet Game Database game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7932'), ('name', 'Irish playography play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3906'), ('name', 'Ishim ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5151'), ('name', 'Israel Film Fund ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4399'), ('name', 'Itaú Cultural ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2400'), ('name', 'JMDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3650'), ('name', 'JMK film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P888'), ('name', 'JSTOR article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5152'), ('name', 'KAVI rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3750'), ('name', 'KMDb documentary film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3704'), ('name', 'KMDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1649'), ('name', 'KMDb person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3818'), ('name', 'KMRB film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8921'), ('name', 'KOBIS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7985'), ('name', 'Kanopy ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8019'), ('name', 'Kickstarter project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2684'), ('name', 'Kijkwijzer rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7458'), ('name', 'Kinematoscope film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2970'), ('name', 'Kinopolis film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8847'), ('name', 'Kinorium movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6760'), ('name', 'Know Your Meme ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3340'), ('name', 'Kvikmyndir film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7211'), ('name', 'LINE BLOG user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9525'), ('name', 'LMIC musician ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3192'), ('name', 'Last.fm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8999'), ('name', 'Lexikon zum Literatur- und Kulturbetrieb im Österreich der Zwischenkriegszeit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7107'), ('name', 'LezWatch.TV show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8360'), ('name', 'Library of Congress Classification (works and editions)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4953'), ('name', 'Library of Congress Genre/Form Terms ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1144'), ('name', 'Library of Congress Control Number (LCCN) (bibliographic)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2089'), ('name', 'Library of Congress JukeBox ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1085'), ('name', 'LibraryThing work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6614'), ('name', 'Libreflix ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3258'), ('name', 'LiveJournal ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6520'), ('name', 'Lokalhistoriewiki.no ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7597'), ('name', 'Lutris game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7212'), ('name', 'LyricsTranslate ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1657'), ('name', 'MPAA film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7631'), ('name', 'MPPDA Digital Archive film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8889'), ('name', 'MTRCB rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7299'), ('name', 'MUBI film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4779'), ('name', 'MYmovies actor ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4780'), ('name', 'MYmovies movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7204'), ('name', 'Mafab.hu film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8918'), ('name', 'Max Movie film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1942'), ('name', 'McCune-Reischauer romanization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6368'), ('name', 'Media Arts Database anime ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7117'), ('name', 'Media Arts Database console games ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7886'), ('name', 'Media Arts Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9022'), ('name', 'Mediafilm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2826'), ('name', 'Megogo ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6922'), ('name', 'Metro topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2624'), ('name', 'MetroLyrics ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5885'), ('name', 'Microsoft Store product ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2636'), ('name', 'Minkultury film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7335'), ('name', 'Mixer game ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1933'), ('name', 'MobyGames game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9365'), ('name', 'Modernist Commons ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5495'), ('name', 'Mormon Literature and Creative Arts Database Works ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5925'), ('name', 'Moviepilot.de series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4784'), ('name', 'Movieplayer TV-series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4783'), ('name', 'Movieplayer film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5990'), ('name', 'Movies Anywhere ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8920'), ('name', 'Movist film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6458'), ('name', 'Mtime movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6464'), ('name', 'Mtime people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2014'), ('name', 'Museum of Modern Art work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P434'), ('name', 'MusicBrainz artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4404'), ('name', 'MusicBrainz recording ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5813'), ('name', 'MusicBrainz release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P436'), ('name', 'MusicBrainz release group ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1407'), ('name', 'MusicBrainz series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P435'), ('name', 'MusicBrainz work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5882'), ('name', 'Muziekweb performer ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4086'), ('name', 'MyAnimeList anime ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4087'), ('name', 'MyAnimeList manga ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3868'), ('name', 'MyDramaList title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3265'), ('name', 'Myspace ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7140'), ('name', 'München Wiki article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2475'), ('name', 'NAVA ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1055'), ('name', 'NLM Unique ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2363'), ('name', 'NMHH film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3959'), ('name', 'NNL item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6549'), ('name', 'NZ On Screen work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4606'), ('name', 'National Film Board of Canada film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4683'), ('name', 'National Gallery of Art artwork ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4619'), ('name', 'National Library of Brazil ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8189'), ('name', 'National Library of Israel J9U ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7369'), ('name', 'National Library of Chile ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7699'), ('name', 'National Library of Lithuania ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6152'), ('name', 'National Portrait Gallery (United States) object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7506'), ('name', 'Naver Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8673'), ('name', 'Naver movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8652'), ('name', 'Netflix maturity rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4903'), ('name', 'New Georgia Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6900'), ('name', 'NicoNicoPedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7749'), ('name', 'Nomenclature for Museum Cataloging')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1439'), ('name', 'Norwegian filmography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P243'), ('name', 'OCLC control number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5331'), ('name', 'OCLC work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7327'), ('name', 'OFLC classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5163'), ('name', 'Odnoklassniki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8286'), ('name', 'Olympedia people ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1430'), ('name', 'OpenPlaques subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6337'), ('name', 'PCGamingWiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1236'), ('name', 'Parsons code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4643'), ('name', 'Philadelphia Museum of Art work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3836'), ('name', 'Pinterest username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5833'), ('name', 'Playbill production ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4515'), ('name', 'Prisma ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2637'), ('name', 'RARS rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6658'), ('name', 'RCQ classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3065'), ('name', 'RERO ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6081'), ('name', 'RIA Novosti reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3705'), ('name', 'RITVA Program ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3834'), ('name', 'RTC film rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8392'), ('name', 'Rate Your Music release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7775'), ('name', 'RationalWiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5290'), ('name', 'Redump.org ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6228'), ('name', 'RegiowikiAT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6554'), ('name', 'Represent Me ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5875'), ('name', 'ResearchGate publication ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2001'), ('name', 'Revised Romanization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6932'), ('name', 'RogerEbert.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2678'), ('name', 'Russiancinema.ru film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P906'), ('name', 'SELIBR ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7523'), ('name', 'SK cinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1025'), ('name', 'SUDOC editions')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9322'), ('name', 'SVKKL authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6817'), ('name', 'SVT Play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P370'), ('name', 'Sandbox-String')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7839'), ('name', 'Saregama artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6584'), ('name', 'Scripts.com script ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2908'), ('name', 'SecondHandSongs work ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6133'), ('name', 'Siamzone film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5338'), ('name', 'SilentEra.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3579'), ('name', 'Sina Weibo user ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6256'), ('name', 'SinemaTürk film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9205'), ('name', 'Sinemalar title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2984'), ('name', 'Snapchat username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3478'), ('name', 'Songkick artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3040'), ('name', 'SoundCloud ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3854'), ('name', 'Soundtrack Collector ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3139'), ('name', 'SourehCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1447'), ('name', 'Sports-Reference.com Olympic athlete ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2205'), ('name', 'Spotify album ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3145'), ('name', 'Sratim ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1482'), ('name', 'Stack Exchange tag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1733'), ('name', 'Steam application ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8256'), ('name', 'Super Mario Wiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1316'), ('name', 'Swedish Media Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6474'), ('name', 'Swiss Films ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6219'), ('name', 'TASS reference')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2613'), ('name', 'TED talk ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4983'), ('name', 'TMDb TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8600'), ('name', 'TV Maze series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6383'), ('name', 'TV Spielfilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6643'), ('name', 'TV Spielfilm series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7611'), ('name', 'Taiwan Cinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5829'), ('name', 'Television Academy Foundation show ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8144'), ('name', 'Ternopil Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6134'), ('name', 'Thaifilm ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9584'), ('name', 'The Criterion Collection film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7952'), ('name', 'The First Amendment Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7284'), ('name', 'The Independent topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3634'), ('name', 'The Met object ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5159'), ('name', 'The New Fund for Cinema and Television (Israel) ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7691'), ('name', 'The Oregon Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4204'), ('name', 'The Times of India topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7043'), ('name', 'TheTVDB episode ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4835'), ('name', 'TheTVDB.com series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1242'), ('name', 'Theatricalia play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7085'), ('name', 'TikTok username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8013'), ('name', 'Trakt.tv ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9760'), ('name', \"Treccani's Enciclopedia del Cinema ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3134'), ('name', 'TripAdvisor ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7760'), ('name', 'Tubi movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3943'), ('name', 'Tumblr username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6552'), ('name', 'Twitter user numeric ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2699'), ('name', 'URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7555'), ('name', 'UVL game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9821'), ('name', 'Unconsenting Media ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3961'), ('name', 'Unifrance film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3929'), ('name', 'V&A item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5659'), ('name', 'VGMdb product ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3185'), ('name', 'VK ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2191'), ('name', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7591'), ('name', 'VideoGameGeek game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4015'), ('name', 'Vimeo identifier')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3180'), ('name', 'Visual Novel Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7334'), ('name', 'Vudu video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6738'), ('name', 'Whitney Museum of American Art artwork ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6517'), ('name', 'WhoSampled artist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8344'), ('name', 'WikiTrek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4656'), ('name', 'Wikimedia import URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P600'), ('name', 'Wine AppDB ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4839'), ('name', 'Wolfram Language entity code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5505'), ('name', 'WorldCat Registry ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7285'), ('name', 'Writers Guild of America project ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8823'), ('name', 'Xfinity Stream ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2819'), ('name', 'Yandex Music release ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3108'), ('name', 'Yelp ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7193'), ('name', 'YesAsia author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3414'), ('name', 'Yle Areena item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2397'), ('name', 'YouTube channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4300'), ('name', 'YouTube playlist ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1651'), ('name', 'YouTube video ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7228'), ('name', 'access restriction status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5202'), ('name', 'adapted by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6291'), ('name', 'advertises')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P945'), ('name', 'allegiance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4970'), ('name', 'alternate names')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6942'), ('name', 'animator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6949'), ('name', 'announcement date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1065'), ('name', 'archive URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2960'), ('name', 'archive date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3174'), ('name', 'art director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5126'), ('name', 'assistant director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1110'), ('name', 'attendance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P51'), ('name', 'audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P990'), ('name', \"audio recording of the subject's spoken voice\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7501'), ('name', 'audio system')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2093'), ('name', 'author name string')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2208'), ('name', 'average shot length')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5732'), ('name', 'bgm.tv subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5733'), ('name', 'bilibili ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3301'), ('name', 'broadcast by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7936'), ('name', 'business model')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4312'), ('name', 'camera setup')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4082'), ('name', 'captured with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6476'), ('name', 'castingvideos ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P972'), ('name', 'catalog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P528'), ('name', 'catalog code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6251'), ('name', 'catchphrase')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P971'), ('name', 'category combines topics')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1754'), ('name', 'category related to list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8670'), ('name', 'character designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P453'), ('name', 'character role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1809'), ('name', 'choreographer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4786'), ('name', 'cinematografo film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2860'), ('name', 'cites work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1638'), ('name', 'codename')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2716'), ('name', 'collage image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P547'), ('name', 'commemorates')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1801'), ('name', 'commemorative plaque image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P88'), ('name', 'commissioned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1027'), ('name', 'conferred by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2789'), ('name', 'connects with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4330'), ('name', 'contains')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P767'), ('name', 'contributor to the creative work or subject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3931'), ('name', 'copyright holder')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P275'), ('name', 'copyright license')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6216'), ('name', 'copyright status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2130'), ('name', 'cost')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2515'), ('name', 'costume designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P736'), ('name', 'cover art by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1029'), ('name', 'crew member(s)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1013'), ('name', 'criterion used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4022'), ('name', 'danskefilm TV series ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4021'), ('name', 'danskefilm animated film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3785'), ('name', 'danskefilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3787'), ('name', 'danskefilm silent film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4209'), ('name', 'danskfilmogtv title ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3575'), ('name', 'data size')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2913'), ('name', 'date depicted')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5204'), ('name', 'date of commercialization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1191'), ('name', 'date of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3999'), ('name', 'date of official closure')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1619'), ('name', 'date of official opening')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P825'), ('name', 'dedicated to')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P287'), ('name', 'designed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1444'), ('name', 'destination point')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P178'), ('name', 'developer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2386'), ('name', 'diameter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1037'), ('name', 'director / manager')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3113'), ('name', 'does not have part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1028'), ('name', 'donated by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6086'), ('name', 'dramaturge')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P393'), ('name', 'edition number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P629'), ('name', 'edition or translation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P98'), ('name', 'editor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3135'), ('name', 'elCinema film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3136'), ('name', 'elCinema person ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P968'), ('name', 'email address')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8001'), ('name', 'endorsed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2257'), ('name', 'event interval')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P608'), ('name', 'exhibition history')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2755'), ('name', 'exploitation visa number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6524'), ('name', 'expression of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2236'), ('name', 'external subproperty')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2079'), ('name', 'fabrication method')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5327'), ('name', 'fernsehserien.de ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2701'), ('name', 'file format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3092'), ('name', 'film crew member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3383'), ('name', 'film poster')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3816'), ('name', 'film script')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6603'), ('name', 'film-documentaire.fr author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3673'), ('name', 'film-documentaire.fr film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1922'), ('name', 'first line')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1317'), ('name', 'floruit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1686'), ('name', 'for work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7937'), ('name', 'form of creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1080'), ('name', 'from narrative universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P953'), ('name', 'full work available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8324'), ('name', 'funder')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6195'), ('name', 'funding scheme')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6418'), ('name', 'funk channel ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P404'), ('name', 'game mode')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P828'), ('name', 'has cause')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1479'), ('name', 'has contributing factor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P747'), ('name', 'has edition or translation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1542'), ('name', 'has effect')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P912'), ('name', 'has facility')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6439'), ('name', 'has lyrics')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1625'), ('name', 'has melody')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2670'), ('name', 'has parts of the class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2572'), ('name', 'hashtag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2048'), ('name', 'height')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1435'), ('name', 'heritage designation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P504'), ('name', 'home port')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6381'), ('name', 'iTunes TV season ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P110'), ('name', 'illustrator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P479'), ('name', 'input method')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2360'), ('name', 'intended public')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P217'), ('name', 'inventory number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P360'), ('name', 'is a list of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P121'), ('name', 'item operated')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2936'), ('name', 'language used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3132'), ('name', 'last line')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2043'), ('name', 'length')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6224'), ('name', 'level of description')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3308'), ('name', 'lib.reviews ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P87'), ('name', 'librettist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5026'), ('name', 'lighting designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1881'), ('name', 'list of characters')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P669'), ('name', 'located on street')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1071'), ('name', 'location of creation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4647'), ('name', 'location of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P740'), ('name', 'location of formation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P676'), ('name', 'lyrics by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8035'), ('name', 'm3db.com film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P186'), ('name', 'made from material')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P126'), ('name', 'maintained by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4805'), ('name', 'make-up artist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1557'), ('name', 'manifestation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P176'), ('name', 'manufacturer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2899'), ('name', 'minimum age')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5059'), ('name', 'modified version of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1451'), ('name', 'motto text')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3300'), ('name', 'musical conductor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2561'), ('name', 'name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1814'), ('name', 'name in kana')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1810'), ('name', 'named as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6962'), ('name', 'narrative motif')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2438'), ('name', 'narrator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1705'), ('name', 'native label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1449'), ('name', 'nickname')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4353'), ('name', 'nominated by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6500'), ('name', 'non-free artwork image URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1350'), ('name', 'number of matches played/races/starts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1104'), ('name', 'number of pages')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1132'), ('name', 'number of participants')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2635'), ('name', 'number of parts of this work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5436'), ('name', 'number of viewers/listeners')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1581'), ('name', 'official blog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1448'), ('name', 'official name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P306'), ('name', 'operating system')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P137'), ('name', 'operator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P449'), ('name', 'original broadcaster')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3803'), ('name', 'original film format')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P127'), ('name', 'owned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1923'), ('name', 'participating team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1246'), ('name', 'patent number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1766'), ('name', 'place name sign')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P291'), ('name', 'place of publication')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P400'), ('name', 'platform')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9177'), ('name', 'playDB play ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5940'), ('name', 'plot expanded in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P585'), ('name', 'point in time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1142'), ('name', 'political ideology')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4634'), ('name', 'premiere type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5072'), ('name', 'presented in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P371'), ('name', 'presenter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2284'), ('name', 'price')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2849'), ('name', 'produced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4733'), ('name', 'produced sound')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2364'), ('name', 'production code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2754'), ('name', 'production date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P742'), ('name', 'pseudonym')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3893'), ('name', 'public domain date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1433'), ('name', 'published in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P123'), ('name', 'publisher')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6166'), ('name', 'quotes work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4271'), ('name', 'rating')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P483'), ('name', 'recorded at studio or venue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8546'), ('name', 'recording location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2550'), ('name', 'recording or performance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1652'), ('name', 'referee')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P854'), ('name', 'reference URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8371'), ('name', 'references work, tradition or theory')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6802'), ('name', 'related image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P611'), ('name', 'religious order')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1366'), ('name', 'replaced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2675'), ('name', 'reply to')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4646'), ('name', 'representation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1875'), ('name', 'represented by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P444'), ('name', 'review score')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P447'), ('name', 'review score by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5707'), ('name', 'samples from work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1752'), ('name', 'scale')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4608'), ('name', 'scenographer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5555'), ('name', 'schematic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4908'), ('name', 'season')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1659'), ('name', 'see also')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8278'), ('name', 'serial identifier on SerialZone')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1545'), ('name', 'series ordinal')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2512'), ('name', 'series spin-off')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3030'), ('name', 'sheet music')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1813'), ('name', 'short name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2407'), ('name', 'short-term exposure limit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7340'), ('name', 'sixpackfilmdata film ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8687'), ('name', 'social media followers')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5028'), ('name', 'sound designer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P406'), ('name', 'soundtrack release')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1896'), ('name', 'source website for the property')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1427'), ('name', 'start point')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7512'), ('name', 'startrek.com Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P248'), ('name', 'stated in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P805'), ('name', 'statement is subject of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3275'), ('name', 'storyboard artist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P963'), ('name', 'streaming media URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1680'), ('name', 'subtitle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P942'), ('name', 'theme music')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2139'), ('name', 'total revenue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5051'), ('name', 'towards')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P658'), ('name', 'tracklist')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P655'), ('name', 'translator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2739'), ('name', 'typeface/font used')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2737'), ('name', 'union of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P366'), ('name', 'use')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7261'), ('name', 'use restriction status')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9182'), ('name', 'uta-net.com song ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8351'), ('name', 'vglist video game ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P10'), ('name', 'video')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P478'), ('name', 'volume')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1019'), ('name', 'web feed URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2049'), ('name', 'width')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2032'), ('name', 'work period (end)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "924\n"
     ]
    }
   ],
   "source": [
    "# properties of films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        ?prop ?obj.\n",
    "    ?prop sc:name ?name.\n",
    "}\n",
    "ORDER BY ?name\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "c470f6c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11720172'), ('name', 'Janusz Grudziński')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11767762'), ('name', 'Marcin Pospieszalski')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11817456'), ('name', 'Piotr Figiel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q13036911'), ('name', 'Aleksandër Lalo')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3299298'), ('name', 'Avni Mula')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4759658'), ('name', 'Andrzej Markowski')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7196950'), ('name', 'Piotr Hertel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9285011'), ('name', 'Hajg Zaharian')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q9312585'), ('name', 'Roman Rewakowicz')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q159250'), ('name', 'Daniel Landa')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10287874'), ('name', 'Gabriel Migliori')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1692106'), ('name', 'Johan Zachrisson')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10327605'), ('name', 'Mauro Senise')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11912173'), ('name', 'Vladivojna La Chia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1261038'), ('name', 'Richard A. Whiting')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1564988'), ('name', 'Radamés Gnattali')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5248182'), ('name', 'Deborah Blando')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5570555'), ('name', 'Tord Benner')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5961437'), ('name', 'Lille Bror Söderlundh')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6200457'), ('name', 'Jules Sylvain')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#use the property P86 to list some composers\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P86 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "df934fc0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1415090'), ('name', 'film score composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680731'), ('name', 'opera composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680663'), ('name', 'classical composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21680699'), ('name', 'operetta composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24256060'), ('name', 'professor of music composition')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q64356038'), ('name', 'musical theatre composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8008937'), ('name', 'Category:Composers')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q63536580'), ('name', 'video game composer')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5156675'), ('name', 'Compo')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# look at their occupation\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P86 ?obj.\n",
    "    ?obj wdt:P106 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"ompo\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "4d64123d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# look at their occupation\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?name\n",
    "WHERE { \n",
    "    BIND(wd:Q36834 AS ?inst).\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "be2e16b8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 2 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q36834\"\n",
    "og_name = \"composer\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"2\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "106e561f",
   "metadata": {},
   "source": [
    "Find `wd:Q36834` -> composer"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d50e6c89",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "8b8b7841",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1054574'), ('name', 'romance film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q369747'), ('name', 'war film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52162262'), ('name', 'film based on literature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q645928'), ('name', 'biographical film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q846544'), ('name', 'disaster film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52207399'), ('name', 'film based on a novel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17013749'), ('name', 'historical film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1196408'), ('name', 'historical fiction')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q136472'), ('name', 'historical literature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2561438'), ('name', 'slice of life')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2642760'), ('name', 'vigilante film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q20656232'), ('name', 'science fiction action film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1548170'), ('name', 'musical comedy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193979'), ('name', 'farce')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q157394'), ('name', 'fantasy film')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# use the property genre (P136) found some queries above\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P136 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "1e2f043c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108329096'), ('name', 'genre by art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5937792'), ('name', 'crime fiction')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1194240'), ('name', 'science fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q223393'), ('name', 'literary genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1792379'), ('name', 'art genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20076756'), ('name', 'speculative fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108465955'), ('name', 'fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15961987'), ('name', 'television genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q7777573'), ('name', 'theatrical genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5151404'), ('name', 'comedic genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20656220'), ('name', 'thriller genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5188177'), ('name', 'cross-genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q188451'), ('name', 'music genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1437361'), ('name', 'form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q759853'), ('name', 'film format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15961983'), ('name', 'radio genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4263830'), ('name', 'literary form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q483394'), ('name', 'genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1053916'), ('name', 'theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q621993'), ('name', 'literary class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8187769'), ('name', 'economic activity')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q862597'), ('name', 'musical form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q89362829'), ('name', 'non-music')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108466143'), ('name', 'non-fiction genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20644555'), ('name', 'fantasy genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4178140'), ('name', 'anime and manga genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q49148153'), ('name', 'pornography genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108317211'), ('name', 'novel genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108368282'), ('name', 'genre by literary form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167410'), ('name', 'Wikimedia disambiguation page')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q659563'), ('name', 'video game genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q60539481'), ('name', 'negative emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11862829'), ('name', 'academic discipline')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2604680'), ('name', 'target audience')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3326717'), ('name', 'literary movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1415395'), ('name', 'film industry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q31629'), ('name', 'type of sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4356073'), ('name', 'spectator sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q9415'), ('name', 'emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1920219'), ('name', 'social issue')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q103110540'), ('name', 'anime genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3516833'), ('name', 'animation technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q45971958'), ('name', 'performing arts genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4894405'), ('name', 'journalism genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1001378'), ('name', 'cinematic technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5484828'), ('name', 'cyberpunk derivative form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q101352'), ('name', 'family name')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20643324'), ('name', 'opera genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q589183'), ('name', 'radio format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q13406463'), ('name', 'Wikimedia list article')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q745775'), ('name', 'narrative mode')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1288568'), ('name', 'modern language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q33742'), ('name', 'natural language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q34770'), ('name', 'language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q152559'), ('name', 'macrolanguage')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56055944'), ('name', 'art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q22808320'), ('name', 'Wikimedia human name disambiguation page')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q16695773'), ('name', 'WikiProject')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q16748888'), ('name', 'advanced emotion')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q97430452'), ('name', 'performing arts industry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24856'), ('name', 'film series')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1969448'), ('name', 'term')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4671286'), ('name', 'academic major')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36649'), ('name', 'visual art')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11921029'), ('name', 'music style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q107356781'), ('name', 'song type')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q506240'), ('name', 'television film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4220920'), ('name', 'filmmaking occupation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20087698'), ('name', 'comics genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q59126'), ('name', 'xiaoshuo')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1126006'), ('name', 'public broadcaster')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('name', 'concept')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q41719'), ('name', 'hypothesis')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1047698'), ('name', 'superpower')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q179661'), ('name', 'treatment')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1047113'), ('name', 'specialty')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q331769'), ('name', 'mood')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2738074'), ('name', 'political movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3001152'), ('name', 'movement in cinema')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q482994'), ('name', 'album')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2198855'), ('name', 'cultural movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q968159'), ('name', 'art movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q191328'), ('name', 'tonal language')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3305213'), ('name', 'painting')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q9332'), ('name', 'behavior')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108306867'), ('name', 'tone (work)')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1149305'), ('name', 'disposition')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q622645'), ('name', 'attitude')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('name', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q636497'), ('name', 'stock character')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q17305127'), ('name', 'fictional profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q842284'), ('name', 'skateboarding')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q215380'), ('name', 'musical group')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1792644'), ('name', 'art style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q103112098'), ('name', 'manga genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3624078'), ('name', 'sovereign state')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4209223'), ('name', 'Rechtsstaat')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43702'), ('name', 'federation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q619610'), ('name', 'social state')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q63791824'), ('name', 'country bordering the Baltic Sea')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q7270'), ('name', 'republic')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q67515288'), ('name', 'cinema of country or region')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3233738'), ('name', 'Golden age')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q576639'), ('name', 'essentially contested concept')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q107357104'), ('name', 'type of dance')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28820001'), ('name', 'music scene')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q42907216'), ('name', 'video game theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5257307'), ('name', 'prize')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3445707'), ('name', 'tax policy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q515244'), ('name', 'administrative procedure')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3024240'), ('name', 'historical country')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q483677'), ('name', 'pseudoscience')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2728698'), ('name', 'religious belief')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q170835'), ('name', 'cosmogony')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4430243'), ('name', 'social organization')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q6055843'), ('name', 'internet genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q89522629'), ('name', 'poetic form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1406161'), ('name', 'artistic theme')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q26971562'), ('name', 'comic format')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q212434'), ('name', 'Olympic sport')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q134556'), ('name', 'single')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q6647660'), ('name', 'literary element')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q18011171'), ('name', 'unfinished or abandoned film project')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q50572323'), ('name', 'fantastic literature genre')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15831596'), ('name', 'class of fictional entities')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2465832'), ('name', 'branch of science')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4502142'), ('name', 'visual artwork')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2695280'), ('name', 'technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1209283'), ('name', 'electronic media')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20742825'), ('name', 'cultural depiction')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q264965'), ('name', 'subculture')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19116554'), ('name', 'youth subculture')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q49447'), ('name', 'world view')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2915955'), ('name', 'philosophical movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5303685'), ('name', 'doxastic attitude')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3377406'), ('name', 'political catch phrase')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q13442814'), ('name', 'scholarly article')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q12737077'), ('name', 'occupation')]\n",
      "142\n"
     ]
    }
   ],
   "source": [
    "# use the property genre (P136) found some queries above\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P136 ?obj.\n",
    "    ?obj wdt:P31 ?inst.\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "8662e35d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# look at their occupation\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?name\n",
    "WHERE { \n",
    "    BIND(wd:Q201658 AS ?inst).\n",
    "    ?inst sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "3924d529",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 3 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q201658\"\n",
    "og_name = \"film genre\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"3\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1052ad1",
   "metadata": {},
   "source": [
    "Found `wd:Q201658` -> film genre"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe574cdc",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8001b02",
   "metadata": {},
   "source": [
    "Need to find date of release and also the country of release"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "849f372e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2754'), ('name', 'production date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3893'), ('name', 'public domain date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2913'), ('name', 'date depicted')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1191'), ('name', 'date of first performance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1619'), ('name', 'date of official opening')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6949'), ('name', 'announcement date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3999'), ('name', 'date of official closure')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2960'), ('name', 'archive date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P576'), ('name', 'dissolved, abolished or demolished date')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5204'), ('name', 'date of commercialization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "# find the date and the country\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        ?prop ?obj.\n",
    "    ?prop sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"date\") || REGEX(?name,\"ountr\") ).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "4c03e91e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q42537'), ('name', 'flag of the United States')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q165230'), ('name', 'flag of the Soviet Union')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q380675'), ('name', 'cinema of the United States')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q36704'), ('name', 'Yugoslavia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41304'), ('name', 'Weimar Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q717'), ('name', 'Venezuela')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q265'), ('name', 'Uzbekistan')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q77'), ('name', 'Uruguay')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q174193'), ('name', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q170468'), ('name', 'United Arab Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q878'), ('name', 'United Arab Emirates')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q193619'), ('name', 'Union of South Africa')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27190661'), ('name', 'Umoma')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q133356'), ('name', 'Ukrainian Soviet Socialist Republic')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q243610'), ('name', \"Ukrainian People's Republic\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q212'), ('name', 'Ukraine')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1036'), ('name', 'Uganda')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q874'), ('name', 'Turkmenistan')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. But first need to find United States\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"[U,u]\")).\n",
    "}\n",
    "ORDER BY DESC (?name)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "ccbc7805",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q93204'), ('name', 'documentary film'), ('counts', '1648')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama'), ('counts', '1584')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film'), ('counts', '687')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film'), ('counts', '663')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film'), ('counts', '573')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q2484376'), ('name', 'thriller film'), ('counts', '521')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q471839'), ('name', 'science fiction film'), ('counts', '318')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q20442589'), ('name', 'LGBT-related film'), ('counts', '311')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q859369'), ('name', 'comedy-drama'), ('counts', '290')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q959790'), ('name', 'crime film'), ('counts', '288')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. USA (Q30)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?genre ?name COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 wd:Q30;\n",
    "        wdt:P136 ?genre;\n",
    "        wdt:P577 ?date.\n",
    "    ?genre wdt:P31 wd:Q201658.\n",
    "    FILTER ( isLiteral(?date) ) .\n",
    "    FILTER(?date>=xsd:date(\"2010-01-01\") && ?date<xsd:date(\"2016-01-01\")).\n",
    "    ?genre sc:name ?name.\n",
    "}\n",
    "GROUP BY ?genre ?name\n",
    "ORDER BY DESC (?counts)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "a6eb2ed0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q130232'), ('name', 'drama'), ('counts', '339')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q157443'), ('name', 'comedy film'), ('counts', '124')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q200092'), ('name', 'horror film'), ('counts', '81')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q860626'), ('name', 'romantic comedy'), ('counts', '81')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q172980'), ('name', 'Western film'), ('counts', '77')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q369747'), ('name', 'war film'), ('counts', '71')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q842256'), ('name', 'musical film'), ('counts', '66')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q471839'), ('name', 'science fiction film'), ('counts', '58')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q959790'), ('name', 'crime film'), ('counts', '52')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q1054574'), ('name', 'romance film'), ('counts', '50')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# use the property publication date and country of origin. USA (Q30)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?genre ?name COUNT(DISTINCT ?film) AS ?counts\n",
    "WHERE { \n",
    "    ?film wdt:P31 wd:Q11424;\n",
    "        wdt:P495 wd:Q30;\n",
    "        wdt:P136 ?genre;\n",
    "        wdt:P577 ?date.\n",
    "    ?genre wdt:P31 wd:Q201658.\n",
    "    FILTER ( isLiteral(?date) ) .\n",
    "    FILTER(?date>=xsd:date(\"1960-01-01\") && ?date<xsd:date(\"1965-01-01\")).\n",
    "    ?genre sc:name ?name.\n",
    "}\n",
    "GROUP BY ?genre ?name\n",
    "ORDER BY DESC (?counts)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "9ea1c66d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryname', 'Sweden'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q221'), ('countryname', 'North Macedonia'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('countryname', 'Spain'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q43'), ('countryname', 'Turkey'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('countryname', 'Belgium'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('countryname', 'Austria'), ('numberOfFilms', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('countryname', 'United Kingdom'), ('numberOfFilms', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q159'), ('countryname', 'Russia'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryname', 'Denmark'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('countryname', 'Germany'), ('numberOfFilms', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countryname', 'France'), ('numberOfFilms', '3')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'),\n",
    "#('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q5107'), ('name', 'continent')]\n",
    "#[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentname', 'Europe')]\n",
    "\n",
    "#AADING THE COUNTER  \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?country  ?countryname (count (?film) AS ?numberOfFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P136 wd:Q172980;\n",
    "       wdt:P495 ?country;\n",
    "       wdt:P577 ?date.\n",
    "    ?country wdt:P30 wd:Q46. \n",
    "    \n",
    "   # get the label\n",
    "  \n",
    "    ?country  sc:name ?countryname.\n",
    "\n",
    "   \n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} \n",
    "GROUP BY ?country  ?countryname\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "dd65d738",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## single literal associated to an URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    val = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= val\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"4\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43c41f24",
   "metadata": {},
   "source": [
    "## Task 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "37c6b966",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pdate', '1982-01-01T00:00:00Z')]\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pdate', '1982-10-15T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-07-26T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-09-18T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-12-05T00:00:00Z')]\n",
      "[('film', 'A Rainy Day in New York'), ('pdate', '2019-12-12T00:00:00Z')]\n",
      "[('film', 'Alice'), ('pdate', '1990-01-01T00:00:00Z')]\n",
      "[('film', 'Alice'), ('pdate', '1991-02-28T00:00:00Z')]\n",
      "[('film', 'Annie Hall'), ('pdate', '1977-04-20T00:00:00Z')]\n",
      "[('film', 'Another Woman'), ('pdate', '1988-01-01T00:00:00Z')]\n",
      "[('film', 'Another Woman'), ('pdate', '1989-03-16T00:00:00Z')]\n",
      "[('film', 'Anything Else'), ('pdate', '2003-01-01T00:00:00Z')]\n",
      "[('film', 'Bananas'), ('pdate', '1971-01-01T00:00:00Z')]\n",
      "[('film', 'Bananas'), ('pdate', '1974-08-30T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-07-26T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-08-29T00:00:00Z')]\n",
      "[('film', 'Blue Jasmine'), ('pdate', '2013-11-07T00:00:00Z')]\n",
      "[('film', 'Broadway Danny Rose'), ('pdate', '1984-01-01T00:00:00Z')]\n",
      "[('film', 'Broadway Danny Rose'), ('pdate', '1984-08-17T00:00:00Z')]\n",
      "[('film', 'Bullets Over Broadway'), ('pdate', '1994-09-16T00:00:00Z')]\n",
      "[('film', 'Bullets Over Broadway'), ('pdate', '1995-04-20T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-01-01T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-11-10T00:00:00Z')]\n",
      "[('film', 'Café Society'), ('pdate', '2016-11-17T00:00:00Z')]\n",
      "[('film', \"Cassandra's Dream\"), ('pdate', '2007-01-01T00:00:00Z')]\n",
      "[('film', \"Cassandra's Dream\"), ('pdate', '2008-06-05T00:00:00Z')]\n",
      "[('film', 'Celebrity'), ('pdate', '1998-09-07T00:00:00Z')]\n",
      "[('film', 'Celebrity'), ('pdate', '1999-04-08T00:00:00Z')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pdate', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pdate', '1990-03-01T00:00:00Z')]\n",
      "[('film', 'Deconstructing Harry'), ('pdate', '1997-01-01T00:00:00Z')]\n",
      "[('film', 'Deconstructing Harry'), ('pdate', '1998-05-21T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1996-01-01T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1996-12-08T00:00:00Z')]\n",
      "[('film', 'Everyone Says I Love You'), ('pdate', '1997-08-14T00:00:00Z')]\n",
      "[('film', 'Everything You Always Wanted to Know About Sex*'), ('pdate', '1972-01-01T00:00:00Z')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pdate', '1986-02-07T00:00:00Z')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pdate', '1986-10-02T00:00:00Z')]\n",
      "[('film', 'Hollywood Ending'), ('pdate', '2002-01-01T00:00:00Z')]\n",
      "[('film', 'Husbands and Wives'), ('pdate', '1992-01-01T00:00:00Z')]\n",
      "[('film', 'Husbands and Wives'), ('pdate', '1993-02-25T00:00:00Z')]\n",
      "[('film', 'Interiors'), ('pdate', '1978-01-01T00:00:00Z')]\n",
      "[('film', 'Irrational Man'), ('pdate', '2015-05-16T00:00:00Z')]\n",
      "[('film', 'Love and Death'), ('pdate', '1975-01-01T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-01-01T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-11-13T00:00:00Z')]\n",
      "[('film', 'Magic in the Moonlight'), ('pdate', '2014-12-04T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-01-01T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-08-30T00:00:00Z')]\n",
      "[('film', 'Manhattan'), ('pdate', '1979-12-14T00:00:00Z')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pdate', '1993-01-01T00:00:00Z')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pdate', '1994-02-03T00:00:00Z')]\n",
      "[('film', 'Match Point'), ('pdate', '2005-05-12T00:00:00Z')]\n",
      "[('film', 'Match Point'), ('pdate', '2005-12-29T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2004-01-01T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2005-03-18T00:00:00Z')]\n",
      "[('film', 'Melinda and Melinda'), ('pdate', '2005-06-23T00:00:00Z')]\n",
      "[('film', 'Midnight in Paris'), ('pdate', '2011-01-01T00:00:00Z')]\n",
      "[('film', 'Midnight in Paris'), ('pdate', '2011-08-18T00:00:00Z')]\n",
      "[('film', 'Mighty Aphrodite'), ('pdate', '1995-01-01T00:00:00Z')]\n",
      "[('film', 'Mighty Aphrodite'), ('pdate', '1996-08-15T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-03-10T00:00:00Z')]\n",
      "[('film', 'New York Stories'), ('pdate', '1989-09-21T00:00:00Z')]\n",
      "[('film', 'Radio Days'), ('pdate', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'Radio Days'), ('pdate', '1987-10-01T00:00:00Z')]\n",
      "[('film', \"Rifkin's Festival\"), ('pdate', '2020-01-01T00:00:00Z')]\n",
      "[('film', 'September'), ('pdate', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'September'), ('pdate', '1988-03-31T00:00:00Z')]\n",
      "[('film', 'Shadows and Fog'), ('pdate', '1991-01-01T00:00:00Z')]\n",
      "[('film', 'Shadows and Fog'), ('pdate', '1992-02-27T00:00:00Z')]\n",
      "[('film', 'Sleeper'), ('pdate', '1973-12-17T00:00:00Z')]\n",
      "[('film', 'Sleeper'), ('pdate', '1974-04-25T00:00:00Z')]\n",
      "[('film', 'Small Time Crooks'), ('pdate', '2000-01-01T00:00:00Z')]\n",
      "[('film', 'Small Time Crooks'), ('pdate', '2000-11-30T00:00:00Z')]\n",
      "[('film', 'Stardust Memories'), ('pdate', '1980-01-01T00:00:00Z')]\n",
      "[('film', 'Stardust Memories'), ('pdate', '1981-01-22T00:00:00Z')]\n",
      "[('film', 'Sweet and Lowdown'), ('pdate', '1999-01-01T00:00:00Z')]\n",
      "[('film', 'Sweet and Lowdown'), ('pdate', '2000-03-30T00:00:00Z')]\n",
      "[('film', 'Take the Money and Run'), ('pdate', '1969-01-01T00:00:00Z')]\n",
      "[('film', 'The Concert for New York City'), ('pdate', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pdate', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pdate', '2001-12-06T00:00:00Z')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pdate', '1985-01-01T00:00:00Z')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pdate', '1985-10-03T00:00:00Z')]\n",
      "[('film', 'To Rome with Love'), ('pdate', '2012-01-01T00:00:00Z')]\n",
      "[('film', 'To Rome with Love'), ('pdate', '2012-08-30T00:00:00Z')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pdate', '2008-01-01T00:00:00Z')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pdate', '2008-12-04T00:00:00Z')]\n",
      "[('film', \"What's Up, Tiger Lily?\"), ('pdate', '1966-01-01T00:00:00Z')]\n",
      "[('film', 'Whatever Works'), ('pdate', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'Whatever Works'), ('pdate', '2009-12-03T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2017-12-01T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2017-12-07T00:00:00Z')]\n",
      "[('film', 'Wonder Wheel'), ('pdate', '2018-01-11T00:00:00Z')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pdate', '2010-01-01T00:00:00Z')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pdate', '2010-12-02T00:00:00Z')]\n",
      "[('film', 'Zelig'), ('pdate', '1983-01-01T00:00:00Z')]\n",
      "[('film', 'Zelig'), ('pdate', '1983-09-30T00:00:00Z')]\n",
      "[('film', 'scoop'), ('pdate', '2006-01-01T00:00:00Z')]\n",
      "[('film', 'scoop'), ('pdate', '2006-11-16T00:00:00Z')]\n",
      "101\n"
     ]
    }
   ],
   "source": [
    "# Finding films directed by Woody Allen and their details to have a clue.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?pdate\n",
    "WHERE {\n",
    "   # bind something\n",
    "  ?f wdt:P31 wd:Q11424 ;\n",
    "     wdt:P57 wd:Q25089 ;\n",
    "     wdt:P577 ?pdate .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?f sc:name ?film.\n",
    "\n",
    "}\n",
    "ORDER BY (?film)  (?pdate) \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "04913766",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', \"What's Up, Tiger Lily?\"), ('pYear', '1966')]\n",
      "[('film', 'Take the Money and Run'), ('pYear', '1969')]\n",
      "[('film', 'Bananas'), ('pYear', '1971')]\n",
      "[('film', 'Everything You Always Wanted to Know About Sex*'), ('pYear', '1972')]\n",
      "[('film', 'Sleeper'), ('pYear', '1973')]\n",
      "[('film', 'Love and Death'), ('pYear', '1975')]\n",
      "[('film', 'Annie Hall'), ('pYear', '1977')]\n",
      "[('film', 'Interiors'), ('pYear', '1978')]\n",
      "[('film', 'Manhattan'), ('pYear', '1979')]\n",
      "[('film', 'Stardust Memories'), ('pYear', '1980')]\n",
      "[('film', \"A Midsummer Night's Sex Comedy\"), ('pYear', '1982')]\n",
      "[('film', 'Zelig'), ('pYear', '1983')]\n",
      "[('film', 'Broadway Danny Rose'), ('pYear', '1984')]\n",
      "[('film', 'The Purple Rose of Cairo'), ('pYear', '1985')]\n",
      "[('film', 'Hannah and Her Sisters'), ('pYear', '1986')]\n",
      "[('film', 'Radio Days'), ('pYear', '1987')]\n",
      "[('film', 'September'), ('pYear', '1987')]\n",
      "[('film', 'Another Woman'), ('pYear', '1988')]\n",
      "[('film', 'Crimes and Misdemeanors'), ('pYear', '1989')]\n",
      "[('film', 'New York Stories'), ('pYear', '1989')]\n",
      "[('film', 'Alice'), ('pYear', '1990')]\n",
      "[('film', 'Shadows and Fog'), ('pYear', '1991')]\n",
      "[('film', 'Husbands and Wives'), ('pYear', '1992')]\n",
      "[('film', 'Manhattan Murder Mystery'), ('pYear', '1993')]\n",
      "[('film', 'Bullets Over Broadway'), ('pYear', '1994')]\n",
      "[('film', 'Mighty Aphrodite'), ('pYear', '1995')]\n",
      "[('film', 'Everyone Says I Love You'), ('pYear', '1996')]\n",
      "[('film', 'Deconstructing Harry'), ('pYear', '1997')]\n",
      "[('film', 'Celebrity'), ('pYear', '1998')]\n",
      "[('film', 'Sweet and Lowdown'), ('pYear', '1999')]\n",
      "[('film', 'Small Time Crooks'), ('pYear', '2000')]\n",
      "[('film', 'The Concert for New York City'), ('pYear', '2001')]\n",
      "[('film', 'The Curse of the Jade Scorpion'), ('pYear', '2001')]\n",
      "[('film', 'Hollywood Ending'), ('pYear', '2002')]\n",
      "[('film', 'Anything Else'), ('pYear', '2003')]\n",
      "[('film', 'Melinda and Melinda'), ('pYear', '2004')]\n",
      "[('film', 'Match Point'), ('pYear', '2005')]\n",
      "[('film', 'scoop'), ('pYear', '2006')]\n",
      "[('film', \"Cassandra's Dream\"), ('pYear', '2007')]\n",
      "[('film', 'Vicky Cristina Barcelona'), ('pYear', '2008')]\n",
      "[('film', 'Whatever Works'), ('pYear', '2009')]\n",
      "[('film', 'You Will Meet a Tall Dark Stranger'), ('pYear', '2010')]\n",
      "[('film', 'Midnight in Paris'), ('pYear', '2011')]\n",
      "[('film', 'To Rome with Love'), ('pYear', '2012')]\n",
      "[('film', 'Blue Jasmine'), ('pYear', '2013')]\n",
      "[('film', 'Magic in the Moonlight'), ('pYear', '2014')]\n",
      "[('film', 'Irrational Man'), ('pYear', '2015')]\n",
      "[('film', 'Café Society'), ('pYear', '2016')]\n",
      "[('film', 'Wonder Wheel'), ('pYear', '2017')]\n",
      "[('film', 'A Rainy Day in New York'), ('pYear', '2019')]\n",
      "[('film', \"Rifkin's Festival\"), ('pYear', '2020')]\n",
      "51\n"
     ]
    }
   ],
   "source": [
    "# Lots of films have more than one publication date.\n",
    "# Selecting first publication date for each film.\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director  (Query 7)\n",
    "# wdt:P577 => publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film (MIN(YEAR(?pdate)) as ?pYear)\n",
    "WHERE {\n",
    "   # bind something\n",
    "  ?f wdt:P31 wd:Q11424 ;\n",
    "     wdt:P57 wd:Q25089 ;\n",
    "     wdt:P577 ?pdate .\n",
    "   \n",
    "   # get the label\n",
    "   ?f sc:name ?film.\n",
    "\n",
    "}\n",
    "ORDER BY ASC(?pYear) (?film)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "7cfbc40f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2005'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1971'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q3772 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q3772;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q25089 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q25089;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "        \n",
    "}\n",
    "}group by ?year \n",
    "limit 2\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "1fbb22af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## more literals associated to the same element\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    year = i[2][1]\n",
    "    films = i[3][1]\n",
    "    for val in [year,films]:\n",
    "        obj = {}\n",
    "        obj[\"refers_to\"] = f_uri\n",
    "        obj[\"refers_to_name\"] = f_name\n",
    "        obj[\"check\"] = \"value\"\n",
    "        obj[\"value\"]= val\n",
    "        objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"5\", evaluation.TYPE_REFERRED ,\"value\", objs, elements_per_tuple = 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "267508c1",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "7a5c102a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q19020'), ('name', 'Academy Awards')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# Query 23\n",
    "\n",
    "\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (wd:Q19020 as ?IRI) ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   wd:Q19020 sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "e1294cce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 6 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q19020\"\n",
    "og_name = \"Academy Awards\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"6\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ce98263d",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "54835a4f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Once Upon a Time in Hollywood'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Once Upon a Time in Hollywood'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Original Score')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Vicky Cristina Barcelona'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query 24\n",
    "\n",
    "# Ckecking all films from both directors that recieve an Academy Awards.\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director ?fName ?aName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   \n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P166 ?a .\n",
    "      \n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "ORDER BY ?Director ?fName ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "3f8cc47e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('awards', '2')]\n",
      "[('Director', 'Quentin Tarantino'), ('awards', '1')]\n",
      "[('Director', 'Woody Allen'), ('awards', '4')]\n",
      "[('Director', 'Woody Allen'), ('awards', '3')]\n",
      "[('Director', 'Woody Allen'), ('awards', '1')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "# Counting awards of each film, grouping based on director and film\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director (COUNT(DISTINCT(?aName)) as ?awards)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   \n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P166 ?a .\n",
    "      \n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "GROUP BY ?Director ?fName\n",
    "ORDER BY ?Director DESC(?awards)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "884d80c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('maxAwards', '2')]\n",
      "[('Director', 'Woody Allen'), ('maxAwards', '4')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Maximun awards of each director\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director (MAX(?awards) as ?maxAwards) WHERE\n",
    "{\n",
    "   SELECT DISTINCT ?Director (COUNT(DISTINCT(?aName)) as ?awards) WHERE\n",
    "   {\n",
    "      # bind something\n",
    "      VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "      \n",
    "      ?f wdt:P57 ?IRI ;\n",
    "         wdt:P166 ?a .\n",
    "         \n",
    "      ?a wdt:P31 wd:Q19020 .\n",
    "      \n",
    "      # get the label\n",
    "      ?f  sc:name ?fName.\n",
    "      ?a sc:name ?aName.\n",
    "      ?IRI sc:name ?Director.\n",
    "   }\n",
    "   GROUP BY ?Director ?fName\n",
    "}\n",
    "GROUP BY ?Director\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "bb0c8a35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('film', 'Once Upon a Time in Hollywood'), ('awards', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3772'), ('Director', 'Quentin Tarantino'), ('film', 'Django Unchained'), ('awards', '2')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25089'), ('Director', 'Woody Allen'), ('film', 'Annie Hall'), ('awards', '4')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Counting awards of each film, grouping based on director and film\n",
    "\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q206124 => 'Midnight in Paris'  (Query 2)\n",
    "# wdt:P166 => award received (Query 7)\n",
    "# wd:Q19020 => Academy Awards  (Query 2)\n",
    "# wd:Q25089 => Woody Allen\n",
    "# wd:Q3772 => Quentin Tarantino\n",
    "# wdt:P57 => director \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?IRI ?Director ?filmIRI ?film ?awards WHERE\n",
    "{\n",
    "\n",
    "############################################################################################################\n",
    "# get the number of awards per film for each director\n",
    "# Output are IRI, f (filmIRI) and awards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRI ?f (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "   {\n",
    "      # bind something\n",
    "      VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "      ?f wdt:P57 ?IRI ;\n",
    "         wdt:P166 ?a .  \n",
    "      ?a wdt:P31 wd:Q19020 .\n",
    "   }\n",
    "   GROUP BY ?IRI ?f\n",
    "   }\n",
    "############################################################################################################\n",
    "# get the maximum of awards per film for each director\n",
    "# Output are IRIm and maxAwards\n",
    "   {\n",
    "   SELECT DISTINCT ?IRIm (MAX(?awards) as ?maxAwards) WHERE\n",
    "   {\n",
    "      SELECT DISTINCT ?IRIm (COUNT(DISTINCT(?a)) as ?awards) WHERE\n",
    "      {\n",
    "         # bind something\n",
    "         VALUES ?IRIm {wd:Q25089 wd:Q3772}\n",
    "         ?f wdt:P57 ?IRIm ;\n",
    "            wdt:P166 ?a .\n",
    "         ?a wdt:P31 wd:Q19020 .\n",
    "      }\n",
    "      GROUP BY ?IRIm ?f\n",
    "   }\n",
    "   GROUP BY ?IRIm\n",
    "   }\n",
    "############################################################################################################\n",
    "\n",
    "   FILTER(?IRI = ?IRIm && ?awards = ?maxAwards)\n",
    "\n",
    "   # get the label\n",
    "   ?f  sc:name ?film.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "350328e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmname', 'Django Unchained'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FIRST APPROACH TO FIND THE ANSWER using union instead of value\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   SELECT   ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "        VALUES ?director {  wd:Q25089 }\n",
    "       ?film wdt:P57 ?director;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "     VALUES ?director { wd:Q3772  }\n",
    "       \n",
    "       ?film wdt:P57 ?director ;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "        \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "d625d2b0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## more elements mixed between URI and literals\n",
    "objs=[]\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    dir_uri = i[2][1]\n",
    "    dir_name = i[3][1]\n",
    "    year = i[4][1]\n",
    "    # add the year element\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"] = year\n",
    "    objs.append(obj)\n",
    "    # add the director element\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = [\"uri\",\"name\"]\n",
    "    obj[\"uri\"] = dir_uri\n",
    "    obj[\"name\"] = dir_name\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"7\", evaluation.TYPE_REFERRED ,[\"uri\",\"name\",\"value\"], objs, elements_per_tuple = 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aed6eb53",
   "metadata": {},
   "source": [
    "## Task 8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "39e7d71e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Sound Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Django Unchained'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Sound')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Sound Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Inglourious Basterds'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Jackie Brown'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'Pulp Fiction'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Original Score')]\n",
      "[('Director', 'Quentin Tarantino'), ('fName', 'The Hateful Eight'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Alice'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Annie Hall'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Blue Jasmine'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Broadway Danny Rose'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Broadway Danny Rose'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Costume Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Bullets Over Broadway'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Crimes and Misdemeanors'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Deconstructing Harry'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Film Editing')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Hannah and Her Sisters'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Husbands and Wives'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Husbands and Wives'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Interiors'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Manhattan'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Manhattan'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Match Point'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Director')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Picture')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Midnight in Paris'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Mighty Aphrodite'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Radio Days'), ('aName', 'Academy Award for Best Production Design')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Radio Days'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Sweet and Lowdown'), ('aName', 'Academy Award for Best Actor')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Sweet and Lowdown'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'The Purple Rose of Cairo'), ('aName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Vicky Cristina Barcelona'), ('aName', 'Academy Award for Best Supporting Actress')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Zelig'), ('aName', 'Academy Award for Best Cinematography')]\n",
      "[('Director', 'Woody Allen'), ('fName', 'Zelig'), ('aName', 'Academy Award for Best Costume Design')]\n",
      "76\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Finding list of all films from directors nominated for any kind of Academy Awards to have a clue.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?Director ?fName ?aName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?f  sc:name ?fName.\n",
    "   ?a sc:name ?aName.\n",
    "   ?IRI sc:name ?Director.\n",
    "}\n",
    "ORDER BY ?Director ?fName ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "39b5a9d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('aName', 'Academy Award for Best Actor'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Actress'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Cinematography'), ('noOfFilm', '4')]\n",
      "[('aName', 'Academy Award for Best Costume Design'), ('noOfFilm', '2')]\n",
      "[('aName', 'Academy Award for Best Director'), ('noOfFilm', '9')]\n",
      "[('aName', 'Academy Award for Best Film Editing'), ('noOfFilm', '3')]\n",
      "[('aName', 'Academy Award for Best Original Score'), ('noOfFilm', '1')]\n",
      "[('aName', 'Academy Award for Best Picture'), ('noOfFilm', '6')]\n",
      "[('aName', 'Academy Award for Best Production Design'), ('noOfFilm', '5')]\n",
      "[('aName', 'Academy Award for Best Sound'), ('noOfFilm', '1')]\n",
      "[('aName', 'Academy Award for Best Sound Editing'), ('noOfFilm', '2')]\n",
      "[('aName', 'Academy Award for Best Supporting Actor'), ('noOfFilm', '7')]\n",
      "[('aName', 'Academy Award for Best Supporting Actress'), ('noOfFilm', '11')]\n",
      "[('aName', 'Academy Award for Best Writing, Original Screenplay'), ('noOfFilm', '19')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Counting no of nominated films for each Academic Awards.\n",
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?aName (COUNT(?f) as ?noOfFilm)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?a sc:name ?aName.\n",
    "}\n",
    "GROUP BY ?aName\n",
    "ORDER BY ?aName\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "b5b6cc2a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103916'), ('award', 'Academy Award for Best Actor'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103618'), ('award', 'Academy Award for Best Actress'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q131520'), ('award', 'Academy Award for Best Cinematography'), ('noOfNominates', '4')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q277536'), ('award', 'Academy Award for Best Costume Design'), ('noOfNominates', '2')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q103360'), ('award', 'Academy Award for Best Director'), ('noOfNominates', '9')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q281939'), ('award', 'Academy Award for Best Film Editing'), ('noOfNominates', '3')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q488651'), ('award', 'Academy Award for Best Original Score'), ('noOfNominates', '1')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q102427'), ('award', 'Academy Award for Best Picture'), ('noOfNominates', '6')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q277751'), ('award', 'Academy Award for Best Production Design'), ('noOfNominates', '5')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q830079'), ('award', 'Academy Award for Best Sound'), ('noOfNominates', '1')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q488645'), ('award', 'Academy Award for Best Sound Editing'), ('noOfNominates', '2')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q106291'), ('award', 'Academy Award for Best Supporting Actor'), ('noOfNominates', '7')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q106301'), ('award', 'Academy Award for Best Supporting Actress'), ('noOfNominates', '11')]\n",
      "[('awardIRI', 'http://www.wikidata.org/entity/Q41417'), ('award', 'Academy Award for Best Writing, Original Screenplay'), ('noOfNominates', '19')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# Sorting the result is just for make it easier to review.\n",
    "\n",
    "# wd:Q19020 => Academy Awards\n",
    "# wdt:P1411 => nominated for  (Query 7)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?a as ?awardIRI) ?award (COUNT(?f) as ?noOfNominates)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   VALUES ?IRI {wd:Q25089 wd:Q3772}\n",
    "   ?f wdt:P57 ?IRI ;\n",
    "      wdt:P1411 ?a .\n",
    "   ?a wdt:P31 wd:Q19020 .\n",
    "   \n",
    "   # get the label\n",
    "   ?a sc:name ?award.\n",
    "}\n",
    "GROUP BY ?a ?award\n",
    "ORDER BY ?award\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "b88a74fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 2_0\n",
      "The path is /locale/data/jupyter/prando/esw/tracks/2022/ground_truths/gt_json/workflow2_0.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "## single literal associated to an URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    val = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= val\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"8\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ba23acc3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
