{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0425f9c7",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f728fea7",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-4ddda0dbce-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8a314171",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Film Genre and directors explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the directors for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b72615a6",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n",
    "| `wd:Q3772`| Quentin Tarantino      | node |\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a63ec72",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for director\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films).\n",
    "\n",
    "5. Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films). \n",
    "\n",
    "6. Identify the BGP for Academy Awards \n",
    "\n",
    "7. Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won).\n",
    "\n",
    "8. Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e97d977",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "a243b257",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('name', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('name', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1309'), ('name', 'EGAXA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1317'), ('name', 'floruit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1455'), ('name', 'list of works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1477'), ('name', 'birth name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1607'), ('name', 'Dialnet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1728'), ('name', 'AllMusic artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1816'), ('name', 'National Portrait Gallery (London) person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1819'), ('name', 'genealogics.org person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1969'), ('name', 'MovieMeter director ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1977'), ('name', 'Les Archives du Spectacle Person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2174'), ('name', 'Museum of Modern Art artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2188'), ('name', 'BiblioNet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2190'), ('name', 'C-SPAN person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2191'), ('name', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('name', 'PORT person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P245'), ('name', 'Union List of Artist Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2469'), ('name', 'Theatricalia person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2519'), ('name', 'Scope.dk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2626'), ('name', 'Danish National Filmography person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2688'), ('name', 'Box Office Mojo person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P271'), ('name', 'CiNii author ID (books)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2734'), ('name', 'Unz Review author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2963'), ('name', 'Goodreads author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3056'), ('name', 'TCM Movie Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3065'), ('name', 'RERO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3136'), ('name', 'elCinema person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3142'), ('name', 'EDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3280'), ('name', 'BAnQ author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3305'), ('name', 'KINENOTE person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3348'), ('name', 'National Library of Greece ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('name', 'SNAC ARK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3478'), ('name', 'Songkick artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "3146d41d-d634-4d50-ab08-ee4d86157e38",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'Mira Sorvino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', '48th British Academy Film Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Edgar Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'Academy Award for Best Director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'television actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'film actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Hungarian Order of Merit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Commandeur des Arts et des Lettres\\u200e')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'Lentapedia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', \"Palme d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'star on Hollywood Walk of Fame')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'German')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'action film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'Museum of Modern Art')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'film director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'film producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'writer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'American Academy of Arts and Sciences')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', '70th Golden Globe Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'human')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'Christianity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'AAAS Fellow')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'male')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'Obalky knih.cz')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'works protected by copyrights')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'European Film Award for Best Non-European Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'National Board of Review Award for Best Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'President of the Jury at the Cannes Festival')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'Italian American')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'Irish Americans')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'Knoxville')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'Howard Hawks')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'BAFTA Award for Best Original Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'Golden Globe Award for Best Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Golden Globe Award for Best Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', '52nd Golden Globe Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'independent film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'Quentin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'Tarantino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'Lumière Award, Lyon Festival of cinema')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', '36th César Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'Daniella Pick')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', '66th British Academy Film Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'Didem Erol')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'Tony Tarantino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', 'Template:Quentin Tarantino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7084'), ('name', 'Category:Films directed by Quentin Tarantino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', 'Category:Quentin Tarantino')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'Quentin Tarantino filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('name', 'New Beverly Cinema')]\n",
      "58\n"
     ]
    }
   ],
   "source": [
    "# Checking the Director Quentin Tarantino on Q3772\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q3772 ?p ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "bac0a936-1730-4927-87ba-260fb6555cd7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q212026'), ('name', 'Mira Sorvino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2566554'), ('name', '48th British Academy Film Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q833154'), ('name', 'Edgar Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10798782'), ('name', 'television actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10800557'), ('name', 'film actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q113068'), ('name', 'Hungarian Order of Merit')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q13452531'), ('name', 'Commandeur des Arts et des Lettres\\u200e')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q17290934'), ('name', 'Lentapedia')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q179808'), ('name', \"Palme d'Or\")]\n",
      "[('object', 'http://www.wikidata.org/entity/Q17985761'), ('name', 'star on Hollywood Walk of Fame')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1860'), ('name', 'English')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188'), ('name', 'German')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188740'), ('name', 'Museum of Modern Art')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2526255'), ('name', 'film director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28389'), ('name', 'screenwriter')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3282637'), ('name', 'film producer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q33999'), ('name', 'actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3455803'), ('name', 'director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q463303'), ('name', 'American Academy of Arts and Sciences')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q490861'), ('name', '70th Golden Globe Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5043'), ('name', 'Christianity')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q52382875'), ('name', 'AAAS Fellow')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q67311526'), ('name', 'Obalky knih.cz')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q7042855'), ('name', 'film editor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q73555012'), ('name', 'works protected by copyrights')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1377772'), ('name', 'European Film Award for Best Non-European Film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1789102'), ('name', 'National Board of Review Award for Best Film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q23958341'), ('name', 'President of the Jury at the Cannes Festival')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q974693'), ('name', 'Italian American')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1075293'), ('name', 'Irish Americans')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q185582'), ('name', 'Knoxville')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q51581'), ('name', 'Howard Hawks')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q41375'), ('name', 'BAFTA Award for Best Original Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q849124'), ('name', 'Golden Globe Award for Best Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q93439'), ('name', '52nd Golden Globe Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q459290'), ('name', 'independent film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1158484'), ('name', 'Quentin')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q21487819'), ('name', 'Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3404975'), ('name', 'Lumière Award, Lyon Festival of cinema')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q245949'), ('name', '36th César Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q32947601'), ('name', 'Daniella Pick')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2690424'), ('name', '66th British Academy Film Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5274115'), ('name', 'Didem Erol')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q3772 ?p ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "836f2a07-0a14-42f3-9de0-eac162ee21da",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1813'), ('name', 'short name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9084'), ('name', 'ABC News topic ID')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "    # bind something\n",
    "    wd:Q188473 ?p ?object .\n",
    "    # get the label\n",
    "    ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "d119185e-c46d-46ed-85ba-936fffe5d7fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Using subClass P279 with action film Q188473\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name \n",
    "WHERE {\n",
    "    # bind something\n",
    "    wd:Q188473 wdt:P279 ?object .\n",
    "    # get the label\n",
    "    ?object sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"film\"))\n",
    "    \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9fc93b68",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "38894b64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2167'), ('name', 'UNSPSC Code')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2579'), ('name', 'studied by')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2612'), ('name', 'TED topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3832'), ('name', 'Europeana Fashion Vocabulary ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3911'), ('name', 'STW Thesaurus for Economics ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3921'), ('name', 'Wikidata SPARQL query equivalent')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P486'), ('name', 'MeSH descriptor ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4953'), ('name', 'Library of Congress Genre/Form Terms ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5125'), ('name', 'Wikimedia outline')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5198'), ('name', 'ASC Leiden Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5250'), ('name', 'IAB code')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6200'), ('name', 'BBC News topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6328'), ('name', 'Politika topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7497'), ('name', 'Wolfram Language entity type')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7685'), ('name', 'CALS Encyclopedia of Arkansas ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7688'), ('name', 'Mississippi Encyclopedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7749'), ('name', 'Nomenclature for Museum Cataloging')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7952'), ('name', 'The First Amendment Encyclopedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8672'), ('name', 'Twitter topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8972'), ('name', 'small logo or icon')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7697'), ('name', 'Maine: An Encyclopedia ID')]\n",
      "75\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Retrived BGP for film\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11424 ?object ?o.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "  \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f7b7295",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for director"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "698dfd28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q5870903'), ('name', 'Category:Directors')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q483501'), ('name', 'artist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2137554'), ('name', 'direction')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2462658'), ('name', 'manager')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2500638'), ('name', 'creator')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2607241'), ('name', 'mise en scène')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q8104450'), ('name', 'Category:Wikipedia categories named after filmmakers')]\n",
      "[('object', 'http://www.wikidata.org/entity/P57'), ('name', 'director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10809861'), ('name', 'Template:Infobox film director')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# cHECK the details of Director node on Q3455803 FROM THE previous Result\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q3455803 ?p ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "c48a3155-c347-463b-828a-4f468adab0fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q25089'), ('name', 'Woody Allen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q27351'), ('name', 'Senkichi Taniguchi')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# cHECK the details of Director node on Q3455803 FROM THE previous Result\n",
    "# [('object', 'http://www.wikidata.org/entity/P57'), ('name', 'director')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q971865 wdt:P57 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "e25f671d-691f-48d5-8cbf-c99a6292fcfa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# cHECK the details of Director node on Q3455803 FROM THE previous Result\n",
    "# [('object', 'http://www.wikidata.org/entity/P57'), ('name', 'director')]\n",
    "# We just need director to search for BGP so \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q971865 ?object wd:Q27351;\n",
    "   ?p wd:Q25089.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "43d223a9-a045-415d-b5d1-39827307c13e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P436'), ('name', 'MusicBrainz release group ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "59\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# cHECK the details of Director node on Q3455803 FROM THE previous Result\n",
    "# [('object', 'http://www.wikidata.org/entity/P57'), ('name', 'director')]\n",
    "# We just need director to search for BGP\n",
    "\n",
    "# we Have Retrivied BGP for Director\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q971865 ?object ?o.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "    \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d5b087a5",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c64d4f38",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for film genre"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "74f911f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('name', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('name', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1309'), ('name', 'EGAXA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1317'), ('name', 'floruit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'director')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q25089 ?p ?object .\n",
    "   ?p sc:name ?pName.\n",
    "   ?p sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "e6921441-e937-4940-acfb-bf6c5db087b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q349357'), ('name', 'Woody Herman')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1140914'), ('name', 'Soon-Yi Previn')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q22673707'), ('name', 'Bechet Dumaine Allen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q22673708'), ('name', 'Manzie Tio Allen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q18426'), ('name', 'The Bronx')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q102642'), ('name', 'Diane Keaton')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3404523'), ('name', 'David di Donatello for Best Foreign Actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q599316'), ('name', 'New School')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q19961034'), ('name', 'Woody')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q206124'), ('name', 'Midnight in Paris')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3831197'), ('name', 'Letty Aronson')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q31579'), ('name', 'David di Donatello')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3241784'), ('name', 'Golden Lion for Lifetime Achievements')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q50616934'), ('name', 'honorary doctorate of Pompeu Fabra University')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3404587'), ('name', 'FIPRESCI Prize of the Festival de Cannes')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2455835'), ('name', 'Woody Allen filmography')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3822438'), ('name', 'Butaca Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10800557'), ('name', 'film actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q13452531'), ('name', 'Commandeur des Arts et des Lettres\\u200e')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q139184'), ('name', 'BAFTA Award for Best Film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q15981151'), ('name', 'jazz musician')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q174389'), ('name', 'César Award')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1860'), ('name', 'English')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q18844224'), ('name', 'science fiction writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188740'), ('name', 'Museum of Modern Art')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1930187'), ('name', 'journalist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q214917'), ('name', 'playwright')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q245068'), ('name', 'comedian')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2526255'), ('name', 'film director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2648323'), ('name', 'Allen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28389'), ('name', 'screenwriter')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q288928'), ('name', 'agnosticism')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3282637'), ('name', 'film producer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q463303'), ('name', 'American Academy of Arts and Sciences')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q482980'), ('name', 'author')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q52382875'), ('name', 'AAAS Fellow')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q58488719'), ('name', 'Billy Ireland Cartoon Library & Museum biographical files')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q639669'), ('name', 'musician')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q67311526'), ('name', 'Obalky knih.cz')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q708135'), ('name', 'Silver Bear')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q73555012'), ('name', 'works protected by copyrights')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q787148'), ('name', 'Academy Fellowship Award')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q25089\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q25089 ?p ?object .\n",
    "   ?p sc:name ?pName.\n",
    "   ?object sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "3e42e864-4f33-4dde-87a3-e17a9c74f4c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q25089'), ('name', 'Woody Allen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q465224'), ('name', 'American International Pictures')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q376138'), ('name', 'Charles H. Joffe')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6381680'), ('name', 'Kazuo Yamada')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1053608'), ('name', \"The Lovin' Spoonful\")]\n",
      "[('object', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q17'), ('name', 'Japan')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1860'), ('name', 'English')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q22006653'), ('name', 'color')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q723685'), ('name', 'video on demand')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q20644797'), ('name', 'FSK 16')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q875920'), ('name', 'Toho')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q271861'), ('name', 'Akiko Wakabayashi')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q967761'), ('name', 'John Sebastian')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q12270304'), ('name', 'Mickey Rose')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q273532'), ('name', 'Louise Lasser')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q27351'), ('name', 'Senkichi Taniguchi')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q11356032'), ('name', 'Tatsuya Mihashi')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3751773'), ('name', 'Frank Buxton')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3674850'), ('name', 'China Lee')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q449493'), ('name', 'Mie Hama')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3189161'), ('name', 'Julie Bennett')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q971865\n",
    "# [('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q971865 ?p ?object .\n",
    "   ?object sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "bb985428-a3fb-4e33-8657-14ac87ce8bad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q971865\n",
    "# [('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q971865 ?p ?object .\n",
    "   ?p sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "704e6d10-8436-414f-94ef-29af3058fc18",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q971865\n",
    "# [('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q971865 wdt:P136 ?object .\n",
    "   ?object sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "68ead23e-2be4-40b7-a9a6-e76ebdfb85e9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q201658'), ('name', 'film genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q971865\n",
    "# [('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "# [('object', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "\n",
    "   wd:Q971865 wdt:P136 ?genre .\n",
    "   ?genre wdt:P31 ?object.\n",
    "   ?object sc:name ?name\n",
    "   \n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "220972fd",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "298cd287",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3235'), ('name', 'PhilPapers topic')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5250'), ('name', 'IAB code')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P5748'), ('name', 'Basisklassifikation')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P9760'), ('name', \"Treccani's Enciclopedia del Cinema ID\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8225'), ('name', 'is metaclass for')]\n",
      "21\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# write your queries\n",
    "\n",
    "# Now I will try to look All the objects of Q971865\n",
    "# [('object', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "# [('object', 'http://www.wikidata.org/entity/Q2297927'), ('name', 'spy film')]\n",
    "\n",
    "# BGP FOR  Genre movie\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q201658 ?object ?o.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "    \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3f49b42",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "e8880fe1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('films', 'http://www.wikidata.org/entity/Q309240'), ('Sname', 'Jean Giraud'), ('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?films ?Sname ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?films wdt:P31 wd:Q5;\n",
    "       wdt:P136 wd:Q172980;\n",
    "    wdt:P27 ?country.\n",
    "    \n",
    "    ?country wdt:P31 wd:Q6256;\n",
    "    wdt:P30 wd:Q46.\n",
    "   # get the label\n",
    "   ?films sc:name ?Sname.\n",
    "   ?country sc:name ?name\n",
    "    \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "508832c0",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "id": "80f196b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('films', 'http://www.wikidata.org/entity/Q309240'), ('Sname', 'Jean Giraud'), ('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?films ?Sname ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?films wdt:P31 wd:Q5;\n",
    "       wdt:P136 wd:Q172980;\n",
    "    wdt:P27 ?country.\n",
    "    \n",
    "    ?country wdt:P31 wd:Q6256;\n",
    "    wdt:P30 wd:Q46.\n",
    "   # get the label\n",
    "   ?films sc:name ?Sname.\n",
    "   ?country sc:name ?name\n",
    "    \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53a7b167",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "549a8844",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('filmname', 'The Concert for New York City'), ('year', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('year', '2011-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('year', '2011-08-18T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('year', '1990-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('year', '1991-02-28T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('filmname', \"What's Up, Tiger Lily?\"), ('year', '1966-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('year', '1994-09-16T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('year', '1995-04-20T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('year', '1995-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('year', '1996-08-15T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('year', '1984-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('year', '1984-08-17T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('year', '2005-05-12T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('year', '2005-12-29T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('year', '1992-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('year', '1993-02-25T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('year', '1971-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('year', '1974-08-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('year', '2010-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('year', '2010-12-02T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('year', '2014-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('year', '2014-11-13T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('year', '2014-12-04T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('filmname', 'Anything Else'), ('year', '2003-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('year', '1983-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('year', '1983-09-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('year', '2017-12-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('year', '2017-12-07T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('year', '2018-01-11T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('year', '1999-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('year', '2000-03-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('year', '1998-09-07T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('year', '1999-04-08T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('filmname', 'Love and Death'), ('year', '1975-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('year', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('year', '1990-03-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('year', '2006-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('year', '2006-11-16T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('year', '1980-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('year', '1981-01-22T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('year', '1989-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('year', '1989-03-10T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('year', '1989-09-21T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('filmname', \"Rifkin's Festival\"), ('year', '2020-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('year', '1973-12-17T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('year', '1974-04-25T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('year', '2000-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('year', '2000-11-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('year', '1991-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('year', '1992-02-27T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('year', '1993-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('year', '1994-02-03T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('filmname', 'Take the Money and Run'), ('year', '1969-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('year', '2004-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('year', '2005-03-18T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('year', '2005-06-23T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('year', '2013-07-26T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('year', '2013-08-29T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('year', '2013-11-07T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('year', '1979-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('year', '1979-08-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('year', '1979-12-14T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('year', '2007-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('year', '2008-06-05T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('filmname', 'Everything You Always Wanted to Know About Sex*'), ('year', '1972-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('year', '1985-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('year', '1985-10-03T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('year', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('year', '1988-03-31T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('filmname', 'Whatever Works'), ('year', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('filmname', 'Whatever Works'), ('year', '2009-12-03T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('filmname', 'Irrational Man'), ('year', '2015-05-16T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('filmname', 'To Rome with Love'), ('year', '2012-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('filmname', 'To Rome with Love'), ('year', '2012-08-30T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('year', '2016-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('year', '2016-11-10T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('year', '2016-11-17T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('filmname', \"A Midsummer Night's Sex Comedy\"), ('year', '1982-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('filmname', \"A Midsummer Night's Sex Comedy\"), ('year', '1982-10-15T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('filmname', 'Another Woman'), ('year', '1988-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('filmname', 'Another Woman'), ('year', '1989-03-16T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('filmname', 'Radio Days'), ('year', '1987-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('filmname', 'Radio Days'), ('year', '1987-10-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('year', '2019-07-26T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('year', '2019-09-18T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('year', '2019-12-05T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('year', '2019-12-12T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('year', '1996-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('year', '1996-12-08T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('year', '1997-08-14T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('year', '2008-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('year', '2008-12-04T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('year', '1977-04-20T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('filmname', 'The Curse of the Jade Scorpion'), ('year', '2001-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('filmname', 'The Curse of the Jade Scorpion'), ('year', '2001-12-06T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('filmname', 'Deconstructing Harry'), ('year', '1997-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('filmname', 'Deconstructing Harry'), ('year', '1998-05-21T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('filmname', 'Hollywood Ending'), ('year', '2002-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('year', '1986-02-07T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('year', '1986-10-02T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q961403'), ('filmname', 'Interiors'), ('year', '1978-01-01T00:00:00Z')]\n",
      "101\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmname ?year\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?year.\n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "id": "6804ea95-766f-42c5-a321-0cf14c4030be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('filmname', 'The Concert for New York City'), ('publicationYear', '2001')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('publicationYear', '2011')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('publicationYear', '1990')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('filmname', \"What's Up, Tiger Lily?\"), ('publicationYear', '1966')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('publicationYear', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('publicationYear', '1995')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('publicationYear', '1984')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('publicationYear', '2005')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('publicationYear', '1992')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('publicationYear', '1971')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('publicationYear', '2010')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('publicationYear', '2014')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('filmname', 'Anything Else'), ('publicationYear', '2003')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('publicationYear', '1983')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('publicationYear', '2017')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('publicationYear', '1999')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('publicationYear', '1998')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('filmname', 'Love and Death'), ('publicationYear', '1975')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('publicationYear', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('publicationYear', '2006')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('publicationYear', '1980')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('publicationYear', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('filmname', \"Rifkin's Festival\"), ('publicationYear', '2020')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('publicationYear', '1973')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('publicationYear', '2000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('publicationYear', '1991')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('publicationYear', '1993')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('filmname', 'Take the Money and Run'), ('publicationYear', '1969')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('publicationYear', '2004')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('publicationYear', '2013')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('publicationYear', '1979')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('publicationYear', '2007')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('filmname', 'Everything You Always Wanted to Know About Sex*'), ('publicationYear', '1972')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('publicationYear', '1985')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('publicationYear', '1987')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('filmname', 'Whatever Works'), ('publicationYear', '2009')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('filmname', 'Irrational Man'), ('publicationYear', '2015')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('filmname', 'To Rome with Love'), ('publicationYear', '2012')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('publicationYear', '2016')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('filmname', \"A Midsummer Night's Sex Comedy\"), ('publicationYear', '1982')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('filmname', 'Another Woman'), ('publicationYear', '1988')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('filmname', 'Radio Days'), ('publicationYear', '1987')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('publicationYear', '2019')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('publicationYear', '1996')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('publicationYear', '2008')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('publicationYear', '1977')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('filmname', 'The Curse of the Jade Scorpion'), ('publicationYear', '2001')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('filmname', 'Deconstructing Harry'), ('publicationYear', '1997')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('filmname', 'Hollywood Ending'), ('publicationYear', '2002')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('publicationYear', '1986')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATIN \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmname (YEAR(?date) AS ?publicationYear)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?date.\n",
    "   \n",
    "   filter NOT EXISTS{\n",
    "   ?film wdt:P577 ?secondDate.\n",
    "   filter(?secondDate < ?date).\n",
    "   }\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "id": "bb548913-0190-4889-86aa-5f39c76e1ebb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('filmname', 'The Concert for New York City'), ('publicationYear', '2001')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('publicationYear', '2011')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('publicationYear', '1990')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('publicationYear', '1991')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('filmname', \"What's Up, Tiger Lily?\"), ('publicationYear', '1966')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('publicationYear', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('publicationYear', '1995')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('publicationYear', '1995')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('publicationYear', '1996')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('publicationYear', '1984')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('publicationYear', '2005')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('publicationYear', '1992')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('publicationYear', '1993')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('publicationYear', '1971')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('publicationYear', '1974')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('publicationYear', '2010')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('publicationYear', '2014')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('filmname', 'Anything Else'), ('publicationYear', '2003')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('publicationYear', '1983')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('publicationYear', '2017')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('publicationYear', '2018')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('publicationYear', '1999')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('publicationYear', '2000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('publicationYear', '1998')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('publicationYear', '1999')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('filmname', 'Love and Death'), ('publicationYear', '1975')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('publicationYear', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('publicationYear', '1990')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('publicationYear', '2006')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('publicationYear', '1980')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('publicationYear', '1981')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('publicationYear', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('filmname', \"Rifkin's Festival\"), ('publicationYear', '2020')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('publicationYear', '1973')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('publicationYear', '1974')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('publicationYear', '2000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('publicationYear', '1991')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('publicationYear', '1992')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('publicationYear', '1993')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('publicationYear', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('filmname', 'Take the Money and Run'), ('publicationYear', '1969')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('publicationYear', '2004')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('filmname', 'Melinda and Melinda'), ('publicationYear', '2005')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('publicationYear', '2013')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('publicationYear', '1979')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('publicationYear', '2007')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('publicationYear', '2008')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('filmname', 'Everything You Always Wanted to Know About Sex*'), ('publicationYear', '1972')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('publicationYear', '1985')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('publicationYear', '1987')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmname (YEAR(?date) AS ?publicationYear)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?date.\n",
    "   \n",
    "     \n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "b2ccd953-b2f5-47d2-b9c1-637163bd01f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('publicationYear', '2011'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('publicationYear', '1971'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('publicationYear', '1983'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('filmname', 'The Concert for New York City'), ('publicationYear', '2001'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('publicationYear', '1990'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('filmname', 'Anything Else'), ('publicationYear', '2003'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('publicationYear', '1991'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('publicationYear', '1993'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('publicationYear', '1987'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('filmname', \"A Midsummer Night's Sex Comedy\"), ('publicationYear', '1982'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('publicationYear', '1996'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('publicationYear', '1977'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('filmname', 'Deconstructing Harry'), ('publicationYear', '1997'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('publicationYear', '1995'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('publicationYear', '1984'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('filmname', 'Hollywood Ending'), ('publicationYear', '2002'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('filmname', \"Rifkin's Festival\"), ('publicationYear', '2020'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('publicationYear', '2017'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('publicationYear', '2006'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('publicationYear', '2016'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('publicationYear', '1986'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('publicationYear', '2005'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('filmname', 'Love and Death'), ('publicationYear', '1975'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('publicationYear', '1979'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('filmname', 'The Curse of the Jade Scorpion'), ('publicationYear', '2001'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('publicationYear', '1989'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('publicationYear', '1989'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('filmname', 'Irrational Man'), ('publicationYear', '2015'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('filmname', 'Radio Days'), ('publicationYear', '1987'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('publicationYear', '1973'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('filmname', 'Take the Money and Run'), ('publicationYear', '1969'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('publicationYear', '2013'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('publicationYear', '2007'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('filmname', 'To Rome with Love'), ('publicationYear', '2012'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('filmname', \"What's Up, Tiger Lily?\"), ('publicationYear', '1966'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('publicationYear', '2014'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('publicationYear', '1998'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('filmname', 'Everything You Always Wanted to Know About Sex*'), ('publicationYear', '1972'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('filmname', 'Whatever Works'), ('publicationYear', '2009'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('filmname', 'Another Woman'), ('publicationYear', '1988'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('publicationYear', '2019'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('publicationYear', '2008'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('publicationYear', '1992'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('publicationYear', '1999'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('publicationYear', '1985'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q961403'), ('filmname', 'Interiors'), ('publicationYear', '1978'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('publicationYear', '1994'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('publicationYear', '2010'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('publicationYear', '1980'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('publicationYear', '2000'), ('numFilms', '1')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmname (YEAR(?date) AS ?publicationYear) (count(?film) AS ?numFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?date.\n",
    "   \n",
    " \n",
    "   filter NOT EXISTS{\n",
    "   ?film wdt:P577 ?secondDate.\n",
    "   filter(?secondDate < ?date).\n",
    "   }\n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "id": "8d8baf6d-93a0-4522-92c7-3ebe87a00eb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('publicationYear', '2011'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('filmname', 'Bananas'), ('publicationYear', '1971'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('filmname', 'Zelig'), ('publicationYear', '1983'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('filmname', 'The Concert for New York City'), ('publicationYear', '2001'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('filmname', 'Alice'), ('publicationYear', '1990'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('filmname', 'Anything Else'), ('publicationYear', '2003'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('filmname', 'Shadows and Fog'), ('publicationYear', '1991'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('filmname', 'Manhattan Murder Mystery'), ('publicationYear', '1993'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('filmname', 'September'), ('publicationYear', '1987'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('filmname', \"A Midsummer Night's Sex Comedy\"), ('publicationYear', '1982'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('filmname', 'Everyone Says I Love You'), ('publicationYear', '1996'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('publicationYear', '1977'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('filmname', 'Deconstructing Harry'), ('publicationYear', '1997'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('publicationYear', '1995'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('filmname', 'Broadway Danny Rose'), ('publicationYear', '1984'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('filmname', 'Hollywood Ending'), ('publicationYear', '2002'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('filmname', \"Rifkin's Festival\"), ('publicationYear', '2020'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('filmname', 'Wonder Wheel'), ('publicationYear', '2017'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('filmname', 'scoop'), ('publicationYear', '2006'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('filmname', 'Café Society'), ('publicationYear', '2016'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('publicationYear', '1986'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('filmname', 'Match Point'), ('publicationYear', '2005'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('filmname', 'Love and Death'), ('publicationYear', '1975'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('filmname', 'Manhattan'), ('publicationYear', '1979'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('filmname', 'The Curse of the Jade Scorpion'), ('publicationYear', '2001'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('filmname', 'Crimes and Misdemeanors'), ('publicationYear', '1989'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('filmname', 'New York Stories'), ('publicationYear', '1989'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('filmname', 'Irrational Man'), ('publicationYear', '2015'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('filmname', 'Radio Days'), ('publicationYear', '1987'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('filmname', 'Sleeper'), ('publicationYear', '1973'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('filmname', 'Take the Money and Run'), ('publicationYear', '1969'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('publicationYear', '2013'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('filmname', \"Cassandra's Dream\"), ('publicationYear', '2007'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('filmname', 'To Rome with Love'), ('publicationYear', '2012'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('filmname', \"What's Up, Tiger Lily?\"), ('publicationYear', '1966'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('filmname', 'Magic in the Moonlight'), ('publicationYear', '2014'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('filmname', 'Celebrity'), ('publicationYear', '1998'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('filmname', 'Everything You Always Wanted to Know About Sex*'), ('publicationYear', '1972'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('filmname', 'Whatever Works'), ('publicationYear', '2009'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('filmname', 'Another Woman'), ('publicationYear', '1988'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('filmname', 'A Rainy Day in New York'), ('publicationYear', '2019'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('publicationYear', '2008'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('filmname', 'Husbands and Wives'), ('publicationYear', '1992'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('filmname', 'Sweet and Lowdown'), ('publicationYear', '1999'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('filmname', 'The Purple Rose of Cairo'), ('publicationYear', '1985'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q961403'), ('filmname', 'Interiors'), ('publicationYear', '1978'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('publicationYear', '1994'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('filmname', 'You Will Meet a Tall Dark Stranger'), ('publicationYear', '2010'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('filmname', 'Stardust Memories'), ('publicationYear', '1980'), ('numFilms', '1')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('filmname', 'Small Time Crooks'), ('publicationYear', '2000'), ('numFilms', '1')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmname (YEAR(?date) AS ?publicationYear) (count(?film) AS ?numFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?date.\n",
    "   \n",
    " \n",
    "   filter NOT EXISTS{\n",
    "   ?film wdt:P577 ?secondDate.\n",
    "   filter(?secondDate < ?date).\n",
    "   }\n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da899a97",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "38f8bb29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed QueryBadFormed: a bad request has been sent to the endpoint, probably the sparql query is bad formed. \n",
      "\n",
      "Response:\n",
      "b\"Virtuoso 37000 Error SP030: SPARQL compiler, line 13: syntax error at 'dir' before ';'\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-4ddda0dbce-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\nSELECT DISTINCT ?dir ?dirName (YEAR(?date) AS ?publicationYear) (count(?film) AS ?numFilms)\\nWHERE {\\n   # bind something\\n   ?film wdt:P57 dir;\\n   wdt:P31 wd:Q11424;\\n   wdt:P577 ?date.\\n   \\n   ?dir sc:name ?dirName\\n   FILTER(?dir=wd:Q25089 || ?dir=wd:Q3772)\\n   \\n   \\n \\n   filter NOT EXISTS{\\n   ?film wdt:P577 ?secondDate.\\n   filter(?secondDate < ?date).\\n   }\\n   \\n   # get the label\\n   ?film sc:name ?filmname.\\n    \\n}\\nLIMIT 50\\n\"\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?dir ?dirName (YEAR(?date) AS ?publicationYear) (count(?film) AS ?numFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P57 dir;\n",
    "   wdt:P31 wd:Q11424;\n",
    "   wdt:P577 ?date.\n",
    "   \n",
    "   ?dir sc:name ?dirName\n",
    "   FILTER(?dir=wd:Q25089 || ?dir=wd:Q3772)\n",
    "   \n",
    "   \n",
    " \n",
    "   filter NOT EXISTS{\n",
    "   ?film wdt:P577 ?secondDate.\n",
    "   filter(?secondDate < ?date).\n",
    "   }\n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmname.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "89368b5d",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Identify the BGP for Academy Awards"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "ec7feef9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result\n",
      "[('object', 'http://www.wikidata.org/entity/Q212026'), ('name', 'Mira Sorvino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2566554'), ('name', '48th British Academy Film Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q833154'), ('name', 'Edgar Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10798782'), ('name', 'television actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10800557'), ('name', 'film actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q113068'), ('name', 'Hungarian Order of Merit')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q13452531'), ('name', 'Commandeur des Arts et des Lettres\\u200e')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q17290934'), ('name', 'Lentapedia')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q179808'), ('name', \"Palme d'Or\")]\n",
      "[('object', 'http://www.wikidata.org/entity/Q17985761'), ('name', 'star on Hollywood Walk of Fame')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1860'), ('name', 'English')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188'), ('name', 'German')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188473'), ('name', 'action film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q188740'), ('name', 'Museum of Modern Art')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2526255'), ('name', 'film director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28389'), ('name', 'screenwriter')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3282637'), ('name', 'film producer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q33999'), ('name', 'actor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3455803'), ('name', 'director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q463303'), ('name', 'American Academy of Arts and Sciences')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q490861'), ('name', '70th Golden Globe Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5043'), ('name', 'Christianity')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q52382875'), ('name', 'AAAS Fellow')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q67311526'), ('name', 'Obalky knih.cz')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q7042855'), ('name', 'film editor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q73555012'), ('name', 'works protected by copyrights')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1377772'), ('name', 'European Film Award for Best Non-European Film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1789102'), ('name', 'National Board of Review Award for Best Film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q23958341'), ('name', 'President of the Jury at the Cannes Festival')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q974693'), ('name', 'Italian American')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1075293'), ('name', 'Irish Americans')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q185582'), ('name', 'Knoxville')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q51581'), ('name', 'Howard Hawks')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q41375'), ('name', 'BAFTA Award for Best Original Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q849124'), ('name', 'Golden Globe Award for Best Screenplay')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q93439'), ('name', '52nd Golden Globe Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q459290'), ('name', 'independent film')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1158484'), ('name', 'Quentin')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q21487819'), ('name', 'Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3404975'), ('name', 'Lumière Award, Lyon Festival of cinema')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q245949'), ('name', '36th César Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q32947601'), ('name', 'Daniella Pick')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2690424'), ('name', '66th British Academy Film Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q5274115'), ('name', 'Didem Erol')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q4818309'), ('name', 'Tony Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6489997'), ('name', 'Template:Quentin Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6838938'), ('name', 'Category:Films directed by Quentin Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q10113292'), ('name', 'Category:Quentin Tarantino')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6794012'), ('name', 'Quentin Tarantino filmography')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q7005534'), ('name', 'New Beverly Cinema')]\n",
      "56\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "    #BIND SOMETHING\n",
    "    wd:Q3772 ?p ?object.\n",
    "    # get the label\n",
    "    ?object sc:name ?name\n",
    "    \n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Result\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "e2afeaba-a9b8-43ed-9fc1-d4ac79204b21",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result\n",
      "[('object', 'http://www.wikidata.org/entity/Q96474679'), ('name', 'award for best direction')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q160726'), ('name', 'Ang Lee')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q55215'), ('name', 'Alejandro González Iñárritu')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q19020'), ('name', 'Academy Awards')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q30'), ('name', 'United States of America')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28028'), ('name', 'Alfonso Cuarón')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q212329'), ('name', 'Academy of Motion Picture Arts and Sciences')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q7146100'), ('name', 'Category:Best Directing Academy Award winners')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q6667698'), ('name', 'Template:Academy Award for Best Director')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q495980'), ('name', 'Bong Joon-ho')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "    #BIND SOMETHING\n",
    "    wd:Q103360 ?p ?object.\n",
    "    # get the label\n",
    "    ?object sc:name ?name\n",
    "    \n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Result\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d278d9b7",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "id": "7c4f42b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result\n",
      "[('object', 'http://www.wikidata.org/entity/Q19020'), ('name', 'Academy Awards')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "    #BIND SOMETHING\n",
    "    wd:Q103360 ?p ?object.\n",
    "    # get the label\n",
    "    ?object sc:name ?name\n",
    "    filter REGEX (?name, \"Academy Awards\")\n",
    "    \n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Result\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73dec1ff",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "id": "8569de67",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q153723'), ('filmName', 'Inglourious Basterds'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q47300912'), ('filmName', 'Once Upon a Time in Hollywood'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q104123'), ('filmName', 'Pulp Fiction'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmName', 'Django Unchained'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmName', 'The Hateful Eight'), ('academnyAward', 'http://www.wikidata.org/entity/Q488651'), ('academyAwardName', 'Academy Award for Best Original Score')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmName', 'Django Unchained'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q47300912'), ('filmName', 'Once Upon a Time in Hollywood'), ('academnyAward', 'http://www.wikidata.org/entity/Q277751'), ('academyAwardName', 'Academy Award for Best Production Design')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q103360'), ('academyAwardName', 'Academy Award for Best Director')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmName', 'Mighty Aphrodite'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q206124'), ('filmName', 'Midnight in Paris'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q103618'), ('academyAwardName', 'Academy Award for Best Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q212123'), ('filmName', 'Vicky Cristina Barcelona'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmName', 'Blue Jasmine'), ('academnyAward', 'http://www.wikidata.org/entity/Q103618'), ('academyAwardName', 'Academy Award for Best Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q102427'), ('academyAwardName', 'Academy Award for Best Picture')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmName', 'Bullets Over Broadway'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# write your final query\n",
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?director ?dirName ?film ?filmName ?academnyAward ?academyAwardName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?academnyAward wdt:P31 wd:Q19020.\n",
    "   ?film wdt:P31 wd:Q11424;\n",
    "   wdt:P57 ?director;\n",
    "   wdt:P166 ?academnyAward.\n",
    "   \n",
    "   ?director sc:name ?dirName.\n",
    "   ?film sc:name ?filmName.\n",
    "   ?academnyAward sc:name ?academyAwardName.\n",
    "   FILTER (?director=wd:Q25089 || ?director=wd:Q3772)\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 143,
   "id": "6bb0ab4e-3018-4ec2-9053-2cd7a63cee8e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmName', 'Django Unchained'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q206124'), ('filmName', 'Midnight in Paris'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q102427'), ('academyAwardName', 'Academy Award for Best Picture')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q103360'), ('academyAwardName', 'Academy Award for Best Director')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmName', 'Mighty Aphrodite'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q153723'), ('filmName', 'Inglourious Basterds'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q212123'), ('filmName', 'Vicky Cristina Barcelona'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmName', 'Bullets Over Broadway'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q47300912'), ('filmName', 'Once Upon a Time in Hollywood'), ('academnyAward', 'http://www.wikidata.org/entity/Q277751'), ('academyAwardName', 'Academy Award for Best Production Design')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmName', 'Django Unchained'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmName', 'Annie Hall'), ('academnyAward', 'http://www.wikidata.org/entity/Q103618'), ('academyAwardName', 'Academy Award for Best Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q106301'), ('academyAwardName', 'Academy Award for Best Supporting Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q47300912'), ('filmName', 'Once Upon a Time in Hollywood'), ('academnyAward', 'http://www.wikidata.org/entity/Q106291'), ('academyAwardName', 'Academy Award for Best Supporting Actor')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q104123'), ('filmName', 'Pulp Fiction'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('dirName', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmName', 'The Hateful Eight'), ('academnyAward', 'http://www.wikidata.org/entity/Q488651'), ('academyAwardName', 'Academy Award for Best Original Score')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmName', 'Blue Jasmine'), ('academnyAward', 'http://www.wikidata.org/entity/Q103618'), ('academyAwardName', 'Academy Award for Best Actress')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('dirName', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmName', 'Hannah and Her Sisters'), ('academnyAward', 'http://www.wikidata.org/entity/Q41417'), ('academyAwardName', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# write your final query\n",
    "# write your queries\n",
    "\n",
    "# Director Number P57\n",
    "# FILM Q11424\n",
    "# WOODEY ALLEN Q25089\n",
    "# SEARCH ALL THE FLIMS WHOSE IS DIRECTED BY WOODEY ALLEN\n",
    "# LETS FIND PUBLICATON YEAR\n",
    "# FIND PUBLICATION YEAR OF EACH FILIM\n",
    "\n",
    "# tRY TO FIND WITH FIRST DATE OF PUBLICATion\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?director ?dirName ?film ?filmName ?academnyAward ?academyAwardName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?academnyAward wdt:P31 wd:Q19020.\n",
    "   ?film wdt:P31 wd:Q11424;\n",
    "   wdt:P57 ?director;\n",
    "   wdt:P166 ?academnyAward.\n",
    "   \n",
    "   ?director sc:name ?dirName.\n",
    "   ?film sc:name ?filmName.\n",
    "   ?academnyAward sc:name ?academyAwardName.\n",
    "   FILTER (?director=wd:Q25089 || ?director=wd:Q3772)\n",
    "    \n",
    "}\n",
    "\n",
    "GROUP BY ?film ?filmName ?director ?directorName\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "1f01ce3f-7e8e-4dfc-ab9d-8f11ffdc52a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed QueryBadFormed: a bad request has been sent to the endpoint, probably the sparql query is bad formed. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 37000 Error SP031: SPARQL compiler: Variable ?dirName is used in the result set outside aggregate and not mentioned in GROUP BY clause\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-4ddda0dbce-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\nSELECT DISTINCT ?director ?dirName (MAX(?numAwards) AS ?maxAwards)\\nWHERE {\\nSELECT DISTINCT ?director ?dirName ?film ?filmName (COUNT(?academnyAward) AS ?numAwards)\\nWHERE {\\n   # bind something\\n   ?academnyAward wdt:P31 wd:Q19020.\\n   ?film wdt:P31 wd:Q11424;\\n   wdt:P57 ?director;\\n   wdt:P166 ?academnyAward.\\n   \\n   ?director sc:name ?dirName.\\n   ?film sc:name ?filmName.\\n   ?academnyAward sc:name ?academyAwardName.\\n   FILTER(?director=wd:Q25089 || ?director=wd:Q3772)\\n    \\n}\\nGROUP BY ?film ?filmName ?director ?directorName\\n}\\nGROUP BY ?director ?directorName\\nLIMIT 50\\n'\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# write your final query\n",
    "# write your queries\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?director ?dirName (MAX(?numAwards) AS ?maxAwards)\n",
    "WHERE {\n",
    "SELECT DISTINCT ?director ?dirName ?film ?filmName (COUNT(?academnyAward) AS ?numAwards)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?academnyAward wdt:P31 wd:Q19020.\n",
    "   ?film wdt:P31 wd:Q11424;\n",
    "   wdt:P57 ?director;\n",
    "   wdt:P166 ?academnyAward.\n",
    "   \n",
    "   ?director sc:name ?dirName.\n",
    "   ?film sc:name ?filmName.\n",
    "   ?academnyAward sc:name ?academyAwardName.\n",
    "   FILTER(?director=wd:Q25089 || ?director=wd:Q3772)\n",
    "    \n",
    "}\n",
    "GROUP BY ?film ?filmName ?director ?directorName\n",
    "}\n",
    "GROUP BY ?director ?directorName\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3cec2ce",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "id": "b3a5d69c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "053538e2",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "05122a0a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19a00b99",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e0501f66",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
