{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "389d8bb5",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "b679c9f0",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-eff9677b66-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ed9291ca",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Literary Movements and physicists explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the literary movements and the poets. In particular, compare some physicists in terms of discovers, Nobel Prizes and education."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93265aef",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q43514`| theory of relativity | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "46c8b2eb",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q43514 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of the theory of relativity**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "1. Who invented the theory of relativity? (return the IRI and the label of the inventor).\n",
    "\n",
    "2. Identify the BGP for physicist\n",
    "\n",
    "3. Identify the BGP for Nobel Prize\n",
    "\n",
    "4. Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists).\n",
    "\n",
    "5. Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label). \n",
    "\n",
    "6. Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries ).\n",
    "\n",
    "7. Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a4c9f3a",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Who invented the theory of relativity? (return the IRI and the label of the inventor)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "16538edf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3847'), ('name', 'Open Library subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4466'), ('name', 'Unified Astronomy Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7305'), ('name', 'Online PWN Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7993'), ('name', \"Treccani's Dizionario di Filosofia ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "c6f55984-56a3-4b1d-bbbf-ef945e3ab2b0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q937'), ('name', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Check the property using P61, Who discoverer or  who is the Inventor\n",
    "# write your final query\n",
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 wdt:P61 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26829d73",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb9a9c61",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for physicist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "ae755f6c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4946'), ('name', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4652'), ('name', 'ESCO Occupation ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P919'), ('name', 'SOC Code (2010)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "33\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q169470 ?p ?object .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "09c6c4aa-e129-4cac-b383-e3183efc9aa4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2861'), ('name', 'Leidse Hoogleraren ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2930'), ('name', 'INSPIRE-HEP author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6231'), ('name', 'BDELIS ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9044'), ('name', 'GEPRIS-Historisch ID (Person)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4116'), ('name', 'JewAge person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('name', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1017'), ('name', 'Vatican Library ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P102'), ('name', 'member of political party')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1038'), ('name', 'relative')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1048'), ('name', 'NCL ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('name', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1153'), ('name', 'Scopus author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1187'), ('name', 'Dharma Drum Institute of Liberal Arts person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1213'), ('name', 'NLC authorities')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1309'), ('name', 'EGAXA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1430'), ('name', 'OpenPlaques subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1438'), ('name', 'Jewish Encyclopedia ID (Russian)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1472'), ('name', 'Commons Creator page')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1556'), ('name', 'zbMATH author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1563'), ('name', 'MacTutor biography ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1580'), ('name', 'University of Barcelona authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1607'), ('name', 'Dialnet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1670'), ('name', 'Canadiana Authorities ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1711'), ('name', 'British Museum person or institution ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1801'), ('name', 'commemorative plaque image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1807'), ('name', 'Great Aragonese Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1816'), ('name', 'National Portrait Gallery (London) person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1819'), ('name', 'genealogics.org person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P184'), ('name', 'doctoral advisor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1890'), ('name', 'CCAB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1899'), ('name', 'LibriVox author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1938'), ('name', 'Project Gutenberg author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1960'), ('name', 'Google Scholar author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1977'), ('name', 'Les Archives du Spectacle Person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2021'), ('name', 'Erdős number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2188'), ('name', 'BiblioNet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2381'), ('name', 'Academic Tree ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2383'), ('name', 'CTHS person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('name', 'PORT person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P245'), ('name', 'Union List of Artist Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2454'), ('name', 'KNAW past member ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2477'), ('name', 'BDRC Resource ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2639'), ('name', 'Filmportal ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Try to retrive data using Alber Einstein point which is Q937\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?object .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "2808323c-361d-4bb5-b127-3301349332a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q19350898'), ('name', 'theoretical physicist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q16389557'), ('name', 'philosopher of science')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q121594'), ('name', 'professor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1231865'), ('name', 'pedagogue')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q15980158'), ('name', 'non-fiction writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1622272'), ('name', 'university teacher')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q169470'), ('name', 'physicist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q170790'), ('name', 'mathematician')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q205375'), ('name', 'inventor')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q37226'), ('name', 'teacher')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q4964182'), ('name', 'philosopher')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q901'), ('name', 'scientist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3745071'), ('name', 'science writer')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q2896489'), ('name', 'patent examiner')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Try to retrive data using the point which is P106 for the occupation to check if they are physicist\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P106 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "cf5346ab-a52d-4694-8bed-ebcc396177d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q19350898'), ('name', 'theoretical physicist')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q169470'), ('name', 'physicist')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#Q937 is a point for Albert Einstein we are using this because This person was physicist\n",
    "# write your final query\n",
    "# write your queries\n",
    "# Try to retrive data using the point which is P106 for the occupation to check if they are physicist\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P106 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   FILTER REGEX(?name, \"physicist.*\")\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e84fdfb0",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "41e14e8f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4946'), ('name', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P4652'), ('name', 'ESCO Occupation ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P919'), ('name', 'SOC Code (2010)')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "33\n"
     ]
    }
   ],
   "source": [
    "# Retrived BGP data of Physicist\n",
    "# write your final query\n",
    "# write your queries\n",
    "# Try to retrive data using the point which is P106 for the occupation to check if they are physicist\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q169470 ?object ?o.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   #FILTER REGEX(?name, \"citizen\")\n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "15156711",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for Nobel Prize"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "7f8fc3ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q1522873'), ('name', 'Josiah Willard Gibbs Lectureship')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q317038'), ('name', 'Max Planck Medal')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1419938'), ('name', 'Matteucci Medal')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q14906020'), ('name', 'Foreign Member of the Royal Society')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q15056034'), ('name', 'Pour le Mérite for Sciences and Arts')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q25287226'), ('name', 'Honorary doctor of the University of Geneva')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28003'), ('name', 'Copley Medal')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q28861731'), ('name', 'honorary doctor of the Hebrew University of Jerusalem')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q38104'), ('name', 'Nobel Prize in Physics')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q42309226'), ('name', 'honorary doctor of the Princeton University')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q50621171'), ('name', 'honorary doctor of the University of Madrid Complutense')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q1711648'), ('name', 'Prix Jules Janssen')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q753072'), ('name', 'Gold Medal of the Royal Astronomical Society')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q3141777'), ('name', 'Franklin Medal')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q63315195'), ('name', 'Member of the National Academy of Sciences of the United States')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q808424'), ('name', 'Barnard Medal for Meritorious Service to Science')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# p166 THIS IS FOR AWARD CHECK ABOVE THIS using Albert Einstein link which is Q937\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P166 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "f0e94553-89b7-49ce-85a4-5f8e4b74a1de",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P444'), ('name', 'review score')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7502'), ('name', 'Golden ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1027'), ('name', 'conferred by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2517'), ('name', 'category for recipients of this award')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# NOw we get the Nobel Prize in Physics on Q38104\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 ?p ?object .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "d293bf58-9692-4917-95a6-dd4f36aa2e63",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q107494520'), ('name', 'physics award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# NOw we get the Nobel Prize in Physics on Q38104 using instances of P31\n",
    "\n",
    "# we just get Physics award using this P31 instances\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 wdt:P31 ?object .\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a6b98400",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "3602538c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q7191'), ('name', 'Nobel Prize')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "# NOw we get the Nobel Prize in Physics on Q38104 using instances of P31\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 wdt:P279 ?object .\n",
    "   # get the label \n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "326b1398-cdcd-4582-b2f5-eef60f6810d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P444'), ('name', 'review score')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P7502'), ('name', 'Golden ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P1027'), ('name', 'conferred by')]\n",
      "[('object', 'http://www.wikidata.org/prop/direct/P2517'), ('name', 'category for recipients of this award')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# write your final query\n",
    "# write your queries\n",
    "# Retrived BGP data of Nobel Prize\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 ?object ?o.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   #FILTER REGEX(?name, \"Nobel Prize\")\n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1910882",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "id": "0debfe49",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q680'), ('name', 'Alessandro Volta'), ('country', 'http://www.wikidata.org/entity/Q209857'), ('cname', 'Kingdom of Lombardy–Venetia')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q310757'), ('name', 'Ruđer Josip Bošković'), ('country', 'http://www.wikidata.org/entity/Q208169'), ('cname', 'Republic of Ragusa')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q65183'), ('name', 'Johann Gottlieb Friedrich von Bohnenberger'), ('country', 'http://www.wikidata.org/entity/Q159631'), ('cname', 'Kingdom of Württemberg')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q57171'), ('name', 'Julius von Mayer'), ('country', 'http://www.wikidata.org/entity/Q159631'), ('cname', 'Kingdom of Württemberg')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q62981'), ('name', 'Johann Georg Christian Lehmann'), ('country', 'http://www.wikidata.org/entity/Q704288'), ('cname', 'Duchy of Holstein')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q9036'), ('name', 'Nikola Tesla'), ('country', 'http://www.wikidata.org/entity/Q25395037'), ('cname', 'Kingdom of Hungary')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q455406'), ('name', 'Gemma Frisius'), ('country', 'http://www.wikidata.org/entity/Q330533'), ('cname', 'Seventeen Provinces')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q311223'), ('name', 'Edward Sabine'), ('country', 'http://www.wikidata.org/entity/Q215530'), ('cname', 'Kingdom of Ireland')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q61088276'), ('name', 'Charles Lambert Manneback'), ('country', 'http://www.wikidata.org/entity/Q1377716'), ('cname', 'Belgians')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q680'), ('name', 'Alessandro Volta'), ('country', 'http://www.wikidata.org/entity/Q223936'), ('cname', 'Kingdom of Italy')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q937 P166\n",
    "\n",
    "#Gettign the names of all Physicists and their country for citizenship\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name ?country ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?object ?o wd:Q169470;\n",
    "   wdt:P27 ?country.\n",
    "   #wdt:P166 wd:Q7191.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   ?country sc:name ?cname.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "id": "8f23a3fb-6943-4b8d-9e0c-54e8d13a1779",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('objec', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q937 P166\n",
    "\n",
    "\n",
    "#('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?objec ?name ?country ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q142 ?objec ?o.\n",
    "   # get the label\n",
    "   ?objec sc:name ?name.\n",
    "   #?country sc:name ?cname.\n",
    "   FILTER(REGEX(?name,\"continent\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "7b89d8cd-6e65-4d9b-9f4c-7db66ea554c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('objec', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q937 P166\n",
    "\n",
    "\n",
    "#('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?objec ?name ?country ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q142 wdt:P30 ?objec.\n",
    "   # get the label\n",
    "   ?objec sc:name ?name.\n",
    "   #?country sc:name ?cname.\n",
    "   #FILTER(REGEX(?name,\"continent\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "1e417692-b565-485a-97f3-09c1f5331d34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q76766'), ('name', 'Gerd Binnig'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q57072'), ('name', 'Otto Stern'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q71024'), ('name', 'Klaus von Klitzing'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q65807'), ('name', 'Reinhard Genzel'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q71022'), ('name', 'Ernst Ruska'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q71023'), ('name', 'Alfred Kastler'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q71023'), ('name', 'Alfred Kastler'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q57063'), ('name', 'Philipp Lenard'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q57063'), ('name', 'Philipp Lenard'), ('country', 'http://www.wikidata.org/entity/Q171150'), ('cname', 'Kingdom of Hungary')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q57067'), ('name', 'Max von Laue'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#wd:Q937 P166\n",
    "#Filtering data for Europe\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name ?country ?cname ?aw\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?object ?o wd:Q169470;\n",
    "   wdt:P166 wd:Q38104;\n",
    "   wdt:P27 ?country.\n",
    "   ?country wdt:P30 wd:Q46.\n",
    "   #.\n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   ?country sc:name ?cname.\n",
    "   #?award sc:name ?aw.\n",
    "\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "830d93e3",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "6934497f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfAwards', '1'), ('country', 'http://www.wikidata.org/entity/Q171150'), ('cname', 'Kingdom of Hungary')]\n",
      "[('NumOfAwards', '2'), ('country', 'http://www.wikidata.org/entity/Q28'), ('cname', 'Hungary')]\n",
      "[('NumOfAwards', '1'), ('country', 'http://www.wikidata.org/entity/Q215'), ('cname', 'Slovenia')]\n",
      "[('NumOfAwards', '4'), ('country', 'http://www.wikidata.org/entity/Q38'), ('cname', 'Italy')]\n",
      "[('NumOfAwards', '25'), ('country', 'http://www.wikidata.org/entity/Q183'), ('cname', 'Germany')]\n",
      "[('NumOfAwards', '4'), ('country', 'http://www.wikidata.org/entity/Q41304'), ('cname', 'Weimar Republic')]\n",
      "[('NumOfAwards', '4'), ('country', 'http://www.wikidata.org/entity/Q43287'), ('cname', 'German Empire')]\n",
      "[('NumOfAwards', '6'), ('country', 'http://www.wikidata.org/entity/Q174193'), ('cname', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfAwards', '1'), ('country', 'http://www.wikidata.org/entity/Q533534'), ('cname', 'Cisleithania')]\n",
      "[('NumOfAwards', '4'), ('country', 'http://www.wikidata.org/entity/Q34'), ('cname', 'Sweden')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "#wd:Q937 P166\n",
    "# write your final query\n",
    "# FInal Result for Awards\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?object) as ?NumOfAwards) ?country ?cname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?object ?o wd:Q169470;\n",
    "   wdt:P166 wd:Q38104;\n",
    "   wdt:P27 ?country.\n",
    "   ?country wdt:P30 wd:Q46.\n",
    "   \n",
    "   # get the label\n",
    "   ?object sc:name ?name.\n",
    "   ?country sc:name ?cname.\n",
    "\n",
    "}\n",
    "GROUP BY ?country ?cname\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e9f91c0",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "493394c6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q754'), ('countryName', 'Trinidad and Tobago')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q854'), ('countryName', 'Sri Lanka')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q865'), ('countryName', 'Taiwan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q921'), ('countryName', 'Brunei')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q929'), ('countryName', 'Central African Republic')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q953'), ('countryName', 'Zambia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q962'), ('countryName', 'Benin')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q963'), ('countryName', 'Botswana')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q967'), ('countryName', 'Burundi')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q974'), ('countryName', 'Democratic Republic of the Congo')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q907112'), ('countryName', 'Transnistria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1044'), ('countryName', 'Sierra Leone')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('countryName', 'Romania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q222'), ('countryName', 'Albania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q232'), ('countryName', 'Kazakhstan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q26988'), ('countryName', 'Cook Islands')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28'), ('countryName', 'Hungary')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q424'), ('countryName', 'Cambodia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q664'), ('countryName', 'New Zealand')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q672'), ('countryName', 'Tuvalu')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q691'), ('countryName', 'Papua New Guinea')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q778'), ('countryName', 'The Bahamas')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q842'), ('countryName', 'Oman')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q863'), ('countryName', 'Tajikistan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q917'), ('countryName', 'Bhutan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34754'), ('countryName', 'Somaliland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1016'), ('countryName', 'Libya')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q16'), ('countryName', 'Canada')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q21203'), ('countryName', 'Aruba')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('countryName', 'Italy')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q736'), ('countryName', 'Ecuador')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q763'), ('countryName', 'Saint Kitts and Nevis')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q796'), ('countryName', 'Iraq')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q843'), ('countryName', 'Pakistan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q858'), ('countryName', 'Syria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q945'), ('countryName', 'Togo')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q970'), ('countryName', 'Comoros')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q786'), ('countryName', 'Dominican Republic')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1007'), ('countryName', 'Guinea-Bissau')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1019'), ('countryName', 'Madagascar')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1025'), ('countryName', 'Mauritania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1042'), ('countryName', 'Seychelles')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('countryName', 'Malta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q25'), ('countryName', 'Wales')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q41'), ('countryName', 'Greece')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q766'), ('countryName', 'Jamaica')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q790'), ('countryName', 'Haiti')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q811'), ('countryName', 'Nicaragua')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q837'), ('countryName', 'Nepal')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q965'), ('countryName', 'Burkina Faso')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q977'), ('countryName', 'Djibouti')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q986'), ('countryName', 'Eritrea')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1041'), ('countryName', 'Senegal')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1049'), ('countryName', 'Sudan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q155'), ('countryName', 'Brazil')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q252'), ('countryName', 'Indonesia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryName', 'Sweden')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q398'), ('countryName', 'Bahrain')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q419'), ('countryName', 'Peru')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q685'), ('countryName', 'Solomon Islands')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q686'), ('countryName', 'Vanuatu')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q733'), ('countryName', 'Paraguay')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q760'), ('countryName', 'Saint Lucia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q79'), ('countryName', 'Egypt')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q819'), ('countryName', 'Laos')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q851'), ('countryName', 'Saudi Arabia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q902'), ('countryName', 'Bangladesh')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q912'), ('countryName', 'Mali')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q948'), ('countryName', 'Tunisia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1006'), ('countryName', 'Guinea')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1014'), ('countryName', 'Liberia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1037'), ('countryName', 'Rwanda')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q148'), ('countryName', \"People's Republic of China\")]\n",
      "[('country', 'http://www.wikidata.org/entity/Q236'), ('countryName', 'Montenegro')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q258'), ('countryName', 'South Africa')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q265'), ('countryName', 'Uzbekistan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q334'), ('countryName', 'Singapore')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q414'), ('countryName', 'Argentina')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q668'), ('countryName', 'India')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q750'), ('countryName', 'Bolivia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q792'), ('countryName', 'El Salvador')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q869'), ('countryName', 'Thailand')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q874'), ('countryName', 'Turkmenistan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q924'), ('countryName', 'Tanzania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q958'), ('countryName', 'South Sudan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q971'), ('countryName', 'Republic of the Congo')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1005'), ('countryName', 'The Gambia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1029'), ('countryName', 'Mozambique')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q1039'), ('countryName', 'São Tomé and Príncipe')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countryName', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q184'), ('countryName', 'Belarus')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q224'), ('countryName', 'Croatia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q241'), ('countryName', 'Cuba')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('countryName', 'Finland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q347'), ('countryName', 'Liechtenstein')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('countryName', 'Austria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q697'), ('countryName', 'Nauru')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q709'), ('countryName', 'Marshall Islands')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q710'), ('countryName', 'Kiribati')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q774'), ('countryName', 'Guatemala')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    " \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?countryName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 ?nPrize;\n",
    "   wdt:P19 ?place.\n",
    "   ?country wdt:P31 wd:Q6256.\n",
    "   ?place wdt:P17 ?country.\n",
    "   # get the label\n",
    "   ?s sc:name ?Sname.\n",
    "   ?country sc:name ?countryName.\n",
    " \n",
    "}\n",
    "GROUP BY ?country ?countryName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17882ea4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "7df8dbe5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query\n",
    "\n",
    "# write your queries\n",
    "\n",
    " \n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "705cec2a",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries )."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "id": "d57009d4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q107494520'), ('name', 'physics award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# We get the Nobel Prize in Physics on Q38104 using instances of P31\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38104 wdt:P31 ?object .\n",
    "   # get the label.\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 142,
   "id": "fe4c80cd-0c23-4a65-b2ba-02353108c29f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://www.wikidata.org/entity/Q1168915'), ('name', 'Swan Medal')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q38104'), ('name', 'Nobel Prize in Physics')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q56610568'), ('name', 'Rutherford Memorial Medal in Physics')]\n",
      "[('object', 'http://www.wikidata.org/entity/Q96402465'), ('name', 'Rolf Wideroe Prize')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# We get the Nobel Prize in Physics on Q38104 using instances of P31\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?object wdt:P31 wd:Q107494520   .\n",
    "   # get the label.\n",
    "   ?object sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "fbf8924b-19f1-4150-80b3-4363e7bdc200",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('object', 'http://schema.org/name'), ('name', 'Nobel Prize in Physics')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# We get the Nobel Prize in Physics on Q38104 using instances of P31\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?object ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "     wd:Q38104 ?object ?name   .\n",
    "   # get the label P31.\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 184,
   "id": "13ebdd2c-694b-48c1-a48b-8239a7336a2c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q71024'), ('sName', 'Klaus von Klitzing'), ('discoveries', 'http://www.wikidata.org/entity/Q1047822')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71022'), ('sName', 'Ernst Ruska'), ('discoveries', 'http://www.wikidata.org/entity/Q132560')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191922'), ('sName', 'Frederick Reines'), ('discoveries', 'http://www.wikidata.org/entity/Q1066748')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57068'), ('sName', 'Wilhelm Wien'), ('discoveries', 'http://www.wikidata.org/entity/Q214336')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57077'), ('sName', 'Ferdinand Braun'), ('discoveries', 'http://www.wikidata.org/entity/Q83913')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57077'), ('sName', 'Ferdinand Braun'), ('discoveries', 'http://www.wikidata.org/entity/Q174320')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q58978'), ('sName', 'Max Born'), ('discoveries', 'http://www.wikidata.org/entity/Q852824')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q58978'), ('sName', 'Max Born'), ('discoveries', 'http://www.wikidata.org/entity/Q894014')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q65989'), ('sName', 'Wolfgang Pauli'), ('discoveries', 'http://www.wikidata.org/entity/Q7155157')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q65989'), ('sName', 'Wolfgang Pauli'), ('discoveries', 'http://www.wikidata.org/entity/Q131594')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q272085')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q652751')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q52992')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q83770')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q115626')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q1069156')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q1152255')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q162803')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q276894')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q83778')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q83773')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('sName', 'Michel Mayor'), ('discoveries', 'http://www.wikidata.org/entity/Q242309')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36488'), ('sName', 'Guglielmo Marconi'), ('discoveries', 'http://www.wikidata.org/entity/Q1466248')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123026'), ('sName', 'Charles Édouard Guillaume'), ('discoveries', 'http://www.wikidata.org/entity/Q898215')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123026'), ('sName', 'Charles Édouard Guillaume'), ('discoveries', 'http://www.wikidata.org/entity/Q902213')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q163415'), ('sName', 'William Shockley'), ('discoveries', 'http://www.wikidata.org/entity/Q1326177')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q169366'), ('sName', 'Carl David Anderson'), ('discoveries', 'http://www.wikidata.org/entity/Q3151')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q169366'), ('sName', 'Carl David Anderson'), ('discoveries', 'http://www.wikidata.org/entity/Q3229')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q206390'), ('sName', 'John L. Hall'), ('discoveries', 'http://www.wikidata.org/entity/Q1671136')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57092'), ('sName', 'Johannes Stark'), ('discoveries', 'http://www.wikidata.org/entity/Q389407')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q127944'), ('sName', 'Arthur Compton'), ('discoveries', 'http://www.wikidata.org/entity/Q171516')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q133267'), ('sName', 'Lev Landau'), ('discoveries', 'http://www.wikidata.org/entity/Q831774')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q179282'), ('sName', 'Steven Weinberg'), ('discoveries', 'http://www.wikidata.org/entity/Q1080745')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q82563'), ('sName', 'Leon Cooper'), ('discoveries', 'http://www.wikidata.org/entity/Q620057')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q124013'), ('sName', 'Didier Queloz'), ('discoveries', 'http://www.wikidata.org/entity/Q1342433')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q124013'), ('sName', 'Didier Queloz'), ('discoveries', 'http://www.wikidata.org/entity/Q242309')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q124013'), ('sName', 'Didier Queloz'), ('discoveries', 'http://www.wikidata.org/entity/Q81698')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q133232'), ('sName', 'Gabriel Lippmann'), ('discoveries', 'http://www.wikidata.org/entity/Q1347174')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q155759'), ('sName', 'Igor Tamm'), ('discoveries', 'http://www.wikidata.org/entity/Q188589')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q189990'), ('sName', 'Antony Hewish'), ('discoveries', 'http://www.wikidata.org/entity/Q4360')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('sName', 'Pierre Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q183759')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('sName', 'Pierre Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q191073')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('sName', 'Pierre Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q1128')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('sName', 'Pierre Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q979')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7186'), ('sName', 'Marie Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q1128')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7186'), ('sName', 'Marie Curie'), ('discoveries', 'http://www.wikidata.org/entity/Q979')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q162900'), ('sName', 'Charles Thomson Rees Wilson'), ('discoveries', 'http://www.wikidata.org/entity/Q214634')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q172844'), ('sName', 'Pyotr Kapitsa'), ('discoveries', 'http://www.wikidata.org/entity/Q106667')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('sName', 'Roger Penrose'), ('discoveries', 'http://www.wikidata.org/entity/Q3375211')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('sName', 'Roger Penrose'), ('discoveries', 'http://www.wikidata.org/entity/Q585688')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Retrive all the physicist who won the Nobel Prize and all the discoverer\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sName ?disc ?discoveries\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104.\n",
    "   ?discoveries wdt:P61 ?s.\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?sName.\n",
    "   ?discoveries sc:name ?name.\n",
    " \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 185,
   "id": "12fbad91-403b-48c3-9c1d-925d92eb450d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('scienctistName', 'Roger Penrose'), ('TotalNumerofDiscoveries', '6')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q160518'), ('scienctistName', 'Gustaf Dalén'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8753'), ('scienctistName', 'Enrico Fermi'), ('TotalNumerofDiscoveries', '6')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('scienctistName', 'Michel Mayor'), ('TotalNumerofDiscoveries', '12')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q173028'), ('scienctistName', 'Emilio G. Segrè'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q124013'), ('scienctistName', 'Didier Queloz'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q937'), ('scienctistName', 'Albert Einstein'), ('TotalNumerofDiscoveries', '10')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47480'), ('scienctistName', 'Paul Dirac'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('scienctistName', 'Pierre Curie'), ('TotalNumerofDiscoveries', '4')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47285'), ('scienctistName', 'J. J. Thomson'), ('TotalNumerofDiscoveries', '3')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#Arrange Group by the inventor and Discovries\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?scienctistName (COUNT(?object) as ?TotalNumerofDiscoveries)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104.\n",
    "   ?object wdt:P61 ?s.\n",
    "   \n",
    "   # get the label\n",
    "   ?object sc:name ?discName.\n",
    "   ?s sc:name ?scienctistName.\n",
    "   \n",
    " \n",
    "}\n",
    "GROUP BY ?s ?scienctistName\n",
    "HAVING (COUNT(?object) >=3 )\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "00c25735",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "1d3fd867",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('scienctistName', 'Roger Penrose'), ('TotalNumerofDiscoveries', '6')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q160518'), ('scienctistName', 'Gustaf Dalén'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8753'), ('scienctistName', 'Enrico Fermi'), ('TotalNumerofDiscoveries', '6')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q123975'), ('scienctistName', 'Michel Mayor'), ('TotalNumerofDiscoveries', '12')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q173028'), ('scienctistName', 'Emilio G. Segrè'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q124013'), ('scienctistName', 'Didier Queloz'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q937'), ('scienctistName', 'Albert Einstein'), ('TotalNumerofDiscoveries', '10')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47480'), ('scienctistName', 'Paul Dirac'), ('TotalNumerofDiscoveries', '3')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37463'), ('scienctistName', 'Pierre Curie'), ('TotalNumerofDiscoveries', '4')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q47285'), ('scienctistName', 'J. J. Thomson'), ('TotalNumerofDiscoveries', '3')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "#Arrange Group by the inventor and Discovries\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?scienctistName (COUNT(?object) as ?TotalNumerofDiscoveries)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104.\n",
    "   ?object wdt:P61 ?s.\n",
    "   \n",
    "   # get the label\n",
    "   ?object sc:name ?discName.\n",
    "   ?s sc:name ?scienctistName.\n",
    "   \n",
    " \n",
    "}\n",
    "GROUP BY ?s ?scienctistName\n",
    "HAVING (COUNT(?object) >=3 )\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "834a588a",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "id": "a9fff2c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q133747'), ('scienctistName', 'William Henry Bragg'), ('university', 'http://www.wikidata.org/entity/Q15574'), ('universityName', 'University of Adelaide')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q181363'), ('scienctistName', 'Brian David Josephson'), ('university', 'http://www.wikidata.org/entity/Q4380853'), ('universityName', 'Missouri University of Science and Technology')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41269'), ('scienctistName', 'Henri Becquerel'), ('university', 'http://www.wikidata.org/entity/Q838691'), ('universityName', \"Muséum national d'histoire naturelle\")]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71013'), ('scienctistName', 'Theodor W. Hänsch'), ('university', 'http://www.wikidata.org/entity/Q829535'), ('universityName', 'Max Planck Institute of Quantum Optics')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57100'), ('scienctistName', 'Maria Goeppert Mayer'), ('university', 'http://www.wikidata.org/entity/Q649120'), ('universityName', 'Argonne National Laboratory')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57120'), ('scienctistName', 'Peter Grünberg'), ('university', 'http://www.wikidata.org/entity/Q1041737'), ('universityName', 'Carleton University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71024'), ('scienctistName', 'Klaus von Klitzing'), ('university', 'http://www.wikidata.org/entity/Q122453'), ('universityName', 'University of Stuttgart')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q62897'), ('scienctistName', 'John Cockcroft'), ('university', 'http://www.wikidata.org/entity/Q127990'), ('universityName', 'Australian National University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q133267'), ('scienctistName', 'Lev Landau'), ('university', 'http://www.wikidata.org/entity/Q1458695'), ('universityName', 'National University of Kharkiv')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71022'), ('scienctistName', 'Ernst Ruska'), ('university', 'http://www.wikidata.org/entity/Q153006'), ('universityName', 'Freie Universität Berlin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57063'), ('scienctistName', 'Philipp Lenard'), ('university', 'http://www.wikidata.org/entity/Q156737'), ('universityName', 'University of Kiel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9021'), ('scienctistName', 'Max Planck'), ('university', 'http://www.wikidata.org/entity/Q156737'), ('universityName', 'University of Kiel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57072'), ('scienctistName', 'Otto Stern'), ('university', 'http://www.wikidata.org/entity/Q159895'), ('universityName', 'University of Rostock')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57068'), ('scienctistName', 'Wilhelm Wien'), ('university', 'http://www.wikidata.org/entity/Q161976'), ('universityName', 'University of Würzburg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57077'), ('scienctistName', 'Ferdinand Braun'), ('university', 'http://www.wikidata.org/entity/Q161976'), ('universityName', 'University of Würzburg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57092'), ('scienctistName', 'Johannes Stark'), ('university', 'http://www.wikidata.org/entity/Q161976'), ('universityName', 'University of Würzburg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57092'), ('scienctistName', 'Johannes Stark'), ('university', 'http://www.wikidata.org/entity/Q165528'), ('universityName', 'University of Greifswald')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9021'), ('scienctistName', 'Max Planck'), ('university', 'http://www.wikidata.org/entity/Q20266330'), ('universityName', 'Frederick William University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q173028'), ('scienctistName', 'Emilio G. Segrè'), ('university', 'http://www.wikidata.org/entity/Q209344'), ('universityName', 'Sapienza University of Rome')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q65989'), ('scienctistName', 'Wolfgang Pauli'), ('university', 'http://www.wikidata.org/entity/Q263761'), ('universityName', 'Niels Bohr Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q179282'), ('scienctistName', 'Steven Weinberg'), ('university', 'http://www.wikidata.org/entity/Q263761'), ('universityName', 'Niels Bohr Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7085'), ('scienctistName', 'Niels Bohr'), ('university', 'http://www.wikidata.org/entity/Q263761'), ('universityName', 'Niels Bohr Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q103854'), ('scienctistName', 'Aage Niels Bohr'), ('university', 'http://www.wikidata.org/entity/Q263761'), ('universityName', 'Niels Bohr Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57077'), ('scienctistName', 'Ferdinand Braun'), ('university', 'http://www.wikidata.org/entity/Q309988'), ('universityName', 'Karlsruhe Institute of Technology')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57063'), ('scienctistName', 'Philipp Lenard'), ('university', 'http://www.wikidata.org/entity/Q315658'), ('universityName', 'University of Wrocław')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57068'), ('scienctistName', 'Wilhelm Wien'), ('university', 'http://www.wikidata.org/entity/Q317053'), ('universityName', 'University of Giessen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q76474'), ('scienctistName', 'Walther Bothe'), ('university', 'http://www.wikidata.org/entity/Q317053'), ('universityName', 'University of Giessen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57100'), ('scienctistName', 'Maria Goeppert Mayer'), ('university', 'http://www.wikidata.org/entity/Q379848'), ('universityName', 'Los Alamos National Laboratory')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q103854'), ('scienctistName', 'Aage Niels Bohr'), ('university', 'http://www.wikidata.org/entity/Q379848'), ('universityName', 'Los Alamos National Laboratory')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q82563'), ('scienctistName', 'Leon Cooper'), ('university', 'http://www.wikidata.org/entity/Q49114'), ('universityName', 'Brown University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1700920'), ('scienctistName', 'Michael Kosterlitz'), ('university', 'http://www.wikidata.org/entity/Q49114'), ('universityName', 'Brown University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q201853'), ('scienctistName', 'David Lee'), ('university', 'http://www.wikidata.org/entity/Q49212'), ('universityName', 'Texas A&M University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q179282'), ('scienctistName', 'Steven Weinberg'), ('university', 'http://www.wikidata.org/entity/Q49213'), ('universityName', 'University of Texas at Austin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193803'), ('scienctistName', 'Roger Penrose'), ('university', 'http://www.wikidata.org/entity/Q49213'), ('universityName', 'University of Texas at Austin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q83557'), ('scienctistName', 'Nikolay Basov'), ('university', 'http://www.wikidata.org/entity/Q56837'), ('universityName', 'National Research Nuclear University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q192689'), ('scienctistName', 'Bertram Brockhouse'), ('university', 'http://www.wikidata.org/entity/Q632891'), ('universityName', 'McMaster University')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q937'), ('scienctistName', 'Albert Einstein'), ('university', 'http://www.wikidata.org/entity/Q659080'), ('universityName', 'University of Bern')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57092'), ('scienctistName', 'Johannes Stark'), ('university', 'http://www.wikidata.org/entity/Q678982'), ('universityName', 'Leibniz University Hannover')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q76797'), ('scienctistName', 'J. Hans D. Jensen'), ('university', 'http://www.wikidata.org/entity/Q678982'), ('universityName', 'Leibniz University Hannover')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q937'), ('scienctistName', 'Albert Einstein'), ('university', 'http://www.wikidata.org/entity/Q708038'), ('universityName', 'Kaiser Wilhelm Society')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q155790'), ('scienctistName', 'Eugene Wigner'), ('university', 'http://www.wikidata.org/entity/Q714439'), ('universityName', 'Oak Ridge National Laboratory')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q206390'), ('scienctistName', 'John L. Hall'), ('university', 'http://www.wikidata.org/entity/Q736674'), ('universityName', 'University of Colorado Boulder')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q205954'), ('scienctistName', 'Eric Allin Cornell'), ('university', 'http://www.wikidata.org/entity/Q736674'), ('universityName', 'University of Colorado Boulder')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q206379'), ('scienctistName', 'Carl Wieman'), ('university', 'http://www.wikidata.org/entity/Q736674'), ('universityName', 'University of Colorado Boulder')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71016'), ('scienctistName', 'Herbert Kroemer'), ('university', 'http://www.wikidata.org/entity/Q736674'), ('universityName', 'University of Colorado Boulder')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q190770'), ('scienctistName', 'Philip W. Anderson'), ('university', 'http://www.wikidata.org/entity/Q1196057'), ('universityName', 'Santa Fe Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q40262'), ('scienctistName', 'David Gross'), ('university', 'http://www.wikidata.org/entity/Q1196057'), ('universityName', 'Santa Fe Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q153219'), ('scienctistName', 'Albert Fert'), ('university', 'http://www.wikidata.org/entity/Q1480643'), ('universityName', 'University of Paris-Sud')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q556543'), ('scienctistName', 'Gérard Mourou'), ('university', 'http://www.wikidata.org/entity/Q149990'), ('universityName', 'University of Rochester')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q323320'), ('scienctistName', 'Kip S. Thorne'), ('university', 'http://www.wikidata.org/entity/Q168515'), ('universityName', 'University of Utah')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?scienctistName ?university ?universityName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P166 wd:Q38104;\n",
    "    wdt:P106 wd:Q1622272;\n",
    "    wdt:P108 ?university;\n",
    "    wdt:P19 ?placeofBirth.\n",
    "   \n",
    "   # get the label\n",
    "   ?s sc:name ?scienctistName.\n",
    "   ?university sc:name ?universityName.\n",
    "   \n",
    " \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "952d4ad8-ae32-4ab3-b405-0e29c2113c19",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P488'), ('pName', 'chairperson'), ('object', 'http://www.wikidata.org/entity/Q1740252')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pName', 'language used'), ('object', 'http://www.wikidata.org/entity/Q1860')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('object', 'http://www.wikidata.org/entity/Q19861084')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location'), ('object', 'http://www.wikidata.org/entity/Q334')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pName', 'country'), ('object', 'http://www.wikidata.org/entity/Q408')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('object', 'http://www.wikidata.org/entity/Q5275956')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('object', 'http://www.wikidata.org/entity/Q99413897')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52145016')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q5381024')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3876'), ('pName', 'category for alumni of educational institution'), ('object', 'http://www.wikidata.org/entity/Q8882583')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pName', 'named after'), ('object', 'http://www.wikidata.org/entity/Q5112')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('object', 'http://www.wikidata.org/entity/Q875538')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('object', 'http://www.wikidata.org/entity/Q1377311')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pName', 'member of'), ('object', 'http://www.wikidata.org/entity/Q2396028')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52807963')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52388160')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2388'), ('pName', 'office held by head of the organization'), ('object', 'http://www.wikidata.org/entity/Q52388722')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52388722')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52144951')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q45132492')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52144873')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q56433431')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location'), ('object', 'http://www.wikidata.org/entity/Q56433431')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q56433431')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('pName', 'headquarters location'), ('object', 'http://www.wikidata.org/entity/Q58421968')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q56433517')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location'), ('object', 'http://www.wikidata.org/entity/Q56433517')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q56433517')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q56433476')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location'), ('object', 'http://www.wikidata.org/entity/Q56433476')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q56433476')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P112'), ('pName', 'founded by'), ('object', 'http://www.wikidata.org/entity/Q16062790')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q4863112')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q4863112')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q4942700')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q52144884')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of'), ('object', 'http://www.wikidata.org/entity/Q56433543')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('pName', 'location'), ('object', 'http://www.wikidata.org/entity/Q56433543')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('object', 'http://www.wikidata.org/entity/Q56433543')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1037'), ('pName', 'director / manager'), ('object', 'http://www.wikidata.org/entity/Q7176537')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\"), ('object', 'http://www.wikidata.org/entity/Q8882580')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4195'), ('pName', 'category for employees of the organization'), ('object', 'http://www.wikidata.org/entity/Q8882584')]\n",
      "42\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?object ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q15574 ?p ?object.\n",
    "    \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?object sc:name ?objectName.\n",
    "   \n",
    " \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0d36c22e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2531bcf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
