{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "2a0c5d82",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3059c1e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-b747603b13-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "99eebb9c",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Tv series Without a Trace explorative search\") \n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> we are interested in the TV series \"Without a Trace\" and we want to investigate the main aspects related to the actors and directors involved in the production, know the numerber of seasons and check what are the episodes which got the higher success/impact.\n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P4969`    | derivative work      | predicate |\n",
    "| `wd:Q826477` | Without a Trace    | node |\n",
    "| `wd:Q733960` | Cold Case       | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q826477 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Without a Trace**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should\n",
    "\n",
    "1. Identify the BGP for television series\n",
    "\n",
    "2. Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes).\n",
    "\n",
    "3. Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)\n",
    "\n",
    "4. Check who is the actor who acted in more films while working on \"Without a Trace\" (the result set must be a list of triples actor/actress IRI, label and #films).\n",
    "\n",
    "5. Compare Without a Trace with the tv series \"Cold Case\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members).\n",
    "\n",
    "6. Return the actors who are members of the cast of Without a Trace have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label).\n",
    "\n",
    "7. Consider the actors who are members of the cast of Cold Case. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e776162",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for television series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "56f6fe01",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1267'), ('name', 'AlloCiné series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2703'), ('name', 'BFI National Archive work ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3121'), ('name', 'Epguides ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P449'), ('name', 'original broadcaster')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4835'), ('name', 'TheTVDB.com series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4983'), ('name', 'TMDb TV series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5327'), ('name', 'fernsehserien.de ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5925'), ('name', 'Moviepilot.de series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4834'), ('name', 'Deutsche Synchronkartei series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6643'), ('name', 'TV Spielfilm series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7107'), ('name', 'LezWatch.TV show ID')]\n",
      "47\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q826477 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "61817739-5fc9-4df4-861d-610ccab06650",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objname', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "   # using instance of property\n",
    "   wd:Q826477 wdt:P31 ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   #?p sc:name ?name.\n",
    "   ?obj sc:name ?objname .\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0dfd41ad",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "1cc16fb9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objname', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "   # using instance of property\n",
    "   wd:Q826477 wdt:P31 ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   #?p sc:name ?name.\n",
    "   ?obj sc:name ?objname .\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "625e8531",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d0b6f571-85c0-4b8a-85ab-81b4f4ec1baa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # Find related characteristics \n",
    "   wd:Q826477 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   FILTER (REGEX (?name, \".*season.*\") || REGEX(?name, \".*episode.*\"))\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "181bc0c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('seasons', '7'), ('episodes', '160')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?seasons ?episodes \n",
    "WHERE {\n",
    "\n",
    "   #Returning number of seasons\n",
    "   wd:Q826477 wdt:P2437 ?seasons .\n",
    "   #Returning number of episodes\n",
    "   wd:Q826477 wdt:P1113 ?episodes .\n",
    "   \n",
    "   # get the label\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0b9a5eb4-8857-4357-bbe6-786947ab85bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('episodes', 'http://www.wikidata.org/entity/Q282789'), ('episodeName', 'list of Without a Trace episodes')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?episodes ?episodeName\n",
    "WHERE {\n",
    "\n",
    "   #Returning list of episodes\n",
    "   wd:Q826477 wdt:P1811 ?episodes .\n",
    "   \n",
    "   # get the label\n",
    "   ?episodes sc:name ?episodeName\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "fe5d5e75-4574-4671-941c-c429d99c151f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P360'), ('pname', 'is a list of'), ('o', 'http://www.wikidata.org/entity/Q1983062'), ('oname', 'episode')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q13406463'), ('oname', 'Wikimedia list article')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P360'), ('pname', 'is a list of'), ('o', 'http://www.wikidata.org/entity/Q21191270'), ('oname', 'television series episode')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('episodes', 'http://www.wikidata.org/entity/Q282789'), ('episodeName', 'list of Without a Trace episodes')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "\n",
    "   #\n",
    "   wd:Q282789 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "7ab61f0d-7aab-49a2-91fb-cfdc21558096",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('list', 'http://www.wikidata.org/entity/Q1983062'), ('listName', 'episode')]\n",
      "[('list', 'http://www.wikidata.org/entity/Q21191270'), ('listName', 'television series episode')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('episodes', 'http://www.wikidata.org/entity/Q282789'), ('episodeName', 'list of Without a Trace episodes')]\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P360'), ('pname', 'is a list of')\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?list ?listName\n",
    "WHERE {\n",
    "\n",
    "   #\n",
    "   #?list wdt:P360 wd:Q282789 .\n",
    "   wd:Q282789 wdt:P360 ?list .\n",
    "   \n",
    "   # get the label\n",
    "   #?p sc:name ?pname.\n",
    "   #?o sc:name ?oname .\n",
    "   ?list sc:name ?listName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "add739e2-f52e-4950-9b01-1c1d0c1405d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('episodes', 'http://www.wikidata.org/entity/Q13406463'), ('episodeName', 'Wikimedia list article')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('episodes', 'http://www.wikidata.org/entity/Q282789'), ('episodeName', 'list of Without a Trace episodes')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?episodes ?episodeName\n",
    "WHERE {\n",
    "\n",
    "   #\n",
    "   wd:Q282789 wdt:P31 ?episodes .\n",
    "   \n",
    "   # get the label\n",
    "   ?episodes sc:name ?episodeName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "f9fb2f36-a4b4-4f07-9a12-ef3141a4f2ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1120248'), ('objname', 'Without a Trace, season 1')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729810'), ('objname', 'Without a Trace, season 4')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729811'), ('objname', 'Without a Trace, season 5')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729812'), ('objname', 'Without a Trace, season 2')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729815'), ('objname', 'Without a Trace, season 6')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729816'), ('objname', 'Without a Trace, season 7')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3729817'), ('objname', 'Without a Trace, season 3')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P527 ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b9d4d9da",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "72c97816",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('season', 'http://www.wikidata.org/entity/Q1120248'), ('seasonName', 'Without a Trace, season 1'), ('episode', '23')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729810'), ('seasonName', 'Without a Trace, season 4'), ('episode', '24')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729811'), ('seasonName', 'Without a Trace, season 5'), ('episode', '24')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729812'), ('seasonName', 'Without a Trace, season 2'), ('episode', '24')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729815'), ('seasonName', 'Without a Trace, season 6'), ('episode', '18')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729816'), ('seasonName', 'Without a Trace, season 7'), ('episode', '24')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729817'), ('seasonName', 'Without a Trace, season 3'), ('episode', '23')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?season ?seasonName ?episode\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P1113 ?episode .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c1e7bbb",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "4edcdfe1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q308124'), ('objname', 'Anthony LaPaglia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q235075'), ('objname', 'Poppy Montgomery')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P161 ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "9ca467b8-f19c-423e-9a15-7d1a61659c2e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('pname', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('pname', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('pname', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('pname', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4908'), ('pname', 'season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('pname', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('pname', 'screenwriter')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   #Finding properties of an episode\n",
    "   ?episode ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "91481566-2da7-4d33-9056-a497d9f8b329",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('seasonName', 'Without a Trace, season 1'), ('episodeName', 'Birthday Boy'), ('castName', 'David Paymer')]\n",
      "[('seasonName', 'Without a Trace, season 1'), ('episodeName', 'Pilot'), ('castName', 'Zach Grenier')]\n",
      "[('seasonName', 'Without a Trace, season 7'), ('episodeName', 'Devotion'), ('castName', 'Lucille Soong')]\n",
      "[('seasonName', 'Without a Trace, season 1'), ('episodeName', 'Maple Street'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 1'), ('episodeName', 'Underground Railroad'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 1'), ('episodeName', 'Hang On to Me'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Our Sons and Daughters'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'A Tree Falls'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Trip Box'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Moving On'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Life Rules'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'The Line'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Wannabe'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Risen'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Gung Ho'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Legacy'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Doppelganger'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Two Families'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'The Season'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('seasonName', 'Without a Trace, season 2'), ('episodeName', 'Lost and Found'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# From Results: [('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?seasonName ?episodeName ?castName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName.\n",
    "   ?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "41b23b19",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "370f6f1f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia'), ('episodeCount', '160')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q235075'), ('castName', 'Poppy Montgomery'), ('episodeCount', '160')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q503040'), ('castName', 'Eric Close'), ('episodeCount', '160')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q551608'), ('castName', 'Enrique Murciano'), ('episodeCount', '160')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q430872'), ('castName', 'Marianne Jean-Baptiste'), ('episodeCount', '160')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5363239'), ('castName', 'Elizabeth Morehead'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q64684485'), ('castName', 'Caris Vujcec'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1721796'), ('castName', 'Kaitlin Doubleday'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q20651783'), ('castName', 'Jenica Bergere'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q297128'), ('castName', 'David Henrie'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3260118'), ('castName', 'Lou Cutell'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q18618690'), ('castName', 'John Livingston'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2927620'), ('castName', 'Denise Dowse'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1378361'), ('castName', 'Kyle Secor'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2923471'), ('castName', 'Bradford Tatum'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier'), ('episodeCount', '1')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong'), ('episodeCount', '1')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
    "#  [('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName (COUNT(?episode) as ?episodeCount )\n",
    "WHERE {\n",
    "\n",
    "   # using has part property\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName.\n",
    "   ?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "}\n",
    "GROUP BY (?cast) (?castName)\n",
    "ORDER BY DESC (?episodeCount)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "28bd4fb2",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Check who is the actor who acted in more films while working on \"Without a Trace\" (the result set must be a list of triples actor/actress IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "id": "a11473f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q430872'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1721796'), ('castName', 'Kaitlin Doubleday')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q445325'), ('castName', 'Megan Gallagher')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1125651'), ('castName', 'Thom Barry')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q20651783'), ('castName', 'Jenica Bergere')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q235075'), ('castName', 'Poppy Montgomery')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q4769249'), ('castName', 'Annie Burgstede')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3260118'), ('castName', 'Lou Cutell')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q18618690'), ('castName', 'John Livingston')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q297128'), ('castName', 'David Henrie')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1378361'), ('castName', 'Kyle Secor')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# all cast members of the Without a trace\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "id": "b47b63c2-ef95-4919-81b1-8585968b02cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('start', '2002-09-26T00:00:00Z'), ('end', '2009-05-19T00:00:00Z')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?start ?end\n",
    "WHERE {\n",
    "\n",
    "   # using start time and end time property to bound period\n",
    "   wd:Q826477 wdt:P580 ?start .\n",
    "   wd:Q826477 wdt:P582 ?end .\n",
    "   \n",
    "\n",
    "   # get the label\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "11e2f8fe-2687-4162-a499-30601451e749",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q15704878'), ('oname', 'television programming')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q20937557'), ('oname', 'series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P580'), ('oname', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P582'), ('oname', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q5616006'), ('oname', 'Template:Infobox television')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q1138524'), ('oname', 'Paulys Realenzyklopädie der klassischen Altertumswissenschaft')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q386724'), ('oname', 'work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q11578774'), ('oname', 'broadcasting program')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2670'), ('pname', 'has parts of the class'), ('o', 'http://www.wikidata.org/entity/Q60215966'), ('oname', 'music segment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P371'), ('oname', 'presenter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q2431196'), ('oname', 'audiovisual work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q17489659'), ('oname', 'group of works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P179'), ('oname', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q1407245'), ('oname', 'entertainment television show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2437'), ('oname', 'number of seasons')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P449'), ('oname', 'original broadcaster')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q6594710'), ('oname', 'Category:Television shows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q10301427'), ('oname', 'moving image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q11812554'), ('oname', 'Category:Serial')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# Trying to find release date property for films\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objname', 'television series')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?o ?oname \n",
    "WHERE {\n",
    "\n",
    "   wd:Q5398426 wdt:P279 ?obj.\n",
    "   ?obj ?p ?o .\n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c26cf8a0-2d92-40fb-bcfb-6ab0ca2f0b73",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q332225'), ('sname', 'endgame')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q98391050'), ('sname', 'nuclear tests series')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31836768'), ('sname', 'model series')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q133250'), ('sname', 'sequence')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3249551'), ('sname', 'process')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q11471'), ('sname', 'time')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q52905625'), ('sname', 'numismatic serie')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q12538685'), ('sname', 'roadshow')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q11424'), ('sname', 'film')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15142889'), ('sname', 'weapon family')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1914636'), ('sname', 'activity')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1326471'), ('sname', 'chord progression')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q357384'), ('sname', 'cascade')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q22833421'), ('sname', 'international championship award series')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25917186'), ('sname', 'coordinated terrorist attack')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50378760'), ('sname', 'serial murder')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3350846'), ('sname', 'soil series')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q811701'), ('sname', 'model series')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15139721'), ('sname', 'multigraph')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q184754'), ('sname', 'string')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P279'),\n",
    "#('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q20937557'), ('oname', 'series')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?s ?sname \n",
    "WHERE {\n",
    "\n",
    "   #Trying to find class Film\n",
    "   ?s wdt:P279 wd:Q20937557.\n",
    "  \n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   ?s sc:name ?sname .\n",
    "   \n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "b8df12ab-15ec-4ac4-ba5c-35ca5cd5663b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "#From results: [('s', 'http://www.wikidata.org/entity/Q11424'), ('sname', 'film')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "\n",
    "   #trying to find property related to release date\n",
    "   wd:Q11424 ?p ?o.\n",
    "  \n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER (REGEX (?pname , \".*date.*\"))\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c3d3097d-ee13-4a61-8b67-9aeff1167489",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P577'), ('oname', 'publication date')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#From results: [('s', 'http://www.wikidata.org/entity/Q11424'), ('sname', 'film')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "\n",
    "   #trying to find property related to release date\n",
    "   wd:Q11424 ?p ?o.\n",
    "  \n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER (REGEX (?oname , \".*date.*\"))\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "84e96bd1-88ab-4f72-8b0f-df4adb0fffb5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q7333560'), ('filmName', 'Right Place, Right Time'), ('date', '2009-05-04T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664300'), ('filmName', 'November 22nd'), ('date', '2009-04-26T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664297'), ('filmName', 'Stealing Home'), ('date', '2009-04-12T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664292'), ('filmName', 'Mind Games'), ('date', '2009-03-22T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664289'), ('filmName', 'Officer Down'), ('date', '2009-03-15T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664286'), ('filmName', 'Jackals'), ('date', '2009-03-08T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1165290'), ('filmName', 'Dadnapped'), ('date', '2009-02-16T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664285'), ('filmName', 'Witness Protection'), ('date', '2009-02-15T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q275553'), ('filmName', 'Changeling'), ('date', '2009-02-12T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664283'), ('filmName', 'The Brush Man'), ('date', '2009-01-25T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q275553'), ('filmName', 'Changeling'), ('date', '2009-01-22T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664280'), ('filmName', 'Breaking News'), ('date', '2009-01-11T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q52664276'), ('filmName', 'Lotto Fever'), ('date', '2009-01-04T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q632737'), ('filmName', 'Drag Me to Hell'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3341968'), ('filmName', 'Nine Dead'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2597292'), ('filmName', 'Balibo'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3024209'), ('filmName', 'A Golden Christmas'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2705177'), ('filmName', 'Megafault'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1798900'), ('filmName', 'La Linea'), ('date', '2009-01-01T00:00:00Z')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q5464761'), ('filmName', 'Follow the Prophet'), ('date', '2009-01-01T00:00:00Z')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('o', 'http://www.wikidata.org/entity/P577'), ('oname', 'publication date')]\n",
    "\n",
    "#All films that actors of the Without a trace played during playing this film with their publication date\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmName ?date\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   ?film wdt:P161 ?cast ;\n",
    "         wdt:P577 ?date .\n",
    "  \n",
    "\n",
    "   # using start time and end time property to bound period\n",
    "   wd:Q826477 wdt:P580 ?start .\n",
    "   wd:Q826477 wdt:P582 ?end .\n",
    "   \n",
    "   FILTER ( ?date > ?start && ?date < ?end )\n",
    "   \n",
    "\n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "   ?film sc:name ?filmName .\n",
    "\n",
    "}\n",
    "ORDER BY DESC (?date)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3a973f99-c90d-4ce9-bccf-35fb155bff1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov'), ('filmName', 'Drag Me to Hell')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov'), ('filmName', 'We Own the Night')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Against the Ropes')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'The Third Nail')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong'), ('filmName', 'Just like Heaven')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight'), ('filmName', 'Changeling')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Gothika')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards'), ('filmName', 'Superbad')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('filmName', 'The Dead Girl')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1125651'), ('castName', 'Thom Barry'), ('filmName', '2 Fast 2 Furious')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia'), ('filmName', 'Spinning Boris')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Secret Window')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q60545340'), ('castName', 'Lindsey Kraft'), ('filmName', 'The Accidental Husband')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', 'Redbelt')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', 'My Suicidal Sweetheart')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('filmName', 'Going Shopping')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia'), ('filmName', 'Manhood')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia'), ('filmName', 'Lantana')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight'), ('filmName', 'The Assassination of Richard Nixon')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'The Express')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName ?filmName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   ?film wdt:P31 wd:Q11424 ;\n",
    "         wdt:P161 ?cast ;\n",
    "         wdt:P577 ?date .\n",
    "  \n",
    "\n",
    "   # using start time and end time property to bound period\n",
    "   wd:Q826477 wdt:P580 ?start .\n",
    "   wd:Q826477 wdt:P582 ?end .\n",
    "   \n",
    "   FILTER ( ?date > ?start && ?date < ?end )\n",
    "\n",
    "\n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "   ?film sc:name ?filmName .\n",
    "\n",
    "}\n",
    "GROUP BY (?cast) (?castName)\n",
    "#ORDER BY DESC (?filmNum)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "bde8d2b8-8adc-49ce-b426-29885c06013a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong'), ('filmName', 'Just like Heaven')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov'), ('filmName', 'Drag Me to Hell')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov'), ('filmName', 'We Own the Night')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'The Third Nail')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Against the Ropes')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('filmName', 'The Dead Girl')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight'), ('filmName', 'Changeling')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Gothika')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1125651'), ('castName', 'Thom Barry'), ('filmName', '2 Fast 2 Furious')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards'), ('filmName', 'Superbad')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', 'Redbelt')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', 'My Suicidal Sweetheart')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia'), ('filmName', 'Spinning Boris')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('filmName', 'Going Shopping')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton'), ('filmName', 'Secret Window')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q60545340'), ('castName', 'Lindsey Kraft'), ('filmName', 'The Accidental Husband')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', \"Ocean's Thirteen\")]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer'), ('filmName', 'Alex & Emma')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier'), ('filmName', 'The Loss of a Teardrop Diamond')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier'), ('filmName', 'Zodiac')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Alternative with sub query\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName ?filmName\n",
    "WHERE {\n",
    " \n",
    "   ?film wdt:P31 wd:Q11424 ;\n",
    "         wdt:P161 ?cast ;\n",
    "         wdt:P577 ?date .\n",
    "           \n",
    "           { SELECT DISTINCT ?cast \n",
    "             WHERE {\n",
    "           \n",
    "               # using has part property to find Without a trace cast members\n",
    "               wd:Q826477 wdt:P527 ?season .\n",
    "               ?season wdt:P527 ?episode .\n",
    "               ?episode wdt:P161 ?cast .\n",
    "                  }\n",
    "           }\n",
    "\n",
    "   # using start time and end time property to bound period\n",
    "   wd:Q826477 wdt:P580 ?start .\n",
    "   wd:Q826477 wdt:P582 ?end .\n",
    "   \n",
    "   FILTER ( ?date > ?start && ?date < ?end )\n",
    "\n",
    "\n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "   ?film sc:name ?filmName .\n",
    "\n",
    "}\n",
    "GROUP BY (?cast) (?castName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0f3fb09e",
   "metadata": {
    "tags": []
   },
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "771fb8f3-8be7-41d0-99da-1f93c7f6029b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison'), ('filmNum', '9')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName (COUNT (DISTINCT ?film) as ?filmNum )\n",
    "WHERE {\n",
    "   \n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   ?film wdt:P31 wd:Q11424 ;\n",
    "         wdt:P161 ?cast ;\n",
    "         wdt:P577 ?date .\n",
    "\n",
    "   # using start time and end time property to bound period\n",
    "   wd:Q826477 wdt:P580 ?start .\n",
    "   wd:Q826477 wdt:P582 ?end .\n",
    "   \n",
    "   FILTER ( ?date > ?start && ?date < ?end )\n",
    "   \n",
    "   # get the label\n",
    "   ?cast sc:name ?castName .\n",
    "\n",
    "}\n",
    "GROUP BY (?cast) (?castName)\n",
    "ORDER BY DESC (?filmNum)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8d4ee75a",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Compare Without a Trace with the tv series \"Cold Case\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "005b36b2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Justina Machado')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Shalim Ortiz')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Stephen Full')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Damon Herriman')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Paula Malcomson')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Martin Spanjers')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Kay Lenz')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Chelsea Hobbs')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Susan Walters')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Bruno Campos')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Bree Turner')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Muse Watson')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Johnathon Schaech')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q826477'), ('tvsName', 'Without a Trace'), ('castName', 'David Paymer')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'James Read')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Jeremy Ratchford')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Richard Edson')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'B.J. Britt')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Edwin Hodge')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('castName', 'Elena Satine')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
    "# Using Task 3:\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?tvsName ?castName\n",
    "WHERE {\n",
    "\n",
    "   VALUES ?tvs { wd:Q826477 wd:Q733960 }\n",
    "   # using has part property\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "7b62fc89-1884-47bc-a14a-81c8202afc14",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('seasonNum', '7'), ('episodeNum', '156')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q826477'), ('tvsName', 'Without a Trace'), ('seasonNum', '7'), ('episodeNum', '160')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
    "# Using Task 3:\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?tvsName ?seasonNum ?episodeNum\n",
    "WHERE {\n",
    "\n",
    "   VALUES ?tvs { wd:Q826477 wd:Q733960 }\n",
    "   # using has part property to find casts\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # finding number of seasons and episodes \n",
    "   ?tvs wdt:P2437 ?seasonNum .\n",
    "   ?tvs wdt:P1113 ?episodeNum .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   #?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07d9e003",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "cc66cae7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q733960'), ('tvsName', 'Cold Case'), ('seasonNum', '7'), ('episodeNum', '156'), ('castNum', '1579')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q826477'), ('tvsName', 'Without a Trace'), ('seasonNum', '7'), ('episodeNum', '160'), ('castNum', '825')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P2437'), ('name', 'number of seasons')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
    "# Using Task 3:\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?tvsName ?seasonNum ?episodeNum (COUNT (?cast) as ?castNum )\n",
    "WHERE {\n",
    "\n",
    "   VALUES ?tvs { wd:Q826477 wd:Q733960 }\n",
    "   # using has part property to find casts\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # finding number of seasons and episodes \n",
    "   ?tvs wdt:P2437 ?seasonNum .\n",
    "   ?tvs wdt:P1113 ?episodeNum .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   #?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e818e4e1",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Return the actors who are members of the cast of Without a Trace have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "99946e52",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q430872'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1721796'), ('castName', 'Kaitlin Doubleday')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q445325'), ('castName', 'Megan Gallagher')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1125651'), ('castName', 'Thom Barry')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q20651783'), ('castName', 'Jenica Bergere')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q235075'), ('castName', 'Poppy Montgomery')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q4769249'), ('castName', 'Annie Burgstede')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3260118'), ('castName', 'Lou Cutell')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q18618690'), ('castName', 'John Livingston')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q297128'), ('castName', 'David Henrie')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1378361'), ('castName', 'Kyle Secor')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q551608'), ('castName', 'Enrique Murciano')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q503040'), ('castName', 'Eric Close')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5363239'), ('castName', 'Elizabeth Morehead')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q462343'), ('castName', 'Rosemary Forsyth')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2923471'), ('castName', 'Bradford Tatum')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q19519424'), ('castName', 'Jessie Usher')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2927620'), ('castName', 'Denise Dowse')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q6832453'), ('castName', 'Michael Maize')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q60545340'), ('castName', 'Lindsey Kraft')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q64684485'), ('castName', 'Caris Vujcec')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#returns all casts of the Without a Trace\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "}\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "9b24b418-fe1e-4966-a626-f660463ddc9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'occupation'), ('oname', 'television actor')]\n",
      "[('pname', 'occupation'), ('oname', 'film actor')]\n",
      "[('pname', 'occupation'), ('oname', 'television director')]\n",
      "[('pname', 'occupation'), ('oname', 'stage actor')]\n",
      "[('pname', 'occupation'), ('oname', 'voice actor')]\n",
      "[('pname', 'occupation'), ('oname', 'screenwriter')]\n",
      "[('pname', 'occupation'), ('oname', 'actor')]\n",
      "[('pname', 'occupation'), ('oname', 'character actor')]\n",
      "[('pname', 'eye color'), ('oname', 'brown')]\n",
      "[('pname', 'nominated for'), ('oname', 'Academy Award for Best Supporting Actress')]\n",
      "[('pname', 'nominated for'), ('oname', 'Academy Award for Best Supporting Actor')]\n",
      "[('pname', 'nominated for'), ('oname', 'Tony Award for Best Featured Actor in a Play')]\n",
      "[('pname', 'languages spoken, written or signed'), ('oname', 'English')]\n",
      "[('pname', 'ethnic group'), ('oname', 'Jewish people')]\n",
      "[('pname', 'hair color'), ('oname', 'brown hair')]\n",
      "[('pname', 'place of birth'), ('oname', 'Englewood')]\n",
      "[('pname', 'place of birth'), ('oname', 'Tianjin')]\n",
      "[('pname', 'place of birth'), ('oname', 'New York City')]\n",
      "[('pname', 'place of birth'), ('oname', 'London')]\n",
      "[('pname', 'sex or gender'), ('oname', 'female')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#returns all properties of the casts of Without a Trace\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pname ?oname\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   ?cast ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   #?cast sc:name ?castName .\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   #FILTER (REGEX (?pname, \".*[kK]evin.*\") || (REGEX (?pname, \".*[bB]acon.*\") ))\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "47696c51-fd8e-4b6a-99c6-1ee51a05e824",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q10798782'), ('oname', 'television actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q10800557'), ('oname', 'film actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('pname', 'given name'), ('o', 'http://www.wikidata.org/entity/Q18057751'), ('oname', 'David')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q2059704'), ('oname', 'television director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pname', 'educated at'), ('o', 'http://www.wikidata.org/entity/Q230492'), ('oname', 'University of Michigan')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q2405480'), ('oname', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship'), ('o', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q33999'), ('oname', 'actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q5'), ('oname', 'human')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), ('o', 'http://www.wikidata.org/entity/Q60'), ('oname', 'New York City')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('pname', 'sex or gender'), ('o', 'http://www.wikidata.org/entity/Q6581097'), ('oname', 'male')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group'), ('o', 'http://www.wikidata.org/entity/Q7325'), ('oname', 'Jewish people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for'), ('o', 'http://www.wikidata.org/entity/Q106291'), ('oname', 'Academy Award for Best Supporting Actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pname', 'educated at'), ('o', 'http://www.wikidata.org/entity/Q1542213'), ('oname', 'Lee Strasberg Theatre and Film Institute')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q948329'), ('oname', 'character actor')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "# as an example: [('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "\n",
    "\n",
    "    wd:Q373989 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "c60fdaf4-6206-4617-85ed-4805e32077a4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'properties for this type'), ('oname', 'IMDb ID')]\n",
      "[('pname', 'field of this occupation'), ('oname', 'acting')]\n",
      "[('pname', 'different from'), ('oname', 'performing artist')]\n",
      "[('pname', 'subclass of'), ('oname', 'performing artist')]\n",
      "[('pname', \"topic's main category\"), ('oname', 'Category:Actors')]\n",
      "[('pname', 'described by source'), ('oname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('pname', 'has part'), ('oname', 'television actor')]\n",
      "[('pname', 'has part'), ('oname', 'film actor')]\n",
      "[('pname', 'described by source'), ('oname', 'Paulys Realenzyklopädie der klassischen Altertumswissenschaft')]\n",
      "[('pname', 'instance of'), ('oname', 'occupation')]\n",
      "[('pname', 'has part'), ('oname', 'stage actor')]\n",
      "[('pname', 'instance of'), ('oname', 'profession')]\n",
      "[('pname', 'described by source'), ('oname', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('pname', 'instance of'), ('oname', 'occupation group according to ISCO')]\n",
      "[('pname', 'patron saint'), ('oname', 'Genesius of Rome')]\n",
      "[('pname', 'said to be the same as'), ('oname', 'actress')]\n",
      "[('pname', 'Wikidata property'), ('oname', 'performer')]\n",
      "[('pname', 'Wikidata property'), ('oname', 'cast member')]\n",
      "[('pname', \"topic's main template\"), ('oname', 'Template:Infobox actor')]\n",
      "[('pname', 'properties for this type'), ('oname', 'occupation')]\n",
      "[('pname', 'category for eponymous categories'), ('oname', 'Category:Wikipedia categories named after actors')]\n",
      "[('pname', 'subclass of'), ('oname', 'creative and performing artists')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), \n",
    "#('o', 'http://www.wikidata.org/entity/Q33999'), ('oname', 'actor')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?pname  ?oname\n",
    "WHERE {\n",
    "\n",
    "\n",
    "    wd:Q33999 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "35aa24cb-a63e-43c3-8d38-dbe05893e66f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('actorName', 'Kevin Bacon')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# #[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), \n",
    "#('o', 'http://www.wikidata.org/entity/Q33999'), ('oname', 'actor')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName\n",
    "WHERE {\n",
    "\n",
    "\n",
    "    ?actor wdt:P106 wd:Q33999 .\n",
    "   \n",
    "   # get the label\n",
    "   ?actor sc:name ?actorName .\n",
    "\n",
    "   FILTER (REGEX (?actorName, \".*[kK]evin.*[Bb]acon\")  )\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "c416dfef-39f9-4153-8fbd-8a2e198ede7a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pname', 'award received'), ('oname', 'Golden Globe Award for Best Actor – Miniseries or Television Film')]\n",
      "[('pname', 'sibling'), ('oname', 'Michael Bacon')]\n",
      "[('pname', 'occupation'), ('oname', 'television actor')]\n",
      "[('pname', 'occupation'), ('oname', 'film actor')]\n",
      "[('pname', 'occupation'), ('oname', 'manufacturer')]\n",
      "[('pname', 'place of birth'), ('oname', 'Philadelphia')]\n",
      "[('pname', 'award received'), ('oname', 'star on Hollywood Walk of Fame')]\n",
      "[('pname', 'languages spoken, written or signed'), ('oname', 'English')]\n",
      "[('pname', 'genre'), ('oname', 'folk rock')]\n",
      "[('pname', 'occupation'), ('oname', 'stage actor')]\n",
      "[('pname', 'occupation'), ('oname', 'voice actor')]\n",
      "[('pname', 'occupation'), ('oname', 'film director')]\n",
      "[('pname', 'country of citizenship'), ('oname', 'United States of America')]\n",
      "[('pname', 'occupation'), ('oname', 'film producer')]\n",
      "[('pname', 'occupation'), ('oname', 'actor')]\n",
      "[('pname', 'occupation'), ('oname', 'director')]\n",
      "[('pname', 'instance of'), ('oname', 'human')]\n",
      "[('pname', 'occupation'), ('oname', 'musician')]\n",
      "[('pname', 'sex or gender'), ('oname', 'male')]\n",
      "[('pname', 'described by source'), ('oname', 'Obalky knih.cz')]\n",
      "[('pname', 'religion'), ('oname', 'atheism')]\n",
      "[('pname', 'given name'), ('oname', 'Kevin')]\n",
      "[('pname', 'occupation'), ('oname', 'character actor')]\n",
      "[('pname', 'educated at'), ('oname', 'Circle in the Square Theatre School')]\n",
      "[('pname', 'family name'), ('oname', 'Bacon')]\n",
      "[('pname', 'award received'), ('oname', 'Saturn Award')]\n",
      "[('pname', 'spouse'), ('oname', 'Kyra Sedgwick')]\n",
      "[('pname', 'child'), ('oname', 'Sosie Bacon')]\n",
      "[('pname', 'educated at'), ('oname', 'Julia R. Masterman School')]\n",
      "[('pname', 'educated at'), ('oname', \"Pennsylvania Governor's School for the Arts\")]\n",
      "[('pname', 'award received'), ('oname', '21st Screen Actors Guild Awards')]\n",
      "[('pname', 'filmography'), ('oname', 'Kevin Bacon filmography')]\n",
      "[('pname', 'father'), ('oname', 'Edmund Bacon')]\n",
      "[('pname', \"topic's main category\"), ('oname', 'Category:Kevin Bacon')]\n",
      "[('pname', 'member of'), ('oname', 'The Bacon Brothers')]\n",
      "[('pname', 'related category'), ('oname', 'Category:Films directed by Kevin Bacon')]\n",
      "[('pname', 'mother'), ('oname', 'Ruth Hilda Holmes')]\n",
      "37\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pname ?oname\n",
    "WHERE {\n",
    "\n",
    "\n",
    "    wd:Q3454165 ?p ?o.\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname.\n",
    "\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "28e68532-7849-4b6b-8da8-a73a0c921b31",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q122113'), ('filmName', 'Super')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q463927'), ('filmName', 'Diner')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q636062'), ('filmName', 'Loverboy')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q691672'), ('filmName', 'Frost/Nixon')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1917925'), ('filmName', 'My Dog Skip')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q5265117'), ('filmName', 'Destination Anywhere (film)')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1154802'), ('filmName', 'Murder in the First')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1243029'), ('filmName', 'Friday the 13th')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q108946'), ('filmName', 'A Few Good Men')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q223596'), ('filmName', 'X-Men: First Class')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q339045'), ('filmName', 'The Big Picture')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q935173'), ('filmName', 'Taking Chance')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1507790'), ('filmName', 'Rails & Ties')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1098140'), ('filmName', 'Hollow Man')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1189631'), ('filmName', 'The Following')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q611535'), ('filmName', 'Novocaine')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q627533'), ('filmName', 'Footloose')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133610'), ('filmName', 'Wild Things')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q813464'), ('filmName', 'Beauty Shop')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q221586'), ('filmName', 'Mystic River')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
    "#[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('actorName', 'Kevin Bacon')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P57'), ('pname', 'director')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmName\n",
    "WHERE {\n",
    "\n",
    "   #all films having Kevin Bacon as a cast member or director\n",
    "   ?film wdt:P161|wdt:P57 wd:Q3454165 .\n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmName .\n",
    "\n",
    "  \n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "611fb322-96c6-45a5-8ad9-e7ebc166b0c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q16185788'), ('actorName', 'Kyle Catlett')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q391359'), ('actorName', 'David Harbour')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q449580'), ('actorName', 'Lynne Thigpen')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q918866'), ('actorName', 'Troy Garity')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1101612'), ('actorName', 'Clint Howard')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q164328'), ('actorName', 'David Koechner')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q189400'), ('actorName', 'Brooke Shields')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q19609853'), ('actorName', 'Eloy Casados')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q198684'), ('actorName', 'Wayne Duvall')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2052002'), ('actorName', 'Stanley Anderson')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705'), ('actorName', 'John Cho')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3376428'), ('actorName', 'Peter Appel')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q40523'), ('actorName', 'Julia Roberts')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q434291'), ('actorName', 'Rade Šerbedžija')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q451830'), ('actorName', 'Lilyan Chauvin')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q461954'), ('actorName', 'Beth Littleford')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q488723'), ('actorName', 'Loren Dean')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q526620'), ('actorName', 'Alfre Woodard')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName \n",
    "WHERE {\n",
    "\n",
    "   #all actors who perfomed a film with Kevin bacon\n",
    "   ?film wdt:P161|wdt:P57 wd:Q3454165 ;\n",
    "         wdt:P161 ?actor .\n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "\n",
    "  #Excluding Kevin Bacon\n",
    "  MINUS {\n",
    "              ?actor wdt:P106 wd:Q33999 . \n",
    "              FILTER (REGEX (?actorName, \".*[kK]evin.*[Bb]acon\"))}\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "f84dbd78-bced-470b-b4ba-dadae2e0d9c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('filmsName', 'Halt and Catch Fire'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'The Darkest Minds'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'Ready or Not'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'Goalie'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'How It Ends'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'State Like Sleep'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'Arrival'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'Anon'), ('actor', 'http://www.wikidata.org/entity/Q15867224'), ('actorName', \"Mark O'Brien\")]\n",
      "[('filmsName', 'Poltergeist'), ('actor', 'http://www.wikidata.org/entity/Q16185788'), ('actorName', 'Kyle Catlett')]\n",
      "[('filmsName', 'The Young and Prodigious T. S. Spivet'), ('actor', 'http://www.wikidata.org/entity/Q16185788'), ('actorName', 'Kyle Catlett')]\n",
      "[('filmsName', 'Bad Samaritans'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Cold Case'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'How I Met Your Mother'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Mine Games'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Captain America: Civil War'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Criminal Minds'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'CSI: Vegas'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Cougar Town'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Fired Up!'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "[('filmsName', 'Glory Daze'), ('actor', 'http://www.wikidata.org/entity/Q269891'), ('actorName', 'Julianna Guill')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#We have to find all films that Kevin Bacon's co-actors played\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?filmsName ?actor ?actorName \n",
    "WHERE {\n",
    "\n",
    "   # all actors who perfomed a film with Kevin bacon\n",
    "   ?film wdt:P161|wdt:P57 wd:Q3454165 ;\n",
    "         wdt:P161 ?actor .\n",
    "   # all films performed by Kevin Bacon's co-actors\n",
    "   ?films wdt:P161 ?actor .     \n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?films sc:name ?filmsName .\n",
    "\n",
    "  #Excluding films perfomed by Kevin Bacon\n",
    "  MINUS {\n",
    "      ?films wdt:P161 wd:Q3454165 .}\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "38b0c775-9bbc-4ead-840c-b1923e37f170",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('filmsName', 'CSI: Miami'), ('castName', 'Zach Grenier')]\n",
      "[('filmsName', '24'), ('castName', 'Zach Grenier')]\n",
      "[('filmsName', 'Cold Case'), ('castName', 'Zach Grenier')]\n",
      "[('filmsName', \"City Slickers II: The Legend of Curly's Gold\"), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Quiz Show'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Ghost Whisperer'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Freaky Friday'), ('castName', 'Lucille Soong')]\n",
      "[('filmsName', 'Working Girl'), ('castName', 'Zach Grenier')]\n",
      "[('filmsName', 'The Lesser Evil'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'The Cell'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('filmsName', 'Sky High'), ('castName', 'Lucille Soong')]\n",
      "[('filmsName', 'City Slickers'), ('castName', 'David Paymer')]\n",
      "[('filmsName', '24, season 1'), ('castName', 'Zach Grenier')]\n",
      "[('filmsName', 'Edge of Tomorrow'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('filmsName', 'Et in Arcadia Ego, Part 1'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Airplane II: The Sequel'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'The In-Laws'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Private Practice'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('filmsName', 'The Mentalist'), ('castName', 'David Paymer')]\n",
      "[('filmsName', 'Fight Club'), ('castName', 'Zach Grenier')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# If an actor of the \"Without a trace\" performed in a film that a co-actor of Kevin Bacon also played,\n",
    "#then we have a list containing \"Without a trace\" actors with Kevin Bacon number equals to 2\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?filmsName ?castName \n",
    "WHERE {\n",
    "\n",
    "   #returns all casts of the Without a Trace     \n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # all actors who perfomed a film with Kevin bacon\n",
    "   ?film wdt:P161|wdt:P57 wd:Q3454165 ;\n",
    "         wdt:P161 ?actor .\n",
    "   # all films performed by Kevin Bacon's co-actors\n",
    "   ?films wdt:P161 ?actor .\n",
    "   #\n",
    "   ?films wdt:P161 ?cast .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?films sc:name ?filmsName .\n",
    "   ?cast sc:name ?castName .\n",
    "\n",
    "  #Excluding films perfomed by Kevin Bacon\n",
    "  MINUS {\n",
    "      ?films wdt:P161 wd:Q3454165 .}\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ced77daa",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f2111239",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q139341'), ('castName', 'Zach Grenier')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q373989'), ('castName', 'David Paymer')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3265830'), ('castName', 'Lucille Soong')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q430872'), ('castName', 'Marianne Jean-Baptiste')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q238501'), ('castName', 'Alex Veadov')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q308124'), ('castName', 'Anthony LaPaglia')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q355163'), ('castName', 'Bruce Davison')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1125651'), ('castName', 'Thom Barry')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q706513'), ('castName', 'Charles S. Dutton')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q235075'), ('castName', 'Poppy Montgomery')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q445325'), ('castName', 'Megan Gallagher')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q22704603'), ('castName', 'Lily Knight')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q20651783'), ('castName', 'Jenica Bergere')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1721796'), ('castName', 'Kaitlin Doubleday')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q459638'), ('castName', 'Stacy Edwards')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q3260118'), ('castName', 'Lou Cutell')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q297128'), ('castName', 'David Henrie')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q18618690'), ('castName', 'John Livingston')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1378361'), ('castName', 'Kyle Secor')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q551608'), ('castName', 'Enrique Murciano')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q4769249'), ('castName', 'Annie Burgstede')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q503040'), ('castName', 'Eric Close')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q462343'), ('castName', 'Rosemary Forsyth')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2923471'), ('castName', 'Bradford Tatum')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q5363239'), ('castName', 'Elizabeth Morehead')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q2927620'), ('castName', 'Denise Dowse')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q60545340'), ('castName', 'Lindsey Kraft')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q19519424'), ('castName', 'Jessie Usher')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q64684485'), ('castName', 'Caris Vujcec')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q6832453'), ('castName', 'Michael Maize')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# If an actor of the \"Without a trace\" performed in a film that a co-actor of Kevin Bacon also played,\n",
    "#then we have a list containing \"Without a trace\" actors with Kevin Bacon number equals to 2\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName \n",
    "WHERE {\n",
    "\n",
    "   #returns all casts of the Without a Trace     \n",
    "   wd:Q826477 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # all actors who perfomed a film with Kevin bacon\n",
    "   ?film wdt:P161|wdt:P57 wd:Q3454165 ;\n",
    "         wdt:P161 ?actor .\n",
    "   # all films performed by Kevin Bacon's co-actors\n",
    "   ?films wdt:P161 ?actor .\n",
    "   #\n",
    "   ?films wdt:P161 ?cast .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?films sc:name ?filmsName .\n",
    "   ?cast sc:name ?castName .\n",
    "\n",
    "  #Excluding films perfomed by Kevin Bacon\n",
    "  MINUS {\n",
    "      ?films wdt:P161 wd:Q3454165 .}\n",
    "   \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb77e47c",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider the actors who are members of the cast of Cold Case. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "id": "003ad532",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cast', 'http://www.wikidata.org/entity/Q270382'), ('castName', 'Justina Machado')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q269891'), ('castName', 'Julianna Guill')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q713925'), ('castName', 'Shalim Ortiz')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q128821'), ('castName', 'Stephen Full')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1093867'), ('castName', 'Damon Herriman')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q433198'), ('castName', 'Paula Malcomson')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1340897'), ('castName', 'Martin Spanjers')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q275476'), ('castName', 'Kay Lenz')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q441617'), ('castName', 'Gabrielle Miller')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q449249'), ('castName', 'Chelsea Hobbs')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q457063'), ('castName', 'Susan Walters')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q613378'), ('castName', 'Bruno Campos')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q242206'), ('castName', 'Bree Turner')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q258246'), ('castName', 'Lois Smith')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q261926'), ('castName', 'Muse Watson')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q266179'), ('castName', 'Johnathon Schaech')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q452288'), ('castName', 'Jeffrey Combs')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q919478'), ('castName', 'James Read')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q960467'), ('castName', 'Chaney Kley')]\n",
      "[('cast', 'http://www.wikidata.org/entity/Q1338682'), ('castName', 'Jeremy Ratchford')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#returns all casts of Cold case\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cast ?castName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q733960 wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "b12860b2-7ad2-49b4-b3dd-52df2ca40d92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('castName', 'Lois Smith'), ('tvsName', 'True Blood')]\n",
      "[('castName', 'Jeremy Ratchford'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Muse Watson'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'James Read'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Kay Lenz'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Chelsea Hobbs'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Shalim Ortiz'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Stephen Full'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Johnathon Schaech'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Damon Herriman'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Jeffrey Combs'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Chaney Kley'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Lois Smith'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Bree Turner'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Susan Walters'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Julianna Guill'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Gabrielle Miller'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Bruno Campos'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Martin Spanjers'), ('tvsName', 'Cold Case')]\n",
      "[('castName', 'Justina Machado'), ('tvsName', 'Cold Case')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#returns all casts of Cold case\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?castName ?tvsName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q733960 wdt:P527 ?ccseason .\n",
    "   ?ccseason wdt:P527 ?ccepisode .\n",
    "   ?ccepisode wdt:P161 ?cast .\n",
    "   \n",
    "   # all tv series these actors played\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   # get the label\n",
    "   #?season sc:name ?seasonName.\n",
    "   #?episode sc:name ?episodeName .\n",
    "   ?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "ef0c76d2-793d-4e65-b0f4-25ae242f7535",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P166'), ('oname', 'award received')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('obj', 'http://www.wikidata.org/entity/Q5398426'), ('objname', 'television series')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "\n",
    "   # finding tv series properties\n",
    "   wd:Q5398426 ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   \n",
    "   FILTER (REGEX (?oname, \".*[Aa]ward.*\") )\n",
    " \n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "beef981e-bc61-4bab-ac23-969af8c0c474",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Genesis Award')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Golden Globe Award for Best Actress – Television Series Drama')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Satellite Award for Best Actress – Television Series Drama')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Satellite Award for Best Supporting Actor – Series, Miniseries or Television Film')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'TCA Award for Outstanding New Program')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Screen Actors Guild Award for Outstanding Performance by a Stunt Ensemble in a Television Series')]\n",
      "[('tvsName', 'True Blood'), ('awardName', 'Satellite Award for Best Cast – Television Series')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'Streamy Awards')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', \"Critics' Choice Television Award for Best Supporting Actor in a Comedy Series\")]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Comedy Series')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'International TV Audience Award for Best Comedy TV Series')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'Primetime Emmy Award for Outstanding Cinematography for a Multi-Camera Series')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'Primetime Emmy Award for Outstanding Art Direction for a Contemporary Program')]\n",
      "[('tvsName', 'How I Met Your Mother'), ('awardName', 'Primetime Emmy Award for Outstanding Multi-Camera Picture Editing for a Comedy Series')]\n",
      "[('tvsName', 'Star Trek: Deep Space Nine'), ('awardName', 'Primetime Emmy Award for Outstanding Original Main Title Theme Music')]\n",
      "[('tvsName', 'Friends'), ('awardName', 'Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series')]\n",
      "[('tvsName', 'Friends'), ('awardName', 'Primetime Emmy Award for Outstanding Directing for a Comedy Series')]\n",
      "[('tvsName', 'Friends'), ('awardName', 'Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series')]\n",
      "[('tvsName', 'Friends'), ('awardName', 'Primetime Emmy Award for Outstanding Guest Actress in a Comedy Series')]\n",
      "[('tvsName', 'Friends'), ('awardName', 'Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('o', 'http://www.wikidata.org/entity/P166'), ('oname', 'award received')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvsName ?awardName\n",
    "WHERE {\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q733960 wdt:P527 ?ccseason .\n",
    "   ?ccseason wdt:P527 ?ccepisode .\n",
    "   ?ccepisode wdt:P161 ?cast .\n",
    "   \n",
    "   # all tv series these actors played\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   #checking if any series won an award\n",
    "   ?tvs wdt:P166 ?award .\n",
    "   \n",
    "   # get the label\n",
    "   ?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "   ?award sc:name ?awardName .\n",
    "}\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1906c45",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "8d55709a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q23577'), ('tvsName', 'Dexter'), ('awards', '4')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q183513'), ('tvsName', 'Buffy the Vampire Slayer'), ('awards', '4')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q4525'), ('tvsName', 'NCIS'), ('awards', '4')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q210146'), ('tvsName', 'Babylon 5'), ('awards', '8')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q8539'), ('tvsName', 'The Big Bang Theory'), ('awards', '10')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q34316'), ('tvsName', 'Doctor Who'), ('awards', '12')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q2744'), ('tvsName', 'The X-Files'), ('awards', '16')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q2085'), ('tvsName', 'Twin Peaks'), ('awards', '18')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q21296543'), ('tvsName', 'Star Trek: Discovery'), ('awards', '18')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q558112'), ('tvsName', 'Black Mirror'), ('awards', '24')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q108774'), ('tvsName', 'Star Trek: Deep Space Nine'), ('awards', '30')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q564345'), ('tvsName', 'Person of Interest'), ('awards', '51')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q1079'), ('tvsName', 'Breaking Bad'), ('awards', '63')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q438406'), ('tvsName', \"Grey's Anatomy\"), ('awards', '64')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q186219'), ('tvsName', 'True Blood'), ('awards', '70')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q321423'), ('tvsName', 'Law & Order'), ('awards', '208')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q79784'), ('tvsName', 'Friends'), ('awards', '380')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q147235'), ('tvsName', 'How I Met Your Mother'), ('awards', '525')]\n",
      "[('tvs', 'http://www.wikidata.org/entity/Q3577037'), ('tvsName', 'The West Wing'), ('awards', '13508')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('o', 'http://www.wikidata.org/entity/P166'), ('oname', 'award received')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvs ?tvsName ( COUNT(?award) as ?awards )\n",
    "WHERE {\n",
    "\n",
    "\n",
    "   # using has part property to find casts\n",
    "   wd:Q733960 wdt:P527 ?ccseason .\n",
    "   ?ccseason wdt:P527 ?ccepisode .\n",
    "   ?ccepisode wdt:P161 ?cast .\n",
    "   \n",
    "   # all tv series these actors played\n",
    "   ?tvs wdt:P527 ?season .\n",
    "   ?season wdt:P527 ?episode .\n",
    "   ?episode wdt:P161 ?cast .\n",
    "   \n",
    "   #checking if any series won an award\n",
    "   ?tvs wdt:P166 ?award .\n",
    "   \n",
    "   # get the label\n",
    "   ?cast sc:name ?castName .\n",
    "   ?tvs sc:name ?tvsName .\n",
    "   ?award sc:name ?awardName .\n",
    "}\n",
    "GROUP BY (?tvs) (?tvsName)\n",
    "HAVING (COUNT(?award) > 2)\n",
    "ORDER BY (?awards)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
