{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-3d7c3e393e-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "       results = sparql.query()\n",
    "       json_results = results.convert()\n",
    "       if len(json_results['results']['bindings'])==0:\n",
    "          print(\"Empty\")\n",
    "          return 0\n",
    "    \n",
    "       for bindings in json_results['results']['bindings']:\n",
    "          print( [ (var, value['value'])  for var, value in bindings.items() ] )\n",
    "\n",
    "       return len(json_results['results']['bindings'])\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Companies Workflow Series (\"Economy of EU States\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> Compare businesses across different sectors and types in E.U. countries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "\n",
    "\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P17`      | country       | predicate |\n",
    "| `wd:Q458`      | E.U.         | node |\n",
    "| `wd:Q142`      | France       | node      |\n",
    "| `wd:Q4830453`  | Business     | node      |\n",
    "| `wd:Q6881511`  | Enterprise   | node      |\n",
    "| `wd:Q29110228` | AXA          | node |\n",
    "| `wd:Q43183`    | insurance    | node |\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "{ \n",
    "?p wdt:P17 wd:Q142  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?p wdt:P17 wd:Q142  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **french enterprises and businesses**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Workload Goals\n",
    "\n",
    "1. Identify the BGP for obtaining the type, legal form, and industry of a company\n",
    "\n",
    "2. Identify the BGP to retrieve all companies owned by a company located in a EU country\n",
    "\n",
    "3. Which company has the largest presence in E.U.?\n",
    "\n",
    "4. Companies have different 'legal forms', compare the number of companies divided in different legal forms\n",
    "\n",
    "5. Analyze the number of companies per type, legal form, and industry in each state\n",
    " \n",
    "   5.1 What are the top-3 legal form in E.U.? \n",
    "   \n",
    "   5.2 For which companies is defined some form of income or market capitalization or total assets? What is the min, max, and average in each country for a given legal form?\n",
    "   \n",
    "   5.3 Which business in each country owns more businesses in other E.U. countries?\n",
    "   \n",
    "   5.4 What can we say about industry sectors in various countries?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "24a853ab-830c-422c-afd3-e9e015b8b8ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "# start your workflow here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '4577')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT COUNT(*)\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "671998cc-b01e-44ac-b266-df740d873517",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Identify the BGP for obtaining the type, legal form, and industry of a company"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "753e9a27-c03e-4eed-be17-4a8df6cacb41",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P154'), ('relationName', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P2002'), ('relationName', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P2003'), ('relationName', 'Instagram username')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P2013'), ('relationName', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P3225'), ('relationName', 'Corporate Number (Japan)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P3417'), ('relationName', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P349'), ('relationName', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P373'), ('relationName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P452'), ('relationName', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P452'), ('relationName', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P5161'), ('relationName', 'Trustpilot company ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P646'), ('relationName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P7293'), ('relationName', 'PLWABN ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P7886'), ('relationName', 'Media Arts Database ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('relation', 'http://www.wikidata.org/prop/direct/P856'), ('relationName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P1278'), ('relationName', 'Legal Entity Identifier')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P169'), ('relationName', 'chief executive officer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54965304'), ('business', 'Agrostroj International'), ('relation', 'http://www.wikidata.org/prop/direct/P749'), ('relationName', 'parent organization')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q58490622'), ('business', 'Humpolecké strojírny Humpolec a.s.'), ('relation', 'http://www.wikidata.org/prop/direct/P749'), ('relationName', 'parent organization')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1037'), ('relationName', 'director / manager')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1037'), ('relationName', 'director / manager')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1365'), ('relationName', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1365'), ('relationName', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P155'), ('relationName', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P155'), ('relationName', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P452'), ('relationName', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P452'), ('relationName', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P576'), ('relationName', 'dissolved, abolished or demolished date')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P576'), ('relationName', 'dissolved, abolished or demolished date')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P5769'), ('relationName', 'editor-in-chief')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P5769'), ('relationName', 'editor-in-chief')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P691'), ('relationName', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P691'), ('relationName', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P793'), ('relationName', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P793'), ('relationName', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P793'), ('relationName', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('relation', 'http://www.wikidata.org/prop/direct/P793'), ('relationName', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P4107'), ('relationName', 'Framalibre ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1324'), ('relationName', 'source code repository')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1401'), ('relationName', 'bug tracking system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P144'), ('relationName', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1482'), ('relationName', 'Stack Exchange tag')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1482'), ('relationName', 'Stack Exchange tag')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1482'), ('relationName', 'Stack Exchange tag')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1482'), ('relationName', 'Stack Exchange tag')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P154'), ('relationName', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1613'), ('relationName', 'IRC channel')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P178'), ('relationName', 'developer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P178'), ('relationName', 'developer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P178'), ('relationName', 'developer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P18'), ('relationName', 'image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P1972'), ('relationName', 'Open Hub ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P2002'), ('relationName', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P2037'), ('relationName', 'GitHub username')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P275'), ('relationName', 'copyright license')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P275'), ('relationName', 'copyright license')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P277'), ('relationName', 'programming language')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P277'), ('relationName', 'programming language')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P277'), ('relationName', 'programming language')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P306'), ('relationName', 'operating system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P306'), ('relationName', 'operating system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P306'), ('relationName', 'operating system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P306'), ('relationName', 'operating system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P306'), ('relationName', 'operating system')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P3417'), ('relationName', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P348'), ('relationName', 'software version identifier')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P3553'), ('relationName', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P3721'), ('relationName', 'public key fingerprint')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P373'), ('relationName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P3984'), ('relationName', 'subreddit')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P407'), ('relationName', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P577'), ('relationName', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P646'), ('relationName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P6665'), ('relationName', 'Pro-Linux.de DBApp ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P740'), ('relationName', 'location of formation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q787177'), ('business', 'MariaDB'), ('relation', 'http://www.wikidata.org/prop/direct/P856'), ('relationName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P1056'), ('relationName', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P1056'), ('relationName', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P112'), ('relationName', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P646'), ('relationName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8179964'), ('business', 'A. Laubin'), ('relation', 'http://www.wikidata.org/prop/direct/P856'), ('relationName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P1128'), ('relationName', 'employees')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P1278'), ('relationName', 'Legal Entity Identifier')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P166'), ('relationName', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P2139'), ('relationName', 'total revenue')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P2295'), ('relationName', 'net profit')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P2403'), ('relationName', 'total assets')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P2671'), ('relationName', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P3362'), ('relationName', 'operating income')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P355'), ('relationName', 'subsidiary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P355'), ('relationName', 'subsidiary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P373'), ('relationName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P691'), ('relationName', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('relation', 'http://www.wikidata.org/prop/direct/P856'), ('relationName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P1056'), ('relationName', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P1207'), ('relationName', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P154'), ('relationName', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P18'), ('relationName', 'image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P213'), ('relationName', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P227'), ('relationName', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P244'), ('relationName', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P3347'), ('relationName', 'PermID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P373'), ('relationName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P452'), ('relationName', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P571'), ('relationName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P646'), ('relationName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P749'), ('relationName', 'parent organization')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P7859'), ('relationName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27786'), ('business', 'Fabryka Samochodów Osobowych'), ('relation', 'http://www.wikidata.org/prop/direct/P856'), ('relationName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P1056'), ('relationName', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P112'), ('relationName', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P127'), ('relationName', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P1278'), ('relationName', 'Legal Entity Identifier')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P131'), ('relationName', 'located in the administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P1320'), ('relationName', 'OpenCorporates ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P1454'), ('relationName', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P154'), ('relationName', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P159'), ('relationName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "200"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i get the relationships for a company\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?business ?relation ?relationName\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p ?relation ?g.\n",
    "?p <http://schema.org/name> ?business.\n",
    "?relation <http://schema.org/name> ?relationName.\n",
    "} \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "450dacb0-a062-485c-afee-9b1201a8a1c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "#in the previous query i found the relationship total asset which i will use later P2403\n",
    "#the BGP for legal form found in the query above is P1454, the one for industry is P452, the one for type is wdt:P31 which is the one for instance of"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "61e1cee8-7b48-428f-a709-9c2774002092",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i find the relationship member of for the eu\n",
    "queryString = \"\"\"\n",
    "SELECT ?country ?relation ?relationName\n",
    "WHERE { \n",
    "\n",
    " \n",
    "\n",
    "\n",
    "\n",
    "wd:Q142 ?relation wd:Q458.\n",
    "\n",
    "?relation <http://schema.org/name> ?relationName.\n",
    "} \n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "88ab8946-8aa8-468d-b193-c36c0a41a790",
   "metadata": {},
   "outputs": [],
   "source": [
    "#i found the BGP P463 whic represent member of I have than to use this for consider country in the european union (look the last query to a response\n",
    "#to the question 2)\n",
    "\n",
    "#the BGP for legal form found in the query above is P1454, the one for industry is P452, the one for type is wdt:P31 which is the one for instance of"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7fd5feb3-0bd7-4528-9a01-d3d6f9504c73",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q19307174')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q81989119')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q1137109')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q35127')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q55638'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q19307174')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q81989119')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q1137109')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q35127')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5366830'), ('business', 'DMM.com'), ('legalForm', 'http://www.wikidata.org/entity/Q1562410'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('legalForm', 'http://www.wikidata.org/entity/Q56538688'), ('industry', 'http://www.wikidata.org/entity/Q16023725'), ('type', 'http://www.wikidata.org/entity/Q2085381')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('legalForm', 'http://www.wikidata.org/entity/Q56538688'), ('industry', 'http://www.wikidata.org/entity/Q16023725'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66364316'), ('business', 'Panorama'), ('legalForm', 'http://www.wikidata.org/entity/Q56538688'), ('industry', 'http://www.wikidata.org/entity/Q16023725'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('legalForm', 'http://www.wikidata.org/entity/Q2624520'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492820'), ('business', 'Salling Group'), ('legalForm', 'http://www.wikidata.org/entity/Q2624520'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80788'), ('business', 'DNB Bank'), ('legalForm', 'http://www.wikidata.org/entity/Q14942889'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80788'), ('business', 'DNB Bank'), ('legalForm', 'http://www.wikidata.org/entity/Q14942889'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80788'), ('business', 'DNB Bank'), ('legalForm', 'http://www.wikidata.org/entity/Q14942889'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80788'), ('business', 'DNB Bank'), ('legalForm', 'http://www.wikidata.org/entity/Q14942889'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1759032'), ('business', 'R. J. Reynolds Tobacco Company'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q907703'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1759032'), ('business', 'R. J. Reynolds Tobacco Company'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q907703'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q288727'), ('business', 'Sapporo Breweries'), ('legalForm', 'http://www.wikidata.org/entity/Q1480166'), ('industry', 'http://www.wikidata.org/entity/Q869095'), ('type', 'http://www.wikidata.org/entity/Q131734')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q288727'), ('business', 'Sapporo Breweries'), ('legalForm', 'http://www.wikidata.org/entity/Q1480166'), ('industry', 'http://www.wikidata.org/entity/Q869095'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q288727'), ('business', 'Sapporo Breweries'), ('legalForm', 'http://www.wikidata.org/entity/Q1480166'), ('industry', 'http://www.wikidata.org/entity/Q869095'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q334122'), ('business', 'Merrill Lynch'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q334122'), ('business', 'Merrill Lynch'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q334122'), ('business', 'Merrill Lynch'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q341139'), ('business', 'Česká zbrojovka Strakonice'), ('legalForm', 'http://www.wikidata.org/entity/Q3742494'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q341139'), ('business', 'Česká zbrojovka Strakonice'), ('legalForm', 'http://www.wikidata.org/entity/Q3742494'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q341139'), ('business', 'Česká zbrojovka Strakonice'), ('legalForm', 'http://www.wikidata.org/entity/Q3742494'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('type', 'http://www.wikidata.org/entity/Q15081032')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1143917'), ('business', 'Meizu'), ('legalForm', 'http://www.wikidata.org/entity/Q18624259'), ('industry', 'http://www.wikidata.org/entity/Q581105'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1143917'), ('business', 'Meizu'), ('legalForm', 'http://www.wikidata.org/entity/Q18624259'), ('industry', 'http://www.wikidata.org/entity/Q581105'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1285819'), ('business', 'TJX Companies'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1285819'), ('business', 'TJX Companies'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1285819'), ('business', 'TJX Companies'), ('legalForm', 'http://www.wikidata.org/entity/Q891723'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q3798668'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q3798668'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q3798668'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q1934969'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q1934969'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502132'), ('business', 'Leidos'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q1934969'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q884975'), ('business', 'Remondis'), ('legalForm', 'http://www.wikidata.org/entity/Q1780029'), ('industry', 'http://www.wikidata.org/entity/Q180388'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q884975'), ('business', 'Remondis'), ('legalForm', 'http://www.wikidata.org/entity/Q1780029'), ('industry', 'http://www.wikidata.org/entity/Q180388'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q635484'), ('business', 'Armani'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q11828862'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q635484'), ('business', 'Armani'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q11828862'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q635484'), ('business', 'Armani'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q11828862'), ('type', 'http://www.wikidata.org/entity/Q1618899')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16174973'), ('business', 'Etude House'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q131207'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16174973'), ('business', 'Etude House'), ('legalForm', 'http://www.wikidata.org/entity/Q134161'), ('industry', 'http://www.wikidata.org/entity/Q131207'), ('type', 'http://www.wikidata.org/entity/Q6881511')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#in this query i return the type, legal form, and industry of a company every company not only in the E.U. \n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?business ?legalForm ?industry ?type\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    " \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    " \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p  wdt:P1454 ?legalForm.\n",
    "?p wdt:P452 ?industry.\n",
    "?p wdt:P31 ?type.\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "6fc80cd0-186d-4407-a391-730aefe46657",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q15911314')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q43229')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q22687')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q650241')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q15911314')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q43229')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q22687')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q650241')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q15911314')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q43229')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q22687')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q650241')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q15911314')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q43229')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q22687')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q650241')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1642179'), ('business', 'Allied Irish Banks'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('type', 'http://www.wikidata.org/entity/Q730038')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66996536'), ('business', 'Bankovní dům Skala'), ('legalForm', 'http://www.wikidata.org/entity/Q3742494'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('type', 'http://www.wikidata.org/entity/Q4830453')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "29"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#in this query i return the type, legal form, and industry of a company every company only in the E.U. \n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?business ?legalForm ?industry ?type\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country. \n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country.\n",
    " ?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p  wdt:P1454 ?legalForm.\n",
    "?p wdt:P452 ?industry.\n",
    "?p wdt:P31 ?type.\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "3d258919-74b2-40e2-b09b-17cd94c44e64",
   "metadata": {},
   "outputs": [],
   "source": [
    "#in the first query i found the relationship owned by P127\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "aaa3af9b-65b5-4da5-a060-5b36d3dc0cc5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q27'), ('owner', 'http://www.wikidata.org/entity/Q329494'), ('owned', 'http://www.wikidata.org/entity/Q7277940')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q35'), ('owner', 'http://www.wikidata.org/entity/Q27231611'), ('owned', 'http://www.wikidata.org/entity/Q27231607')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q16992781')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q3045865')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q3087840')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q4024778')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q36'), ('owner', 'http://www.wikidata.org/entity/Q2153892'), ('owned', 'http://www.wikidata.org/entity/Q495943')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q7521067')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q7995379')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q825539')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q612524'), ('owned', 'http://www.wikidata.org/entity/Q938535')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q661845'), ('owned', 'http://www.wikidata.org/entity/Q2700883')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q661845'), ('owned', 'http://www.wikidata.org/entity/Q2700883')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q661845'), ('owned', 'http://www.wikidata.org/entity/Q5532821')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q661845'), ('owned', 'http://www.wikidata.org/entity/Q5532821')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q29913'), ('owned', 'http://www.wikidata.org/entity/Q14523978')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q35'), ('owner', 'http://www.wikidata.org/entity/Q492820'), ('owned', 'http://www.wikidata.org/entity/Q18162020')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q455484')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q912872')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q145'), ('owner', 'http://www.wikidata.org/entity/Q541451'), ('owned', 'http://www.wikidata.org/entity/Q471891')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q34'), ('owner', 'http://www.wikidata.org/entity/Q505922'), ('owned', 'http://www.wikidata.org/entity/Q158276')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q2178795')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q552581'), ('owned', 'http://www.wikidata.org/entity/Q259966')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q1837429')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q679402')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q145'), ('owner', 'http://www.wikidata.org/entity/Q259013'), ('owned', 'http://www.wikidata.org/entity/Q2925725')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q552581'), ('owned', 'http://www.wikidata.org/entity/Q1017587')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q392157'), ('owned', 'http://www.wikidata.org/entity/Q474287')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q336735'), ('owned', 'http://www.wikidata.org/entity/Q58408963')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q4162216'), ('owned', 'http://www.wikidata.org/entity/Q27485698')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q4162216'), ('owned', 'http://www.wikidata.org/entity/Q29650125')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q3488608')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q27'), ('owner', 'http://www.wikidata.org/entity/Q329494'), ('owned', 'http://www.wikidata.org/entity/Q7277952')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q673327'), ('owned', 'http://www.wikidata.org/entity/Q2074255')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q673327'), ('owned', 'http://www.wikidata.org/entity/Q2943665')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q29913'), ('owned', 'http://www.wikidata.org/entity/Q1426765')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q29913'), ('owned', 'http://www.wikidata.org/entity/Q3153321')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q4162216'), ('owned', 'http://www.wikidata.org/entity/Q46965053')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q3012420')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q41365932'), ('owned', 'http://www.wikidata.org/entity/Q58218626')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q27'), ('owner', 'http://www.wikidata.org/entity/Q329494'), ('owned', 'http://www.wikidata.org/entity/Q15995451')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q27'), ('owner', 'http://www.wikidata.org/entity/Q329494'), ('owned', 'http://www.wikidata.org/entity/Q17101509')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q27'), ('owner', 'http://www.wikidata.org/entity/Q329494'), ('owned', 'http://www.wikidata.org/entity/Q7695043')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q2311262')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q35'), ('owner', 'http://www.wikidata.org/entity/Q83824'), ('owned', 'http://www.wikidata.org/entity/Q12333181')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q524989'), ('owned', 'http://www.wikidata.org/entity/Q5275887')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q274591'), ('owned', 'http://www.wikidata.org/entity/Q3117576')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q4162216'), ('owned', 'http://www.wikidata.org/entity/Q107490701')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q1475312'), ('owned', 'http://www.wikidata.org/entity/Q1137796')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q4162216'), ('owned', 'http://www.wikidata.org/entity/Q11828362')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q296625'), ('owned', 'http://www.wikidata.org/entity/Q2261849')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q19800576'), ('owned', 'http://www.wikidata.org/entity/Q67806835')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q33'), ('owner', 'http://www.wikidata.org/entity/Q1439075'), ('owned', 'http://www.wikidata.org/entity/Q19839259')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q1759255')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q5823281')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q1428656')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q23072012'), ('owned', 'http://www.wikidata.org/entity/Q29650125')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q383711'), ('owned', 'http://www.wikidata.org/entity/Q7907620')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q673267'), ('owned', 'http://www.wikidata.org/entity/Q16583875')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q2713910')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q757689'), ('owned', 'http://www.wikidata.org/entity/Q2284316')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q757689'), ('owned', 'http://www.wikidata.org/entity/Q2869599')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q3512525')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q609524')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q20059505')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q160229'), ('owned', 'http://www.wikidata.org/entity/Q5559900')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q67'), ('owned', 'http://www.wikidata.org/entity/Q176856')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q152051'), ('owned', 'http://www.wikidata.org/entity/Q812131')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q28'), ('owner', 'http://www.wikidata.org/entity/Q549181'), ('owned', 'http://www.wikidata.org/entity/Q29611051')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q28'), ('owner', 'http://www.wikidata.org/entity/Q549181'), ('owned', 'http://www.wikidata.org/entity/Q29611294')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q152051'), ('owned', 'http://www.wikidata.org/entity/Q812142')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q12052386')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q1360940')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q174747'), ('owned', 'http://www.wikidata.org/entity/Q1726547')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q21684266')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q25288771')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q30285191')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q169167'), ('owned', 'http://www.wikidata.org/entity/Q33093119')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q169167'), ('owned', 'http://www.wikidata.org/entity/Q33093143')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q145'), ('owner', 'http://www.wikidata.org/entity/Q173146'), ('owned', 'http://www.wikidata.org/entity/Q4669798')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q5807063')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q145'), ('owner', 'http://www.wikidata.org/entity/Q173146'), ('owned', 'http://www.wikidata.org/entity/Q6802052')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q169167'), ('owned', 'http://www.wikidata.org/entity/Q704606')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q775153')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q174747'), ('owned', 'http://www.wikidata.org/entity/Q838716')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q8561619')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q8960761')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q29'), ('owner', 'http://www.wikidata.org/entity/Q163327'), ('owned', 'http://www.wikidata.org/entity/Q9092005')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q40'), ('owner', 'http://www.wikidata.org/entity/Q19604540'), ('owned', 'http://www.wikidata.org/entity/Q18193621')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q67'), ('owned', 'http://www.wikidata.org/entity/Q888608')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q26678'), ('owned', 'http://www.wikidata.org/entity/Q796752')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q156077'), ('owned', 'http://www.wikidata.org/entity/Q1541268')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q156077'), ('owned', 'http://www.wikidata.org/entity/Q158205')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q213'), ('owner', 'http://www.wikidata.org/entity/Q58206677'), ('owned', 'http://www.wikidata.org/entity/Q54941175')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q156077'), ('owned', 'http://www.wikidata.org/entity/Q21294908')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q183'), ('owner', 'http://www.wikidata.org/entity/Q26678'), ('owned', 'http://www.wikidata.org/entity/Q15141144')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q156077'), ('owned', 'http://www.wikidata.org/entity/Q2932784')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q156077'), ('owned', 'http://www.wikidata.org/entity/Q3196447')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q142'), ('owner', 'http://www.wikidata.org/entity/Q128356'), ('owned', 'http://www.wikidata.org/entity/Q2946060')]\n",
      "[('countryOwner', 'http://www.wikidata.org/entity/Q38'), ('owner', 'http://www.wikidata.org/entity/Q128356'), ('owned', 'http://www.wikidata.org/entity/Q2946060')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "100"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#answer to question 2 \n",
    "#Identify the BGP to retrieve all companies owned by a company located in a EU country\n",
    "queryString = \"\"\"\n",
    "SELECT ?country AS ?countryOwner  ?p AS ?owner ?owned\n",
    "{\n",
    "\n",
    "{\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?owned wdt:P31 wd:Q4830453  . \n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "79700dea-dca9-4f9c-9df1-69fb398ca562",
   "metadata": {},
   "outputs": [],
   "source": [
    " #3. Which company has the largest presence in E.U.?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "7b423689-7249-420a-aa47-9f857b3929fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('owned', '34'), ('owner', 'http://www.wikidata.org/entity/Q219635')]\n",
      "[('owned', '29'), ('owner', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('owned', '23'), ('owner', 'http://www.wikidata.org/entity/Q292750')]\n",
      "[('owned', '19'), ('owner', 'http://www.wikidata.org/entity/Q64')]\n",
      "[('owned', '18'), ('owner', 'http://www.wikidata.org/entity/Q442637')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Rifacendomi alla query precedente decido di usare come criterio la compagnia che possiede più compagnie europee\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT COUNT(distinct ?p) AS ?owned ?owner\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?p wdt:P17 ?country.\n",
    "?country wdt:P463 wd:Q458.\n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    "\n",
    "} UNION {\n",
    "\n",
    " ?p wdt:P31 wd:Q4830453  .\n",
    "?p wdt:P17 ?country.\n",
    "?country wdt:P463 wd:Q458.\n",
    " \n",
    "}\n",
    " \n",
    "\n",
    "\n",
    "?p wdt:P127 ?owner.\n",
    "\n",
    "\n",
    "}GROUP BY ?owner \n",
    "ORDER BY DESC (?owned)\n",
    "\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "87af4e37-c8fd-4382-ba61-3b8b53ee7e2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#so the company which owns more E.U. companies is BlackRock"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "7a7df1a2-10aa-4231-bb59-ed6f69ebe924",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#NON GUARDARE SBAGLIATA (VERSIONE PRECEDENTE DI RISPOSTA A QUERY 3)\n",
    "queryString = \"\"\"\n",
    "SELECT ?employers ?p\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country. \n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    " ?p wdt:P1128 ?employers.\n",
    "} \n",
    "UNION\n",
    "{\n",
    " \n",
    " ?country wdt:P463 wd:Q458.\n",
    " ?p wdt:P27 ?country.\n",
    " ?p wdt:P31 wd:Q4830453  .\n",
    " ?p wdt:P1128 ?employers.\n",
    " \n",
    "}\n",
    "\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} \n",
    "ORDER BY DESC (?employers)\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "2561ace6-fc7b-4654-9030-418edcfa3bde",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('presence', '2'), ('p', 'http://www.wikidata.org/entity/Q77353644')]\n",
      "[('presence', '2'), ('p', 'http://www.wikidata.org/entity/Q534903')]\n",
      "[('presence', '2'), ('p', 'http://www.wikidata.org/entity/Q3546460')]\n",
      "[('presence', '2'), ('p', 'http://www.wikidata.org/entity/Q1534581')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969037')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971803')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99972397')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96994625')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96996529')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99970063')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969957')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971645')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969954')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96996119')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99967264')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99968824')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99970356')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96996369')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99967279')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99968643')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971670')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971309')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971691')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96947978')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96991067')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971983')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q97002996')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99967856')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969115')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96994006')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99967761')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99970738')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971699')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99968542')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99970015')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99968300')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969465')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99972196')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q55218063')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q50165660')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99967751')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971660')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971947')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q96997252')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969971')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99972022')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99969077')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99972303')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q99971278')]\n",
      "[('presence', '1'), ('p', 'http://www.wikidata.org/entity/Q97001576')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#SBAGLIATA (VERSIONE PRECEDENTE DI RISPOSTA A QUERY 3)\n",
    "#att rifare, cosa si intende per presence?\n",
    "queryString = \"\"\"\n",
    "SELECT  ?p\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country. \n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country.\n",
    " ?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} GROUP BY ?p\n",
    "ORDER BY DESC (?presence)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b6240df8-7a1e-4433-b1ec-9e8972e4c1f2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c29b3b27-5fa3-462f-aced-fb3d88492abc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "7e175409-6ffe-4362-9d04-968254a29436",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '1'), ('legalForm', 'http://www.wikidata.org/entity/Q3742494')]\n",
      "[('callret-0', '1'), ('legalForm', 'http://www.wikidata.org/entity/Q510785')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q166280')]\n",
      "[('callret-0', '3'), ('legalForm', 'http://www.wikidata.org/entity/Q1555574')]\n",
      "[('callret-0', '1'), ('legalForm', 'http://www.wikidata.org/entity/Q6832945')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q15091621')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q422053')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q134161')]\n",
      "[('callret-0', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q1436139')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#compare the number of companies divided in different legal forms (i consider companies in the E.U.)\n",
    " \n",
    "queryString = \"\"\"\n",
    "SELECT COUNT(?p) ?legalForm \n",
    "WHERE { \n",
    "\n",
    "{ \n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country. \n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country.\n",
    " ?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p  wdt:P1454 ?legalForm.\n",
    "\n",
    "\n",
    "\n",
    "}GROUP BY (?legalForm) \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "e15ca1a1-ccf9-4262-9a22-45c5541bf945",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('number', '3'), ('legalForm', 'http://www.wikidata.org/entity/Q1555574')]\n",
      "[('number', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q166280')]\n",
      "[('number', '2'), ('legalForm', 'http://www.wikidata.org/entity/Q15091621')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What are the top-3 legal form in E.U.? \n",
    "queryString = \"\"\"\n",
    "SELECT COUNT(?p) AS ?number ?legalForm \n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "\n",
    "\n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country. \n",
    " ?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    " ?country wdt:P463 wd:Q458.\n",
    "\n",
    " ?p wdt:P27 ?country.\n",
    " ?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p  wdt:P1454 ?legalForm.\n",
    "\n",
    "\n",
    "\n",
    "}GROUP BY (?legalForm) \n",
    "ORDER BY DESC (?number)\n",
    "LIMIT 3\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "dce79f8a-c497-4ff9-aacc-f8fdfc9315ff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q8183600'), ('business', 'Agrostroj Pelhřimov'), ('g', '7824063000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80788'), ('business', 'DNB Bank'), ('g', '2793294000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q334122'), ('business', 'Merrill Lynch'), ('g', '603000000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q341139'), ('business', 'Česká zbrojovka Strakonice'), ('g', '2165963000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4162216'), ('business', 'Energetický a průmyslový holding'), ('g', '13329000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4162216'), ('business', 'Energetický a průmyslový holding'), ('g', '342889000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18552286'), ('business', 'Zealand Pharma'), ('g', '694626000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q41365932'), ('business', 'AGEL'), ('g', '10518247000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q41567534'), ('business', 'PPF'), ('g', '2203115000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182197'), ('business', 'Kongsberg Automotive'), ('g', '927000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q65790247'), ('business', 'Caluma'), ('g', '3420638000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q62010637'), ('business', 'MTC - invest'), ('g', '101485000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q444110'), ('business', 'The Hartford'), ('g', '228300000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q488470'), ('business', 'Korea Aerospace Industries'), ('g', '2933216465722')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1475312'), ('business', 'Vinci'), ('g', '91102000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q29610321'), ('business', 'MOL Česká republika'), ('g', '10945322000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q336735'), ('business', 'ČEZ Group'), ('g', '707443000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q763402'), ('business', 'S.P. Korolev Rocket and Space Corporation Energia'), ('g', '114995477000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q625713'), ('business', 'BHP Group'), ('g', '111993000000')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54968395'), ('business', 'Intersport ČR'), ('g', '332973000')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "20"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#For which companies is defined some form of income or market capitalization or total assets? \n",
    "#What is the min, max, and average in each country for a given legal form?\n",
    "#in this query a return the companies with their total asset P2403 it is not specified companies inside the E.U. so i consider all companies\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?business ?g\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p wdt:P2403 ?g.\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "fa27dec6-f4ed-4b4a-a4d3-16f179015e81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('max', '86933'), ('min', '86933'), ('avg', '86933'), ('country', 'http://www.wikidata.org/entity/Q35'), ('legalform', 'http://www.wikidata.org/entity/Q15649047')]\n",
      "[('max', '53801000000'), ('min', '53801000000'), ('avg', '53801000000'), ('country', 'http://www.wikidata.org/entity/Q39'), ('legalform', 'http://www.wikidata.org/entity/Q17375963')]\n",
      "[('max', '845000000000'), ('min', '158904000'), ('avg', '93504643916.666666666666667'), ('country', 'http://www.wikidata.org/entity/Q55'), ('legalform', 'http://www.wikidata.org/entity/Q1436139')]\n",
      "[('max', '8467304000'), ('min', '8467304000'), ('avg', '8467304000'), ('country', 'http://www.wikidata.org/entity/Q398'), ('legalform', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('max', '196766000'), ('min', '196766000'), ('avg', '196766000'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('legalform', 'http://www.wikidata.org/entity/Q3742494')]\n",
      "[('max', '111993000000'), ('min', '111993000000'), ('avg', '111993000000'), ('country', 'http://www.wikidata.org/entity/Q408'), ('legalform', 'http://www.wikidata.org/entity/Q5225895')]\n",
      "[('max', '595194000000'), ('min', '36220000000'), ('avg', '315707000000'), ('country', 'http://www.wikidata.org/entity/Q145'), ('legalform', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('max', '50605000000'), ('min', '797647000'), ('avg', '25701323500'), ('country', 'http://www.wikidata.org/entity/Q183'), ('legalform', 'http://www.wikidata.org/entity/Q279014')]\n",
      "[('max', '123992000000'), ('min', '123992000000'), ('avg', '123992000000'), ('country', 'http://www.wikidata.org/entity/Q39'), ('legalform', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('max', '93386000000'), ('min', '93386000000'), ('avg', '93386000000'), ('country', 'http://www.wikidata.org/entity/Q27'), ('legalform', 'http://www.wikidata.org/entity/Q422069')]\n",
      "[('max', '1332465865.19'), ('min', '1332465865.19'), ('avg', '1332465865.19'), ('country', 'http://www.wikidata.org/entity/Q183'), ('legalform', 'http://www.wikidata.org/entity/Q67207116')]\n",
      "[('max', '112729300'), ('min', '112729300'), ('avg', '112729300'), ('country', 'http://www.wikidata.org/entity/Q142'), ('legalform', 'http://www.wikidata.org/entity/Q166280')]\n",
      "[('max', '4103786000000'), ('min', '720000000000'), ('avg', '2975857333333.333333333333333'), ('country', 'http://www.wikidata.org/entity/Q28'), ('legalform', 'http://www.wikidata.org/entity/Q134161')]\n",
      "[('max', '99506834000'), ('min', '99506834000'), ('avg', '99506834000'), ('country', 'http://www.wikidata.org/entity/Q30'), ('legalform', 'http://www.wikidata.org/entity/Q1421490')]\n",
      "[('max', '4986580075'), ('min', '4986580075'), ('avg', '4986580075'), ('country', 'http://www.wikidata.org/entity/Q183'), ('legalform', 'http://www.wikidata.org/entity/Q5349747')]\n",
      "[('max', '18349489000000'), ('min', '9527870000000'), ('avg', '14207284600000'), ('country', 'http://www.wikidata.org/entity/Q148'), ('legalform', 'http://www.wikidata.org/entity/Q891723')]\n",
      "[('max', '115727000'), ('min', '115727000'), ('avg', '115727000'), ('country', 'http://www.wikidata.org/entity/Q213'), ('legalform', 'http://www.wikidata.org/entity/Q18624259')]\n",
      "[('max', '262174300000000'), ('min', '6450000000'), ('avg', '88371322155240.666666666666667'), ('country', 'http://www.wikidata.org/entity/Q884'), ('legalform', 'http://www.wikidata.org/entity/Q134161')]\n",
      "[('max', '1494126000000'), ('min', '32525893'), ('avg', '103677291376.694736842105263'), ('country', 'http://www.wikidata.org/entity/Q851'), ('legalform', 'http://www.wikidata.org/entity/Q134161')]\n",
      "[('max', '1340000000000'), ('min', '5895083000'), ('avg', '672947541500'), ('country', 'http://www.wikidata.org/entity/Q29'), ('legalform', 'http://www.wikidata.org/entity/Q166280')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "20"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What is the min, max, and average in each country for a given legal form?\n",
    "#in this query a return the min, max, and average for each country and legal form it is not specified companies inside the E.U. so i consider all companies\n",
    "#i can add ?country wdt:P463 wd:Q458. if I want to limit anly for E.U. countries\n",
    "queryString = \"\"\"\n",
    "SELECT MAX(?g) AS ?max MIN(?g) AS ?min AVG(?g) AS ?avg ?country ?legalform\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p wdt:P2403 ?g.\n",
    "\n",
    "?p  wdt:P1454 ?legalform.\n",
    "\n",
    "\n",
    "}GROUP BY ?country ?legalform \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f62566e0-a813-43f0-8dda-0e1beb5ac29b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Which business in each country owns more businesses in other E.U. countries? I assume that both the businesses must be in an E.U. country"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "4b0e54ab-b9fa-470a-bc06-ce61491ad734",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('Number', '7'), ('owner', 'http://www.wikidata.org/entity/Q1418')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q1341222')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q941020')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q2643648')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q213'), ('Number', '6'), ('owner', 'http://www.wikidata.org/entity/Q20120422')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q142'), ('Number', '12'), ('owner', 'http://www.wikidata.org/entity/Q77846713')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q218'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q104640458')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q106509822')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q73421997')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q191'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q1536909')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q1437502')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q214'), ('Number', '6'), ('owner', 'http://www.wikidata.org/entity/Q29790925')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q233'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q80202960')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q924370')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '14'), ('owner', 'http://www.wikidata.org/entity/Q554198')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q549181')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q842108')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('owner', 'http://www.wikidata.org/entity/Q1739782')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '7'), ('owner', 'http://www.wikidata.org/entity/Q113215')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q30299422')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q842108')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q213'), ('Number', '6'), ('owner', 'http://www.wikidata.org/entity/Q336735')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q229'), ('Number', '10'), ('owner', 'http://www.wikidata.org/entity/Q60607397')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q971649')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '5'), ('owner', 'http://www.wikidata.org/entity/Q681316')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '4'), ('owner', 'http://www.wikidata.org/entity/Q842108')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q224'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q397347')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29999'), ('Number', '2'), ('owner', 'http://www.wikidata.org/entity/Q16866011')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '6'), ('owner', 'http://www.wikidata.org/entity/Q45568')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q37'), ('Number', '1'), ('owner', 'http://www.wikidata.org/entity/Q2631680')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "30"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Which business in each country owns more businesses in other E.U. countries?\n",
    "#SBAGLIATA VAI AVANTI\n",
    "queryString = \"\"\"\n",
    "SELECT ?country2 ?Number ?owner\n",
    "{\n",
    "\n",
    "\n",
    "{\n",
    "SELECT ?country2   MAX(?NumOwned) AS ?Number\n",
    "{\n",
    "SELECT   ?country2 ?owner COUNT(?p) as ?NumOwned\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P127 ?owner.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owner wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?owner\n",
    "\n",
    "\n",
    "}GROUP BY ?country2\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "{\n",
    "SELECT   ?country2 ?owner COUNT(?p) as ?Number\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P127 ?owner.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owner wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?owner\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "b7896abc-f284-4ddd-8f37-e968406b2673",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q670482')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q19305480')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q565050')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q3737496')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q34'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q664399')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q160054')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q27485599')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q298824')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q612524')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q618098')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q113215')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q27485599')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q34'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q49053')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q298824')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q795981')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q157675')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q4995')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q23317')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q23317')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q23317')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q23317')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '8'), ('p', 'http://www.wikidata.org/entity/Q504998')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q4995')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q689159')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q689159')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q689159')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q113215')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q442637')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q442637')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q505922')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "30"
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#SBAGLIATA VAI ALLA PROSSIMA DA FARE\n",
    "#Which business in each country owns more businesses in other E.U. countries?\n",
    "queryString = \"\"\"\n",
    "SELECT ?country2 ?Number ?p\n",
    "{\n",
    "\n",
    "{\n",
    "\n",
    "SELECT   ?country2 ?p COUNT(?owned) as ?Number\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "{\n",
    "SELECT ?country2  MAX(?NumOwned) AS ?Number\n",
    "{\n",
    "SELECT   ?country2 ?p COUNT(?owned) as ?NumOwned\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "\n",
    "}GROUP BY ?country2 ?p \n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "728cf07a-bf1b-4a10-b5c7-2e7eba88853c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('callret-1', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q34'), ('callret-1', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('callret-1', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('callret-1', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q224'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('callret-1', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q218'), ('callret-1', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q233'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q213'), ('callret-1', '13')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q142'), ('callret-1', '6')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q214'), ('callret-1', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q37'), ('callret-1', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q191'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q229'), ('callret-1', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('callret-1', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('callret-1', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('callret-1', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "26"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#SBAGLIATA VAI ALLA PROSSIMA\n",
    "#Which business in each country owns more businesses in other E.U. countries?\n",
    "queryString = \"\"\"\n",
    "SELECT ?country2 MAX(?Number) \n",
    "{\n",
    "\n",
    "SELECT ?country2  ?NumOwned AS ?Number ?p\n",
    "{\n",
    "SELECT   ?country2 ?p COUNT(distinct ?owned) as ?NumOwned\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "835f0b73-92ed-498f-9197-95a1f8cb91f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q34'), ('Number', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q224'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '4')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q218'), ('Number', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q233'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q213'), ('Number', '13')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q142'), ('Number', '6')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q214'), ('Number', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q37'), ('Number', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q191'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q229'), ('Number', '2')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '1')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('Number', '3')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('Number', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "26"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#look the next one\n",
    "#Which business in each country owns more businesses in other E.U. countries? i select only the maximum but not the business \n",
    "queryString = \"\"\"\n",
    "SELECT ?country2  MAX(?NumOwned) AS ?Number \n",
    "{\n",
    "SELECT ?country2 ?p COUNT(distinct ?owned) as ?NumOwned\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "\n",
    "}GROUP BY ?country2\n",
    "\n",
    "\n",
    "\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "56fc57fa-41cf-48fd-9f0a-9bef50a03596",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q122141')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q45'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q842108')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q9396')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q28472762')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q614920')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q122141')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q41'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q113215')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q93256355')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q28471680')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q59165')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q13408692')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q18019960')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q1206672')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q841263')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q3895')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q161168')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q63099095')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q39925406')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q126944')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q152695')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q60607691')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q608518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q40'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q62269558')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q38'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q504998')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q37'), ('Number', '3'), ('p', 'http://www.wikidata.org/entity/Q371901')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q157675')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q36'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q608518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q106859740')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q10536452')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q94441569')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q47251161')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q28947875')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q187854')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q694872')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q674575')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q106098267')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q378944')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q27231605')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q157675')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q679933')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q50413952')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q22676683')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q608518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q129391')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q106595790')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q29785200')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q104918912')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q35'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q29041303')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q34'), ('Number', '3'), ('p', 'http://www.wikidata.org/entity/Q608518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q183412')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q608518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q33'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q187854')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q499707')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q102337078')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q18019960')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q58449322')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q95989703')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q43930212')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q32'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q157852')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q275623')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q274591')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q27893')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q571779')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q499707')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q474565')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q160054')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q3117359')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q215293')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q31'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q1475312')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q29'), ('Number', '3'), ('p', 'http://www.wikidata.org/entity/Q8774')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q27485599')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q23317')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q378944')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q48916492')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q9396')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q4995')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q680991')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q59165')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q29613327')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q28'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q45568')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q837049')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q571779')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q117059')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q502316')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q27'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q161140')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q233'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q54974654')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q229'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q60605903')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q224'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q688755')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q224'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q9396')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q218'), ('Number', '2'), ('p', 'http://www.wikidata.org/entity/Q4995')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q397347')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q98584518')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q215'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q340135')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q214'), ('Number', '3'), ('p', 'http://www.wikidata.org/entity/Q58425777')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q213'), ('Number', '13'), ('p', 'http://www.wikidata.org/entity/Q94639662')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q61391782')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q19839259')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q996907')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q371901')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q211'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q28966957')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q191'), ('Number', '1'), ('p', 'http://www.wikidata.org/entity/Q309865')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q157675')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q183'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q46964447')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q504998')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q275623')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q145'), ('Number', '4'), ('p', 'http://www.wikidata.org/entity/Q554198')]\n",
      "[('country2', 'http://www.wikidata.org/entity/Q142'), ('Number', '6'), ('p', 'http://www.wikidata.org/entity/Q502316')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "107"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Which business in each country owns more businesses in other E.U. countries? if there are more than one with the same number i return both\n",
    "queryString = \"\"\"\n",
    "SELECT ?country2 ?Number ?p\n",
    "{\n",
    "\n",
    "{\n",
    "SELECT ?country2  MAX(?NumOwned) AS ?Number \n",
    "{\n",
    "SELECT ?country2 ?p COUNT(distinct ?owned) as ?NumOwned\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "\n",
    "}GROUP BY ?country2\n",
    "}\n",
    "\n",
    "\n",
    "{\n",
    "\n",
    "\n",
    "SELECT ?country2 ?p COUNT(distinct ?owned) as ?Number\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "\n",
    "?p wdt:P1830 ?owned.\n",
    "?country2 wdt:P463 wd:Q458.\n",
    "?owned wdt:P17 ?country2  .\n",
    "FILTER(?country2!=?country)\n",
    "} GROUP BY ?country2 ?p\n",
    "\n",
    "}\n",
    "\n",
    "}ORDER BY DESC (?country2)\n",
    "\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e002edd1-05fa-4626-947a-f6e41b83ea05",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1e97ed8-95b5-4fe8-9e66-87ba10cb7564",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "453d694e-82a8-4a87-a7c9-fcc3ac016346",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "4107cfba-d40c-4ac1-9d34-9daa9f8f9330",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q474883'), ('country', 'http://www.wikidata.org/entity/Q801')]\n",
      "[('callret-0', '16'), ('industry', 'http://www.wikidata.org/entity/Q29585175'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q29585313'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q29584705'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('country', 'http://www.wikidata.org/entity/Q739')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('country', 'http://www.wikidata.org/entity/Q16957')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q216053'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q3966'), ('country', 'http://www.wikidata.org/entity/Q884')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2001305'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q581714'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q29585204'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q626608'), ('country', 'http://www.wikidata.org/entity/Q114')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q1067601'), ('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q202866'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q81058'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q179310'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q11661'), ('country', 'http://www.wikidata.org/entity/Q1033')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q41222493'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2095'), ('country', 'http://www.wikidata.org/entity/Q8646')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q627371'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q217107'), ('country', 'http://www.wikidata.org/entity/Q17')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1734300'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q540912'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q11416'), ('country', 'http://www.wikidata.org/entity/Q96')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q177777'), ('country', 'http://www.wikidata.org/entity/Q794')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q13554450'), ('country', 'http://www.wikidata.org/entity/Q184')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1192008'), ('country', 'http://www.wikidata.org/entity/Q236')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q868404'), ('country', 'http://www.wikidata.org/entity/Q668')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q44497'), ('country', 'http://www.wikidata.org/entity/Q884')]\n",
      "[('callret-0', '16'), ('industry', 'http://www.wikidata.org/entity/Q29585018'), ('country', 'http://www.wikidata.org/entity/Q55')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q7590'), ('country', 'http://www.wikidata.org/entity/Q833')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q862571'), ('country', 'http://www.wikidata.org/entity/Q174193')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q6662173'), ('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q862571'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584408'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q540912'), ('country', 'http://www.wikidata.org/entity/Q148')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q67014509'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q154'), ('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q1976332'), ('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q44497'), ('country', 'http://www.wikidata.org/entity/Q20')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q852602'), ('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2085381'), ('country', 'http://www.wikidata.org/entity/Q794')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q76215292'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q261428'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q5487333'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q107601662'), ('country', 'http://www.wikidata.org/entity/Q16')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584730'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('country', 'http://www.wikidata.org/entity/Q16')]\n",
      "[('callret-0', '14'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29585509'), ('country', 'http://www.wikidata.org/entity/Q31')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What can we say about industry sectors in various countries\n",
    "#here i return the number of industries for industry sector in various countries even outside the EU\n",
    "queryString = \"\"\"\n",
    "SELECT  COUNT(?p) ?industry ?country\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p wdt:P452 ?industry.\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} GROUP BY ?industry ?country\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6e006bf7-7e20-4261-883a-ac1f54214a5e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e8011a3a-d572-4dc9-abde-e6ae89274faa",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "f9257ef5-f662-4ae1-aa73-ee52a46fe04d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29585295'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q3997851'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q1961917'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q46970'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q1423777'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q1625796'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q130693'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q899277'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q392933'), ('country', 'http://www.wikidata.org/entity/Q214')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29585484'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q2588161'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29586130'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584290'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '13'), ('industry', 'http://www.wikidata.org/entity/Q786820'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '66'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q19967801'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q2922469'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '11'), ('industry', 'http://www.wikidata.org/entity/Q22687'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q178512'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q187939'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q7108'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2836940'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '13'), ('industry', 'http://www.wikidata.org/entity/Q484847'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '201'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '239'), ('industry', 'http://www.wikidata.org/entity/Q207652'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q3477381'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q768186'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '16'), ('industry', 'http://www.wikidata.org/entity/Q177777'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '26'), ('industry', 'http://www.wikidata.org/entity/Q392933'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1056396'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '45'), ('industry', 'http://www.wikidata.org/entity/Q2285982'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1227658'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q418'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q58891990'), ('country', 'http://www.wikidata.org/entity/Q214')]\n",
      "[('callret-0', '12'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '21'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q207652'), ('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q474200'), ('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q5358497'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '24'), ('industry', 'http://www.wikidata.org/entity/Q25245117'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '26'), ('industry', 'http://www.wikidata.org/entity/Q2518196'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q831619'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q207652'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q101333'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q41767'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q418'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '18'), ('industry', 'http://www.wikidata.org/entity/Q25245117'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q837060'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q893164'), ('country', 'http://www.wikidata.org/entity/Q45')]\n",
      "[('callret-0', '17'), ('industry', 'http://www.wikidata.org/entity/Q7590'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '25'), ('industry', 'http://www.wikidata.org/entity/Q29584410'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q3623281'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q1625796'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '41'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2986369'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q49389'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1341477'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '18'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '11'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q925667'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1481411'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q3966'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '35'), ('industry', 'http://www.wikidata.org/entity/Q107597958'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q29584453'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '14'), ('industry', 'http://www.wikidata.org/entity/Q936518'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '68'), ('industry', 'http://www.wikidata.org/entity/Q107597958'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q29584286'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q893164'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q56611700'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '9'), ('industry', 'http://www.wikidata.org/entity/Q3565868'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '15'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('country', 'http://www.wikidata.org/entity/Q28')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q49845'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '31'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q100251750'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q107597958'), ('country', 'http://www.wikidata.org/entity/Q29999')]\n",
      "[('callret-0', '13'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q645292'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q7406919'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q913709'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q100252087'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q2073644'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q44497'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q309252'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q16319025'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q29584625'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q6657015'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q107602514'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q10953913'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '19'), ('industry', 'http://www.wikidata.org/entity/Q29584313'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q936518'), ('country', 'http://www.wikidata.org/entity/Q215')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q862571'), ('country', 'http://www.wikidata.org/entity/Q218')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q63383285'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q995609'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q941594'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1957908'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '23'), ('industry', 'http://www.wikidata.org/entity/Q418'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q7202108'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1944497'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '17'), ('industry', 'http://www.wikidata.org/entity/Q11451'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q29584583'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q101333'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q5358497'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q219409'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1344636'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1326624'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q17377208'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '18'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q37')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q3510521'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q2729047'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q508378'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q17027266'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q190117'), ('country', 'http://www.wikidata.org/entity/Q218')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q392933'), ('country', 'http://www.wikidata.org/entity/Q28')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q2729047'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q806718'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '9'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q5418962'), ('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q3510521'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('country', 'http://www.wikidata.org/entity/Q45')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('country', 'http://www.wikidata.org/entity/Q45')]\n",
      "[('callret-0', '9'), ('industry', 'http://www.wikidata.org/entity/Q173799'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1416657'), ('country', 'http://www.wikidata.org/entity/Q229')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q837171'), ('country', 'http://www.wikidata.org/entity/Q229')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q159719'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q124192'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '5'), ('industry', 'http://www.wikidata.org/entity/Q100251750'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q57262277'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q14554973'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '10'), ('industry', 'http://www.wikidata.org/entity/Q913709'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q695829'), ('country', 'http://www.wikidata.org/entity/Q32')]\n",
      "[('callret-0', '9'), ('industry', 'http://www.wikidata.org/entity/Q25245117'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q913709'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '13'), ('industry', 'http://www.wikidata.org/entity/Q862571'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q4265939'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q34493'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q29584334'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '36'), ('industry', 'http://www.wikidata.org/entity/Q581105'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q907703'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q48767813'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q327092'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '12'), ('industry', 'http://www.wikidata.org/entity/Q936518'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q2072431'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q967140'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q189507'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q11661'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '9'), ('industry', 'http://www.wikidata.org/entity/Q1061108'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '23'), ('industry', 'http://www.wikidata.org/entity/Q29584657'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1345638'), ('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q786820'), ('country', 'http://www.wikidata.org/entity/Q214')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q17102188'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q22667'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q29585204'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q220117'), ('country', 'http://www.wikidata.org/entity/Q218')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q179310'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '16'), ('industry', 'http://www.wikidata.org/entity/Q29585175'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q29585313'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q29584705'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q216053'), ('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q1734300'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q2001305'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q581714'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q202866'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q81058'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q41222493'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q627371'), ('country', 'http://www.wikidata.org/entity/Q213')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q177777'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '14'), ('industry', 'http://www.wikidata.org/entity/Q126793'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q261428'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q121916'), ('country', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q187939'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q207822'), ('country', 'http://www.wikidata.org/entity/Q27')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q11630521'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '6'), ('industry', 'http://www.wikidata.org/entity/Q29584490'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '7'), ('industry', 'http://www.wikidata.org/entity/Q862571'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584408'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q67014509'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q76215292'), ('country', 'http://www.wikidata.org/entity/Q35')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q5487333'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584730'), ('country', 'http://www.wikidata.org/entity/Q36')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29585509'), ('country', 'http://www.wikidata.org/entity/Q31')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q55488'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q63769412'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584437'), ('country', 'http://www.wikidata.org/entity/Q31')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q446760'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q29585118'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q184199'), ('country', 'http://www.wikidata.org/entity/Q33')]\n",
      "[('callret-0', '3'), ('industry', 'http://www.wikidata.org/entity/Q1416313'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29584657'), ('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q747066'), ('country', 'http://www.wikidata.org/entity/Q31')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q57262267'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '4'), ('industry', 'http://www.wikidata.org/entity/Q627371'), ('country', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('callret-0', '8'), ('industry', 'http://www.wikidata.org/entity/Q11033'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q29585683'), ('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q29585169'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q180846'), ('country', 'http://www.wikidata.org/entity/Q41')]\n",
      "[('callret-0', '2'), ('industry', 'http://www.wikidata.org/entity/Q7889'), ('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q4063722'), ('country', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q651658'), ('country', 'http://www.wikidata.org/entity/Q41')]\n",
      "[('callret-0', '1'), ('industry', 'http://www.wikidata.org/entity/Q695829'), ('country', 'http://www.wikidata.org/entity/Q145')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "200"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What can we say about industry sectors in various countries\n",
    "#here i return the number of industries for industry sector in various countries in the EU\n",
    "queryString = \"\"\"\n",
    "SELECT  COUNT(?p) ?industry ?country\n",
    "WHERE { \n",
    "\n",
    "{ \n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q6881511  . \n",
    "} UNION {\n",
    "?country wdt:P463 wd:Q458.\n",
    "?p wdt:P17 ?country  . \n",
    "?p wdt:P31 wd:Q4830453  . \n",
    "}\n",
    "?p wdt:P452 ?industry.\n",
    "?p <http://schema.org/name> ?business.\n",
    "\n",
    "} GROUP BY ?industry ?country\n",
    " \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "797e2ca9-07d6-4839-8c54-26be638b8941",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "73e760b6-762a-44af-90d4-4b2a70d8d02b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
