{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-c17c3e4e63-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "       results = sparql.query()\n",
    "       json_results = results.convert()\n",
    "       if len(json_results['results']['bindings'])==0:\n",
    "          print(\"Empty\")\n",
    "          return 0\n",
    "    \n",
    "       for bindings in json_results['results']['bindings']:\n",
    "          print( [ (var, value['value'])  for var, value in bindings.items() ] )\n",
    "\n",
    "       return len(json_results['results']['bindings'])\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Horror Franchises explorative search\") \n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> we are interested in horror movies, in particular we care about the slasher subgenre, and we want to compare the Halloween and the Friday the 13th francise. \n",
    "\n",
    "Background knowledge useful for better conducting the search: Halloween is a movie from 1978 with many sequels and the set of Halloween + all the sequels is called the \"Halloween franchise\". The same considerations hold for Friday the 13th.\n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wd:Q221103`     | Halloween       | node |\n",
    "| `wd:Q1243029`| Friday the 13th       | node |\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q1243029 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Friday the 13th**\n",
    "\n",
    "The workload should\n",
    "\n",
    "\n",
    "1. Investigate the workers of the two original movies and check any commonality \n",
    "\n",
    "2. Check who was the most famous actor/actress on Halloween and Friday the 13th at the time of the release (e.g., the actor/actress who acted in more movies before and/or the actor/actress who won more academy awards)\n",
    "\n",
    "3. Check which actor/actress did more movies after the release of these two films (consider the films separately)\n",
    "\n",
    "4. Get all the movies of the two franchises (return year and director)\n",
    "\n",
    "5. Who is most involved in a franchise (who did something in the movies, e.g., writer, director, producer)? \n",
    "\n",
    "6. Investigate which franchise is highly regarded by the critics overall\n",
    "\n",
    "7. Investigate which franchise costed more "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "24a853ab-830c-422c-afd3-e9e015b8b8ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "# start your workflow here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), ('obj', 'http://wikiba.se/ontology#Item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct-normalized/P244'), ('obj', 'https://id.loc.gov/authorities/names/no98033420')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct-normalized/P3212'), ('obj', 'urn:isan:0000-0000-31EA-0000-G-0000-0000-Q')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct-normalized/P4276'), ('obj', 'https://data.cinematheque.qc.ca/data/Work1467')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct-normalized/P646'), ('obj', 'http://g.co/kg/m/016mng')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('obj', 'friday13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('obj', 'm/friday_the_13th_part_1')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('obj', '505')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('obj', 'http://www.wikidata.org/entity/Q1067324')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('obj', 'http://www.wikidata.org/entity/Q1200678')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('obj', 'http://www.wikidata.org/entity/Q853630')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('obj', 'http://www.wikidata.org/entity/Q909586')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('obj', 'http://www.wikidata.org/entity/Q1780634')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('obj', 'http://www.wikidata.org/entity/Q977915')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('obj', 'Friday the 13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('obj', 'http://www.wikidata.org/entity/Q1243009')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('obj', 'v18658')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q2440012')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q263765')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q3428829')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q3434272')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q3454165')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q13218111')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q2570201')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q3047636')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('obj', 'http://www.wikidata.org/entity/Q524486')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('obj', 'http://www.wikidata.org/entity/Q709325')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('obj', 'movie/friday-the-13th-1980')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P175'), ('obj', 'http://www.wikidata.org/entity/Q664025')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('obj', 'http://www.wikidata.org/entity/Q1138878')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('obj', 'http://commons.wikimedia.org/wiki/Special:FilePath/Friday%20the%2013th%20%281980%29%20film%20logo.png')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('obj', '1319')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('obj', '525111')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('obj', 'http://www.wikidata.org/entity/Q1454815')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('obj', '1191')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('obj', '91')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('obj', 'http://www.wikidata.org/entity/Q752245')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('obj', '7782')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('obj', '133662')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('obj', 'no98033420')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('obj', '10511')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('obj', '4386')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2509'), ('obj', 'mv4378')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('obj', '1265')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('obj', '23053')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('obj', '23922')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('obj', '17974')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('obj', 'movies/friday-the-13th-1980')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('obj', '10.5240/7544-6FCA-F299-ECD8-BE4D-A')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('obj', 'http://www.wikidata.org/entity/Q159846')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2747'), ('obj', 'http://www.wikidata.org/entity/Q23830579')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2755'), ('obj', '52986')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2758'), ('obj', 'http://www.wikidata.org/entity/Q23817741')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('obj', '18183')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('obj', 'http://www.wikidata.org/entity/Q11424')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('obj', '25470')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3129'), ('obj', '651006')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('obj', '53')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3141'), ('obj', 't0003232')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3143'), ('obj', '80561')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('obj', '54093')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('obj', '0000-0000-31EA-0000-G-0000-0000-Q')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('obj', '4488')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('obj', 'http://www.wikidata.org/entity/Q4863956')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('obj', 'tt0080761')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('obj', '56417')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('obj', 'http://www.wikidata.org/entity/Q1860')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('obj', '123800')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('obj', 'Friday-the-13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('obj', '1142')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3933'), ('obj', '1294128')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4276'), ('obj', '1467')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4282'), ('obj', '13638')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('obj', 'http://www.wikidata.org/entity/Q723685')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('obj', '1293143')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('obj', 'http://www.wikidata.org/entity/Q22006653')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('obj', '4569')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('obj', '6056')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('obj', '265349')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('obj', '4488')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('obj', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('obj', 'http://www.wikidata.org/entity/Q1454815')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('obj', 'http://www.wikidata.org/entity/Q4165246')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5032'), ('obj', '8684')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('obj', 'film/venerdi13')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5693'), ('obj', '93065')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('obj', 'http://www.wikidata.org/entity/Q709325')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('obj', '1980-05-09T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('obj', '1980-10-23T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('obj', '1980-11-10T00:00:00Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('obj', 'freitag-der-13')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('obj', 'http://www.wikidata.org/entity/Q7926158')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('obj', '4025-275')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('obj', 'friday-the-13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('obj', 'movies:Friday_the_13th_(1980)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('obj', 'the80smovies:Friday_the_13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('obj', '305332580')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('obj', '312028305')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('obj', '/m/016mng')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('obj', '-er1PNqRLiI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('obj', 'http://www.wikidata.org/entity/Q2576457')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('obj', 'http://www.wikidata.org/entity/Q366957')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('obj', 'http://www.wikidata.org/entity/Q80948336')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('obj', 'http://www.wikidata.org/entity/Q907311')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('obj', 'http://www.wikidata.org/entity/Q159846')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7970'), ('obj', '1MV59a10bc8835dfb67d1a4a2bf5428a03b')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8033'), ('obj', 'friday-the-13th-m100051176')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('obj', 'http://www.wikidata.org/entity/Q1408')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('obj', 'http://www.fridaythe13thfilms.com')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('obj', 'http://www.wikidata.org/entity/Q664025')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('obj', '7021')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P915'), ('obj', 'http://www.wikidata.org/entity/Q1408')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('obj', 'umc.cmc.4cny06c1e312h2mfd2utrtve2')]\n",
      "[('p', 'http://schema.org/name'), ('obj', 'Friday the 13th')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2554'), ('obj', 'http://www.wikidata.org/entity/Q450964')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4277'), ('obj', '10178')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7975'), ('obj', '1283')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6466'), ('obj', '98dc6b45-4478-4877-8316-acc3c7f6ae94')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "118"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE { \n",
    "\n",
    "wd:Q1243029 ?p ?obj .\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d6b00ffb-50d6-4247-9370-7837ccb34f0f",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Taks 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "229b6684-026a-453a-a14d-7b2a7123e8ec",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Investigate the workers of the two original movies and check any commonality: "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3df158aa-4479-476a-8e75-11f7f889dd7e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# in the first query i see that fridey the 13 was released in 1980"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "03442ee3-3106-4774-8f4e-9632226ce5ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('worker', 'http://www.wikidata.org/entity/Q219424'), ('rel', 'http://www.wikidata.org/prop/direct/P6166'), ('name', 'quotes work')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q1454815'), ('rel', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q366957'), ('rel', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q2576457'), ('rel', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q1243009'), ('rel', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3567621'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i look if i can find a relationship for worker in a particular movie (Friday)\n",
    "queryString = \"\"\"\n",
    "SELECT ?worker ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "?worker ?rel wd:Q1243029.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5c0d2cec-f969-488d-b6da-5b3402e460a1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "336e1667-dd0c-413d-9ba5-21fe4b26fcc1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4a7135b2-88ab-4a5c-8118-d8bd811c3678",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "af13feed-6452-4530-a37c-14d26eceb2fe",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'friday13th'), ('rel', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'm/friday_the_13th_part_1'), ('rel', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', '505'), ('rel', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1067324'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1200678'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q853630'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q909586'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1780634'), ('rel', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q977915'), ('rel', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'Friday the 13th'), ('rel', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1243009'), ('rel', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'v18658'), ('rel', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2440012'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q263765'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3428829'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3434272'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3454165'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13218111'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2570201'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3047636'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q524486'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q709325'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'movie/friday-the-13th-1980'), ('rel', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q664025'), ('rel', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1138878'), ('rel', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', 'http://commons.wikimedia.org/wiki/Special:FilePath/Friday%20the%2013th%20%281980%29%20film%20logo.png'), ('rel', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', '1319'), ('rel', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', '525111'), ('rel', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1454815'), ('rel', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', '1191'), ('rel', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', '91'), ('rel', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q752245'), ('rel', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', '7782'), ('rel', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', '133662'), ('rel', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'no98033420'), ('rel', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', '10511'), ('rel', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', '4386'), ('rel', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'mv4378'), ('rel', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('p', '1265'), ('rel', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', '23053'), ('rel', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', '23922'), ('rel', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', '17974'), ('rel', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'movies/friday-the-13th-1980'), ('rel', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', '10.5240/7544-6FCA-F299-ECD8-BE4D-A'), ('rel', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q159846'), ('rel', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23830579'), ('rel', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', '52986'), ('rel', 'http://www.wikidata.org/prop/direct/P2755'), ('name', 'exploitation visa number')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23817741'), ('rel', 'http://www.wikidata.org/prop/direct/P2758'), ('name', 'CNC film rating (France)')]\n",
      "[('p', '18183'), ('rel', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11424'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', '25470'), ('rel', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', '651006'), ('rel', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', '53'), ('rel', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 't0003232'), ('rel', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', '80561'), ('rel', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', '54093'), ('rel', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('p', '0000-0000-31EA-0000-G-0000-0000-Q'), ('rel', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', '4488'), ('rel', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4863956'), ('rel', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'tt0080761'), ('rel', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', '56417'), ('rel', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', '123800'), ('rel', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'Friday-the-13th'), ('rel', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', '1142'), ('rel', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', '1294128'), ('rel', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', '1467'), ('rel', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', '13638'), ('rel', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q723685'), ('rel', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', '1293143'), ('rel', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22006653'), ('rel', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', '4569'), ('rel', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', '6056'), ('rel', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', '265349'), ('rel', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', '4488'), ('rel', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1454815'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4165246'), ('rel', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', '8684'), ('rel', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'film/venerdi13'), ('rel', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', '93065'), ('rel', 'http://www.wikidata.org/prop/direct/P5693'), ('name', 'Fandango film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q709325'), ('rel', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', '1980-05-09T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1980-10-23T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1980-11-10T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'freitag-der-13'), ('rel', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7926158'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', '4025-275'), ('rel', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'friday-the-13th'), ('rel', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'movies:Friday_the_13th_(1980)'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'the80smovies:Friday_the_13th'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', '305332580'), ('rel', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', '312028305'), ('rel', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', '/m/016mng'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', '-er1PNqRLiI'), ('rel', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2576457'), ('rel', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q366957'), ('rel', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80948336'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q907311'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q159846'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', '1MV59a10bc8835dfb67d1a4a2bf5428a03b'), ('rel', 'http://www.wikidata.org/prop/direct/P7970'), ('name', 'FandangoNow ID')]\n",
      "[('p', 'friday-the-13th-m100051176'), ('rel', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1408'), ('rel', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.fridaythe13thfilms.com'), ('rel', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q664025'), ('rel', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', '7021'), ('rel', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1408'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'umc.cmc.4cny06c1e312h2mfd2utrtve2'), ('rel', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q450964'), ('rel', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', '10178'), ('rel', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('p', '1283'), ('rel', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('p', '98dc6b45-4478-4877-8316-acc3c7f6ae94'), ('rel', 'http://www.wikidata.org/prop/direct/P6466'), ('name', 'Hulu movie ID')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "112"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#i investigate the relationship with the film Friday\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q1243029 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "50f83541-c785-4016-91cf-fef6dfd1f2bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "#in the query before i found the iri for publication date which is P577\n",
    "#Check who was the most famous actor/actress on Halloween and Friday the 13th at the time of the release\n",
    "#(e.g., the actor/actress who acted in more movies before and/or the actor/actress who won more academy awards)\n",
    "# In the previous query i found the iri for cast member which is P161\n",
    "#here i find also the iri for director P57"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8575193f-2587-4391-a319-9c8b91d3df5b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#in the query before i get the iri P179 which stands for part of the series , screen writer P58, director P57, director of photography P344\n",
    "#performer P175,producer P162,production designer P2554,composer P86"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "8a84b95c-5e96-4fa1-9b46-7ae1d2bdb809",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q574983'), ('rel', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'm/1009113-halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', '9434'), ('rel', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q377616'), ('rel', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q130232'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q200092'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1146335'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q853630'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'topic/Halloween-1978-film'), ('rel', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101480110'), ('rel', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('p', 'Halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q850312'), ('rel', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'v21317'), ('rel', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2865227'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3066766'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106997'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201570'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1064022'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q936000'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1853959'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q314914'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3093664'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q270079'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6963012'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6248629'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q262102'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380471'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3802169'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q823422'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'movie/halloween-1978'), ('rel', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1364022'), ('rel', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', '16863'), ('rel', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', '569090'), ('rel', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q229620'), ('rel', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', '1081'), ('rel', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', '91'), ('rel', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21062414'), ('rel', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', '325000'), ('rel', 'http://www.wikidata.org/prop/direct/P2130'), ('name', 'cost')]\n",
      "[('p', '183290594'), ('rel', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', '7671785-9'), ('rel', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', '8377'), ('rel', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', '121090'), ('rel', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'no98046857'), ('rel', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', '18702'), ('rel', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', '7161'), ('rel', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'mv7146'), ('rel', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('p', '2575'), ('rel', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', '1322'), ('rel', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', '8435'), ('rel', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', '77236'), ('rel', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'movies/halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', '10.5240/F55B-E276-0102-C4C1-93B5-Y'), ('rel', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3685076'), ('rel', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23830579'), ('rel', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', '18105'), ('rel', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11424'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', '16452'), ('rel', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', '651007'), ('rel', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', '63'), ('rel', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 't0003057'), ('rel', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', '77467'), ('rel', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', '0000-0001-3D3E-0000-E-0000-0000-W'), ('rel', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', '948'), ('rel', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q497036'), ('rel', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'tt0077651'), ('rel', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', '56347'), ('rel', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', '125497'), ('rel', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'Halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', '1392'), ('rel', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', '1331081'), ('rel', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', '787'), ('rel', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', '12659'), ('rel', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q723685'), ('rel', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', '1299586'), ('rel', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22006653'), ('rel', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', '2815'), ('rel', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', '1774'), ('rel', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', '11287'), ('rel', 'http://www.wikidata.org/prop/direct/P4780'), ('name', 'MYmovies movie ID')]\n",
      "[('p', '384174'), ('rel', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', '948'), ('rel', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3285065'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4502764'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7079511'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4165246'), ('rel', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85783379'), ('rel', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', '6009'), ('rel', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'film1/halloween1'), ('rel', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', '1978-10-25T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1979-07-06T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1979-08-06T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'halloween-die-nacht-des-grauens'), ('rel', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q262102'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', '4025-190'), ('rel', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80656032'), ('rel', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('p', 'film/wd/7132'), ('rel', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('p', 'halloween-1978'), ('rel', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'halloweenmovie:Halloween_(1978)'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'movies:Halloween_(1978)'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', '1052963015'), ('rel', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', '/m/0m3gy'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', '1014626'), ('rel', 'http://www.wikidata.org/prop/direct/P7334'), ('name', 'Vudu video ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q907311'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3685076'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'halloween-m100017116'), ('rel', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101479794'), ('rel', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q210999'), ('rel', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('p', 'http://www.theofficialjohncarpenter.com/pages/themovies/hw/hw.html'), ('rel', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', '41366'), ('rel', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q65'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q99'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q484188'), ('rel', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'umc.cmc.3ucmuzhhu97vky5ss9shi57ba'), ('rel', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q574983'), ('rel', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380471'), ('rel', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2483'), ('rel', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2755'), ('rel', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('p', '10966'), ('rel', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('p', '1077'), ('rel', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q251868'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1314'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "128"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#i investigate the relationship with the film halloween\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q221103 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b70ae8b0-5068-4efb-90ef-9b977b777da3",
   "metadata": {},
   "outputs": [],
   "source": [
    "#here i get the new positions: film editor P1040 which i will check only for the film halloween"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "id": "2e2dff04-0cf8-47b7-b7a3-4954bd886ebd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('worker', 'http://www.wikidata.org/entity/Q2865227')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3066766')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q106997')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q201570')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q1064022')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q95008')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q936000')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q1853959')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q314914')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3093664')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q270079')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q6963012')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q6248629')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q262102')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q497036')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q380471')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3802169')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q574983')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q2440012')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q263765')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3428829')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3434272')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3454165')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q13218111')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q2570201')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q3047636')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q524486')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q7926158')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q709325')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q4863956')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q664025')]\n",
      "[('worker', 'http://www.wikidata.org/entity/Q450964')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "32"
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i select the workers  for the 2 films i check for the working positions found for the films\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?worker \n",
    "WHERE { \n",
    "{\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie) Halloween \n",
    "wd:Q221103 wdt:P161 ?worker.\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P58 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P57 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P344 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P175 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P162 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P2554 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P86 ?worker.\n",
    "}\n",
    "UNION\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P1040 ?worker.\n",
    "}\n",
    "#then i get the workers of the second film\n",
    "UNION\n",
    "{\n",
    "\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie)  \n",
    "wd:Q1243029 wdt:P161 ?worker.\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P58 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P57 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P344 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P175 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P162 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P2554 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q1243029 wdt:P86 ?worker.\n",
    "}\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "id": "8fb736ac-1d69-47f3-b3bd-88bdd2a54b1e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i get the workers who worked in both films (first the workers who where present in alloween then i look if they had a relation in the other film)\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?worker \n",
    "WHERE { \n",
    "{\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie) Halloween \n",
    "wd:Q221103 wdt:P161 ?worker.\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P58 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P57 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P344 ?worker. \n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P175 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P162 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P2554 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P86 ?worker.\n",
    "}\n",
    "UNION\n",
    "{\n",
    " \n",
    "wd:Q221103 wdt:P1040 ?worker.\n",
    "}\n",
    "FILTER EXISTS {wd:Q1243029 ?relation ?worker}.\n",
    "}\n",
    "\n",
    "LIMIT 50\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "254c0d67-8cdd-4b11-a72d-ceebbdd1a7f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "#so i found that there are not workers in common between the two films"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1a89484c-650e-4499-881e-868bdd0cb598",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "312b5131-fae2-4dde-a0db-005bca0a4598",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1028181'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10800557'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2259451'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2405480'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q33999'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5716684'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q897317'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', '1609'), ('rel', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', '80116835'), ('rel', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://commons.wikimedia.org/wiki/Special:FilePath/Adrienne%20King.jpg'), ('rel', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18438'), ('rel', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'p38252'), ('rel', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID')]\n",
      "[('p', '1965-01-01T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6581072'), ('rel', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', '0000 0001 1490 0753'), ('rel', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', '37126862'), ('rel', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', '84700'), ('rel', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID')]\n",
      "[('p', '237238'), ('rel', 'http://www.wikidata.org/prop/direct/P2387'), ('name', 'Elonet person ID')]\n",
      "[('p', 'no2009122943'), ('rel', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', '156447'), ('rel', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID')]\n",
      "[('p', '10992'), ('rel', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('p', '29469'), ('rel', 'http://www.wikidata.org/prop/direct/P2626'), ('name', 'Danish National Filmography person ID')]\n",
      "[('p', '14193593p'), ('rel', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', '162333978'), ('rel', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'adrienneking13'), ('rel', 'http://www.wikidata.org/prop/direct/P3265'), ('name', 'Myspace ID')]\n",
      "[('p', 'Adrienne-King-1'), ('rel', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'nm0454415'), ('rel', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'Adrienne King'), ('rel', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', '37470'), ('rel', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('p', '41939'), ('rel', 'http://www.wikidata.org/prop/direct/P5033'), ('name', 'Filmweb.pl person ID')]\n",
      "[('p', '1955-07-21T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('p', '1960-07-21T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('p', '/m/081vds'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q523926'), ('rel', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q535214'), ('rel', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q377369'), ('rel', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q73555012'), ('rel', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'lccn-no2009122943'), ('rel', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.adrienneking.com/'), ('rel', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'XX1473619'), ('rel', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "43"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i investigate all the relationship with an actor found before Adrienne King Q2440012 to get the profession actor\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q2440012 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7febefd1-b41f-4414-aac1-033c5778f96f",
   "metadata": {},
   "outputs": [],
   "source": [
    "#in the query before i get the iri for actor Q33999 and the iri for occupation P106 but i prefer to use cast member so i can identify those who \n",
    "#where actually actors in the two films and didn't have another profession"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "7c2057ff-217d-492c-b316-fbba28e26d56",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', '147880998'), ('rel', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', '98015093'), ('rel', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10798782'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10800557'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13235160'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2259451'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2405480'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2526255'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3282637'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q33999'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3455803'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q639669'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q948329'), ('rel', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'n2008131085'), ('rel', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', '90569'), ('rel', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', '717/000022651'), ('rel', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', '2130'), ('rel', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17085462'), ('rel', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('p', '00000023526'), ('rel', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', '1189569'), ('rel', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q67311526'), ('rel', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q186472'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', '000249798'), ('rel', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7066'), ('rel', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'Kevin Norwood Bacon'), ('rel', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('p', '00048912'), ('rel', 'http://www.wikidata.org/prop/direct/P1649'), ('name', 'KMDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q251542'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17985761'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q105447'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18600734'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'A1257000X'), ('rel', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('p', '77838'), ('rel', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://commons.wikimedia.org/wiki/Special:FilePath/Kevin%20Bacon%20SDCC%202014.jpg'), ('rel', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'I00572020'), ('rel', 'http://www.wikidata.org/prop/direct/P1819'), ('name', 'genealogics.org person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1345'), ('rel', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', '956139'), ('rel', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('p', '7338'), ('rel', 'http://www.wikidata.org/prop/direct/P1969'), ('name', 'MovieMeter director ID (former scheme)')]\n",
      "[('p', 'kevinbacon'), ('rel', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('p', 'kevinbacon'), ('rel', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('p', 'KevinBacon'), ('rel', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('p', 'p3164'), ('rel', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID')]\n",
      "[('p', '1978-01-01T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6581097'), ('rel', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', '0000 0001 2129 1300'), ('rel', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', '39570812'), ('rel', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', '242183'), ('rel', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', '73959'), ('rel', 'http://www.wikidata.org/prop/direct/P2168'), ('name', 'Swedish Film Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1285964'), ('rel', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', '124109659'), ('rel', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#i use one actor found before Q3428829 to get the relationship\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q3454165 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "da944d3b-69cc-4b5b-a43b-1aeec02a2265",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('callret-1', '4')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q314914'), ('callret-1', '1')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q106997'), ('callret-1', '3')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#att not correct (time) look at the next one \n",
    "\n",
    "#i found the IRI award received which is P166\n",
    "#i can then check the actors of the first films of each series which received more awards who actually where actors in the films\n",
    "#FILTER(?time<1978).\n",
    "#?award wdt:P585 ?time.\n",
    "queryString = \"\"\"\n",
    "SELECT ?actor COUNT(?award) \n",
    "WHERE { \n",
    "{\n",
    "#this stands for the actor which where part of the cast of the film (not the serie) Halloween \n",
    "wd:Q221103 wdt:P161 ?actor.\n",
    "#this stands for the awards received\n",
    "?actor wdt:P166 ?award.\n",
    "\n",
    "#?award wdt:P585 ?time.\n",
    "#FILTER(?time<\"1978\"^^xsd:date).\n",
    "}\n",
    "UNION\n",
    "{\n",
    "wd:Q1243029  wdt:P161 ?actor.\n",
    "?actor wdt:P166 ?award.\n",
    "#?award wdt:P585 ?time.\n",
    "#FILTER(?time<\"1980\"^^xsd:date).\n",
    "}\n",
    "\n",
    "}GROUP BY(?actor)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n",
    "\n",
    "\n",
    "\n",
    "#anyway none of the actors returned received an academy awards before the movies so i check which one partecipated in more films before the movies\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "a8a214ff-ca57-46c3-9658-0ef142961db8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q314914'), ('number', '87')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#actor/actress who acted in more movies before here i check for both the films i check for the actor or actress who actually where actors in the films\n",
    "queryString = \"\"\"\n",
    "SELECT ?actor COUNT(?film) as ?number \n",
    "WHERE { \n",
    "{\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie) Halloween \n",
    "wd:Q221103 wdt:P161 ?actor.\n",
    "?film wdt:P161 ?actor.\n",
    "?film wdt:P577 ?date.\n",
    "\n",
    "\n",
    "FILTER(?date<\"1978\"^^xsd:date).\n",
    "}\n",
    "UNION\n",
    "{\n",
    "\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie)  \n",
    "wd:Q1243029 wdt:P161 ?actor.\n",
    "?film wdt:P161 ?actor.\n",
    "?film wdt:P577 ?date.\n",
    "\n",
    "FILTER(?date<\"1980\"^^xsd:date).\n",
    "}\n",
    "}\n",
    "GROUP BY(?actor)\n",
    "ORDER BY DESC(?number)\n",
    "LIMIT 1\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b627a7ab-994e-4d66-a40a-e1a2a3b35bd6",
   "metadata": {},
   "outputs": [],
   "source": [
    "#so the most famous actor (did more films before) was Donald Pleasence"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93696d27-1242-415c-9480-c183d618fc48",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "f4330af4-96ac-4f29-b70b-2075f6045806",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q314914'), ('number', '126')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Check which actor/actress did more movies after the release of these two films (consider the films separately) i consider actors as cast members so i \n",
    "#consider only those who where actors in the two films and not those who had another profession in the films\n",
    "#here i check for the film Halloween\n",
    "queryString = \"\"\"\n",
    "SELECT ?actor COUNT(?film) as ?number \n",
    "WHERE { \n",
    "\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie) Halloween \n",
    "wd:Q221103 wdt:P161 ?actor.\n",
    "?film wdt:P161 ?actor.\n",
    "?film wdt:P577 ?date.\n",
    "\n",
    "\n",
    "FILTER(?date>\"1978\"^^xsd:date).\n",
    "}\n",
    "GROUP BY(?actor)\n",
    "ORDER BY DESC(?number)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "127842b4-d92b-4f74-9553-48ecdb844899",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('number', '110')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2440012'), ('number', '22')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q263765'), ('number', '13')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3434272'), ('number', '10')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3428829'), ('number', '8')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q524486'), ('number', '5')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3047636'), ('number', '5')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q13218111'), ('number', '3')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2570201'), ('number', '3')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "9"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Check which actor/actress did more movies after the release of these two films (consider the films separately)\n",
    "#here i check for the film FRIDAY\n",
    "queryString = \"\"\"\n",
    "SELECT ?actor COUNT(?film) as ?number\n",
    "WHERE { \n",
    "\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film (not the serie)  \n",
    "wd:Q1243029 wdt:P161 ?actor.\n",
    "?film wdt:P161 ?actor.\n",
    "?film wdt:P577 ?date.\n",
    "\n",
    "FILTER(?date>\"1980\"^^xsd:date).\n",
    "\n",
    "}GROUP BY(?actor)\n",
    "ORDER BY DESC(?number)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2563690c-7f3d-4dba-a2b7-3554727464cb",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "83094a13-c26b-4233-b9ae-d440b3db80c4",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q574983'), ('rel', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'm/1009113-halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', '9434'), ('rel', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q377616'), ('rel', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q130232'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q200092'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1146335'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q853630'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'topic/Halloween-1978-film'), ('rel', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101480110'), ('rel', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('p', 'Halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q850312'), ('rel', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'v21317'), ('rel', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2865227'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3066766'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106997'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201570'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1064022'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q936000'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1853959'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q314914'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3093664'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q270079'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6963012'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6248629'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q262102'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380471'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3802169'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q823422'), ('rel', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'movie/halloween-1978'), ('rel', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1364022'), ('rel', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', '16863'), ('rel', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', '569090'), ('rel', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q229620'), ('rel', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', '1081'), ('rel', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', '91'), ('rel', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21062414'), ('rel', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', '325000'), ('rel', 'http://www.wikidata.org/prop/direct/P2130'), ('name', 'cost')]\n",
      "[('p', '183290594'), ('rel', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', '7671785-9'), ('rel', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', '8377'), ('rel', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', '121090'), ('rel', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'no98046857'), ('rel', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', '18702'), ('rel', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', '7161'), ('rel', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'mv7146'), ('rel', 'http://www.wikidata.org/prop/direct/P2509'), ('name', 'Movie Walker film ID')]\n",
      "[('p', '2575'), ('rel', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', '1322'), ('rel', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', '8435'), ('rel', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', '77236'), ('rel', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'movies/halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', '10.5240/F55B-E276-0102-C4C1-93B5-Y'), ('rel', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3685076'), ('rel', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23830579'), ('rel', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', '18105'), ('rel', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11424'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', '16452'), ('rel', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', '651007'), ('rel', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', '63'), ('rel', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 't0003057'), ('rel', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', '77467'), ('rel', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', '0000-0001-3D3E-0000-E-0000-0000-W'), ('rel', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', '948'), ('rel', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q497036'), ('rel', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'tt0077651'), ('rel', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', '56347'), ('rel', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', '125497'), ('rel', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'Halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', '1392'), ('rel', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', '1331081'), ('rel', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', '787'), ('rel', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', '12659'), ('rel', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q723685'), ('rel', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', '1299586'), ('rel', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22006653'), ('rel', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', '2815'), ('rel', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', '1774'), ('rel', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', '11287'), ('rel', 'http://www.wikidata.org/prop/direct/P4780'), ('name', 'MYmovies movie ID')]\n",
      "[('p', '384174'), ('rel', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', '948'), ('rel', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3285065'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4502764'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7079511'), ('rel', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4165246'), ('rel', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85783379'), ('rel', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', '6009'), ('rel', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'film1/halloween1'), ('rel', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', '1978-10-25T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1979-07-06T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1979-08-06T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'halloween-die-nacht-des-grauens'), ('rel', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q262102'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', '4025-190'), ('rel', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q80656032'), ('rel', 'http://www.wikidata.org/prop/direct/P5970'), ('name', 'Medierådet rating')]\n",
      "[('p', 'film/wd/7132'), ('rel', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('p', 'halloween-1978'), ('rel', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'halloweenmovie:Halloween_(1978)'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'movies:Halloween_(1978)'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', '1052963015'), ('rel', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', '/m/0m3gy'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', '1014626'), ('rel', 'http://www.wikidata.org/prop/direct/P7334'), ('name', 'Vudu video ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q907311'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3685076'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'halloween-m100017116'), ('rel', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101479794'), ('rel', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q210999'), ('rel', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('p', 'http://www.theofficialjohncarpenter.com/pages/themovies/hw/hw.html'), ('rel', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', '41366'), ('rel', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q65'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q99'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q484188'), ('rel', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "[('p', 'umc.cmc.3ucmuzhhu97vky5ss9shi57ba'), ('rel', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q574983'), ('rel', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380471'), ('rel', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2483'), ('rel', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2755'), ('rel', 'http://www.wikidata.org/prop/direct/P2408'), ('name', 'set in period')]\n",
      "[('p', '10966'), ('rel', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('p', '1077'), ('rel', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q251868'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1314'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "128"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#in the queries before i get the iri Q1138878 whic represent the series friday the 13 and the iri for part of the series  P179\n",
    "#here i try to get the series halloween\n",
    "#i investigate the relationship with the film\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q221103 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "c3b94ee7-94af-4717-be2c-9dd340c4dfd0",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('year', '1979-07-06T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q95008'), ('film', 'http://www.wikidata.org/entity/Q221103')]\n",
      "[('year', '1978-10-25T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q95008'), ('film', 'http://www.wikidata.org/entity/Q221103')]\n",
      "[('year', '1979-08-06T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q95008'), ('film', 'http://www.wikidata.org/entity/Q221103')]\n",
      "[('year', '1998-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1050815')]\n",
      "[('year', '1998-10-29T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1050815')]\n",
      "[('year', '2002-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1384404'), ('film', 'http://www.wikidata.org/entity/Q176488')]\n",
      "[('year', '2002-11-07T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1384404'), ('film', 'http://www.wikidata.org/entity/Q176488')]\n",
      "[('year', '2007-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q298255'), ('film', 'http://www.wikidata.org/entity/Q909063')]\n",
      "[('year', '2007-10-25T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q298255'), ('film', 'http://www.wikidata.org/entity/Q909063')]\n",
      "[('year', '1981-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q95008'), ('film', 'http://www.wikidata.org/entity/Q850312')]\n",
      "[('year', '1981-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1384404'), ('film', 'http://www.wikidata.org/entity/Q850312')]\n",
      "[('year', '1982-11-11T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q95008'), ('film', 'http://www.wikidata.org/entity/Q850312')]\n",
      "[('year', '1982-11-11T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1384404'), ('film', 'http://www.wikidata.org/entity/Q850312')]\n",
      "[('year', '1982-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q574983'), ('film', 'http://www.wikidata.org/entity/Q203705')]\n",
      "[('year', '1988-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1268483'), ('film', 'http://www.wikidata.org/entity/Q959853')]\n",
      "[('year', '1989-05-18T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1268483'), ('film', 'http://www.wikidata.org/entity/Q959853')]\n",
      "[('year', '1991-07-11T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q117234'), ('film', 'http://www.wikidata.org/entity/Q976728')]\n",
      "[('year', '1989-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q117234'), ('film', 'http://www.wikidata.org/entity/Q976728')]\n",
      "[('year', '2009-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q298255'), ('film', 'http://www.wikidata.org/entity/Q908690')]\n",
      "[('year', '2009-10-15T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q298255'), ('film', 'http://www.wikidata.org/entity/Q908690')]\n",
      "[('year', '1995-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1381885'), ('film', 'http://www.wikidata.org/entity/Q1138055')]\n",
      "[('year', '1981-11-02T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q709325'), ('film', 'http://www.wikidata.org/entity/Q1243009')]\n",
      "[('year', '1981-11-02T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1243009')]\n",
      "[('year', '1981-04-30T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q709325'), ('film', 'http://www.wikidata.org/entity/Q1243009')]\n",
      "[('year', '1981-04-30T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1243009')]\n",
      "[('year', '1983-05-12T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1243013')]\n",
      "[('year', '1982-08-13T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1243013')]\n",
      "[('year', '1983-05-13T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q107404'), ('film', 'http://www.wikidata.org/entity/Q1243013')]\n",
      "[('year', '1980-11-10T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q709325'), ('film', 'http://www.wikidata.org/entity/Q1243029')]\n",
      "[('year', '1980-05-09T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q709325'), ('film', 'http://www.wikidata.org/entity/Q1243029')]\n",
      "[('year', '1980-10-23T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q709325'), ('film', 'http://www.wikidata.org/entity/Q1243029')]\n",
      "[('year', '2001-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q472868'), ('film', 'http://www.wikidata.org/entity/Q1427521')]\n",
      "[('year', '1993-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q4679450'), ('film', 'http://www.wikidata.org/entity/Q1683918')]\n",
      "[('year', '1989-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q21280751'), ('film', 'http://www.wikidata.org/entity/Q1454794')]\n",
      "[('year', '1988-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q3052099'), ('film', 'http://www.wikidata.org/entity/Q1454798')]\n",
      "[('year', '1986-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q730985'), ('film', 'http://www.wikidata.org/entity/Q1454799')]\n",
      "[('year', '1985-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1778633'), ('film', 'http://www.wikidata.org/entity/Q286830')]\n",
      "[('year', '1987-01-02T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q1778633'), ('film', 'http://www.wikidata.org/entity/Q286830')]\n",
      "[('year', '2003-11-20T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q525109'), ('film', 'http://www.wikidata.org/entity/Q965859')]\n",
      "[('year', '2003-08-13T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q525109'), ('film', 'http://www.wikidata.org/entity/Q965859')]\n",
      "[('year', '1984-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q11335'), ('film', 'http://www.wikidata.org/entity/Q1243019')]\n",
      "[('year', '1984-07-13T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q11335'), ('film', 'http://www.wikidata.org/entity/Q1243019')]\n",
      "[('year', '2009-01-01T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q77399'), ('film', 'http://www.wikidata.org/entity/Q1454815')]\n",
      "[('year', '2009-02-13T00:00:00Z'), ('director', 'http://www.wikidata.org/entity/Q77399'), ('film', 'http://www.wikidata.org/entity/Q1454815')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "44"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#P577 forud before is the iri for pubblication date\n",
    "#in the query before i get the iri for the series halloween Q1364022\n",
    "#Get all the movies of the two franchises (return year and director)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?year ?director ?film\n",
    "WHERE { \n",
    "{\n",
    "#this are the films part of the Halloween franciase\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P57 ?director.\n",
    "?film wdt:P577 ?year.\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P57 ?director.\n",
    "?film wdt:P577 ?year.\n",
    "\n",
    "}\n",
    "\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "90498226-0ca2-474e-992b-2f4ed682fd08",
   "metadata": {},
   "source": [
    "## Task 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "82e4d989-6dbe-4c85-9802-362b16ab0d69",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('apparition', '13'), ('worker', 'http://www.wikidata.org/entity/Q95008')]\n",
      "[('apparition', '6'), ('worker', 'http://www.wikidata.org/entity/Q262102')]\n",
      "[('apparition', '6'), ('worker', 'http://www.wikidata.org/entity/Q298255')]\n",
      "[('apparition', '5'), ('worker', 'http://www.wikidata.org/entity/Q314914')]\n",
      "[('apparition', '5'), ('worker', 'http://www.wikidata.org/entity/Q106997')]\n",
      "[('apparition', '5'), ('worker', 'http://www.wikidata.org/entity/Q574983')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q730362')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q272944')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q380471')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q497036')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q1378684')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q201570')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q6963012')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q1384404')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3066766')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q1853959')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q2329915')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q6173666')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q2779609')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q1345338')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q329734')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q449520')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q117234')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q117392')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q374239')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q552031')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q107404')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q238121')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q1064022')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q239382')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q813336')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q936000')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q6248629')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q52440')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q235677')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q256884')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q564851')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3048468')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3929818')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q959750')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q2865227')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q340213')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3453826')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q350255')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q703809')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q2048649')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q1366623')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q234471')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3296147')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q5356821')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 130,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Who is most involved in a franchise (who did something in the movies, e.g., writer, director, producer)?\n",
    "#here i return the number of apparition for the alloween franciaise for each worker\n",
    "queryString = \"\"\"\n",
    "SELECT  COUNT(?film) as ?apparition ?worker\n",
    "WHERE { \n",
    "\n",
    "#this are the films part of the Halloween franciase\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "\n",
    "{\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film \n",
    "?film wdt:P161 ?worker.\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P58 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P57 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P344 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P175 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P162 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P2554 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P86 ?worker.\n",
    "}\n",
    "UNION\n",
    "{\n",
    " \n",
    "?film wdt:P1040 ?worker.\n",
    "}\n",
    "\n",
    "}GROUP BY (?worker)\n",
    "ORDER BY DESC(?apparition)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "772ca4f8-546e-4335-bad6-0a0be42db202",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('apparition', '15'), ('worker', 'http://www.wikidata.org/entity/Q664025')]\n",
      "[('apparition', '7'), ('worker', 'http://www.wikidata.org/entity/Q709325')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q107404')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q3082711')]\n",
      "[('apparition', '4'), ('worker', 'http://www.wikidata.org/entity/Q465134')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q375419')]\n",
      "[('apparition', '3'), ('worker', 'http://www.wikidata.org/entity/Q263765')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3116155')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q1314250')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q30327831')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q2440012')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q6394602')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q730985')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3434272')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q455879')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q6234410')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q450964')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3086901')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3063036')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q991651')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q5246313')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q1228672')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q21280751')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q3428829')]\n",
      "[('apparition', '2'), ('worker', 'http://www.wikidata.org/entity/Q4679450')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q11770584')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q7626409')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q55422')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q1589252')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3183440')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q465914')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q684370')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3038793')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q231116')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3505578')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q434014')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q6308992')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q184249')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q422310')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q923279')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q957454')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q108006600')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q108033009')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3288389')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q3454165')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q13218111')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q637974')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q264377')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q626553')]\n",
      "[('apparition', '1'), ('worker', 'http://www.wikidata.org/entity/Q2443799')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 131,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Who is most involved in a franchise (who did something in the movies, e.g., writer, director, producer)?\n",
    "#here i return the number of apparition for the  Friday franciase for each worker\n",
    "queryString = \"\"\"\n",
    "SELECT  COUNT(?film) as ?apparition ?worker\n",
    "WHERE { \n",
    "\n",
    "#this are the films part of the Friday franciase\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "\n",
    "{\n",
    "\n",
    "#this stands for the actor which where part of the cast of the film \n",
    "?film wdt:P161 ?worker.\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P58 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P57 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P344 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P175 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P162 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P2554 ?worker.\n",
    "}\n",
    "UNION\n",
    "\n",
    "{\n",
    " \n",
    "?film wdt:P86 ?worker.\n",
    "}\n",
    "UNION\n",
    "{\n",
    " \n",
    "?film wdt:P1040 ?worker.\n",
    "}\n",
    "\n",
    "}GROUP BY (?worker)\n",
    "ORDER BY DESC(?apparition)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "60ab8c6a-5751-4f33-96fe-b690d0736168",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "77c2fda7-a26f-42b4-9c27-702512e226a6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "71fa7507-777c-4599-ae80-9353d613df9d",
   "metadata": {},
   "source": [
    "## Task 6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "9dc7a3b8-8842-463c-ace4-03d71c4f8643",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#SBAGLIATA NON GUARDARE\n",
    "#i found in the previous query P1712 which is the id for metacritic\n",
    "#Investigate which franchise is highly regarded by the critics overall\n",
    "#in this query i return for each film his metacritic ranking\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?film ?critic\n",
    "WHERE { \n",
    "{\n",
    "#this are the films part of the Halloween franciase\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P444 ?critic.\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P444 ?critic.\n",
    "\n",
    "}\n",
    "\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ffcbbf26-31f7-483b-8414-9201214513d8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "27b9c5f0-6b00-4031-92fc-d6ac90adffdd",
   "metadata": {},
   "outputs": [],
   "source": [
    "#i already found all the relationship for the film halloween in the previous queries (the first one) so i try alloween 5"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e261bbc9-ac15-4af9-830f-4a3f8db33fb8",
   "metadata": {},
   "source": [
    "## Task 7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "8bb1985e-59d1-4a75-9290-23b045493aaf",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'halloween5'), ('rel', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'm/halloween_5_the_revenge_of_michael_myers'), ('rel', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', '57785'), ('rel', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q200092'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q853630'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'Halloween 5: The Revenge of Michael Myers'), ('rel', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q959853'), ('rel', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27834579'), ('rel', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27847754'), ('rel', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1138055'), ('rel', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'v21321'), ('rel', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q813336'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q204395'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q556064'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q743045'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q314914'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q272944'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2633389'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23900757'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q449520'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7982682'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3514655'), ('rel', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q380471'), ('rel', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'movie/halloween-5-the-revenge-of-michael-myers'), ('rel', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1364022'), ('rel', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', 'http://commons.wikimedia.org/wiki/Special:FilePath/Halloween5bann.jpg'), ('rel', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', '60002050'), ('rel', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', '3859'), ('rel', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20644797'), ('rel', 'http://www.wikidata.org/prop/direct/P1981'), ('name', 'FSK film rating')]\n",
      "[('p', '96'), ('rel', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', '11642254'), ('rel', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('p', '37996'), ('rel', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', '840694'), ('rel', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', '18706'), ('rel', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', '46146'), ('rel', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', '5046'), ('rel', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', '7072'), ('rel', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "[('p', '14501'), ('rel', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', '77240'), ('rel', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'movies/halloween-5-the-revenge-of-michael-myers'), ('rel', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', '10.5240/2EB7-ECD2-79CF-5931-E06B-O'), ('rel', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', '3000000'), ('rel', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11424'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', '21424'), ('rel', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', '712280'), ('rel', 'http://www.wikidata.org/prop/direct/P3129'), ('name', 'cine.gr film ID')]\n",
      "[('p', '65'), ('rel', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 't0004658'), ('rel', 'http://www.wikidata.org/prop/direct/P3141'), ('name', 'EDb film ID')]\n",
      "[('p', '97144'), ('rel', 'http://www.wikidata.org/prop/direct/P3143'), ('name', 'elFilm film ID')]\n",
      "[('p', '11361'), ('rel', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7343629'), ('rel', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography')]\n",
      "[('p', 'tt0097474'), ('rel', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', '58103'), ('rel', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', '127561'), ('rel', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', '1396'), ('rel', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', '1302032'), ('rel', 'http://www.wikidata.org/prop/direct/P3933'), ('name', 'Cinema.de ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q723685'), ('rel', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', '1295166'), ('rel', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22006653'), ('rel', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', '6400'), ('rel', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', '70456'), ('rel', 'http://www.wikidata.org/prop/direct/P4780'), ('name', 'MYmovies movie ID')]\n",
      "[('p', '456968'), ('rel', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', '11361'), ('rel', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', '34736'), ('rel', 'http://www.wikidata.org/prop/direct/P5032'), ('name', 'Filmweb.pl film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q117234'), ('rel', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', '1989-01-01T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', '1991-07-11T00:00:00Z'), ('rel', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'halloween-v-die-rache-des-michael-myers'), ('rel', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q95008'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q117234'), ('rel', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', '4025-722'), ('rel', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'halloween-5-the-revenge-of-michael-myers'), ('rel', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'movies:Halloween_5:_The_Revenge_of_Michael_Myers'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'the80smovies:Halloween_5:_The_Revenge_of_Michael_Myers'), ('rel', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', '927752262'), ('rel', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', '/m/06d6nx'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q907311'), ('rel', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1204'), ('rel', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.halloweenmovies.com'), ('rel', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q730362'), ('rel', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', '113532'), ('rel', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q829'), ('rel', 'http://www.wikidata.org/prop/direct/P915'), ('name', 'filming location')]\n",
      "[('p', 'umc.cmc.4igzhykb2olsno5m2wrdulw6m'), ('rel', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', '17637'), ('rel', 'http://www.wikidata.org/prop/direct/P4277'), ('name', 'Daum movie ID')]\n",
      "[('p', '1264'), ('rel', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q251868'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "87"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#i investigate the relationship with the film Halloween 5 found before\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q976728 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37a5a4e2-10cd-42e2-b78e-d472d90e31d4",
   "metadata": {},
   "outputs": [],
   "source": [
    " #i found cost:P2130 for each film and in the query before i found buget P2769 for each film"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "a771471c-2f00-49d6-86d2-544f7d7614f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P2530'), ('name', 'Box Office Mojo franchise ID (former scheme)')]\n",
      "[('p', 'franchise/halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q853630'), ('rel', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10547782'), ('rel', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'Halloween'), ('rel', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q229620'), ('rel', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24856'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q196600'), ('rel', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('rel', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'Halloween (franchise)'), ('rel', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30'), ('rel', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q85997053'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1050815'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q976728'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20666646'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q909063'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q203705'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q221103'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q959853'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q850312'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1138055'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q67279679'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q176488'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q908690'), ('rel', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', '/m/09twsw'), ('rel', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'Halloween_(série_de_films)'), ('rel', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6456912'), ('rel', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q251868'), ('rel', 'http://www.wikidata.org/prop/direct/P9215'), ('name', 'set during recurring event')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "28"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i get all the relationship with the  halloween serie Q1364022 found before\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?rel ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q1364022 ?rel ?p.\n",
    "?rel <http://schema.org/name> ?name .\n",
    "} LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5de1b3d2-a108-4cd1-be8a-e08ba8c6faa7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "adc76904-3dd8-475d-90ca-eaac6b2b95c0",
   "metadata": {},
   "outputs": [],
   "source": [
    "#I found no relationship which indicates rating (apart for age ratings ex 18+) whith the Hallowing serie and 2 Halloween films \n",
    "#so a possible comparrison with the current information is impossible\n",
    "#the only idea i have is to look through the links of other sites such as metacritics or wrotten tomatoes wich i have found"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "aa675236-4dff-440a-98d2-7d2631014d0a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q221103'), ('cost', '325000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1243009'), ('cost', '1250000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1243013'), ('cost', '2250000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1454798'), ('cost', '2800000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1454799'), ('cost', '3000000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1243019'), ('cost', '2600000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q176488'), ('cost', '15000000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q909063'), ('cost', '15000000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q203705'), ('cost', '2500000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q976728'), ('cost', '3000000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1138055'), ('cost', '5000000')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "11"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Investigate which franchise costed more\n",
    "#in the previous queries i found cost:P2130 for each film and in the query before i found buget P2769 for each film\n",
    "#in this query i return the cost for each film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?film ?cost\n",
    "WHERE { \n",
    "{\n",
    "#this are the films part of the Halloween franciase\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P2130 ?cost.\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P2130 ?cost.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P2769 ?cost.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P2769 ?cost.\n",
    "\n",
    "}\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "06a49f3c-64d2-485d-b399-7f21e28fdbc3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('serie', 'http://www.wikidata.org/entity/Q1364022'), ('cost', '40825000')]\n",
      "[('serie', 'http://www.wikidata.org/entity/Q1138878'), ('cost', '11900000')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "2"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#in this query i return the total cost for each franchise\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "\n",
    "SELECT DISTINCT  ?serie SUM(?cost) AS ?cost\n",
    "WHERE { \n",
    "{\n",
    "#this are the films part of the Halloween franciase\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P2130 ?cost.\n",
    "?film wdt:P179 ?serie.\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P2130 ?cost.\n",
    "?film wdt:P179 ?serie.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1138878.\n",
    "?film wdt:P2769 ?cost.\n",
    "?film wdt:P179 ?serie.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?film wdt:P179 wd:Q1364022.\n",
    "?film wdt:P2769 ?cost.\n",
    "?film wdt:P179 ?serie.\n",
    "\n",
    "}\n",
    "}GROUP BY(?serie)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "72a01503-722e-4bdc-b244-8ab476596ace",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
