{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b99afaa5",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a884a8f3",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-a7db882dd9-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6a07b35c",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Literary Movements and Divine Comedy explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the literary movements and the poets. In particular, compare some italian poets in terms of place of birth, number of literary works and education."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "27a7fc8c",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q40185`| The Divine Comedy  | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "634cb1e0",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q40185 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Divine Comedy**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "1. Who wrote The Divine Comedy? (return the IRI and the label of the author)\n",
    "\n",
    "2. Identify the BGP for poet\n",
    "\n",
    "3. Identify the BGP for literary movement\n",
    "\n",
    "4. Return the poets born in the same place of the author of The Divine Comedy who are born between 1300 and 1500 (1300 and 1500 included) (the result set must be a list of couples poets IRI and label).\n",
    "\n",
    "5. Identify the BGP for literary work\n",
    "\n",
    "6. Compare the author of The Divine Comedy with Giovanni Boccaccio. Return for these poets the number of literary work they wrote (the result set must be two triples -one for each author- author IRI, label and #literary work).\n",
    "\n",
    "7. Consider italian poets, their place of birth (the city) and their university education. Return for each city the number of poets who born there and who was educated there (the result set must be a list of triples city IRI, label and #poets).\n",
    "\n",
    "8. Return the italian poets who won the Nobel Prize in Literature (the result set must be poet IRI and label). "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48d8e791",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Who wrote The Divine Comedy? (return the IRI and the label of the author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0e130bb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2551'), ('name', 'used metre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P435'), ('name', 'MusicBrainz work ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5986'), ('name', 'Getty Iconography Authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7314'), ('name', 'TDV İslam Ansiklopedisi ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P747'), ('name', 'has edition or translation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8189'), ('name', 'National Library of Israel J9U ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8248'), ('name', 'Colon Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P906'), ('name', 'SELIBR ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9223'), ('name', 'Provenio UUID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9322'), ('name', 'SVKKL authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1274'), ('name', 'ISFDB title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6175'), ('name', 'Bitraga work ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8359'), ('name', 'Dewey Decimal Classification (works and editions)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2034'), ('name', 'Project Gutenberg ebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3976'), ('name', 'BVMC work ID')]\n",
      "46\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q40185 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e428dc4f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "afad5ec5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('auteur', 'http://www.wikidata.org/entity/Q1067'), ('name', 'Dante Alighieri')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?auteur ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q40185 wdt:P50 ?auteur .\n",
    "   # get the label\n",
    "   ?auteur sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "76f95dcc",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for poet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "1a076ed7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "06c95fa5",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "1efb0826",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q12144794'), ('name', 'prosaist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15994177'), ('name', 'political theorist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q482980'), ('name', 'author')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4964182'), ('name', 'philosopher')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q822146'), ('name', 'lyricist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q82955'), ('name', 'politician')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q58968'), ('name', 'intellectual')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# we're retrieveing all the occupations of Dante\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 wdt:P106 ?o . \n",
    "   # get the label\n",
    "   ?o sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "10e8fb27",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for literary movement"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "06a89d5a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5160'), ('name', 'Thesaurus for Graphic Materials ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)')]\n",
      "32\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# we're retrieving all the properties and object of poet\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q49757 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "1d536cb4-eed8-4a21-a749-04d0581e1bb9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('name', 'Wikidata property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4801'), ('name', 'LoC and MARC vocabularies ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4839'), ('name', 'Wolfram Language entity code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5398'), ('name', 'TDKIV term ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "39\n"
     ]
    }
   ],
   "source": [
    "# we're now trying with the properties of author\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q482980 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "e60f89db-bcc0-4993-b7df-d5acf2be8a04",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1299'), ('name', 'depicted by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#trying with the properties of Dante?\n",
    "# we didn't find literary movement but we find movement\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 ?p ?o . \n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "   FILTER(!isLiteral(?o)) .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "cf61027f-3ebc-455b-8e9b-fcbaa33c081d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q542036'), ('name', 'Dolce Stil Novo')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# let's take a look at what it is for Dante\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 wdt:P135 ?o . \n",
    "   # get the label\n",
    "   ?o sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "07c5c5a6",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "560f499d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('namep', 'country of origin'), ('o', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q3326717'), ('name', 'literary movement')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?namep ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q542036 ?p ?o . \n",
    "   # get the label\n",
    "   ?p sc:name ?namep .\n",
    "   ?o sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "15bf46a5",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return the poets born in the same place of the author of The Divine Comedy who are born between 1300 and 1500 (1300 and 1500 included) (the result set must be a list of couples poets IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "bd171900",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#We want to find birthplace and birthdate retrieving the property of Dante\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "   FILTER REGEX (?name, \".*birth.*\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "955db8c6-a9c5-4137-918b-7f1bb7108213",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3296224'), ('name', 'Muhammad ibn Mahmud Amuli'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q18214823'), ('name', 'Georges Warda'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1510346'), ('name', 'Gerbert de Montreuil'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q5199'), ('name', 'Le Chastelain de Couci'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q582581'), ('name', 'Tomaso di Sasso'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q734140'), ('name', 'Walter of Winterburn'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q7461783'), ('name', 'Shahin Shirazi'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q6043494'), ('name', 'Mustafa Zarir'), ('year', '1301-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2245720'), ('name', \"Cielo d'Alcamo\"), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q711416'), ('name', 'Trần Minh Tông'), ('year', '1300-09-04T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q930623'), ('name', 'Gautier de Metz'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q4321424'), ('name', 'Nina Siciliana'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2640054'), ('name', 'Albrecht von Kemenaten'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3629743'), ('name', 'Auliver'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3610547'), ('name', 'Alexios Makrembolites'), ('year', '1301-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q7936667'), ('name', 'Viswanatha Kaviraja'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q16742870'), ('name', 'Gotto Mantovano'), ('year', '1301-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q200580'), ('name', 'Guillaume de Machaut'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3436655'), ('name', 'Robert de Gretham'), ('year', '1300-01-01T00:00:00Z')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3854784'), ('name', 'Meo Abbracciavacca'), ('year', '1300-01-01T00:00:00Z')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#We're decomposing the final query in 2 to be sure.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?name ?year\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ; \n",
    "       sc:name ?name ;   \n",
    "       wdt:P569 ?year .\n",
    "   \n",
    "   FILTER(?year > \"1299\"^^xsd:gYear && ?year < \"1501\"^^xsd:gYear)\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "ecc446be-4950-43c6-9037-2c5bf9cc0424",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q17203201'), ('name', 'Sebastiano Fenzi'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q21003797'), ('name', 'Michel Verin'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q426305'), ('name', 'Giovanni Maria Cecchi'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1248954'), ('name', 'Giovanni di Bernardo Rucellai'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q7803'), ('name', 'Bronzino'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1067'), ('name', 'Dante Alighieri'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q177854'), ('name', \"Lorenzo de' Medici\"), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q529858'), ('name', 'Giovanni Papini'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3694295'), ('name', 'Corrado Pavolini'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q328117'), ('name', 'Girolamo Benivieni'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q104145408'), ('name', 'Luigi Alamanni'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q721846'), ('name', 'Luigi Alamanni'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1249317'), ('name', 'Lorenzo Lippi'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q366328'), ('name', 'Brunetto Latini'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3742647'), ('name', 'Ferdinando Paolieri'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q509504'), ('name', 'Franco Fortini'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q117197'), ('name', 'Marc Monnier'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1399'), ('name', 'Niccolò Machiavelli'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3610195'), ('name', 'Alessandro Parronchi'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q335896'), ('name', 'John Douglas, 9th Marquess of Queensberry'), ('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#retrieving all the poets born at the same place as Dante\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?name ?birthplace ?city\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ; \n",
    "       sc:name ?name ;   \n",
    "       wdt:P19 ?birthplace .\n",
    "    ?birthplace sc:name ?city .\n",
    "   wd:Q1067 wdt:P19 ?birthplaceD . #retrieve the birthplace of Dante\n",
    "   \n",
    "   FILTER(?birthplace = ?birthplaceD)\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8f0f0093",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e4476a35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q21003797'), ('name', 'Michel Verin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1248954'), ('name', 'Giovanni di Bernardo Rucellai')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q177854'), ('name', \"Lorenzo de' Medici\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q328117'), ('name', 'Girolamo Benivieni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q721846'), ('name', 'Luigi Alamanni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1399'), ('name', 'Niccolò Machiavelli')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q366499'), ('name', 'Orcagna')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1402'), ('name', 'Giovanni Boccaccio')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q631635'), ('name', 'Luigi Pulci')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2857170'), ('name', 'Antonio Alamanni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1527917'), ('name', 'Giuliano Dati')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q45539848'), ('name', 'Niccolò Tinucci')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1113645'), ('name', 'Lucrezia Tornabuoni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q711964'), ('name', 'Cristoforo Landino')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q741841'), ('name', 'Ugolino di Vieri')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3677259'), ('name', 'Cino Rinuccini')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q640594'), ('name', 'John Dominici')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q781511'), ('name', 'Aurelio Lippo Brandolini')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q13570581'), ('name', 'Bartolomeo della Fonte')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q302218'), ('name', 'Agnolo Firenzuola')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q62055718'), ('name', \"Lippo Pasci de' Bardi\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q19357719'), ('name', 'Lodovico Martelli')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q425969'), ('name', 'Bernardo Bellincioni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1229872'), ('name', 'Matteo Palmieri')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q589545'), ('name', 'Bernardo Pulci')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1215784'), ('name', 'Alessandra Scala')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q659093'), ('name', 'Benedetto Dei')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q50399164'), ('name', \"Dolcibene de' Tori\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1149308'), ('name', 'Rustico Filippi')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3830353'), ('name', 'Leonardo Dati')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q66809563'), ('name', \"Alessandro Pazzi de' Medici\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q604448'), ('name', 'Antonio Pucci')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2832756'), ('name', 'Alessandro Braccesi')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3750836'), ('name', \"Francesco d'Altobianco Alberti\")]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1058842'), ('name', 'Domenico di Giovanni')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1158784'), ('name', 'Crinitus')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q17166727'), ('name', 'Antonio di Meglio')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q15633606'), ('name', 'Bondie Dietaiuti')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3339583'), ('name', 'Niccolò Martelli')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3763435'), ('name', 'Gianni Alfani')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3068447'), ('name', 'Feo Belcari')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q18945288'), ('name', 'Francesco da Firenze')]\n",
      "42\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ; \n",
    "       sc:name ?name ;   \n",
    "       wdt:P569 ?year ;\n",
    "       wdt:P19 ?birthplace .\n",
    "   wd:Q1067 wdt:P19 ?birthplaceD . #retrieve the birthplace of Dante\n",
    "   \n",
    "   FILTER(?year > \"1299\"^^xsd:gYear && ?year < \"1501\"^^xsd:gYear && ?birthplace = ?birthplaceD)\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16c4ca1c",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Identify the BGP for literary work"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "5b0db126",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q47461344'), ('name', 'written work')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# looking for the objects of which The Divine Comedy is an instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q40185 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee54f671",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "9efe94bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P214'), ('nameo', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P407'), ('nameo', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q17537576'), ('nameo', 'creative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q7725634'), ('nameo', 'literary work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q3331189'), ('nameo', 'version, edition, or translation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q571'), ('nameo', 'book')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses'), ('obj', 'http://www.wikidata.org/entity/Q8192'), ('nameo', 'writing system')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P136'), ('nameo', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q10013893'), ('nameo', 'Category:Written works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from'), ('obj', 'http://www.wikidata.org/entity/Q105763458'), ('nameo', 'volume')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# we're retrieving all properties and objects of written work\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?nameo\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q47461344 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "   ?obj sc:name ?nameo .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9e70ca31",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Compare the author of The Divine Comedy with Giovanni Boccaccio. Return for these poets the number of literary work they wrote (the result set must be two triples -one for each author- author IRI, label and #literary work)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "dafe9a51",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#we're gonna retrieve what property link literary work and poet\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name \n",
    "WHERE { \n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757;\n",
    "         ?p wd:Q7725634 .\n",
    "   ?p sc:name ?name .\n",
    "} \n",
    "LIMIT 50 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "bc476d53-ad63-4bb8-9b2d-38ecc0cd0fa8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P180'), ('name', 'depicts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#maybe the other way around\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name \n",
    "WHERE { \n",
    "   # bind something\n",
    "   ?litwrk wdt:P31 wd:Q7725634 ;\n",
    "           ?p wd:Q49757 .\n",
    "   ?p sc:name ?name .\n",
    "} \n",
    "LIMIT 50 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "b1ebc7a9-5a1d-4f76-a5d9-94ffb3f4d55d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P110'), ('name', 'illustrator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P123'), ('name', 'publisher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('name', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P291'), ('name', 'place of publication')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6216'), ('name', 'copyright status')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P655'), ('name', 'translator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P747'), ('name', 'has edition or translation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7937'), ('name', 'form of creative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P88'), ('name', 'commissioned by')]\n",
      "40\n"
     ]
    }
   ],
   "source": [
    "#not finding anything, we're trying to retrieve every property from literary work\n",
    "#and we find author(and creator, don't know what is the difference between both)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name \n",
    "WHERE { \n",
    "   # bind something\n",
    "   ?litwrk wdt:P31 wd:Q7725634 ;\n",
    "           ?p ?o .\n",
    "   ?p sc:name ?name .\n",
    "   FILTER(!isLiteral(?o)) .\n",
    "} \n",
    "LIMIT 40 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d52afd81",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "69bde70a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1067'), ('name', 'Dante Alighieri'), ('nblworks', '37')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1402'), ('name', 'Giovanni Boccaccio'), ('nblworks', '10')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# we found the BGP of Giovanni Boccaccio during the task 4\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?name (COUNT(?lwork) as ?nblworks) \n",
    "WHERE{ \n",
    "   # bind something\n",
    "   ?lwork wdt:P31 wd:Q7725634 ;\n",
    "          wdt:P50 ?poet .\n",
    "   ?poet wdt:P106 wd:Q49757 ;\n",
    "        sc:name ?name .\n",
    "   FILTER (?poet IN (wd:Q1402, wd:Q1067)) .\n",
    "} ORDER BY DESC(?nblworks)\n",
    "LIMIT 50 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb749c10",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 7\n",
    "Consider italian poets, their place of birth (the city) and their university education. Return for each city the number of poets who born there and who was educated there (the result set must be a list of triples city IRI, label and #poets)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "8f5f9566-ff62-4f54-b704-a5908ddec26a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q148540'), ('name', 'Republic of Florence')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# First we need to find the BGP of Italian nationality. We just need to retrieve the nationality of Dante\n",
    "# It was not Italy at the time\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 wdt:P27 ?o . \n",
    "   # get the label\n",
    "   ?o sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "9a7fc054-b1f0-413b-a989-334c22e43ffe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#we got the PGB of country above, we're just gonna use it on the birthplace of Dante to obtain the PGB of Italy\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 wdt:P19 ?city. \n",
    "   # get the label\n",
    "   ?city wdt:P17 ?country.\n",
    "   ?country sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "6963cfa1-7114-4935-ae12-3a50d8d1628e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('city', 'http://www.wikidata.org/entity/Q12081657'), ('name', 'township level division of the Republic of China')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q14502790'), ('name', 'settlement of Hungary')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q22580836'), ('name', 'village in Latvia')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q717478'), ('name', 'administrative territorial entity of the United Kingdom')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q683738'), ('name', 'Administrative subdivision of Wales')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2828312'), ('name', 'protected area of Canada')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q10677154'), ('name', 'Stadsdelsnämndsområde')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q35798'), ('name', 'executive branch')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q57058'), ('name', 'municipalities of Croatia')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15989253'), ('name', 'part')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q19953632'), ('name', 'former administrative territorial entity')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1030034'), ('name', 'GLAM')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15078955'), ('name', 'urban-type settlement in Russia')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q164142'), ('name', 'protectorate')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q171308'), ('name', 'oblast')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q4286337'), ('name', 'city district')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q10374501'), ('name', 'administrative territorial entity of Bulgaria')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q14757767'), ('name', 'fourth-level administrative country subdivision')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q264441'), ('name', 'Bezirk')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q269528'), ('name', 'unincorporated area')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q387917'), ('name', 'administrative territorial entity of Germany')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q417633'), ('name', 'self-governance')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1054813'), ('name', 'municipality of Japan')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1850442'), ('name', 'administrative territorial entity of Japan')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q470540'), ('name', 'seat')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q4976993'), ('name', 'civil parish')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q294440'), ('name', 'public space')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q588140'), ('name', 'science museum')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q102496'), ('name', 'parish')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q697379'), ('name', 'administrative territorial entity of Romania')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1048835'), ('name', 'political territorial entity')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q10864048'), ('name', 'first-level administrative country subdivision')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1093829'), ('name', 'city of the United States')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q123705'), ('name', 'neighborhood')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q13539802'), ('name', 'place with town rights and privileges')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15284'), ('name', 'municipality')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1549591'), ('name', 'big city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q192611'), ('name', 'electoral district')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2039348'), ('name', 'municipality of the Netherlands')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q205895'), ('name', 'landmass')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2074737'), ('name', 'municipality of Spain')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2221906'), ('name', 'geographic location')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q262166'), ('name', 'municipality of Germany')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q3183364'), ('name', 'administrative territorial entity of Spain')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q3702971'), ('name', 'personal data')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q3957'), ('name', 'town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q486972'), ('name', 'human settlement')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q4946461'), ('name', 'spa town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q515'), ('name', 'city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q532'), ('name', 'village')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# we also need the BGP of university education\n",
    "# We're gonna try to find the BGP of city to see its subclasses\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?city ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?born wdt:P19 ?pot . \n",
    "   ?pot wdt:P31 ?type .\n",
    "   ?type wdt:P279 ?city .\n",
    "   ?city sc:name ?name .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "16b320f4-2e7c-4a08-9e5c-d1895e032131",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('city', 'http://www.wikidata.org/entity/Q15260353'), ('name', 'host city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q5124027'), ('name', 'city proper')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1656724'), ('name', 'ideal city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q83020'), ('name', 'provincial city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q28659128'), ('name', 'city of North Korea')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q63208555'), ('name', 'city in Gabon')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q104157'), ('name', 'city of the Philippines')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q23640644'), ('name', 'Levitical city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q13218690'), ('name', 'town in Hungary')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15141632'), ('name', 'Thesaban Nakhon')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q37800986'), ('name', 'Serbian city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q16858213'), ('name', 'town in Romania')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1266029'), ('name', 'edge city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q4943467'), ('name', 'Boomburb')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q5770918'), ('name', 'city of Argentina')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q63209072'), ('name', 'city in Colombia')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2367508'), ('name', 'township of Taiwan')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q24700892'), ('name', 'post town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1093829'), ('name', 'city of the United States')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1187811'), ('name', 'college town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1256805'), ('name', 'Drei-Flüsse-Stadt')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q13416557'), ('name', 'Royal city in Polish–Lithuanian Commonwealth')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q13539802'), ('name', 'place with town rights and privileges')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1549591'), ('name', 'big city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15647906'), ('name', 'city of Portugal')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2264924'), ('name', 'port settlement')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q250811'), ('name', 'sub-province-level division')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q25412763'), ('name', 'city in Chile')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q2616791'), ('name', 'urban municipality of Poland')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q42744322'), ('name', 'urban municipality of Germany')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q537250'), ('name', 'federal city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q54935504'), ('name', 'city of Switzerland')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q55440238'), ('name', 'city in Alberta')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q677678'), ('name', 'fortified town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q707813'), ('name', 'Hanseatic city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q748149'), ('name', 'prefecture-level city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q12102963'), ('name', 'city specifically designated in the state plan')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q15273785'), ('name', 'Belgian municipality with the title of city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q3249005'), ('name', 'provincial city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q494721'), ('name', 'city of Japan')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q7819319'), ('name', 'Czech municipality with expanded powers')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q8452914'), ('name', 'district town')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q3559093'), ('name', 'sanctuary city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q652360'), ('name', 'sustainable city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q1231558'), ('name', 'smart city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q108454687'), ('name', 'half million city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q262882'), ('name', 'statutory city of Austria')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q713146'), ('name', 'County-administered city')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q925381'), ('name', 'city with powiat rights')]\n",
      "[('city', 'http://www.wikidata.org/entity/Q34843301'), ('name', 'capital of county in Romania')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# not what I'm looking for.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?city ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?city wdt:P279 wd:Q515 ;\n",
    "       sc:name ?name .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "1f883bc6-2570-4ee5-9d1d-82e221787851",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Another approach could be to see the relations between Dante and Florence(as we have the BGP of both) hoping Dante has studied is Florence.\n",
    "# Apparently not.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1067 ?p wd:Q2044 .\n",
    "   ?p sc:name ?name .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "3c05f59d-9ec5-4b36-90c8-fa6a0d5bf2ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P509'), ('name', 'cause of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6886'), ('name', 'writing language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "#maybe Dante doesn't have the field city of education but Giovanni Boccaccio does?\n",
    "#Apparently not\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1402 ?p ?o . \n",
    "   # get the label\n",
    "   ?p sc:name ?name .\n",
    "   FILTER(!isLiteral(?o)) .\n",
    "}\n",
    "LIMIT 40\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "24691aaa-c825-4061-aed3-87b51cf9a734",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q736348'), ('name', 'Cino da Pistoia')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#Maybe the property student of can help us\n",
    "#Seems to give the name of his teacher maybe this will bring us to a university\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1402 wdt:P1066 ?o . \n",
    "   # get the label\n",
    "   ?o sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "73398c9a-14de-43ec-9e8d-b5225e255cc3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('namep', 'employer'), ('o', 'http://www.wikidata.org/entity/Q1245999'), ('name', 'University of Siena')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('namep', 'employer'), ('o', 'http://www.wikidata.org/entity/Q748085'), ('name', 'University of Perugia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('namep', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1209498'), ('name', 'poet lawyer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('namep', 'employer'), ('o', 'http://www.wikidata.org/entity/Q131262'), ('name', 'University of Bologna')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('namep', 'educated at'), ('o', 'http://www.wikidata.org/entity/Q131262'), ('name', 'University of Bologna')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('namep', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q1622272'), ('name', 'university teacher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('namep', 'occupation'), ('o', 'http://www.wikidata.org/entity/Q185351'), ('name', 'jurist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('namep', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q19180675'), ('name', 'Small Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('namep', 'languages spoken, written or signed'), ('o', 'http://www.wikidata.org/entity/Q397'), ('name', 'Latin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('namep', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q51955019'), ('name', 'BEIC Digital Library')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('namep', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q602358'), ('name', 'Brockhaus and Efron Encyclopedic Dictionary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('namep', 'languages spoken, written or signed'), ('o', 'http://www.wikidata.org/entity/Q652'), ('name', 'Italian')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('namep', 'sex or gender'), ('o', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('namep', 'copyright status as a creator'), ('o', 'http://www.wikidata.org/entity/Q71887839'), ('name', 'copyrights on works have expired')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('namep', 'employer'), ('o', 'http://www.wikidata.org/entity/Q820887'), ('name', 'University of Florence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('namep', 'place of death'), ('o', 'http://www.wikidata.org/entity/Q13376'), ('name', 'Pistoia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('namep', 'place of birth'), ('o', 'http://www.wikidata.org/entity/Q13376'), ('name', 'Pistoia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('namep', 'student of'), ('o', 'http://www.wikidata.org/entity/Q1226745'), ('name', 'Dinus de Rossonis')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('namep', 'given name'), ('o', 'http://www.wikidata.org/entity/Q3677254'), ('name', 'Cino')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#we've obtained not only some universities but also the property educated at\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?namep ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q736348 ?p ?o . \n",
    "   # get the label\n",
    "   ?p sc:name ?namep .\n",
    "   ?o sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "ef2dc115-c7a2-4288-b15f-5e4329ff969c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('namep', 'member of'), ('o', 'http://www.wikidata.org/entity/Q19861084'), ('name', 'ORCID, Inc.')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('namep', 'headquarters location'), ('o', 'http://www.wikidata.org/entity/Q2751'), ('name', 'Siena')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('namep', 'located in the administrative territorial entity'), ('o', 'http://www.wikidata.org/entity/Q2751'), ('name', 'Siena')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('namep', 'country'), ('o', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q3918'), ('name', 'university')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q45400320'), ('name', 'open-access publisher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('namep', 'language used'), ('o', 'http://www.wikidata.org/entity/Q652'), ('name', 'Italian')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('namep', 'member of'), ('o', 'http://www.wikidata.org/entity/Q868940'), ('name', 'European University Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('namep', 'member of'), ('o', 'http://www.wikidata.org/entity/Q211620'), ('name', 'Coimbra Group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1416'), ('namep', 'affiliation'), ('o', 'http://www.wikidata.org/entity/Q211620'), ('name', 'Coimbra Group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4195'), ('namep', 'category for employees of the organization'), ('o', 'http://www.wikidata.org/entity/Q8884453'), ('name', 'Category:University of Siena faculty')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3876'), ('namep', 'category for alumni of educational institution'), ('o', 'http://www.wikidata.org/entity/Q9757751'), ('name', 'Category:University of Siena alumni')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('namep', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8884451'), ('name', 'Category:University of Siena')]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "#we're looking at the University of Siena to find the PGB of university and see how it is linked to city\n",
    "#we're retrieving the property located in the administrative territorial entity\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?namep ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1245999 ?p ?o . \n",
    "   # get the label\n",
    "   ?p sc:name ?namep .\n",
    "   ?o sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "9eb1e152",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q220'), ('city', 'Rome'), ('nbpoets', '213')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2044'), ('city', 'Florence'), ('nbpoets', '179')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2634'), ('city', 'Naples'), ('nbpoets', '136')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q490'), ('city', 'Milan'), ('nbpoets', '131')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q641'), ('city', 'Venice'), ('nbpoets', '93')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q1449'), ('city', 'Genoa'), ('nbpoets', '72')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q495'), ('city', 'Turin'), ('nbpoets', '60')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q546'), ('city', 'Trieste'), ('nbpoets', '59')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q1891'), ('city', 'Bologna'), ('nbpoets', '57')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q617'), ('city', 'Padua'), ('nbpoets', '49')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2028'), ('city', 'Verona'), ('nbpoets', '44')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2656'), ('city', 'Palermo'), ('nbpoets', '40')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q13362'), ('city', 'Ferrara'), ('nbpoets', '31')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q13666'), ('city', 'Messina'), ('nbpoets', '30')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2751'), ('city', 'Siena'), ('nbpoets', '29')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q2683'), ('city', 'Parma'), ('nbpoets', '25')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q6537'), ('city', 'Vicenza'), ('nbpoets', '24')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q13373'), ('city', 'Lucca'), ('nbpoets', '24')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q1903'), ('city', 'Catania'), ('nbpoets', '24')]\n",
      "[('birthplace', 'http://www.wikidata.org/entity/Q279'), ('city', 'Modena'), ('nbpoets', '23')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#query without the city of education is working\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?birthplace ?city (COUNT(?poet) as ?nbpoets)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ; #a poet\n",
    "        sc:name ?name ;\n",
    "        wdt:P19 ?birthplace .\n",
    "   ?birthplace sc:name ?city ;\n",
    "           wdt:P17 wd:Q38 .\n",
    "} ORDER BY DESC(?nbpoets)\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "e8dce4ce-f4cd-4187-9081-4d58e21b5914",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q25106'), ('city', 'Genoa'), ('educ', 'Genoa')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q318309'), ('city', 'Bologna'), ('educ', 'Bologna')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q675583'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q273334'), ('city', 'Naples'), ('educ', 'Naples')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1130258'), ('city', 'Parma'), ('educ', 'Parma')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q535810'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q659749'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q153670'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q733342'), ('city', 'Padua'), ('educ', 'Padua')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q919900'), ('city', 'Padua'), ('educ', 'Padua')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q350103'), ('city', 'Genoa'), ('educ', 'Genoa')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1246391'), ('city', 'Urbino'), ('educ', 'Urbino')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q724672'), ('city', 'Ferrara'), ('educ', 'Ferrara')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1227036'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q354085'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3941603'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q778716'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1131281'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q25120'), ('city', 'Bologna'), ('educ', 'Bologna')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1399'), ('city', 'Florence'), ('educ', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3610195'), ('city', 'Florence'), ('educ', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q558128'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q560126'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3659951'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q507595'), ('city', 'Bari'), ('educ', 'Bari')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3665362'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1439364'), ('city', 'Florence'), ('educ', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q16573950'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q291866'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3852568'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3877170'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q23017315'), ('city', 'Chieti'), ('educ', 'Chieti')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q334147'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q867740'), ('city', 'Rome'), ('educ', 'Rome')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q366270'), ('city', 'Bologna'), ('educ', 'Bologna')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q52154284'), ('city', 'Naples'), ('educ', 'Naples')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3724536'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q272797'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q2529303'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3107905'), ('city', 'Padua'), ('educ', 'Padua')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3851007'), ('city', 'Florence'), ('educ', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1246106'), ('city', 'Florence'), ('educ', 'Florence')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1092012'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3838573'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q378645'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q1876253'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q26649297'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q89654187'), ('city', 'Milan'), ('educ', 'Milan')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3106894'), ('city', 'Turin'), ('educ', 'Turin')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q3972451'), ('city', 'Padua'), ('educ', 'Padua')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?city ?educ\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ; #a poet\n",
    "        wdt:P19 ?birthplace ;\n",
    "        wdt:P69 ?university .\n",
    "   ?birthplace sc:name ?city ;\n",
    "        wdt:P17 wd:Q38 .\n",
    "   ?university wdt:P131 ?educationcity .\n",
    "   ?educationcity sc:name ?educ .\n",
    "   FILTER (?birthplace = ?educationcity)\n",
    "} \n",
    "LIMIT 50 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0f8bb04e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "f8a732f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('city2', 'Rome'), ('nbpoets', '16')]\n",
      "[('city2', 'Milan'), ('nbpoets', '14')]\n",
      "[('city2', 'Florence'), ('nbpoets', '9')]\n",
      "[('city2', 'Turin'), ('nbpoets', '9')]\n",
      "[('city2', 'Padua'), ('nbpoets', '4')]\n",
      "[('city2', 'Bologna'), ('nbpoets', '4')]\n",
      "[('city2', 'Genoa'), ('nbpoets', '3')]\n",
      "[('city2', 'Trieste'), ('nbpoets', '2')]\n",
      "[('city2', 'Parma'), ('nbpoets', '2')]\n",
      "[('city2', 'Naples'), ('nbpoets', '2')]\n",
      "[('city2', 'Urbino'), ('nbpoets', '2')]\n",
      "[('city2', 'Ferrara'), ('nbpoets', '1')]\n",
      "[('city2', 'Terlizzi'), ('nbpoets', '1')]\n",
      "[('city2', 'Catania'), ('nbpoets', '1')]\n",
      "[('city2', 'Bari'), ('nbpoets', '1')]\n",
      "[('city2', 'Siena'), ('nbpoets', '1')]\n",
      "[('city2', 'Sassari'), ('nbpoets', '1')]\n",
      "[('city2', 'Messina'), ('nbpoets', '1')]\n",
      "[('city2', 'Chieti'), ('nbpoets', '1')]\n",
      "[('city2', 'Prato'), ('nbpoets', '1')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?city2 (COUNT(?poet2) as ?nbpoets) WHERE {\n",
    "    ?poet2 wdt:P106 wd:Q49757 ; #a poet\n",
    "            wdt:P19 ?birthplace2 .\n",
    "    ?birthplace2 sc:name ?city2 .       \n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT ?poet ?city\n",
    "        WHERE {\n",
    "           # bind something\n",
    "           ?poet wdt:P106 wd:Q49757 ; #a poet\n",
    "                wdt:P19 ?birthplace ;\n",
    "                wdt:P69 ?university .\n",
    "           ?birthplace sc:name ?city ;\n",
    "                wdt:P17 wd:Q38 .\n",
    "           ?university wdt:P131 ?educationcity .\n",
    "           FILTER (?birthplace = ?educationcity)\n",
    "        } \n",
    "    }\n",
    "    FILTER (?poet2 = ?poet)\n",
    "} GROUP BY ?city2\n",
    "ORDER BY DESC(?nbpoets)\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93279777",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Return the italian poets who won the Nobel Prize in Literature (the result set must be poet IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "feaab88e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('namep', 'field of this occupation'), ('o', 'http://www.wikidata.org/entity/Q37260'), ('name', 'writing')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('namep', 'field of this occupation'), ('o', 'http://www.wikidata.org/entity/Q2250012'), ('name', 'writing')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('namep', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q5849863'), ('name', 'Category:Writers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('namep', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P50'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q12737077'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('namep', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q4164871'), ('name', 'position')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('namep', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q482980'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('namep', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q98970039'), ('name', 'WikiProject PCC Wikidata Pilot/University of Washington')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('namep', 'has list'), ('o', 'http://www.wikidata.org/entity/Q13019738'), ('name', 'list of lists of writers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('namep', 'category for eponymous categories'), ('o', 'http://www.wikidata.org/entity/Q6963972'), ('name', 'Category:Wikipedia categories named after writers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('namep', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P2093'), ('name', 'author name string')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('namep', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q5615832'), ('name', 'Template:Infobox writer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('namep', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q6535605'), ('name', 'Template:Writer-stub')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# As the Nobel Prize of Literature is something given to writers(I think) we're retrieving the properties of writer\n",
    "# results not very relevant\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?namep ?o ?name  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36180 ?p ?o .\n",
    "    ?p sc:name ?namep .\n",
    "   ?o sc:name ?name .\n",
    "} \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "29b259e9-7db5-41fc-8534-ce12807404c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q15734590'), ('nameS', 'Alma Sundquist'), ('o', 'http://www.wikidata.org/entity/Q15734554'), ('name', 'Thora Wigardh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4969542'), ('nameS', 'Ada Nilsson'), ('o', 'http://www.wikidata.org/entity/Q15734554'), ('name', 'Thora Wigardh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4767613'), ('nameS', 'Anna Whitlock'), ('o', 'http://www.wikidata.org/entity/Q15734554'), ('name', 'Thora Wigardh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4990100'), ('nameS', 'Lydia Wahlström'), ('o', 'http://www.wikidata.org/entity/Q15734554'), ('name', 'Thora Wigardh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q106903887'), ('nameS', 'Petroccelli'), ('o', 'http://www.wikidata.org/entity/Q16059906'), ('name', 'Vincenzo Petroccelli')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q485664'), ('nameS', 'Sukjong of Joseon'), ('o', 'http://www.wikidata.org/entity/Q16184469'), ('name', 'Nam Gu-man')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q466623'), ('nameS', 'Elsa Beskow'), ('o', 'http://www.wikidata.org/entity/Q462879'), ('name', 'Alice Tegnér')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4990938'), ('nameS', 'Lilli Zickerman'), ('o', 'http://www.wikidata.org/entity/Q17493718'), ('name', 'Anna Wettergren-Behm')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1611548'), ('nameS', 'Hermann Huber'), ('o', 'http://www.wikidata.org/entity/Q214564'), ('name', 'Ferdinand Hodler')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2023784'), ('nameS', 'Hooge Crater Cemetery'), ('o', 'http://www.wikidata.org/entity/Q21664044'), ('name', 'Albert Stewart')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q370217'), ('nameS', 'Dustin Moskovitz'), ('o', 'http://www.wikidata.org/entity/Q36215'), ('name', 'Mark Zuckerberg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3320915'), ('nameS', 'David Bravo Bueno'), ('o', 'http://www.wikidata.org/entity/Q21936906'), ('name', 'Wismichu')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q21936906'), ('nameS', 'Wismichu'), ('o', 'http://www.wikidata.org/entity/Q3320915'), ('name', 'David Bravo Bueno')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q21936906'), ('nameS', 'Wismichu'), ('o', 'http://www.wikidata.org/entity/Q59514029'), ('name', 'Dalas Review')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2433150'), ('nameS', '1983 NASCAR Winston Cup Series'), ('o', 'http://www.wikidata.org/entity/Q2061570'), ('name', 'Sterling Marlin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q127434'), ('nameS', '2005 NHL Entry Draft'), ('o', 'http://www.wikidata.org/entity/Q311280'), ('name', 'Sidney Crosby')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6034'), ('nameS', 'Dada'), ('o', 'http://www.wikidata.org/entity/Q463411'), ('name', 'Hannah Höch')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q67815'), ('nameS', 'Helmina von Chézy'), ('o', 'http://www.wikidata.org/entity/Q468618'), ('name', 'Dominique Vivant')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q160202'), ('nameS', 'Franz Anton Mesmer'), ('o', 'http://www.wikidata.org/entity/Q26246856'), ('name', 'Franziska von Posch')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q26832770'), ('nameS', 'Galerie Chirvan'), ('o', 'http://www.wikidata.org/entity/Q16524645'), ('name', 'Adriano Gajoni')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1611548'), ('nameS', 'Hermann Huber'), ('o', 'http://www.wikidata.org/entity/Q15807329'), ('name', 'Eduard Bick')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1611548'), ('nameS', 'Hermann Huber'), ('o', 'http://www.wikidata.org/entity/Q27229278'), ('name', 'Thomas Ernst Gubler')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243280'), ('nameS', 'Bonadea'), ('o', 'http://www.wikidata.org/entity/Q30106696'), ('name', 'Ulrich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243389'), ('nameS', 'Clarisse'), ('o', 'http://www.wikidata.org/entity/Q30106696'), ('name', 'Ulrich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243402'), ('nameS', 'Walter'), ('o', 'http://www.wikidata.org/entity/Q30106696'), ('name', 'Ulrich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243528'), ('nameS', 'Paul Arnheim'), ('o', 'http://www.wikidata.org/entity/Q30106696'), ('name', 'Ulrich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30250689'), ('nameS', 'Gerda Fischel'), ('o', 'http://www.wikidata.org/entity/Q30106696'), ('name', 'Ulrich')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30106696'), ('nameS', 'Ulrich'), ('o', 'http://www.wikidata.org/entity/Q30243280'), ('name', 'Bonadea')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243528'), ('nameS', 'Paul Arnheim'), ('o', 'http://www.wikidata.org/entity/Q30243330'), ('name', 'Diotima')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30250839'), ('nameS', 'Count Leinsdorf'), ('o', 'http://www.wikidata.org/entity/Q30243330'), ('name', 'Diotima')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1501666'), ('nameS', 'General Stumm von Bordwehr'), ('o', 'http://www.wikidata.org/entity/Q30243330'), ('name', 'Diotima')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30106696'), ('nameS', 'Ulrich'), ('o', 'http://www.wikidata.org/entity/Q30243389'), ('name', 'Clarisse')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30106696'), ('nameS', 'Ulrich'), ('o', 'http://www.wikidata.org/entity/Q30243402'), ('name', 'Walter')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30106696'), ('nameS', 'Ulrich'), ('o', 'http://www.wikidata.org/entity/Q30243528'), ('name', 'Paul Arnheim')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243330'), ('nameS', 'Diotima'), ('o', 'http://www.wikidata.org/entity/Q30243528'), ('name', 'Paul Arnheim')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30106696'), ('nameS', 'Ulrich'), ('o', 'http://www.wikidata.org/entity/Q30250689'), ('name', 'Gerda Fischel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30243330'), ('nameS', 'Diotima'), ('o', 'http://www.wikidata.org/entity/Q30250839'), ('name', 'Count Leinsdorf')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q91336419'), ('nameS', 'Tommy Merlyn'), ('o', 'http://www.wikidata.org/entity/Q19866576'), ('name', 'Oliver Queen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q19866576'), ('nameS', 'Oliver Queen'), ('o', 'http://www.wikidata.org/entity/Q91336419'), ('name', 'Tommy Merlyn')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q30652305'), ('nameS', 'Cage of la Corriveau'), ('o', 'http://www.wikidata.org/entity/Q3291969'), ('name', 'Marie-Josephte Corriveau')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2758129'), ('nameS', 'Helena Harper'), ('o', 'http://www.wikidata.org/entity/Q16565826'), ('name', 'Ingrid Hunnigan')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1138965'), ('nameS', 'Leon Scott Kennedy'), ('o', 'http://www.wikidata.org/entity/Q16565826'), ('name', 'Ingrid Hunnigan')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16565826'), ('nameS', 'Ingrid Hunnigan'), ('o', 'http://www.wikidata.org/entity/Q2758129'), ('name', 'Helena Harper')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1138965'), ('nameS', 'Leon Scott Kennedy'), ('o', 'http://www.wikidata.org/entity/Q2758129'), ('name', 'Helena Harper')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q104450705'), ('nameS', 'Processo do padre António Vieira'), ('o', 'http://www.wikidata.org/entity/Q458650'), ('name', 'António Vieira')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8134'), ('nameS', 'economics'), ('o', 'http://www.wikidata.org/entity/Q9317'), ('name', 'John Maynard Keynes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q11634'), ('nameS', 'art of sculpture'), ('o', 'http://www.wikidata.org/entity/Q1122412'), ('name', 'Giannino Castiglioni')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q485009'), ('nameS', 'Yeongjo of Joseon'), ('o', 'http://www.wikidata.org/entity/Q12588940'), ('name', 'Kim Chang-jip')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q485009'), ('nameS', 'Yeongjo of Joseon'), ('o', 'http://www.wikidata.org/entity/Q12596325'), ('name', 'Min Jin-won')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q485009'), ('nameS', 'Yeongjo of Joseon'), ('o', 'http://www.wikidata.org/entity/Q16178177'), ('name', 'Kim Jae-ro')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# we have a property Significant Person, maybe we can use it. First we'll try to see what there is in it\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?nameS ?o ?name  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P3342 ?o .\n",
    "    ?s sc:name ?nameS .\n",
    "   ?o sc:name ?name .\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "b0abba40-4d73-4b0c-a9b9-8200e0bbe0d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q21936906'), ('nameS', 'Wismichu')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q468618'), ('nameS', 'Dominique Vivant')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q104450705'), ('nameS', 'Processo do padre António Vieira')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q958683'), ('nameS', 'Nick Kamen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2642427'), ('nameS', 'Albert Engström')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48235'), ('nameS', 'stoicism')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q485009'), ('nameS', 'Yeongjo of Joseon')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q77079'), ('nameS', 'Jean Paul')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4988547'), ('nameS', 'Ida Gawell-Blumenthal')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q549109'), ('nameS', 'Artur Hazelius')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q552288'), ('nameS', 'R. H. Barlow')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57074'), ('nameS', 'Nelly Sachs')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3816'), ('nameS', 'George Sand')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3296046'), ('nameS', 'Marvel Productions')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q380937'), ('nameS', 'Erik Gustaf Geijer')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q55037230'), ('nameS', 'Stéphanie Félicité Ducrest de Saint-Aubin de Genlis')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243068'), ('nameS', 'Anne Charlotte Leffler')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4939281'), ('nameS', 'Olga Björkegren')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4967393'), ('nameS', 'Ruth Milles')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q469339'), ('nameS', 'Alfhild Agrell')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215691'), ('nameS', 'Karl August Varnhagen von Ense')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29324277'), ('nameS', 'tomb of Garsenda of Sabran, comtesse of Forcalquier')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q184535'), ('nameS', 'Sofia Kovalevskaya')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q39427'), ('nameS', 'surrealism')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48589'), ('nameS', 'Zenta Mauriņa')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q58586'), ('nameS', 'Edmund Husserl')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q94514551'), ('nameS', 'Else Seel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q89625'), ('nameS', 'Ludwig von Ficker')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q163366'), ('nameS', 'Ezra Pound')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q172684'), ('nameS', 'Aleister Crowley')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25107'), ('nameS', 'power')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q5062902'), ('nameS', 'The Lee Strasberg Theatre Institute')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q93210691'), ('nameS', 'Sydna Edmonia Robella Francis')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15734590'), ('nameS', 'Alma Sundquist')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q238443'), ('nameS', 'Ellen Key')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q270468'), ('nameS', 'Elin Wägner')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4568363'), ('nameS', 'Barbro Alving')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4940406'), ('nameS', 'Elin Brandell')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4948398'), ('nameS', 'Emilia Fogelklou')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4953745'), ('nameS', 'Honorine Hermelin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4953847'), ('nameS', 'Kerstin Hesselgren')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4954629'), ('nameS', 'Britta Holmström')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4969542'), ('nameS', 'Ada Nilsson')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4976087'), ('nameS', 'Ellen Rydelius')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4980157'), ('nameS', 'Frida Stéenhoff')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4981979'), ('nameS', 'Elisabeth Tamm')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50803162'), ('nameS', 'Flory Gate')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50809185'), ('nameS', 'Ellen Landquist')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q50926751'), ('nameS', 'Klara Lindh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1500'), ('nameS', 'José Rizal')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1611548'), ('nameS', 'Hermann Huber')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q312542'), ('nameS', 'Marcelo H. del Pilar')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4970016'), ('nameS', 'Alice Nordin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q27841'), ('nameS', 'economic anthropology')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4766181'), ('nameS', 'Ann-Margret Holmgren')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q431143'), ('nameS', 'Božena Benešová')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q434056'), ('nameS', 'Anna Branting')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4953125'), ('nameS', 'Alma Hedin')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4976841'), ('nameS', 'Maria Sandel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q53620'), ('nameS', 'Hjalmar Branting')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q462363'), ('nameS', 'Helen Hunt Jackson')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q51800428'), ('nameS', 'Mathilde Wigert-Österlund')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q484359'), ('nameS', 'Seonjo of Joseon')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q262145'), ('nameS', 'Fredrika Bremer')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q157271'), ('nameS', 'Friedrich Schlegel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3172270'), ('nameS', 'Johann Gottfried Schweighäuser')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3181548'), ('nameS', 'Kutsuki Masatsuna')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q67815'), ('nameS', 'Helmina von Chézy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q77271'), ('nameS', 'Dorothea von Schlegel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q5164922'), ('nameS', 'Contax I')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q5169832'), ('nameS', 'Corcadorca Theatre Company')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4959294'), ('nameS', 'Thekla Knös')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3992'), ('nameS', 'Liège')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7197'), ('nameS', 'Simone de Beauvoir')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8134'), ('nameS', 'economics')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9364'), ('nameS', 'Jean-Paul Sartre')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6504956'), ('nameS', 'data visualization')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q707629'), ('nameS', 'Northeast Anti-Japanese United Army')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2002653'), ('nameS', 'amor fati')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4410099'), ('nameS', 'Dmitry Sverbeyev')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q23988983'), ('nameS', 'Eva Upmark')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q466623'), ('nameS', 'Elsa Beskow')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4767613'), ('nameS', 'Anna Whitlock')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4937621'), ('nameS', 'Signe Barth')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4953755'), ('nameS', 'Elisabet Hermodsson')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q546949'), ('nameS', 'Malla Silfverstolpe')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q63247022'), ('nameS', 'Margareta Beckius')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q71259399'), ('nameS', 'Anna Lisa Rolf')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q99776118'), ('nameS', 'Wilhelmina Natalia Palmaer')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q154812'), ('nameS', 'Carl Maria von Weber')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6034'), ('nameS', 'Dada')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q61793'), ('nameS', 'Rahel Varnhagen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1631'), ('nameS', 'Édith Piaf')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q152437'), ('nameS', 'Alva Myrdal')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q365858'), ('nameS', 'Knut Wicksell')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q828580'), ('nameS', 'Jack Garfein')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1118654'), ('nameS', 'institutional economics')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q193959'), ('nameS', 'marketing mix')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q44403'), ('nameS', 'Heinrich Heine')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q160202'), ('nameS', 'Franz Anton Mesmer')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# It's strange. For Keynes for example, it seems that the object of Significant person is a person and the subject, the reason why. But it doesn't seem the case most of the time.\n",
    "# We'll try to put the object as a writer, we'll see what we can obtain\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?nameS\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?writer wdt:P106 wd:Q36180 .\n",
    "   ?s wdt:P3342 ?writer ;\n",
    "       sc:name ?nameS .\n",
    "} \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "b40be60a-be97-45d1-a16d-15f119e17a74",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q468618'), ('names', 'Dominique Vivant')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q63213350'), ('names', 'Sentiero di Leonardo da Vinci')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q958683'), ('names', 'Nick Kamen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q77079'), ('names', 'Jean Paul')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q108427348'), ('names', \"Marie-Marguerite d'Alègre\")]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4988547'), ('names', 'Ida Gawell-Blumenthal')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q552288'), ('names', 'R. H. Barlow')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q57074'), ('names', 'Nelly Sachs')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3816'), ('names', 'George Sand')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q738671'), ('names', 'Val Bregaglia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q55037230'), ('names', 'Stéphanie Félicité Ducrest de Saint-Aubin de Genlis')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q243068'), ('names', 'Anne Charlotte Leffler')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215691'), ('names', 'Karl August Varnhagen von Ense')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29324277'), ('names', 'tomb of Garsenda of Sabran, comtesse of Forcalquier')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q39427'), ('names', 'surrealism')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48589'), ('names', 'Zenta Mauriņa')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q94514551'), ('names', 'Else Seel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q89625'), ('names', 'Ludwig von Ficker')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q163366'), ('names', 'Ezra Pound')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q172684'), ('names', 'Aleister Crowley')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25107'), ('names', 'power')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1611548'), ('names', 'Hermann Huber')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q312542'), ('names', 'Marcelo H. del Pilar')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q462363'), ('names', 'Helen Hunt Jackson')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q484359'), ('names', 'Seonjo of Joseon')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q157271'), ('names', 'Friedrich Schlegel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3172270'), ('names', 'Johann Gottfried Schweighäuser')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q67815'), ('names', 'Helmina von Chézy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q77271'), ('names', 'Dorothea von Schlegel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4959294'), ('names', 'Thekla Knös')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8134'), ('names', 'economics')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3485863'), ('names', 'Siege of Constantinople')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15581'), ('names', 'Principality of Catalonia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2002653'), ('names', 'amor fati')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4410099'), ('names', 'Dmitry Sverbeyev')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q466623'), ('names', 'Elsa Beskow')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q546949'), ('names', 'Malla Silfverstolpe')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6577515'), ('names', 'Samuel')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q90838008'), ('names', 'Armenian Relief Committee - French section')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q334308'), ('names', 'Sejo of Joseon')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q42935'), ('names', 'Mandello del Lario')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6237'), ('names', 'Lecco')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q154812'), ('names', 'Carl Maria von Weber')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6034'), ('names', 'Dada')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q61793'), ('names', 'Rahel Varnhagen')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1631'), ('names', 'Édith Piaf')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q828580'), ('names', 'Jack Garfein')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q44403'), ('names', 'Heinrich Heine')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q813280'), ('names', 'Beatrice d’Este')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q35548'), ('names', 'Paul Cézanne')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# It seems that we have also painters and economists in the list. Maybe we can reduce with poets.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?names\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 .\n",
    "   ?s wdt:P3342 ?poet ;\n",
    "       sc:name ?names .\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "ed34d532-9e3d-4615-b2a6-6e89e89f8ec9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('name', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1419'), ('name', 'shape')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('name', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('name', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1589'), ('name', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1622'), ('name', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('name', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1740'), ('name', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1791'), ('name', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('name', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('name', 'office held by head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('name', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('name', 'located in or next to body of water')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('name', 'executive body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P209'), ('name', 'highest judicial authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('name', 'coat of arms')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2596'), ('name', 'culture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2633'), ('name', 'geography of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2852'), ('name', 'emergency telephone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2853'), ('name', 'electrical plug type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('name', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P35'), ('name', 'head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('name', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3896'), ('name', 'geoshape')]\n",
      "40\n"
     ]
    }
   ],
   "source": [
    "# Don't know if it's cheating but doing the NBA workflow we found the property award received by retrieving the properties of France\n",
    "#So we're gonna try to find again this property with what we have there, Italy\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?o .\n",
    "   ?p sc:name ?name .\n",
    "   FILTER (!isLiteral(?o)).\n",
    "} \n",
    "LIMIT 40\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "4b1a5a13-0747-495b-9565-95fef1b08721",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q3624078'), ('name', 'sovereign state')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6256'), ('name', 'country')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#nothing, but we'll just look for the BGP of France then. For that we need the PGB of country\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 wdt:P31 ?o .\n",
    "   ?o sc:name ?name .\n",
    "   FILTER (!isLiteral(?o)).\n",
    "} \n",
    "LIMIT 40\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "d703e343-02c7-4c70-aa15-dacbdf216628",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q756617'), ('name', 'Danish Realm')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q907112'), ('name', 'Transnistria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q184'), ('name', 'Belarus')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q20'), ('name', 'Norway')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q222'), ('name', 'Albania')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q22880'), ('name', 'Electoral Palatinate')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q232'), ('name', 'Kazakhstan')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q236'), ('name', 'Montenegro')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q25'), ('name', 'Wales')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 wdt:P30 ?continent .\n",
    "   ?country wdt:P31  wd:Q6256 ;\n",
    "        wdt:P30 ?continent ;\n",
    "        sc:name ?name .\n",
    "} \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "fbf526d3-9f05-43b4-bc08-cf7eb816aa86",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('name', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('name', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('name', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1482'), ('name', 'Stack Exchange tag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1546'), ('name', 'motto')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P158'), ('name', 'seal image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1589'), ('name', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1622'), ('name', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('name', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#and there we have the award received property\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q142 ?p ?o .\n",
    "   ?p sc:name ?name .\n",
    "   FILTER (!isLiteral(?o)).\n",
    "} \n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "eec57386-b478-4d7d-a15e-1d3173133d50",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q2108706'), ('name', 'Premio Campiello')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q18608364'), ('name', 'Commander with star of the Order of St. Sylvester')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q519214'), ('name', 'Nelly Sachs Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q7650000'), ('name', 'Sutherland Trophy')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1526935'), ('name', 'Viareggio Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q788568'), ('name', 'Bagutta Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q731542'), ('name', 'Strega Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q14539729'), ('name', 'Commander of the Order of Merit of the Italian Republic')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q14539974'), ('name', 'Knight Grand Cross of the Order of Merit of the Italian Republic')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q154590'), ('name', 'Golden Bear')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q179808'), ('name', \"Palme d'Or\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q209459'), ('name', 'Golden Lion')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q514445'), ('name', 'European Film Academy Lifetime Achievement Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3703463'), ('name', 'David di Donatello for Best Director')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q727328'), ('name', 'Academy Honorary Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1315008'), ('name', 'National Society of Film Critics Award for Best Director')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q599434'), ('name', 'Feltrinelli Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1700510'), ('name', 'Golden Leopard')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q164200'), ('name', 'Jury Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3703245'), ('name', 'David Luchino Visconti')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q55455135'), ('name', 'honorary doctorate of the Bordeaux Montaigne University')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q844284'), ('name', 'Grawemeyer Award for Music Composition')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3910584'), ('name', 'Marzotto Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3241784'), ('name', 'Golden Lion for Lifetime Achievements')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3870549'), ('name', \"Nastro d'Argento for Best Actor\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2085270'), ('name', 'Order of the Badge of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q791135'), ('name', 'Order of Friendship')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2268261'), ('name', 'Order of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3405076'), ('name', 'Prix Médicis for foreign literature')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q60642820'), ('name', 'Viareggio-Versilia International Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3404594'), ('name', 'Prix Formentor')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3405086'), ('name', 'Napoli Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1662330'), ('name', \"Globo d'oro\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3607619'), ('name', \"Alabarda d'Oro Award\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1966051'), ('name', \"Nastro d'Argento for Best Screenplay\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2089923'), ('name', 'Volpi Cup for Best Actor')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q96382035'), ('name', 'Bonavera Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q327154'), ('name', 'Hans Christian Andersen Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q128649'), ('name', 'David di Donatello for Best Actor')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q13452528'), ('name', 'Chevalier des Arts et des Lettres')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20898906'), ('name', 'Golden Wreath')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2972198'), ('name', \"Ciak d'oro\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q96895980'), ('name', 'Honorary degree of the University of Macerata')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3870546'), ('name', \"Nastro d'Argento for Best New Director\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q978420'), ('name', 'Best Screenplay Award (Cannes Film Festival)')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q674146'), ('name', 'Leopard of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1052227'), ('name', 'Kinema Junpo')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q107258'), ('name', 'Academy Award for Best Writing, Adapted Screenplay')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q10855271'), ('name', 'Knight of the Legion of Honour')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#we're looking a the prizes won by Italian poets\n",
    "#Nobel prize is not there, but there is a lot of local prizes maybe reducing with those also receiving by French poets\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ;\n",
    "        wdt:P27 wd:Q38 ;\n",
    "        wdt:P166 ?award .\n",
    "   ?award sc:name ?name .\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "840a6dad-43df-4059-9108-3402e8bc200a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q519214'), ('name', 'Nelly Sachs Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q14539974'), ('name', 'Knight Grand Cross of the Order of Merit of the Italian Republic')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q55455135'), ('name', 'honorary doctorate of the Bordeaux Montaigne University')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3405076'), ('name', 'Prix Médicis for foreign literature')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q60642820'), ('name', 'Viareggio-Versilia International Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3404594'), ('name', 'Prix Formentor')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q13452528'), ('name', 'Chevalier des Arts et des Lettres')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q20898906'), ('name', 'Golden Wreath')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q674146'), ('name', 'Leopard of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q10855271'), ('name', 'Knight of the Legion of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17985761'), ('name', 'star on Hollywood Walk of Fame')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3753203'), ('name', 'Gold Medal of Merit in the Fine Arts (Spain)')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q580574'), ('name', 'Neustadt International Prize for Literature')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q9052807'), ('name', 'Orden al Mérito Docente y Cultural Gabriela Mistral')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q37922'), ('name', 'Nobel Prize in Literature')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q57446605'), ('name', 'honorary doctor of the University of Padua')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q16974791'), ('name', 'America Award in Literature')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q50321301'), ('name', \"prix de poésie de l'Académie française\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q13452524'), ('name', 'Officier des Arts et des Lettres\\u200e')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1141859'), ('name', 'Czech Medal of Merit')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2364347'), ('name', 'Andrei Biely Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q308907'), ('name', 'Lenin Peace Prize')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1139785'), ('name', \"Saint George's Cross\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q10855195'), ('name', 'Officer of the Legion of Honour')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q14637188'), ('name', 'Commander of the French Order of Academic Palms')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3114788'), ('name', 'Grand prix de la francophonie')]\n",
      "26\n"
     ]
    }
   ],
   "source": [
    "#and there we (finally) have the Nobel Prize in Literature\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ;\n",
    "        wdt:P27 wd:Q38 ;\n",
    "        wdt:P166 ?award .\n",
    "   ?fpoet wdt:P106 wd:Q49757 ;\n",
    "        wdt:P27 wd:Q142 ;\n",
    "        wdt:P166 ?award2 .\n",
    "   ?award sc:name ?name .\n",
    "   FILTER(?award2 = ?award)\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "6c99f2b3-8b86-43ca-be23-eed82c5d500e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q2707485'), ('name', 'scenographer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q9334029'), ('name', 'satirist')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1028181'), ('name', 'painter')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10800557'), ('name', 'film actor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q214917'), ('name', 'playwright')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2259451'), ('name', 'stage actor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28389'), ('name', 'screenwriter')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3387717'), ('name', 'theatrical director')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q482980'), ('name', 'author')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q49757'), ('name', 'poet')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q644687'), ('name', 'illustrator')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1323191'), ('name', 'costume designer')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "#according to wikipedia Dario Fo is not a poet so I'm verifying the result of my final query\n",
    "#apparently no problem\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q765 wdt:P106 ?o .\n",
    "   ?o sc:name ?name.\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "d43c9f6f-f898-418d-bee2-b8f954c59f6f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('italian', 'http://www.wikidata.org/entity/Q765'), ('name', 'Dario Fo')]\n",
      "[('italian', 'http://www.wikidata.org/entity/Q83038'), ('name', 'Salvatore Quasimodo')]\n",
      "[('italian', 'http://www.wikidata.org/entity/Q83174'), ('name', 'Eugenio Montale')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#according to wikipedia there are other Italian poets who receive the Nobel Prize in Literature so I'm gonna verify the results of my final query\n",
    "#We retrieve all the Italian receiving this Nobel Prize, apparently the data is just incomplete\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?italian ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?italian wdt:P27 wd:Q38 ;\n",
    "       wdt:P166 wd:Q37922 ;\n",
    "       sc:name ?name.\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6c038e8a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "b296ec94",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poet', 'http://www.wikidata.org/entity/Q765'), ('name', 'Dario Fo')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q83038'), ('name', 'Salvatore Quasimodo')]\n",
      "[('poet', 'http://www.wikidata.org/entity/Q83174'), ('name', 'Eugenio Montale')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?poet ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?poet wdt:P106 wd:Q49757 ;\n",
    "        wdt:P27 wd:Q38 ;\n",
    "        wdt:P166 wd:Q37922 ;\n",
    "        sc:name ?name.\n",
    "} \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
