{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "af1fcf15",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a5966eb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-db366238e9-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fb0577a6",
   "metadata": {},
   "source": [
    "# Sport Workflow Series (\"Association Football Players explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the association football players and find the main BGPs related to this sport. Compare players per countries, awards of the players and participation in the FIFA World Cup.\n",
    "\n",
    "**Important consideration: in wikidata, we are talking of ASSOCIATION FOOTBALL**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "56b798a8",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q11571`| Cristiano Ronaldo       | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e798b1f3",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q11571 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Cristiano Ronaldo**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for association football player\n",
    "\n",
    "2. Identify the BGP for association football club\n",
    "\n",
    "3. Identify the BGP for association football league\n",
    "\n",
    "4. Return for each european country the number of association football leagues (the result set must be a list of triples country IRI, label and #leagues).\n",
    "\n",
    "5. Identify the BGP for the ballon d'Or award\n",
    "\n",
    "6. Return the countries which have at least two different players of their nationality (consider the country of citizenship) who won the ballon d'Or (the result set must be a list of triples country IRI, label and #different players).\n",
    "\n",
    "7. Identify the BGP of the FIFA World Cup\n",
    "\n",
    "8. Who are the players who partecipated in more than 4 world's cup editions? (the result set must be a list of triples player IRI, label and #participations).\n",
    "\n",
    "9. Consider the countries that won the FIFA World Cup at least twice. Find the players of those countries won the ballon d'Or (the result set must be a list of couples player IRI and label).\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aceab9c5",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for association football player"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "63f6db64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1750244'), ('name', 'FWA Footballer of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10726649'), ('name', \"PFA Fans' Player of the Year\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182994'), ('name', 'Liga Portugal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12899500'), ('name', 'Cristiano')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20888805'), ('name', 'Commander of the Order of Merit of Portugal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3590758'), ('name', 'Portugal Olympic football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q373501'), ('name', 'UEFA Euro 2020')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20819738'), ('name', 'dos Santos')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1146578'), ('name', 'UEFA Team of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182529'), ('name', 'FIFA World Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q260117'), ('name', \"UEFA Men's Player of the Year Award\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q102920'), ('name', 'UEFA Euro 2004')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1321'), ('name', 'Spanish')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1422'), ('name', 'Juventus F.C.')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15279749'), ('name', 'tax noncompliance')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15804'), ('name', 'Serie A')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q166177'), ('name', \"Ballon d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q170645'), ('name', '2018 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17290934'), ('name', 'Lentapedia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17329836'), ('name', 'Larousse Encyclopedia online')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q176883'), ('name', '2010 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1808301'), ('name', 'Laureus World Sports Award for Sportsman of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18125'), ('name', 'Manchester')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1860'), ('name', 'English')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18656'), ('name', 'Manchester United F.C.')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q189571'), ('name', 'UEFA Euro 2016')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22669'), ('name', 'UEFA Euro 2012')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q241864'), ('name', 'UEFA Euro 2008')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q25444'), ('name', 'Funchal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q280658'), ('name', 'forward')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2807'), ('name', 'Madrid')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q324867'), ('name', 'La Liga')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37285'), ('name', '2006 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4091875'), ('name', 'Great Encyclopedia of Cyril and Methodius')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q495'), ('name', 'Turin')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5'), ('name', 'human')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5146'), ('name', 'Portuguese')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q597'), ('name', 'Lisbon')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6373'), ('name', 'British Museum')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6581097'), ('name', 'male')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q73555012'), ('name', 'works protected by copyrights')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q79859'), ('name', '2014 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8025128'), ('name', 'winger')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q84263196'), ('name', 'COVID-19')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8558'), ('name', '2004 Summer Olympics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q9448'), ('name', 'Premier League')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8682'), ('name', 'Real Madrid CF')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19819804'), ('name', 'Ronaldo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1630430'), ('name', 'Portugal national under-21 football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20860117'), ('name', 'Officer of the Order of Prince Henry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q267245'), ('name', 'Portugal national association football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q75729'), ('name', 'Sporting CP')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20859673'), ('name', 'Grand Officer of the Order of Prince Henry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1772776'), ('name', 'Portugal national under-20 football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q483915'), ('name', 'Nike')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q615'), ('name', 'Lionel Messi')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3590754'), ('name', 'Portugal national under-17 football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2165781'), ('name', 'Kátia Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166223'), ('name', 'José Dinis Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166583'), ('name', 'Maria Dolores dos Santos Viveiros da Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166621'), ('name', 'Elma dos Santos Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166624'), ('name', 'Hugo Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2986505'), ('name', 'Sir Matt Busby Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2291862'), ('name', \"FIFA Ballon d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q729513'), ('name', 'Pichichi Trophy')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q233454'), ('name', 'European Golden Shoe')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2044044'), ('name', 'PFA Team of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q616031'), ('name', 'FIFA Puskás Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166653'), ('name', 'José Nunes de Viveiros')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166655'), ('name', 'Matilde dos Santos da Viveiros')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166678'), ('name', 'Filomena da Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q56166683'), ('name', 'Humberto Cirilo Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4896696'), ('name', 'Best International Athlete ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q33729164'), ('name', 'Georgina Rodríguez')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q88245029'), ('name', 'right-footedness')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q621867'), ('name', \"PFA Players' Player of the Year\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q554495'), ('name', 'Bravo Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q529207'), ('name', 'Ronaldo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1049896'), ('name', \"Onze d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1188692'), ('name', 'Premier League Player of the Season')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q794775'), ('name', 'Premier League Golden Boot')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q890790'), ('name', 'Premier League Player of the Month')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2009646'), ('name', 'PFA Young Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1808491'), ('name', 'Trofeo Alfredo Di Stéfano')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66504206'), ('name', 'Medal of Merit of the Order of the Immaculate Conception of Vila Viçosa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37487459'), ('name', 'Aveiro')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15474655'), ('name', 'La Liga Player of the Month')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q34037960'), ('name', 'Category:Cristiano Ronaldo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21079208'), ('name', 'Portugal national under-15 football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1187699'), ('name', 'UEFA Club Footballer of the Year')]\n",
      "93\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11571 ?obj ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   #FILTER(REGEX(?name,\"Profession\"^^xsd:string))\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "a3fef988-fd39-4ced-9db6-7b116f48d1fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3908'), ('name', 'Reprezentacija player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18536342'), ('name', 'competitive player')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2446'), ('name', 'Transfermarkt player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7217464'), ('name', 'Category:Association football players')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2823'), ('name', 'Royal Belgian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31930761'), ('name', \"men's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17019799'), ('name', 'Template:SD Eibar squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2066131'), ('name', 'athlete')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q606060'), ('name', \"women's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P1469'), ('name', 'FIFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4019'), ('name', 'USL Championship player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2574'), ('name', 'National-Football-Teams.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6690764'), ('name', 'Template:Atlético Madrid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1381731'), ('name', 'kit')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3677'), ('name', 'Wereld van Oranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3049'), ('name', 'Scottish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13413241'), ('name', 'Template:Levante UD squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3577'), ('name', 'Croatian Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3681'), ('name', 'ESPNFC.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3660'), ('name', 'FootballFacts.ru player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6198'), ('name', 'Liga MX Femenil player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3043'), ('name', 'Scoresway soccer person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3537'), ('name', 'FootballDatabase.eu player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3726'), ('name', 'EU-Football.info player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2020'), ('name', 'WorldFootball.net player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2193'), ('name', 'Soccerbase player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3665'), ('name', \"L'Équipe football player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P6188'), ('name', 'BDFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2276'), ('name', 'UEFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2398'), ('name', 'MLS player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3046'), ('name', 'ForaDeJogo player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4262'), ('name', 'Footoféminin.fr player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5750'), ('name', 'FBref.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3655'), ('name', 'BDFutbol player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3605'), ('name', '90minut player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P1238'), ('name', 'Swedish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4830'), ('name', 'Swedish Football Association national team player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5038'), ('name', 'Fogis.se player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2448'), ('name', 'Turkish Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2458'), ('name', 'Mackolik.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5158'), ('name', 'OnsOranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5222'), ('name', \"National Women's Soccer League player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P4417'), ('name', 'Russian Premier League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3538'), ('name', 'Fussballdaten.de player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13581058'), ('name', 'Template:Elche CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10994610'), ('name', 'Template:Real Sociedad squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3936'), ('name', 'NFF person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5616966'), ('name', 'Template:Infobox football biography')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3047'), ('name', 'PlaymakerStats.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3050'), ('name', 'FACR player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3565'), ('name', 'J.League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4381'), ('name', 'Soccerdonna player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3659'), ('name', 'Estonian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4883'), ('name', 'FFF male player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4886'), ('name', 'FFF female player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453370'), ('name', 'Template:Athletic Bilbao squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453375'), ('name', 'Template:Sevilla FC squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3668'), ('name', 'Sambafoot player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4023'), ('name', 'German Football Association person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3662'), ('name', 'Football Federation of Ukraine player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5628'), ('name', 'Football.it female player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3658'), ('name', 'DZFoot.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5951198'), ('name', 'Template:Granada CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20328690'), ('name', 'Template:SD Huesca squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3683'), ('name', 'LFP player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3053'), ('name', 'K League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5339'), ('name', 'Lega Serie A soccer player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5742'), ('name', 'Voetbalstats player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6867231'), ('name', 'Template:Celta de Vigo squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3657'), ('name', 'Croatian Football Statistics player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11175008'), ('name', 'Template:CA Osasuna squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6317'), ('name', 'RusTeam player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20377971'), ('name', 'Template:Deportivo Alavés squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6109'), ('name', 'Danish Football Union player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8302675'), ('name', 'Template:Valencia CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11183975'), ('name', 'Template:Real Betis squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10720421'), ('name', 'Template:Real Madrid C.F. squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3663'), ('name', 'Fotbal DNES player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3748'), ('name', 'Israel Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11046481'), ('name', 'Template:Real Valladolid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20372475'), ('name', 'Template:Cádiz CF squad')]\n",
      "86\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937857 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "3e9285e1-3b9b-4a8b-b87e-cdac53298283",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q51481377'), ('name', \"women's association football club\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q628099'), ('name', 'association football manager')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q714581'), ('name', 'Nea Salamis Famagusta FC')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q167270'), ('name', 'trademark')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17270000'), ('name', 'football club')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28083137'), ('name', 'football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5424'), ('name', 'Lega Serie A team ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5614332'), ('name', 'Category:Association football clubs')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q103231176'), ('name', \"men's association football club\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P1241'), ('name', 'Swiss Football Association club number')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4639'), ('name', 'Estonian Football Association team ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q951054'), ('name', 'list of association football clubs')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5611964'), ('name', 'Template:Infobox football club')]\n",
      "16\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q476028 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "9093342e-fe0e-451c-984b-de0d252db231",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3908'), ('name', 'Reprezentacija player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18536342'), ('name', 'competitive player')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2446'), ('name', 'Transfermarkt player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7217464'), ('name', 'Category:Association football players')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2823'), ('name', 'Royal Belgian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31930761'), ('name', \"men's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17019799'), ('name', 'Template:SD Eibar squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2066131'), ('name', 'athlete')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q606060'), ('name', \"women's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P1469'), ('name', 'FIFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4019'), ('name', 'USL Championship player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2574'), ('name', 'National-Football-Teams.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6690764'), ('name', 'Template:Atlético Madrid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1381731'), ('name', 'kit')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3677'), ('name', 'Wereld van Oranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3049'), ('name', 'Scottish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13413241'), ('name', 'Template:Levante UD squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3577'), ('name', 'Croatian Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3681'), ('name', 'ESPNFC.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3660'), ('name', 'FootballFacts.ru player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6198'), ('name', 'Liga MX Femenil player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3043'), ('name', 'Scoresway soccer person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3537'), ('name', 'FootballDatabase.eu player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3726'), ('name', 'EU-Football.info player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2020'), ('name', 'WorldFootball.net player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2193'), ('name', 'Soccerbase player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3665'), ('name', \"L'Équipe football player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P6188'), ('name', 'BDFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2276'), ('name', 'UEFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2398'), ('name', 'MLS player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3046'), ('name', 'ForaDeJogo player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4262'), ('name', 'Footoféminin.fr player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5750'), ('name', 'FBref.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3655'), ('name', 'BDFutbol player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3605'), ('name', '90minut player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P1238'), ('name', 'Swedish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4830'), ('name', 'Swedish Football Association national team player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5038'), ('name', 'Fogis.se player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2448'), ('name', 'Turkish Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2458'), ('name', 'Mackolik.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5158'), ('name', 'OnsOranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5222'), ('name', \"National Women's Soccer League player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P4417'), ('name', 'Russian Premier League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3538'), ('name', 'Fussballdaten.de player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13581058'), ('name', 'Template:Elche CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10994610'), ('name', 'Template:Real Sociedad squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3936'), ('name', 'NFF person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5616966'), ('name', 'Template:Infobox football biography')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3047'), ('name', 'PlaymakerStats.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3050'), ('name', 'FACR player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3565'), ('name', 'J.League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4381'), ('name', 'Soccerdonna player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3659'), ('name', 'Estonian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4883'), ('name', 'FFF male player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4886'), ('name', 'FFF female player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453370'), ('name', 'Template:Athletic Bilbao squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453375'), ('name', 'Template:Sevilla FC squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3668'), ('name', 'Sambafoot player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4023'), ('name', 'German Football Association person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3662'), ('name', 'Football Federation of Ukraine player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5628'), ('name', 'Football.it female player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3658'), ('name', 'DZFoot.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5951198'), ('name', 'Template:Granada CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20328690'), ('name', 'Template:SD Huesca squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3683'), ('name', 'LFP player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3053'), ('name', 'K League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5339'), ('name', 'Lega Serie A soccer player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5742'), ('name', 'Voetbalstats player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6867231'), ('name', 'Template:Celta de Vigo squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3657'), ('name', 'Croatian Football Statistics player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11175008'), ('name', 'Template:CA Osasuna squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6317'), ('name', 'RusTeam player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20377971'), ('name', 'Template:Deportivo Alavés squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6109'), ('name', 'Danish Football Union player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8302675'), ('name', 'Template:Valencia CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11183975'), ('name', 'Template:Real Betis squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10720421'), ('name', 'Template:Real Madrid C.F. squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3663'), ('name', 'Fotbal DNES player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3748'), ('name', 'Israel Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11046481'), ('name', 'Template:Real Valladolid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20372475'), ('name', 'Template:Cádiz CF squad')]\n",
      "86\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937857 ?o ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a996f18d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "33a908c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3908'), ('name', 'Reprezentacija player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18536342'), ('name', 'competitive player')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2446'), ('name', 'Transfermarkt player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7217464'), ('name', 'Category:Association football players')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2823'), ('name', 'Royal Belgian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28640'), ('name', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31930761'), ('name', \"men's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17019799'), ('name', 'Template:SD Eibar squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2066131'), ('name', 'athlete')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q606060'), ('name', \"women's association football\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P1469'), ('name', 'FIFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4019'), ('name', 'USL Championship player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2574'), ('name', 'National-Football-Teams.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6690764'), ('name', 'Template:Atlético Madrid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1381731'), ('name', 'kit')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3677'), ('name', 'Wereld van Oranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3049'), ('name', 'Scottish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13413241'), ('name', 'Template:Levante UD squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3577'), ('name', 'Croatian Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3681'), ('name', 'ESPNFC.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3660'), ('name', 'FootballFacts.ru player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6198'), ('name', 'Liga MX Femenil player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3043'), ('name', 'Scoresway soccer person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3537'), ('name', 'FootballDatabase.eu player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3726'), ('name', 'EU-Football.info player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2020'), ('name', 'WorldFootball.net player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2193'), ('name', 'Soccerbase player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3665'), ('name', \"L'Équipe football player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P6188'), ('name', 'BDFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2276'), ('name', 'UEFA player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2398'), ('name', 'MLS player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3046'), ('name', 'ForaDeJogo player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4262'), ('name', 'Footoféminin.fr player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5750'), ('name', 'FBref.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3655'), ('name', 'BDFutbol player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3605'), ('name', '90minut player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P1238'), ('name', 'Swedish Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4830'), ('name', 'Swedish Football Association national team player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5038'), ('name', 'Fogis.se player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2448'), ('name', 'Turkish Football Federation player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2458'), ('name', 'Mackolik.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5158'), ('name', 'OnsOranje player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5222'), ('name', \"National Women's Soccer League player ID\")]\n",
      "[('p', 'http://www.wikidata.org/entity/P4417'), ('name', 'Russian Premier League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3538'), ('name', 'Fussballdaten.de player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13581058'), ('name', 'Template:Elche CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10994610'), ('name', 'Template:Real Sociedad squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3936'), ('name', 'NFF person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5616966'), ('name', 'Template:Infobox football biography')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3047'), ('name', 'PlaymakerStats.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3050'), ('name', 'FACR player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3565'), ('name', 'J.League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4381'), ('name', 'Soccerdonna player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3659'), ('name', 'Estonian Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4883'), ('name', 'FFF male player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4886'), ('name', 'FFF female player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453370'), ('name', 'Template:Athletic Bilbao squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10453375'), ('name', 'Template:Sevilla FC squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3668'), ('name', 'Sambafoot player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4023'), ('name', 'German Football Association person ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3662'), ('name', 'Football Federation of Ukraine player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5628'), ('name', 'Football.it female player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3658'), ('name', 'DZFoot.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5951198'), ('name', 'Template:Granada CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20328690'), ('name', 'Template:SD Huesca squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3683'), ('name', 'LFP player ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3053'), ('name', 'K League player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5339'), ('name', 'Lega Serie A soccer player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P5742'), ('name', 'Voetbalstats player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6867231'), ('name', 'Template:Celta de Vigo squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3657'), ('name', 'Croatian Football Statistics player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11175008'), ('name', 'Template:CA Osasuna squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6317'), ('name', 'RusTeam player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20377971'), ('name', 'Template:Deportivo Alavés squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6109'), ('name', 'Danish Football Union player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8302675'), ('name', 'Template:Valencia CF squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11183975'), ('name', 'Template:Real Betis squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10720421'), ('name', 'Template:Real Madrid C.F. squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3663'), ('name', 'Fotbal DNES player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3748'), ('name', 'Israel Football Association player ID')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11046481'), ('name', 'Template:Real Valladolid squad')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20372475'), ('name', 'Template:Cádiz CF squad')]\n",
      "86\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937857 ?o ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "83d438c5",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 2\n",
    "Identify the BGP for association football club"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "4a440cea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# [('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q476028 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24bc0bbf",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "54c667ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# got association football club in task 1 results\n",
    "# [('p', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q476028 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8376c86c",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for association football league"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "6ddfd790",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium'), ('o', 'http://www.wikidata.org/prop/direct/P17'), ('nm', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15991303'), ('name', 'association football league'), ('o', 'http://www.wikidata.org/prop/direct/P31'), ('nm', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football'), ('o', 'http://www.wikidata.org/prop/direct/P641'), ('nm', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q381124'), ('name', 'Royal Belgian Football Association'), ('o', 'http://www.wikidata.org/prop/direct/P664'), ('nm', 'organizer')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# [('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
    "#('o', 'http://www.wikidata.org/entity/Q2186316'), ('nm', 'Belgian Provincial leagues')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q2186316 ?o ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   #filter(regex(?nm,\"league\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4c7a8ca5",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "40da63a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q8085406'), ('name', 'Template:Infobox football league'), ('o', 'http://www.wikidata.org/prop/direct/P1424'), ('nm', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26887310'), ('name', 'association football team season'), ('o', 'http://www.wikidata.org/prop/direct/P1889'), ('nm', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/entity/P1132'), ('name', 'number of participants'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2500'), ('name', 'league level below'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P6118'), ('name', 'season ends'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3195'), ('name', 'league points system'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P641'), ('name', 'sport'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P2499'), ('name', 'league level above'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4794'), ('name', 'season starts'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P17'), ('name', 'country'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3822'), ('name', 'rules for classification'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P3983'), ('name', 'sports league level'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/P664'), ('name', 'organizer'), ('o', 'http://www.wikidata.org/prop/direct/P1963'), ('nm', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1478437'), ('name', 'association football competition'), ('o', 'http://www.wikidata.org/prop/direct/P279'), ('nm', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q623109'), ('name', 'sports league'), ('o', 'http://www.wikidata.org/prop/direct/P279'), ('nm', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football'), ('o', 'http://www.wikidata.org/prop/direct/P641'), ('nm', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6383739'), ('name', 'Category:Association football leagues'), ('o', 'http://www.wikidata.org/prop/direct/P910'), ('nm', \"topic's main category\")]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "#here it is BGP assosiation football leagues.\n",
    "#[('p', 'http://www.wikidata.org/entity/Q15991303'),('name', 'association football league'), ('o', 'http://www.wikidata.org/prop/direct/P31'), ('nm', 'instance of')]\n",
    "# [('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
    "#('o', 'http://www.wikidata.org/entity/Q2186316'), ('nm', 'Belgian Provincial leagues')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q15991303 ?o ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c0edf9f4",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return for each european country the number of association football leagues (the result set must be a list of triples country IRI, label and #leagues)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "cee9b063",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1044'), ('nm', 'Sierra Leone')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q215'), ('nm', 'Slovenia')]\n",
      "[('NumOfLeagues', '49'), ('o', 'http://www.wikidata.org/entity/Q218'), ('nm', 'Romania')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q222'), ('nm', 'Albania')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q232'), ('nm', 'Kazakhstan')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q28'), ('nm', 'Hungary')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q424'), ('nm', 'Cambodia')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q754'), ('nm', 'Trinidad and Tobago')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q854'), ('nm', 'Sri Lanka')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q865'), ('nm', 'Taiwan')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q921'), ('nm', 'Brunei')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q929'), ('nm', 'Central African Republic')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q953'), ('nm', 'Zambia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q962'), ('nm', 'Benin')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q963'), ('nm', 'Botswana')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q967'), ('nm', 'Burundi')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q974'), ('nm', 'Democratic Republic of the Congo')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q15282'), ('nm', 'Nuevo León')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q1016'), ('nm', 'Libya')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q1246'), ('nm', 'Kosovo')]\n",
      "[('NumOfLeagues', '16'), ('o', 'http://www.wikidata.org/entity/Q16'), ('nm', 'Canada')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q21203'), ('nm', 'Aruba')]\n",
      "[('NumOfLeagues', '15'), ('o', 'http://www.wikidata.org/entity/Q38'), ('nm', 'Italy')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q664'), ('nm', 'New Zealand')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q672'), ('nm', 'Tuvalu')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q691'), ('nm', 'Papua New Guinea')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q778'), ('nm', 'The Bahamas')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q842'), ('nm', 'Oman')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q863'), ('nm', 'Tajikistan')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q917'), ('nm', 'Bhutan')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q34754'), ('nm', 'Somaliland')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q786'), ('nm', 'Dominican Republic')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1007'), ('nm', 'Guinea-Bissau')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1019'), ('nm', 'Madagascar')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1025'), ('nm', 'Mauritania')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1042'), ('nm', 'Seychelles')]\n",
      "[('NumOfLeagues', '93'), ('o', 'http://www.wikidata.org/entity/Q183'), ('nm', 'Germany')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q189'), ('nm', 'Iceland')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q233'), ('nm', 'Malta')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q238'), ('nm', 'San Marino')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q37'), ('nm', 'Lithuania')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q41'), ('nm', 'Greece')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q678'), ('nm', 'Tonga')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q736'), ('nm', 'Ecuador')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q763'), ('nm', 'Saint Kitts and Nevis')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q796'), ('nm', 'Iraq')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q843'), ('nm', 'Pakistan')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q858'), ('nm', 'Syria')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q945'), ('nm', 'Togo')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q9676'), ('nm', 'Isle of Man')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1000'), ('nm', 'Gabon')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1041'), ('nm', 'Senegal')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1049'), ('nm', 'Sudan')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1050'), ('nm', 'Eswatini')]\n",
      "[('NumOfLeagues', '24'), ('o', 'http://www.wikidata.org/entity/Q155'), ('nm', 'Brazil')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q174193'), ('nm', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q212'), ('nm', 'Ukraine')]\n",
      "[('NumOfLeagues', '9'), ('o', 'http://www.wikidata.org/entity/Q252'), ('nm', 'Indonesia')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q31'), ('nm', 'Belgium')]\n",
      "[('NumOfLeagues', '9'), ('o', 'http://www.wikidata.org/entity/Q34'), ('nm', 'Sweden')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q398'), ('nm', 'Bahrain')]\n",
      "[('NumOfLeagues', '13'), ('o', 'http://www.wikidata.org/entity/Q403'), ('nm', 'Serbia')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q419'), ('nm', 'Peru')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q766'), ('nm', 'Jamaica')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q790'), ('nm', 'Haiti')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q811'), ('nm', 'Nicaragua')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q837'), ('nm', 'Nepal')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q965'), ('nm', 'Burkina Faso')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q977'), ('nm', 'Djibouti')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q986'), ('nm', 'Eritrea')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1006'), ('nm', 'Guinea')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1014'), ('nm', 'Liberia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1037'), ('nm', 'Rwanda')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q148'), ('nm', \"People's Republic of China\")]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q217'), ('nm', 'Moldova')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q236'), ('nm', 'Montenegro')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q258'), ('nm', 'South Africa')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q265'), ('nm', 'Uzbekistan')]\n",
      "[('NumOfLeagues', '23'), ('o', 'http://www.wikidata.org/entity/Q29'), ('nm', 'Spain')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q31354462'), ('nm', 'Republic of Abkhazia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q334'), ('nm', 'Singapore')]\n",
      "[('NumOfLeagues', '13'), ('o', 'http://www.wikidata.org/entity/Q414'), ('nm', 'Argentina')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q685'), ('nm', 'Solomon Islands')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q686'), ('nm', 'Vanuatu')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q733'), ('nm', 'Paraguay')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q760'), ('nm', 'Saint Lucia')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q79'), ('nm', 'Egypt')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q819'), ('nm', 'Laos')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q851'), ('nm', 'Saudi Arabia')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q902'), ('nm', 'Bangladesh')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q912'), ('nm', 'Mali')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q948'), ('nm', 'Tunisia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q37024'), ('nm', 'Serbia and Montenegro')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q1005'), ('nm', 'The Gambia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1029'), ('nm', 'Mozambique')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q1039'), ('nm', 'São Tomé and Príncipe')]\n",
      "[('NumOfLeagues', '12'), ('o', 'http://www.wikidata.org/entity/Q142'), ('nm', 'France')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q184'), ('nm', 'Belarus')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q224'), ('nm', 'Croatia')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q225'), ('nm', 'Bosnia and Herzegovina')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q15991303'),('name', 'association football league'),\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (count(?p) as ?NumOfLeagues) ?o ?nm\n",
    "#it will total number of leagues in each country\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p ?i wd:Q15991303.\n",
    "   ?p wdt:P17 ?o.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   \n",
    "}\n",
    "GROUP BY ?o ?nm\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 116,
   "id": "8dd36843-7f3a-4b46-b275-54aa2aea3863",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe'), ('o', 'http://www.wikidata.org/prop/direct/P30'), ('nm', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q263686'), ('name', 'Southeast Europe'), ('o', 'http://www.wikidata.org/prop/direct/P361'), ('nm', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3866537'), ('name', 'Movement Coordination Centre Europe'), ('o', 'http://www.wikidata.org/prop/direct/P463'), ('nm', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q81299'), ('name', 'Organization for Security and Co-operation in Europe'), ('o', 'http://www.wikidata.org/prop/direct/P463'), ('nm', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8908'), ('name', 'Council of Europe'), ('o', 'http://www.wikidata.org/prop/direct/P463'), ('nm', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q458'), ('name', 'European Union'), ('o', 'http://www.wikidata.org/prop/direct/P463'), ('nm', 'member of')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#Selecying Croatia for getting continent\n",
    "#[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q224'), ('nm', 'Croatia')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q224 ?o ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   filter(regex(?name,\"Europe\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "3462b9ec-9997-4b13-8472-df8a23e5ad9e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q28'), ('nm', 'Hungary')]\n",
      "[('NumOfLeagues', '49'), ('o', 'http://www.wikidata.org/entity/Q218'), ('nm', 'Romania')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q232'), ('nm', 'Kazakhstan')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q215'), ('nm', 'Slovenia')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q222'), ('nm', 'Albania')]\n",
      "[('NumOfLeagues', '15'), ('o', 'http://www.wikidata.org/entity/Q38'), ('nm', 'Italy')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q1246'), ('nm', 'Kosovo')]\n",
      "[('NumOfLeagues', '93'), ('o', 'http://www.wikidata.org/entity/Q183'), ('nm', 'Germany')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q9676'), ('nm', 'Isle of Man')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q41'), ('nm', 'Greece')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q189'), ('nm', 'Iceland')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q37'), ('nm', 'Lithuania')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q238'), ('nm', 'San Marino')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q233'), ('nm', 'Malta')]\n",
      "[('NumOfLeagues', '13'), ('o', 'http://www.wikidata.org/entity/Q403'), ('nm', 'Serbia')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q31'), ('nm', 'Belgium')]\n",
      "[('NumOfLeagues', '9'), ('o', 'http://www.wikidata.org/entity/Q34'), ('nm', 'Sweden')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q212'), ('nm', 'Ukraine')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q174193'), ('nm', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q217'), ('nm', 'Moldova')]\n",
      "[('NumOfLeagues', '23'), ('o', 'http://www.wikidata.org/entity/Q29'), ('nm', 'Spain')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q37024'), ('nm', 'Serbia and Montenegro')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q236'), ('nm', 'Montenegro')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q31354462'), ('nm', 'Republic of Abkhazia')]\n",
      "[('NumOfLeagues', '12'), ('o', 'http://www.wikidata.org/entity/Q142'), ('nm', 'France')]\n",
      "[('NumOfLeagues', '14'), ('o', 'http://www.wikidata.org/entity/Q33'), ('nm', 'Finland')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q225'), ('nm', 'Bosnia and Herzegovina')]\n",
      "[('NumOfLeagues', '12'), ('o', 'http://www.wikidata.org/entity/Q40'), ('nm', 'Austria')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q32'), ('nm', 'Luxembourg')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q347'), ('nm', 'Liechtenstein')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q184'), ('nm', 'Belarus')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q224'), ('nm', 'Croatia')]\n",
      "[('NumOfLeagues', '11'), ('o', 'http://www.wikidata.org/entity/Q36'), ('nm', 'Poland')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q4628'), ('nm', 'Faroe Islands')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q221'), ('nm', 'North Macedonia')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q1206012'), ('nm', 'German Reich')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q45'), ('nm', 'Portugal')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q213'), ('nm', 'Czech Republic')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q229'), ('nm', 'Cyprus')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q227'), ('nm', 'Azerbaijan')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q172579'), ('nm', 'Kingdom of Italy')]\n",
      "[('NumOfLeagues', '15'), ('o', 'http://www.wikidata.org/entity/Q20'), ('nm', 'Norway')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q214'), ('nm', 'Slovakia')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q35'), ('nm', 'Denmark')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q27'), ('nm', 'Ireland')]\n",
      "[('NumOfLeagues', '17'), ('o', 'http://www.wikidata.org/entity/Q55'), ('nm', 'Netherlands')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q159'), ('nm', 'Russia')]\n",
      "[('NumOfLeagues', '91'), ('o', 'http://www.wikidata.org/entity/Q145'), ('nm', 'United Kingdom')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q39'), ('nm', 'Switzerland')]\n",
      "[('NumOfLeagues', '8'), ('o', 'http://www.wikidata.org/entity/Q191'), ('nm', 'Estonia')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q43'), ('nm', 'Turkey')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q230'), ('nm', 'Georgia')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('nm', 'Soviet Union')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q211'), ('nm', 'Latvia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q33946'), ('nm', 'Czechoslovakia')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q228'), ('nm', 'Andorra')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q219'), ('nm', 'Bulgaria')]\n",
      "[('NumOfLeagues', '18'), ('o', 'http://www.wikidata.org/entity/Q713750'), ('nm', 'West Germany')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q16957'), ('nm', 'German Democratic Republic')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q23681'), ('nm', 'Turkish Republic of Northern Cyprus')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q399'), ('nm', 'Armenia')]\n",
      "61\n"
     ]
    }
   ],
   "source": [
    "#filtering data according to continent\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (count(?p) as ?NumOfLeagues) ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p ?i wd:Q15991303.\n",
    "   ?p wdt:P17 ?o.\n",
    "   ?o wdt:P30 wd:Q46.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   \n",
    "}\n",
    "GROUP BY ?o ?nm\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0bf7a6b2",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "ca200d06",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q28'), ('nm', 'Hungary')]\n",
      "[('NumOfLeagues', '49'), ('o', 'http://www.wikidata.org/entity/Q218'), ('nm', 'Romania')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q232'), ('nm', 'Kazakhstan')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q215'), ('nm', 'Slovenia')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q222'), ('nm', 'Albania')]\n",
      "[('NumOfLeagues', '15'), ('o', 'http://www.wikidata.org/entity/Q38'), ('nm', 'Italy')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q1246'), ('nm', 'Kosovo')]\n",
      "[('NumOfLeagues', '93'), ('o', 'http://www.wikidata.org/entity/Q183'), ('nm', 'Germany')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q9676'), ('nm', 'Isle of Man')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q41'), ('nm', 'Greece')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q189'), ('nm', 'Iceland')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q37'), ('nm', 'Lithuania')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q238'), ('nm', 'San Marino')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q233'), ('nm', 'Malta')]\n",
      "[('NumOfLeagues', '13'), ('o', 'http://www.wikidata.org/entity/Q403'), ('nm', 'Serbia')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q31'), ('nm', 'Belgium')]\n",
      "[('NumOfLeagues', '9'), ('o', 'http://www.wikidata.org/entity/Q34'), ('nm', 'Sweden')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q212'), ('nm', 'Ukraine')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q174193'), ('nm', 'United Kingdom of Great Britain and Ireland')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q217'), ('nm', 'Moldova')]\n",
      "[('NumOfLeagues', '23'), ('o', 'http://www.wikidata.org/entity/Q29'), ('nm', 'Spain')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q37024'), ('nm', 'Serbia and Montenegro')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q236'), ('nm', 'Montenegro')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q31354462'), ('nm', 'Republic of Abkhazia')]\n",
      "[('NumOfLeagues', '12'), ('o', 'http://www.wikidata.org/entity/Q142'), ('nm', 'France')]\n",
      "[('NumOfLeagues', '14'), ('o', 'http://www.wikidata.org/entity/Q33'), ('nm', 'Finland')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q225'), ('nm', 'Bosnia and Herzegovina')]\n",
      "[('NumOfLeagues', '12'), ('o', 'http://www.wikidata.org/entity/Q40'), ('nm', 'Austria')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q32'), ('nm', 'Luxembourg')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q347'), ('nm', 'Liechtenstein')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q184'), ('nm', 'Belarus')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q224'), ('nm', 'Croatia')]\n",
      "[('NumOfLeagues', '11'), ('o', 'http://www.wikidata.org/entity/Q36'), ('nm', 'Poland')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q4628'), ('nm', 'Faroe Islands')]\n",
      "[('NumOfLeagues', '3'), ('o', 'http://www.wikidata.org/entity/Q221'), ('nm', 'North Macedonia')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q1206012'), ('nm', 'German Reich')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q45'), ('nm', 'Portugal')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q213'), ('nm', 'Czech Republic')]\n",
      "[('NumOfLeagues', '10'), ('o', 'http://www.wikidata.org/entity/Q229'), ('nm', 'Cyprus')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q227'), ('nm', 'Azerbaijan')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q172579'), ('nm', 'Kingdom of Italy')]\n",
      "[('NumOfLeagues', '15'), ('o', 'http://www.wikidata.org/entity/Q20'), ('nm', 'Norway')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q214'), ('nm', 'Slovakia')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q35'), ('nm', 'Denmark')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q27'), ('nm', 'Ireland')]\n",
      "[('NumOfLeagues', '17'), ('o', 'http://www.wikidata.org/entity/Q55'), ('nm', 'Netherlands')]\n",
      "[('NumOfLeagues', '7'), ('o', 'http://www.wikidata.org/entity/Q159'), ('nm', 'Russia')]\n",
      "[('NumOfLeagues', '91'), ('o', 'http://www.wikidata.org/entity/Q145'), ('nm', 'United Kingdom')]\n",
      "[('NumOfLeagues', '5'), ('o', 'http://www.wikidata.org/entity/Q39'), ('nm', 'Switzerland')]\n",
      "[('NumOfLeagues', '8'), ('o', 'http://www.wikidata.org/entity/Q191'), ('nm', 'Estonia')]\n",
      "[('NumOfLeagues', '6'), ('o', 'http://www.wikidata.org/entity/Q43'), ('nm', 'Turkey')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q230'), ('nm', 'Georgia')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('nm', 'Soviet Union')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q211'), ('nm', 'Latvia')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q33946'), ('nm', 'Czechoslovakia')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q228'), ('nm', 'Andorra')]\n",
      "[('NumOfLeagues', '4'), ('o', 'http://www.wikidata.org/entity/Q219'), ('nm', 'Bulgaria')]\n",
      "[('NumOfLeagues', '18'), ('o', 'http://www.wikidata.org/entity/Q713750'), ('nm', 'West Germany')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q16957'), ('nm', 'German Democratic Republic')]\n",
      "[('NumOfLeagues', '1'), ('o', 'http://www.wikidata.org/entity/Q23681'), ('nm', 'Turkish Republic of Northern Cyprus')]\n",
      "[('NumOfLeagues', '2'), ('o', 'http://www.wikidata.org/entity/Q399'), ('nm', 'Armenia')]\n",
      "61\n"
     ]
    }
   ],
   "source": [
    "#filtering data according to continent\n",
    "#[('p', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe'), ('o', 'http://www.wikidata.org/prop/direct/P30'), ('nm', 'continent')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (count(?p) as ?NumOfLeagues) ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p ?i wd:Q15991303.\n",
    "   ?p wdt:P17 ?o.\n",
    "   ?o wdt:P30 wd:Q46.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   \n",
    "}\n",
    "GROUP BY ?o ?nm\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f55ae272",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Identify the BGP for the ballon d'Or award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "id": "d79c30a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11571 ?p ?o  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   filter(regex(?name,\"award\"))\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "76696eb3",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "c7c52c05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q1750244'), ('name', 'FWA Footballer of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10726649'), ('name', \"PFA Fans' Player of the Year\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20888805'), ('name', 'Commander of the Order of Merit of Portugal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1146578'), ('name', 'UEFA Team of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q182529'), ('name', 'FIFA World Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q260117'), ('name', \"UEFA Men's Player of the Year Award\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q166177'), ('name', \"Ballon d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20860117'), ('name', 'Officer of the Order of Prince Henry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20859673'), ('name', 'Grand Officer of the Order of Prince Henry')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2986505'), ('name', 'Sir Matt Busby Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2291862'), ('name', \"FIFA Ballon d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q729513'), ('name', 'Pichichi Trophy')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q233454'), ('name', 'European Golden Shoe')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2044044'), ('name', 'PFA Team of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q616031'), ('name', 'FIFA Puskás Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4896696'), ('name', 'Best International Athlete ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q621867'), ('name', \"PFA Players' Player of the Year\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q554495'), ('name', 'Bravo Award')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1049896'), ('name', \"Onze d'Or\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1188692'), ('name', 'Premier League Player of the Season')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q794775'), ('name', 'Premier League Golden Boot')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q890790'), ('name', 'Premier League Player of the Month')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2009646'), ('name', 'PFA Young Player of the Year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1808491'), ('name', 'Trofeo Alfredo Di Stéfano')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q66504206'), ('name', 'Medal of Merit of the Order of the Immaculate Conception of Vila Viçosa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15474655'), ('name', 'La Liga Player of the Month')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1187699'), ('name', 'UEFA Club Footballer of the Year')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# here are the awards recieved by cristiano ronaldo\n",
    "# write your queries\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11571 wdt:P166 ?p.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   #filter(regex(?name,\"award\"))\n",
    "   \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "id": "7e7911bd-cc4f-46bb-aad0-d7d07dd63706",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2572'), ('name', 'hashtag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1027'), ('name', 'conferred by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2517'), ('name', 'category for recipients of this award')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# FINAL query \n",
    "# BGP OF BALLON D'OR \n",
    "#[('p', 'http://www.wikidata.org/entity/Q166177'), ('name', \"Ballon d'Or\")]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q166177 ?p ?O.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   #filter(regex(?name,\"award\"))\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e58ae24",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Return the countries which have at least two different players of their nationality (consider the country of citizenship) who won the ballon d'Or (the result set must be a list of triples country IRI, label and #different players)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "fa007289",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P348'), ('name', 'software version identifier')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4669'), ('name', 'tabular software version')]\n",
      "[('p', 'http://www.wikidata.org/entity/P747'), ('name', 'has edition or translation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1002728'), ('name', 'Fonsi Nieto')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100326534'), ('name', \"Al Stewart's albums in chronological order\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100327667'), ('name', 'Category:Adelina Lopes Vieira')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100343342'), ('name', 'Lubomír Stoklásek')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1007576'), ('name', 'Ciudad Vieja')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100879156'), ('name', 'Echániz')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10100'), ('name', 'Natuna')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101032298'), ('name', \"Acid Mothers Temple's albums in chronological order\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101042154'), ('name', 'Relaño')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10121707'), ('name', '2002 in transport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10130131'), ('name', '2006 in transport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10145708'), ('name', 'Category:1920 elections in Oceania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10147007'), ('name', 'Category:2002 elections in South America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10176484'), ('name', 'Category:Teluk Sebong')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1018547'), ('name', 'Võnnu Rural Municipality')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q102115260'), ('name', 'Kojiro Kobayashi')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q102118153'), ('name', 'Miguel E. M. Herrera')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10237146'), ('name', 'Category:Akita Shoten magazines')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1024094'), ('name', \"2010 CONCACAF Women's Gold Cup\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10271305'), ('name', '2014 FIFA World Cup venues')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q102730099'), ('name', 'ambassador of Guatemala to France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10275776'), ('name', 'Estação Ferroviária de Mafra')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10279508'), ('name', 'Faculdade de Letras da Universidade de Coimbra')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10279509'), ('name', 'Faculty of Arts and Humanities of the University of Porto')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1028297'), ('name', 'Aji')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10388300'), ('name', 'Urucu')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10436048'), ('name', 'jikimiyake')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q104528620'), ('name', 'war horse')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1046546'), ('name', '2010 Pacific hurricane season')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10480703'), ('name', '1972 in economics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1053559'), ('name', '2020 Winter Youth Olympics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1055353'), ('name', 'Hitachi Province')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10561524'), ('name', 'Lightiella')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q105701834'), ('name', 'compilation album released this year')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1057504'), ('name', 'region of Ethiopia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q105753880'), ('name', 'Mateo Egea')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583001'), ('name', '1942 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583019'), ('name', '1958 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583024'), ('name', '1964 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583031'), ('name', '1971 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583049'), ('name', '1989 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583060'), ('name', '2000 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10583063'), ('name', '2003 in meteorology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1058869'), ('name', 'Nemėžis')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1058937'), ('name', '530 BC')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106093218'), ('name', 'ambassador of China to Peru')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10634104'), ('name', 'Pleomothra')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10636222'), ('name', '1967 in politics')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1064712'), ('name', '1970 FIFA World Cup qualification')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106574800'), ('name', 'List of ambassadors of Gabon to the United States')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1066033'), ('name', 'Vietnamese name')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106696027'), ('name', '2003 in the Democratic Republic of the Congo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106696048'), ('name', '2000 in the Democratic Republic of the Congo')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106764375'), ('name', 'List of ANZ Championship players')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106823762'), ('name', 'veterinary scientist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10683250'), ('name', 'Suctobelbella')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q106884579'), ('name', 'Versailles EPs discography')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107407449'), ('name', '2014 in Namibia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1074111'), ('name', '1975 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107441260'), ('name', \"Aaliyah's albums in chronological order\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107520918'), ('name', 'Jerónimo Latorre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107587774'), ('name', '2000 in Uganda')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107690225'), ('name', 'Paratge natural municipal')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1078462'), ('name', '1972 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107875682'), ('name', 'Alma Scots baseball')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q107877610'), ('name', 'Alfred Saxons football')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1078784'), ('name', '1987 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1079203'), ('name', '1928 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1081152'), ('name', '2010 World Touring Car Championship season')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1082132'), ('name', '2004 UEFA European Under-17 Football Championship')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10832870'), ('name', '2012 in Vietnam')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10843970'), ('name', '1984 in Taiwan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10847276'), ('name', 'Green Garden Pop')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10868675'), ('name', 'Kakyuusei 2')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10874329'), ('name', 'List of ambassador of China to Peru')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1091318'), ('name', '1994 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q109144'), ('name', 'tidal locking')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1091623'), ('name', '1998 in sports')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q109576'), ('name', 'Aegadian Islands')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10999435'), ('name', 'Vice President of the Maldives')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11074221'), ('name', 'Prince Qing')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1114794'), ('name', \"Grey's Anatomy, season 1\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11167612'), ('name', 'Category:2009 in Australian sport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11186091'), ('name', '1990 in volleyball')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11186218'), ('name', '1998 in education')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11187133'), ('name', '2016 in transport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1122543'), ('name', '1995 UCI Track Cycling World Championships')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11235194'), ('name', 'Tokyo Solamachi')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11250'), ('name', 'Kubuntu')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1128095'), ('name', 'The Village Gate')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11292651'), ('name', 'Orix Real Estate')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1129391'), ('name', \"All People's Party\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q113120'), ('name', 'Sliven Province')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11336831'), ('name', 'list of Vegalta Sendai players')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11360774'), ('name', 'Shimo-Umi Station')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1137516'), ('name', '2009–2010 Coupe de France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11387370'), ('name', 'Bingo-nada')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q166177'), ('name', \"Ballon d'Or\")]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36386 ?O ?P.\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "904c5b1b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9ddcbc81",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93148ff4",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Identify the BGP of the FIFA World Cup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "id": "b2c78208",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q47774'), ('name', 'France national association football team'), ('o', 'http://www.wikidata.org/prop/direct/P1346'), ('nm', 'winner')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19593927'), ('name', 'Template:2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1424'), ('nm', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q159'), ('name', 'Russia'), ('o', 'http://www.wikidata.org/prop/direct/P17'), ('nm', 'country')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31930761'), ('name', \"men's association football\"), ('o', 'http://www.wikidata.org/prop/direct/P2094'), ('nm', 'competition class')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q202163'), ('name', 'Luzhniki Stadium'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1190634'), ('name', 'Otkrytie Bank Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1149601'), ('name', 'Fisht Olympic Stadium'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4439101'), ('name', 'Rostov Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q33993'), ('name', 'Kazan Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q722970'), ('name', 'Gazprom Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4366184'), ('name', 'Volgograd Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4439075'), ('name', 'Nizhny Novgorod Stadium'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4439098'), ('name', 'Kaliningrad Stadium'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4533552'), ('name', 'Mordovia Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q190779'), ('name', 'Central Stadium Yekaterinburg'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4439099'), ('name', 'Samara Arena'), ('o', 'http://www.wikidata.org/prop/direct/P276'), ('nm', 'location')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27020041'), ('name', 'sports season'), ('o', 'http://www.wikidata.org/prop/direct/P31'), ('nm', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19317'), ('name', 'FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P3450'), ('nm', 'sports season of league or competition')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31043671'), ('name', '2018 FIFA World Cup Final'), ('o', 'http://www.wikidata.org/prop/direct/P3967'), ('nm', 'final event')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31189412'), ('name', '2018 FIFA World Cup Group D'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31189411'), ('name', '2018 FIFA World Cup Group C'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43214797'), ('name', '2018 FIFA World Cup Group F'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43214603'), ('name', '2018 FIFA World Cup knockout stage'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31189406'), ('name', '2018 FIFA World Cup Group B'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31189405'), ('name', '2018 FIFA World Cup Group A'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43214817'), ('name', '2018 FIFA World Cup Group G'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31189413'), ('name', '2018 FIFA World Cup Group E'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q54968737'), ('name', '2018 FIFA World Cup opening ceremony'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43214843'), ('name', '2018 FIFA World Cup Group H'), ('o', 'http://www.wikidata.org/prop/direct/P527'), ('nm', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football'), ('o', 'http://www.wikidata.org/prop/direct/P641'), ('nm', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q253414'), ('name', 'FIFA'), ('o', 'http://www.wikidata.org/prop/direct/P664'), ('nm', 'organizer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27500909'), ('name', 'Zabivaka'), ('o', 'http://www.wikidata.org/prop/direct/P822'), ('nm', 'mascot')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8204709'), ('name', 'Category:2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P910'), ('nm', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45101586'), ('name', 'Australia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43196508'), ('name', 'Uruguay at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43196538'), ('name', 'Brazil at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43122212'), ('name', 'Iceland at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45905387'), ('name', 'Croatia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43197686'), ('name', 'Panama at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43249937'), ('name', 'France at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44959733'), ('name', 'Egypt at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43122091'), ('name', 'Germany at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45186603'), ('name', 'Denmark at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43249895'), ('name', 'Iran at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44310763'), ('name', 'Morocco at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45299081'), ('name', 'South Korea at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43196480'), ('name', 'Colombia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44959661'), ('name', 'Switzerland at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45137606'), ('name', 'Sweden at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43122146'), ('name', 'Spain at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q42944467'), ('name', 'England at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43122121'), ('name', 'Belgium at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43196530'), ('name', 'Argentina at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43238405'), ('name', 'Peru at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45371075'), ('name', 'Portugal at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45821549'), ('name', 'Serbia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43196466'), ('name', 'Mexico at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43249900'), ('name', 'Japan at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45047280'), ('name', 'Senegal at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45590884'), ('name', 'Poland at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43127430'), ('name', 'Russia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46264327'), ('name', 'Saudi Arabia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46265248'), ('name', 'Costa Rica at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44959591'), ('name', 'Tunisia at the 2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q45041100'), ('name', 'Nigeria at the 2018 FIFA World Cup\\u200e'), ('o', 'http://www.wikidata.org/prop/direct/P1923'), ('nm', 'participating team')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q969725'), ('name', 'Harry Kane'), ('o', 'http://www.wikidata.org/prop/direct/P3279'), ('nm', 'statistical leader')]\n",
      "66\n"
     ]
    }
   ],
   "source": [
    "# [('p', 'http://www.wikidata.org/entity/Q170645'), ('name', '2018 FIFA World Cup')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q170645 ?o ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?nm.\n",
    "   #filter(regex(?nm,\"league\"))\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "49525c2d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 165,
   "id": "c430d03f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q101751'), ('name', '1994 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131591'), ('name', '1938 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132664'), ('name', '1970 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q253414'), ('name', 'FIFA'), ('o', 'http://www.wikidata.org/prop/direct/P664')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q48432'), ('name', '1930 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8437937'), ('name', 'Category:FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P910')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q120'), ('name', 'June'), ('o', 'http://www.wikidata.org/prop/direct/P2922')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q170645'), ('name', '2018 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q176883'), ('name', '2010 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2736'), ('name', 'association football'), ('o', 'http://www.wikidata.org/prop/direct/P641')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37285'), ('name', '2006 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46934'), ('name', '1982 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46938'), ('name', '1986 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46943'), ('name', '1978 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q47735'), ('name', '2002 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q79859'), ('name', '2014 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1478437'), ('name', 'association football competition'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31930761'), ('name', \"men's association football\"), ('o', 'http://www.wikidata.org/prop/direct/P2094')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6979593'), ('name', 'national association football team'), ('o', 'http://www.wikidata.org/prop/direct/P8115')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101730'), ('name', '1998 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131075'), ('name', '1954 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132515'), ('name', '1950 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132529'), ('name', '1990 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q134202'), ('name', '1966 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q166121'), ('name', '1974 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132533'), ('name', '1958 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1477177'), ('name', '1934 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q160813'), ('name', '1962 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1344963'), ('name', 'world championship'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q284163'), ('name', '2022 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5020214'), ('name', '2026 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14935989'), ('name', '2030 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7120395'), ('name', 'Category:FIFA World Cup-winning players'), ('o', 'http://www.wikidata.org/prop/direct/P2517')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q34542827'), ('name', 'international association football national teams competition'), ('o', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5636960'), ('name', 'Template:FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1424')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1196082'), ('name', 'history of the FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P2184')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q203851'), ('name', '1942 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28736876'), ('name', 'Portal:FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P1151')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q65273310'), ('name', '1946 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43215379'), ('name', '2034 FIFA World Cup'), ('o', 'http://www.wikidata.org/prop/direct/P527')]\n",
      "40\n"
     ]
    }
   ],
   "source": [
    "# FINAL QUERY BGP FOR FIFA WORLD CUP\n",
    "# [('p', 'http://www.wikidata.org/entity/Q19317'), ('name', 'FIFA World Cup'),\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q19317 ?o ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "  \n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c5372b0e",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Who are the players who partecipated in more than 4 world's cup editions? (the result set must be a list of triples player IRI, label and #participations)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 172,
   "id": "653a109d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q101751'), ('name', '1994 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131591'), ('name', '1938 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132664'), ('name', '1970 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q48432'), ('name', '1930 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q170645'), ('name', '2018 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q176883'), ('name', '2010 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q37285'), ('name', '2006 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46934'), ('name', '1982 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46938'), ('name', '1986 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46943'), ('name', '1978 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q47735'), ('name', '2002 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q79859'), ('name', '2014 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101730'), ('name', '1998 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q131075'), ('name', '1954 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132515'), ('name', '1950 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132529'), ('name', '1990 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q134202'), ('name', '1966 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q166121'), ('name', '1974 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q132533'), ('name', '1958 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1477177'), ('name', '1934 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q160813'), ('name', '1962 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q284163'), ('name', '2022 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5020214'), ('name', '2026 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14935989'), ('name', '2030 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q203851'), ('name', '1942 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q65273310'), ('name', '1946 FIFA World Cup')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q43215379'), ('name', '2034 FIFA World Cup')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?nm\n",
    "WHERE {\n",
    "   # bind something\n",
    "      wd:Q19317 wdt:P527 ?p  .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   #?o sc:name ?nm.\n",
    "  \n",
    "   \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "750e9b6b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c92533fb",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af6d9c0e",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Consider the countries that won the FIFA World Cup at least twice. Find the players of those countries won the ballon d'Or (the result set must be a list of couples player IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "29edb809",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your queries"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4689719a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "616991d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
