{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "02140acd",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "492142f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-2438c49dac-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2a0807ea",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Literary Movements and physicists explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the literary movements and the poets. In particular, compare some physicists in terms of discovers, Nobel Prizes and education."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b475e847",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q43514`| theory of relativity | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c6bd081e",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q43514 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of the theory of relativity**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "1. Who invented the theory of relativity? (return the IRI and the label of the inventor).\n",
    "\n",
    "2. Identify the BGP for physicist\n",
    "\n",
    "3. Identify the BGP for Nobel Prize\n",
    "\n",
    "4. Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists).\n",
    "\n",
    "5. Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label). \n",
    "\n",
    "6. Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries ).\n",
    "\n",
    "7. Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ceefa90f",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Who invented the theory of relativity? (return the IRI and the label of the inventor)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "id": "2430984b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1256'), ('name', 'Iconclass notation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3847'), ('name', 'Open Library subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4466'), ('name', 'Unified Astronomy Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5357'), ('name', 'The Encyclopedia of Science Fiction ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6363'), ('name', 'WordLift URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7305'), ('name', 'Online PWN Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7993'), ('name', \"Treccani's Dizionario di Filosofia ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "3dc396a3-f4bb-4bd6-b2d5-3832abec0945",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q11452'), ('objName', 'general relativity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of'), ('obj', 'http://www.wikidata.org/entity/Q658544'), ('objName', 'modern physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q214070'), ('objName', 'physical law')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q35875'), ('objName', 'mass–energy equivalence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor'), ('obj', 'http://www.wikidata.org/entity/Q937'), ('objName', 'Albert Einstein')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q11455'), ('objName', 'special relativity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q3239681'), ('objName', 'scientific theory')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q3239681'), ('objName', 'scientific theory')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q4162444'), ('objName', 'branch of physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q6617097'), ('objName', 'Category:Theory of relativity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q14839046'), ('objName', 'Template:Relativity')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "# checking properties of the given node to find a clue\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?objName\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "882bc44a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0e6f062d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor'), \n",
    "#('obj', 'http://www.wikidata.org/entity/Q937'), ('objName', 'Albert Einstein')]\n",
    "#FINAL \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   # get the label\n",
    "   ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d6abf37",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for physicist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "2ea39fd8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#USING THE NODE WE FOUND FOR FINDING THE RESULTS \n",
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor'), \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   # get the label\n",
    "   ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 218,
   "id": "06b9458d-27d3-4a3f-bd47-faf913d02344",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('job', 'http://www.wikidata.org/entity/Q19350898'), ('jobname', 'theoretical physicist')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q16389557'), ('jobname', 'philosopher of science')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q121594'), ('jobname', 'professor')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q1231865'), ('jobname', 'pedagogue')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q15980158'), ('jobname', 'non-fiction writer')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q1622272'), ('jobname', 'university teacher')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q170790'), ('jobname', 'mathematician')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q205375'), ('jobname', 'inventor')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q36180'), ('jobname', 'writer')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q37226'), ('jobname', 'teacher')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q4964182'), ('jobname', 'philosopher')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q901'), ('jobname', 'scientist')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q3745071'), ('jobname', 'science writer')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q2896489'), ('jobname', 'patent examiner')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "#USING THE NODE WE FOUND FOR FINDING THE RESULTS \n",
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor'), \n",
    "#wdt:P106\toccupation\tpredicate\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?job ?jobname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   ?inv wdt:P106 ?job.\n",
    "   # get the label\n",
    "   ?job sc:name ?jobname\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9b335eae",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "44f29395",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('job', 'http://www.wikidata.org/entity/Q19350898'), ('jobname', 'theoretical physicist')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#USING THE NODE WE FOUND FOR FINDING THE RESULTS \n",
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor'), \n",
    "#wdt:P106\toccupation\tpredicate\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?job ?jobname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   ?inv wdt:P106 ?job.\n",
    "   # get the label\n",
    "   ?job sc:name ?jobname\n",
    "   FILTER(REGEX(?jobname ,'physicist'))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "256ae649",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for Nobel Prize"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5dd9a449",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   # get the label\n",
    "   ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "97d4230d-4015-48e7-b670-ea44108b05ef",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pName', 'residence'), ('obj', 'http://www.wikidata.org/entity/Q1309294'), ('objName', 'Einsteinhaus Caputh')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pName', 'notable work'), ('obj', 'http://www.wikidata.org/entity/Q11452'), ('objName', 'general relativity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pName', 'notable work'), ('obj', 'http://www.wikidata.org/entity/Q944'), ('objName', 'quantum mechanics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pName', 'educated at'), ('obj', 'http://www.wikidata.org/entity/Q435651'), ('objName', 'old Kantonsschule (Albert Einstein House)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('pName', 'assessment'), ('obj', 'http://www.wikidata.org/entity/Q1051792'), ('objName', 'intelligence test')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('pName', 'place of death'), ('obj', 'http://www.wikidata.org/entity/Q138518'), ('objName', 'Princeton')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pName', 'residence'), ('obj', 'http://www.wikidata.org/entity/Q138518'), ('objName', 'Princeton')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pName', 'work location'), ('obj', 'http://www.wikidata.org/entity/Q138518'), ('objName', 'Princeton')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q1522873'), ('objName', 'Josiah Willard Gibbs Lectureship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('pName', 'field of work'), ('obj', 'http://www.wikidata.org/entity/Q18362'), ('objName', 'theoretical physics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pName', 'educated at'), ('obj', 'http://www.wikidata.org/entity/Q1876751'), ('objName', 'Luitpold-Gymnasium')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q19350898'), ('objName', 'theoretical physicist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q317038'), ('objName', 'Max Planck Medal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P102'), ('pName', 'member of political party'), ('obj', 'http://www.wikidata.org/entity/Q328195'), ('objName', 'German Democratic Party')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('pName', 'given name'), ('obj', 'http://www.wikidata.org/entity/Q577011'), ('objName', 'Albert')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('obj', 'http://www.wikidata.org/entity/Q659080'), ('objName', 'University of Bern')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pName', 'employer'), ('obj', 'http://www.wikidata.org/entity/Q708038'), ('objName', 'Kaiser Wilhelm Society')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pName', 'work location'), ('obj', 'http://www.wikidata.org/entity/Q72'), ('objName', 'Zürich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1321'), ('pName', 'place of origin (Switzerland)'), ('obj', 'http://www.wikidata.org/entity/Q72'), ('objName', 'Zürich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pName', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q16389557'), ('objName', 'philosopher of science')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "#check properties to find the awards\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "60d6ddf3-ca40-4326-9184-5f83ae8e22d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "\n",
    "#check awards  to find the nobel prize \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?award ?awardName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?obj ;\n",
    "       wdt:P166 ?award .\n",
    "   # get the label\n",
    "  ?award sc:name ?awardName.\n",
    "  FILTER(REGEX(?awardName ,'[Nn]obel'))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09073943",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "aca09a8f-c08a-4f49-b9b3-c66e144d2684",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
    "#wdt:P279\tsubclass\tpredicate\n",
    "#FINAL QUERY \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "    wd:Q38104 wdt:P279 ?obj.\n",
    "    \n",
    "   # get the label\n",
    "    \n",
    "   ?obj sc:name ?objName.\n",
    "  \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30a3aaa5",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Consider physicists born in Europe. For each european country return the number of physicists who won the Nobel Prize in Physics (the result set must be a list of triples country IRI, label and #physicists)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "960bcd81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#STARTING FROM A FOUND NODE TO FIND THE BIRTH COUNTRY PROPERTY \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q43514 ?p ?obj .\n",
    "   ?obj wdt:P61 ?inv.\n",
    "   # get the label\n",
    "   ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 225,
   "id": "31280177-21dd-4018-94ac-be63e799d5f2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q279118'), ('invName', 'wooden house')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship'), ('inv', 'http://www.wikidata.org/entity/Q1489259'), ('invName', 'superpower')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pname', 'work location'), ('inv', 'http://www.wikidata.org/entity/Q257391'), ('invName', 'federal capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('inv', 'http://www.wikidata.org/entity/Q5767753'), ('invName', 'style')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('inv', 'http://www.wikidata.org/entity/Q5767753'), ('invName', 'style')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P803'), ('pname', 'professorship'), ('inv', 'http://www.wikidata.org/entity/Q5767753'), ('invName', 'style')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('inv', 'http://www.wikidata.org/entity/Q7810129'), ('invName', 'title of authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P39'), ('pname', 'position held'), ('inv', 'http://www.wikidata.org/entity/Q7810129'), ('invName', 'title of authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P803'), ('pname', 'professorship'), ('inv', 'http://www.wikidata.org/entity/Q7810129'), ('invName', 'title of authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pname', 'archives at'), ('inv', 'http://www.wikidata.org/entity/Q1865249'), ('invName', 'literary museum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('inv', 'http://www.wikidata.org/entity/Q16695773'), ('invName', 'WikiProject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q15911314'), ('invName', 'association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pname', 'archives at'), ('inv', 'http://www.wikidata.org/entity/Q166118'), ('invName', 'archive')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q166118'), ('invName', 'archive')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('pname', 'participant in'), ('inv', 'http://www.wikidata.org/entity/Q170584'), ('invName', 'project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q20971972'), ('invName', 'Original Public Ivy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q23002039'), ('invName', 'public educational institution of the United States')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('pname', 'place of burial'), ('inv', 'http://www.wikidata.org/entity/Q2772772'), ('invName', 'military museum')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q615150'), ('invName', 'land-grant university')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('inv', 'http://www.wikidata.org/entity/Q8513'), ('invName', 'database')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('inv', 'http://www.wikidata.org/entity/Q1320047'), ('invName', 'book publisher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('inv', 'http://www.wikidata.org/entity/Q2085381'), ('invName', 'publisher')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('inv', 'http://www.wikidata.org/entity/Q186165'), ('invName', 'web portal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship'), ('inv', 'http://www.wikidata.org/entity/Q19953632'), ('invName', 'former administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pname', 'notable work'), ('inv', 'http://www.wikidata.org/entity/Q211364'), ('invName', 'principle')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received'), ('inv', 'http://www.wikidata.org/entity/Q618779'), ('invName', 'award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q748019'), ('invName', 'scientific society')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P803'), ('pname', 'professorship'), ('inv', 'http://www.wikidata.org/entity/Q216353'), ('invName', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pname', 'archives at'), ('inv', 'http://www.wikidata.org/entity/Q4431094'), ('invName', 'special collections')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q5003624'), ('invName', 'memorial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pname', 'work location'), ('inv', 'http://www.wikidata.org/entity/Q548611'), ('invName', 'districts of the Czech Republic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship'), ('inv', 'http://www.wikidata.org/entity/Q99541706'), ('invName', 'historical unrecognized state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q1066984'), ('invName', 'financial centre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('inv', 'http://www.wikidata.org/entity/Q12020836'), ('invName', 'timber-framed house')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pname', 'notable work'), ('inv', 'http://www.wikidata.org/entity/Q173227'), ('invName', 'physical constant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('inv', 'http://www.wikidata.org/entity/Q1966910'), ('invName', 'national academy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('pname', 'permanent duplicated item'), ('inv', 'http://www.wikidata.org/entity/Q21286738'), ('invName', 'Wikimedia permanent duplicate item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('inv', 'http://www.wikidata.org/entity/Q414147'), ('invName', 'academy of sciences')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q414147'), ('invName', 'academy of sciences')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pname', 'archives at'), ('inv', 'http://www.wikidata.org/entity/Q1497649'), ('invName', 'memory institution')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('inv', 'http://www.wikidata.org/entity/Q1789476'), ('invName', 'bibliographic database')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q1371037'), ('invName', 'institute of technology')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('pname', 'educated at'), ('inv', 'http://www.wikidata.org/entity/Q1371037'), ('invName', 'institute of technology')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('pname', 'sex or gender'), ('inv', 'http://www.wikidata.org/entity/Q48264'), ('invName', 'gender identity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('pname', 'archives at'), ('inv', 'http://www.wikidata.org/entity/Q856234'), ('invName', 'academic library')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group'), ('inv', 'http://www.wikidata.org/entity/Q11197007'), ('invName', 'ethnoreligious group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1441'), ('pname', 'present in work'), ('inv', 'http://www.wikidata.org/entity/Q11424'), ('invName', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship'), ('inv', 'http://www.wikidata.org/entity/Q11514315'), ('invName', 'historical period')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('inv', 'http://www.wikidata.org/entity/Q11753321'), ('invName', 'Wikimedia navigational template')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q1180262'), ('invName', 'residenz')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pname', 'work location'), ('inv', 'http://www.wikidata.org/entity/Q1187811'), ('invName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1321'), ('pname', 'place of origin (Switzerland)'), ('inv', 'http://www.wikidata.org/entity/Q1187811'), ('invName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q1187811'), ('invName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), ('inv', 'http://www.wikidata.org/entity/Q1187811'), ('invName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q1187811'), ('invName', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pname', 'work location'), ('inv', 'http://www.wikidata.org/entity/Q1221156'), ('invName', 'state of Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation'), ('inv', 'http://www.wikidata.org/entity/Q12737077'), ('invName', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('pname', 'languages spoken, written or signed'), ('inv', 'http://www.wikidata.org/entity/Q1288568'), ('invName', 'modern language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6886'), ('pname', 'writing language'), ('inv', 'http://www.wikidata.org/entity/Q1288568'), ('invName', 'modern language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('pname', 'native language'), ('inv', 'http://www.wikidata.org/entity/Q1288568'), ('invName', 'modern language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pname', 'notable work'), ('inv', 'http://www.wikidata.org/entity/Q1293220'), ('invName', 'physical phenomenon')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('inv', 'http://www.wikidata.org/entity/Q13406463'), ('invName', 'Wikimedia list article')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q134626'), ('invName', 'district capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), ('inv', 'http://www.wikidata.org/entity/Q134626'), ('invName', 'district capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('pname', 'religion'), ('inv', 'http://www.wikidata.org/entity/Q13649246'), ('invName', 'uncertainty')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('pname', 'work location'), ('inv', 'http://www.wikidata.org/entity/Q14770218'), ('invName', 'cantonal capital of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1321'), ('pname', 'place of origin (Switzerland)'), ('inv', 'http://www.wikidata.org/entity/Q14770218'), ('invName', 'cantonal capital of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'), ('inv', 'http://www.wikidata.org/entity/Q14770218'), ('invName', 'cantonal capital of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('pname', 'residence'), ('inv', 'http://www.wikidata.org/entity/Q14784328'), ('invName', 'state capital in Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('pname', 'notable work'), ('inv', 'http://www.wikidata.org/entity/Q151885'), ('invName', 'concept')]\n",
      "70\n"
     ]
    }
   ],
   "source": [
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inv.\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 70\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "4e1d9fbd-3c2c-4463-afb6-1c021f4186aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), 3\n",
    "#USING THE PLACE OF BIRTH TO FIND THE COUNTRY BY CHECKING IT'S PROPERTIES \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P19 ?x.\n",
    "   ?x ?p ?inv.\n",
    "\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   FILTER(REGEX(?pname ,'country'))\n",
    "\n",
    " \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b0cbc52e-c2d9-4c29-982a-c0a33e736043",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inv', 'http://www.wikidata.org/entity/Q183'), ('invName', 'Germany')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    " \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inv ?invName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P19 ?x.\n",
    "   ?x wdt:P17 ?inv.\n",
    "\n",
    "   # get the label\n",
    "   #?n sc:name ?name.\n",
    "  # ?p sc:name ?pname.\n",
    " ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "bdd51c8f-8d09-4712-a9de-8c29b1157f23",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#CHECKING THE COUNTRY PRIPERTIES TO FIND THW CONTINENT \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P19 ?x.\n",
    "   ?x wdt:P17 ?inv.\n",
    "   ?inv ?p ?n .\n",
    "\n",
    "   # get the label\n",
    "   ?n sc:name ?name.\n",
    "   ?p sc:name ?pname.\n",
    "   FILTER(REGEX(?pname ,'continent'))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "5a20f2cc-b7ef-45fb-a466-4e4b14b656e1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('n', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "#AS THE ANES Albert Einstein IS EUROPEAN CHECK THE CONTINENT OF HIS BIRTH PLACE \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?n ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q937 wdt:P19 ?x.\n",
    "   ?x wdt:P17 ?inv.\n",
    "   ?inv wdt:P30 ?n .\n",
    "\n",
    "   # get the label\n",
    "   ?n sc:name ?name.\n",
    "   #?p sc:name ?pname.\n",
    "# ?inv sc:name ?invName\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 231,
   "id": "4aeb7ef9-3a04-446b-b2bb-3ec64a22c0ab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q15869777'), ('personName', 'Alice Pirard')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q15918318'), ('personName', 'Philippe Henri Coclers van Wyck')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q4276453'), ('personName', 'Petr Makushin')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q8187363'), ('personName', 'Andreĭ Ivanovich Borisov')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q16145198'), ('personName', 'Philippe Grandjean')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q456662'), ('personName', 'Nabiha')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q8706868'), ('personName', 'Christian Rantzau')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q15731855'), ('personName', 'Gustav Holck-Winterfeldt')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q13646019'), ('personName', 'Mladen')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q15734007'), ('personName', 'Kadri Prishtina')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('n', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), 3\n",
    "#wdt:P106\toccupation\tpredicate\n",
    "#FINDING EUROPEANS\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?person  ?personName\n",
    "WHERE {\n",
    "    #being european \n",
    "    ?person wdt:P19 ?birthplace.\n",
    "    ?birthplace wdt:P17 ?countryofbirth.\n",
    "    ?countryofbirth wdt:P30 wd:Q46.\n",
    "    \n",
    "    \n",
    "    \n",
    "    \n",
    "    ?person sc:name ?personName.\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "621146d0-4bcf-4350-a402-ff482283d475",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q76766'), ('personName', 'Gerd Binnig')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57072'), ('personName', 'Otto Stern')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71024'), ('personName', 'Klaus von Klitzing')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q65807'), ('personName', 'Reinhard Genzel')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71022'), ('personName', 'Ernst Ruska')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71023'), ('personName', 'Alfred Kastler')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57063'), ('personName', 'Philipp Lenard')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57067'), ('personName', 'Max von Laue')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57068'), ('personName', 'Wilhelm Wien')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57070'), ('personName', 'Gustav Ludwig Hertz')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('n', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth'), 3\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "#[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
    "\n",
    "#wdt:P106\toccupation\tpredicate\n",
    "#FINDING EUROPEANS WHO ARE physicist and won the nobel of pysics\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?person  ?personName\n",
    "WHERE {\n",
    "    #being european \n",
    "    ?person wdt:P19 ?birthplace.\n",
    "    ?birthplace wdt:P17 ?countryofbirth.\n",
    "    ?countryofbirth wdt:P30 wd:Q46.\n",
    "    \n",
    "    #being pysict\n",
    "    \n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    \n",
    "    ?person sc:name ?personName.\n",
    " \n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1576d3fc",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "ef4abc7e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q756617'), ('countryName', 'Danish Realm'), ('number', '2')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q159'), ('countryName', 'Russia'), ('number', '9')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q184'), ('countryName', 'Belarus'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q27'), ('countryName', 'Ireland'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q39'), ('countryName', 'Switzerland'), ('number', '5')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q20'), ('countryName', 'Norway'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q214'), ('countryName', 'Slovakia'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q28'), ('countryName', 'Hungary'), ('number', '2')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q227'), ('countryName', 'Azerbaijan'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q31'), ('countryName', 'Belgium'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q213'), ('countryName', 'Czech Republic'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q36'), ('countryName', 'Poland'), ('number', '7')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q40'), ('countryName', 'Austria'), ('number', '2')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q55'), ('countryName', 'Netherlands'), ('number', '9')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q32'), ('countryName', 'Luxembourg'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q38'), ('countryName', 'Italy'), ('number', '5')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q145'), ('countryName', 'United Kingdom'), ('number', '22')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q183'), ('countryName', 'Germany'), ('number', '26')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q29999'), ('countryName', 'Kingdom of the Netherlands'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q142'), ('countryName', 'France'), ('number', '9')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q212'), ('countryName', 'Ukraine'), ('number', '1')]\n",
      "[('countryofbirth', 'http://www.wikidata.org/entity/Q34'), ('countryName', 'Sweden'), ('number', '4')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "#[('n', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "\n",
    "#FINAL QUERY \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?countryofbirth ?countryName (count(?person) as ?number )\n",
    "WHERE {\n",
    "    #being european \n",
    "    ?person wdt:P19 ?birthplace.\n",
    "    ?birthplace wdt:P17 ?countryofbirth.\n",
    "    ?countryofbirth wdt:P30 wd:Q46.\n",
    "    \n",
    "    #being pysict\n",
    "    \n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    \n",
    "     ?countryofbirth sc:name ?countryName .\n",
    " \n",
    "   \n",
    "}\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c92c7e42",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return the countries which won at least once all the type of Nobel Prizes with the people born there. (the result set must be a list of couples country IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a957cd50",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q35637'), ('allNpname', 'Nobel Peace Prize')]\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q37922'), ('allNpname', 'Nobel Prize in Literature')]\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q38104'), ('allNpname', 'Nobel Prize in Physics')]\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q44585'), ('allNpname', 'Nobel Prize in Chemistry')]\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q47170'), ('allNpname', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
      "[('allNp', 'http://www.wikidata.org/entity/Q80061'), ('allNpname', 'Nobel Prize in Physiology or Medicine')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
    "\n",
    "\n",
    "#finding all type of Nobel Prize\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?allNp  ?allNpname\n",
    "WHERE {\n",
    "    ?allNp wdt:P279 wd:Q7191.\n",
    "    ?allNp sc:name ?allNpname.\n",
    "\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "9c35d2e7-bda6-497b-9fcd-bd87c2433836",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q252')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q17')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q219')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q668')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q8680')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q929')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth')\n",
    "# P19 Gives Birth PLace (Based on Previous achived results )\n",
    "#P17 Gives the country of Birth Place (Based on Previous achived results)\n",
    "\n",
    "\n",
    "#finding country of all people \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country\n",
    "WHERE {\n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    ?birthPlace wdt:P17 ?country.\n",
    "    \n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "70acd80f-17f5-4d99-883a-fe84cb106b2b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q574')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q155')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q20')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q760')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q188712')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q262')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth')\n",
    "\n",
    "#finding country of people who won a nobel prize \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country\n",
    "WHERE {\n",
    "    ?person wdt:P19 ?birthPlace;\n",
    "            wdt:P166 ?award .\n",
    "    ?birthPlace wdt:P17 ?country.\n",
    "    ?award  wdt:P279 wd:Q7191.\n",
    "    \n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "id": "2b6a6bf0-bfd0-4da1-9b17-a8785d053556",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countrylabel', 'Algeria'), ('awardName', 'Nobel Prize in Physics')]\n",
      "[('countrylabel', 'Algeria'), ('awardName', 'Nobel Prize in Literature')]\n",
      "[('countrylabel', 'Argentina'), ('awardName', 'Nobel Peace Prize')]\n",
      "[('countrylabel', 'Argentina'), ('awardName', 'Nobel Prize in Physiology or Medicine')]\n",
      "[('countrylabel', 'Australia'), ('awardName', 'Nobel Prize in Chemistry')]\n",
      "[('countrylabel', 'Australia'), ('awardName', 'Nobel Prize in Physics')]\n",
      "[('countrylabel', 'Australia'), ('awardName', 'Nobel Prize in Physiology or Medicine')]\n",
      "[('countrylabel', 'Austria'), ('awardName', 'Nobel Prize in Physiology or Medicine')]\n",
      "[('countrylabel', 'Austria'), ('awardName', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
      "[('countrylabel', 'Austria'), ('awardName', 'Nobel Peace Prize')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('allNp', 'http://www.wikidata.org/entity/Q35637'), ('allNpname', 'Nobel Peace Prize')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q37922'), ('allNpname', 'Nobel Prize in Literature')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q38104'), ('allNpname', 'Nobel Prize in Physics')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q44585'), ('allNpname', 'Nobel Prize in Chemistry')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q47170'), ('allNpname', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q80061'), ('allNpname', 'Nobel Prize in Physiology or Medicine')]\n",
    "# VALUES ?award {Q35637 Q37922 Q38104 Q44585 Q47170 Q80061 }\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?countrylabel  ?awardName \n",
    "WHERE {\n",
    "    \n",
    "    VALUES ?award {wd:Q35637 wd:Q37922 wd:Q38104 wd:Q44585 wd:Q47170 wd:Q80061}\n",
    "    ?person wdt:P19 ?birthPlace;\n",
    "            wdt:P166 ?award .\n",
    "    ?birthPlace wdt:P17 ?country.\n",
    "    ?award  wdt:P279 wd:Q7191.\n",
    "    ?country sc:name ?countrylabel .\n",
    "    ?award sc:name ?awardName\n",
    "    \n",
    "} group by ?countrylabel \n",
    "order by ?countrylabel\n",
    "\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3625fee",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "9eb818fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('countrylabel', 'Austria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q16'), ('countrylabel', 'Canada')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countrylabel', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('countrylabel', 'Germany')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q668'), ('countrylabel', 'India')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('countrylabel', 'Italy')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q20'), ('countrylabel', 'Norway')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q36'), ('countrylabel', 'Poland')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q159'), ('countrylabel', 'Russia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countrylabel', 'Sweden')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('countrylabel', 'United Kingdom')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q30'), ('countrylabel', 'United States of America')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "#[('allNp', 'http://www.wikidata.org/entity/Q35637'), ('allNpname', 'Nobel Peace Prize')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q37922'), ('allNpname', 'Nobel Prize in Literature')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q38104'), ('allNpname', 'Nobel Prize in Physics')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q44585'), ('allNpname', 'Nobel Prize in Chemistry')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q47170'), ('allNpname', 'Prize in Economic Sciences in Memory of Alfred Nobel')]\n",
    "#[('allNp', 'http://www.wikidata.org/entity/Q80061'), ('allNpname', 'Nobel Prize in Physiology or Medicine')]\n",
    "# VALUES ?award {Q35637 Q37922 Q38104 Q44585 Q47170 Q80061 }\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?country ?countrylabel  \n",
    "WHERE {\n",
    "    \n",
    "    ?person wdt:P19 ?birthPlace;\n",
    "            wdt:P166 ?award .\n",
    "     ?award wdt:P279 wd:Q7191.\n",
    "    \n",
    "    ?birthPlace wdt:P17 ?country.\n",
    "    ?award  wdt:P279 wd:Q7191.\n",
    "    ?country sc:name ?countrylabel .\n",
    "    \n",
    "} group by ?countrylabel ?country\n",
    "having (count(DISTINCT(?award))>5)\n",
    "order by ?countrylabel\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "48bee359",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who had discovered or invented at least 3 things (the result set must be a list of triples physicist IRI, label and #discoveries )."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "b0708a61",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q193803'), ('personName', 'Roger Penrose'), ('Number', '6')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q160518'), ('personName', 'Gustaf Dalén'), ('Number', '4')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q8753'), ('personName', 'Enrico Fermi'), ('Number', '6')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q123975'), ('personName', 'Michel Mayor'), ('Number', '12')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q173028'), ('personName', 'Emilio G. Segrè'), ('Number', '3')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q47480'), ('personName', 'Paul Dirac'), ('Number', '3')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q937'), ('personName', 'Albert Einstein'), ('Number', '10')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q37463'), ('personName', 'Pierre Curie'), ('Number', '4')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q47285'), ('personName', 'J. J. Thomson'), ('Number', '3')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "#[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?person ?personName (count (?discovery) AS ?Number)\n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #invented or discovered something\n",
    "    ?discovery wdt:P61 ?person .\n",
    "    \n",
    "    ?person sc:name ?personName .\n",
    "    \n",
    "   \n",
    "} group by  ?person ?personName \n",
    "having (count (?discovery)>=3)\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e9c7241",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "9895b543-a738-4ce2-af67-d6366d10b1d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q193803'), ('personName', 'Roger Penrose'), ('Number', '6')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q160518'), ('personName', 'Gustaf Dalén'), ('Number', '4')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q8753'), ('personName', 'Enrico Fermi'), ('Number', '6')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q123975'), ('personName', 'Michel Mayor'), ('Number', '12')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q173028'), ('personName', 'Emilio G. Segrè'), ('Number', '3')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q47480'), ('personName', 'Paul Dirac'), ('Number', '3')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q937'), ('personName', 'Albert Einstein'), ('Number', '10')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q37463'), ('personName', 'Pierre Curie'), ('Number', '4')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q47285'), ('personName', 'J. J. Thomson'), ('Number', '3')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P61'), ('name', 'discoverer or inventor')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "#[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?person ?personName (count (?discovery) AS ?Number)\n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #invented or discovered something\n",
    "    ?discovery wdt:P61 ?person .\n",
    "    \n",
    "   \n",
    "    \n",
    "    ?person sc:name ?personName .\n",
    "    \n",
    "   \n",
    "} group by  ?person ?personName \n",
    "having (count (?discovery)>=3)\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "951a8e9a",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Amongst the physicists who won the Nobel Prize in Physics, find who taught in the university of his/her city of birth (the result set must be a list of elements of the form physicist IRI, label, university IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "e003a7f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q57072'), ('personName', 'Otto Stern')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71024'), ('personName', 'Klaus von Klitzing')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q65807'), ('personName', 'Reinhard Genzel')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71022'), ('personName', 'Ernst Ruska')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q190495'), ('personName', 'Henry Way Kendall')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71023'), ('personName', 'Alfred Kastler')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q191922'), ('personName', 'Frederick Reines')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57063'), ('personName', 'Philipp Lenard')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57067'), ('personName', 'Max von Laue')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57068'), ('personName', 'Wilhelm Wien')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('job', 'http://www.wikidata.org/entity/Q169470'), ('jobname', 'physicist')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received'),\n",
    "#[('award', 'http://www.wikidata.org/entity/Q38104'), ('awardName', 'Nobel Prize in Physics')]\n",
    "#[('work', 'http://www.wikidata.org/entity/Q1622272'), ('workName', 'university teacher')]\n",
    "#all physicists who won the Nobel Prize in Physics, who taught in \"a\" university\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?person ?personName \n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher\n",
    "    ?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    \n",
    "   \n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "e2f8ec70-abf4-4203-854e-61e307c7cbbf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3911'), ('name', 'STW Thesaurus for Economics ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P487'), ('name', 'Unicode character')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8365'), ('name', 'Thesaurus Sozialwissenschaften ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P920'), ('name', 'LEM ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "#[('person', 'http://www.wikidata.org/entity/Q71024'), ('personName', 'Klaus von Klitzing')]\n",
    "#checking a random found node (university)from previous query to find the property related to location of university\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name\n",
    "WHERE {\n",
    "   wd:Q1622272 ?p ?obj.\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "#did not work so using another way "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "9d8c2da1-3378-46d4-8ed5-2debabb6316e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q819187'), ('name', 'Deutsche Physikalische Gesellschaft'), ('obj', 'http://www.wikidata.org/entity/Q15911314'), ('objname', 'association')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q635642'), ('name', 'Institute for Advanced Study'), ('obj', 'http://www.wikidata.org/entity/Q166118'), ('objname', 'archive')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q20971972'), ('objname', 'Original Public Ivy')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q23002039'), ('objname', 'public educational institution of the United States')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q615150'), ('objname', 'land-grant university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q708038'), ('name', 'Kaiser Wilhelm Society'), ('obj', 'http://www.wikidata.org/entity/Q748019'), ('objname', 'scientific society')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q329464'), ('name', 'Royal Prussian Academy of Sciences'), ('obj', 'http://www.wikidata.org/entity/Q414147'), ('objname', 'academy of sciences')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11942'), ('name', 'ETH Zürich'), ('obj', 'http://www.wikidata.org/entity/Q1371037'), ('objname', 'institute of technology')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q1187811'), ('objname', 'college town')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q14770218'), ('objname', 'cantonal capital of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q1549591'), ('objname', 'big city')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21578'), ('name', 'Princeton University'), ('obj', 'http://www.wikidata.org/entity/Q15936437'), ('objname', 'research university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21578'), ('name', 'Princeton University'), ('obj', 'http://www.wikidata.org/entity/Q23002054'), ('objname', 'private not-for-profit educational institution')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q156598'), ('name', 'Leiden University'), ('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1729754'), ('name', 'German University in Prague'), ('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q206702'), ('name', 'University of Zurich'), ('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q685539'), ('name', 'Swiss Federal Institute of Intellectual Property'), ('obj', 'http://www.wikidata.org/entity/Q43229'), ('objname', 'organization')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q659080'), ('name', 'University of Bern'), ('obj', 'http://www.wikidata.org/entity/Q45400320'), ('objname', 'open-access publisher')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q152087'), ('name', 'Humboldt University of Berlin'), ('obj', 'http://www.wikidata.org/entity/Q45400320'), ('objname', 'open-access publisher')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q5119'), ('objname', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q537250'), ('objname', 'federal city')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q54935504'), ('objname', 'city of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q56061'), ('objname', 'administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q70'), ('name', 'Bern'), ('obj', 'http://www.wikidata.org/entity/Q70208'), ('objname', 'municipality of Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21578'), ('name', 'Princeton University'), ('obj', 'http://www.wikidata.org/entity/Q902104'), ('objname', 'private university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q635642'), ('name', 'Institute for Advanced Study'), ('obj', 'http://www.wikidata.org/entity/Q31855'), ('objname', 'research institute')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q62078547'), ('objname', 'public research university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q152087'), ('name', 'Humboldt University of Berlin'), ('obj', 'http://www.wikidata.org/entity/Q62078547'), ('objname', 'public research university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q819187'), ('name', 'Deutsche Physikalische Gesellschaft'), ('obj', 'http://www.wikidata.org/entity/Q1391145'), ('objname', 'professional society')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q11422631'), ('objname', 'United Nations Depository Library')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q152087'), ('name', 'Humboldt University of Berlin'), ('obj', 'http://www.wikidata.org/entity/Q1767829'), ('objname', 'comprehensive university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q206702'), ('name', 'University of Zurich'), ('obj', 'http://www.wikidata.org/entity/Q1767829'), ('objname', 'comprehensive university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q659080'), ('name', 'University of Bern'), ('obj', 'http://www.wikidata.org/entity/Q1767829'), ('objname', 'comprehensive university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q659080'), ('name', 'University of Bern'), ('obj', 'http://www.wikidata.org/entity/Q875538'), ('objname', 'public university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q31519'), ('name', 'Charles University'), ('obj', 'http://www.wikidata.org/entity/Q875538'), ('objname', 'public university')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q168756'), ('name', 'University of California, Berkeley'), ('obj', 'http://www.wikidata.org/entity/Q3053337'), ('objname', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21578'), ('name', 'Princeton University'), ('obj', 'http://www.wikidata.org/entity/Q1188663'), ('objname', 'Colonial Colleges')]\n",
      "37\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer'),\n",
    "#('inv', 'http://www.wikidata.org/entity/Q3918'), ('invName', 'university')]\n",
    "#[('inv', 'http://www.wikidata.org/entity/Q937'), ('invName', 'Albert Einstein')]\n",
    "\n",
    "#finding place of teaching \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name ?obj ?objname\n",
    "WHERE {\n",
    "    wd:Q937 wdt:P108 ?p.\n",
    "    ?p wdt:P31 ?obj .\n",
    "    \n",
    "    ?p sc:name ?name.\n",
    "    ?obj sc:name ?objname\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "2b8a7daf-c6e9-4e89-bad5-29ad10d24e1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q190495'), ('personName', 'Henry Way Kendall')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q191922'), ('personName', 'Frederick Reines')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57063'), ('personName', 'Philipp Lenard')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57067'), ('personName', 'Max von Laue')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57070'), ('personName', 'Gustav Ludwig Hertz')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57100'), ('personName', 'Maria Goeppert Mayer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q39246'), ('personName', 'Richard Feynman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q130975'), ('personName', 'Robert A. Millikan')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q131721'), ('personName', 'Johannes Diderik van der Waals')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q163415'), ('personName', 'William Shockley')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
    "#had been employed by a university \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?person ?personName \n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher\n",
    "    ?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    #university employed \n",
    "    ?person wdt:P108 ?university.\n",
    "    ?university wdt:P31 wd:Q3918.\n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    \n",
    "   \n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "5b624c5e-2b5f-4c97-8a68-481d454a2268",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location'), ('obj', 'http://www.wikidata.org/entity/Q72'), ('objname', 'Zürich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at'), ('obj', 'http://www.wikidata.org/entity/Q31839584'), ('objname', 'UZH Archives')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P355'), ('name', 'subsidiary'), ('obj', 'http://www.wikidata.org/entity/Q15850649'), ('objname', 'Faculty of Theology of the University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at'), ('obj', 'http://www.wikidata.org/entity/Q2324789'), ('objname', 'Staatsarchiv des Kantons Zürich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q27490237'), ('objname', 'Main Library of the University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('name', 'owner of'), ('obj', 'http://www.wikidata.org/entity/Q38141077'), ('objname', 'Oerlikon Campus')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses'), ('obj', 'http://www.wikidata.org/entity/Q66647864'), ('objname', 'University of Zurich, main building')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4195'), ('name', 'category for employees of the organization'), ('obj', 'http://www.wikidata.org/entity/Q7997450'), ('objname', 'Category:University of Zurich faculty')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part'), ('obj', 'http://www.wikidata.org/entity/Q856547'), ('objname', 'University of Zurich Law Library')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7561'), ('name', 'category for the interior of the item'), ('obj', 'http://www.wikidata.org/entity/Q86119132'), ('objname', 'Category:Interior of the University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q8946129'), ('objname', 'Category:University of Zurich')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3876'), ('name', 'category for alumni of educational institution'), ('obj', 'http://www.wikidata.org/entity/Q9758902'), ('objname', 'Category:University of Zurich alumni')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country'), ('obj', 'http://www.wikidata.org/entity/Q39'), ('objname', 'Switzerland')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of'), ('obj', 'http://www.wikidata.org/entity/Q868940'), ('objname', 'European University Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of'), ('obj', 'http://www.wikidata.org/entity/Q1559701'), ('objname', 'Informationsdienst Wissenschaft e.V.')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('obj', 'http://www.wikidata.org/entity/Q1767829'), ('objname', 'comprehensive university')]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "#finding location property for university \n",
    "#[('p', 'http://www.wikidata.org/entity/Q206702'), ('name', 'University of Zurich')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name ?obj ?objname\n",
    "WHERE {\n",
    "   wd:Q206702 ?p ?obj .\n",
    "    ?p sc:name ?name.\n",
    "    ?obj sc:name ?objname\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "c6890906-e5c3-4d98-bab7-636328508543",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q72')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#finding location property for university \n",
    "#[('p', 'http://www.wikidata.org/entity/Q206702'), ('name', 'University of Zurich')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q3918'), ('objname', 'university')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?x\n",
    "WHERE {\n",
    "   wd:Q206702 wdt:P159 ?x.\n",
    "   ?x sc:name ?name .\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3cd59020-dbc3-41fc-a410-273e43433a5e",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 174,
   "id": "4aeb3965-2358-42cb-a67c-4a15b5f5acd6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q133267'), ('personName', 'Lev Landau')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q201853'), ('personName', 'David Lee')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q83557'), ('personName', 'Nikolay Basov')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q556543'), ('personName', 'Gérard Mourou')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q192712'), ('personName', 'Kai Siegbahn')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q54945'), ('personName', 'Hannes Alfvén')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q170741'), ('personName', 'Manne Siegbahn')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q131729'), ('personName', 'Lawrence Bragg')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q184499'), ('personName', 'Patrick Blackett, Baron Blackett')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q7085'), ('personName', 'Niels Bohr')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q155794'), ('personName', 'Hans Bethe')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57063'), ('personName', 'Philipp Lenard')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q127944'), ('personName', 'Arthur Compton')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q79000'), ('personName', 'Pieter Zeeman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q191922'), ('personName', 'Frederick Reines')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q127234'), ('personName', 'Albert A. Michelson')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q83552'), ('personName', 'Alexander Prokhorov')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57070'), ('personName', 'Gustav Ludwig Hertz')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q40904'), ('personName', 'Werner Heisenberg')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q70532'), ('personName', 'Hans Georg Dehmelt')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q163415'), ('personName', 'William Shockley')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71013'), ('personName', 'Theodor W. Hänsch')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q123022'), ('personName', 'Felix Bloch')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q205954'), ('personName', 'Eric Allin Cornell')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q130113'), ('personName', 'Robert Hofstadter')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q172466'), ('personName', 'Steven Chu')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q206379'), ('personName', 'Carl Wieman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q192106'), ('personName', 'Burton Richter')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q189997'), ('personName', 'Robert B. Laughlin')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q201470'), ('personName', 'Richard E. Taylor')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q206405'), ('personName', 'Douglas Osheroff')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q190495'), ('personName', 'Henry Way Kendall')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q179282'), ('personName', 'Steven Weinberg')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q165969'), ('personName', 'Isidor Isaac Rabi')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q2128461'), ('personName', 'Rainer Weiss')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q183270'), ('personName', 'Edward Mills Purcell')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q187822'), ('personName', 'Jerome Isaac Friedman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q184566'), ('personName', 'Charles Hard Townes')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q192715'), ('personName', 'Samuel C. C. Ting')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q107450'), ('personName', 'Frank Wilczek')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q201506'), ('personName', 'Clifford Shull')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q76462'), ('personName', 'Wolfgang Ketterle')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q151746'), ('personName', 'François Englert')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q323320'), ('personName', 'Kip S. Thorne')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q193803'), ('personName', 'Roger Penrose')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q41688'), ('personName', 'Hendrik Lorentz')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q937'), ('personName', 'Albert Einstein')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q184592'), ('personName', \"Gerard 't Hooft\")]\n",
      "[('person', 'http://www.wikidata.org/entity/Q155790'), ('personName', 'Eugene Wigner')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q189987'), ('personName', 'Nicolaas Bloembergen')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q62891'), ('personName', 'Heike Kamerlingh Onnes')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q190697'), ('personName', 'Claude Cohen-Tannoudji')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q202149'), ('personName', 'Martinus J. G. Veltman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q181369'), ('personName', 'Chen-ning Yang')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q64188'), ('personName', 'Roy J. Glauber')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q40262'), ('personName', 'David Gross')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q193655'), ('personName', 'John Hasbrouck Van Vleck')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q1002250'), ('personName', 'Duncan Haldane')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q39246'), ('personName', 'Richard Feynman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q130975'), ('personName', 'Robert A. Millikan')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q169366'), ('personName', 'Carl David Anderson')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q46120'), ('personName', 'William Alfred Fowler')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q44286'), ('personName', 'Rudolf Mössbauer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q107407'), ('personName', 'Hugh David Politzer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q160522'), ('personName', 'Charles Glover Barkla')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57100'), ('personName', 'Maria Goeppert Mayer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q186481'), ('personName', 'Riccardo Giacconi')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57066'), ('personName', 'James Franck')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q57067'), ('personName', 'Max von Laue')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q122298'), ('personName', 'Karl Alexander Müller')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q133222'), ('personName', 'Clinton Davisson')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q106494'), ('personName', 'Konstantin Novoselov')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q71016'), ('personName', 'Herbert Kroemer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q153201'), ('personName', 'John Robert Schrieffer')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q60429'), ('personName', 'C. V. Raman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q192685'), ('personName', 'Joseph Hooton Taylor')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q192695'), ('personName', 'Leon M. Lederman')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q131721'), ('personName', 'Johannes Diderik van der Waals')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q11443689'), ('personName', 'Hiroshi Amano')]\n",
      "79\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location'), \n",
    "#('obj', 'http://www.wikidata.org/entity/Q72'), ('objname', 'Zürich')]\n",
    "\n",
    "#finding university location \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?person ?personName \n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher\n",
    "    ?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    #university employed \n",
    "    ?person wdt:P108 ?university.\n",
    "    ?university wdt:P31 wd:Q3918.\n",
    "    \n",
    "    #university location \n",
    "    \n",
    "    ?university wdt:P159 ?uniLocation .\n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    \n",
    "   \n",
    "} \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "87a9e3bb-0504-429b-acf4-a83e553c0b86",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('personName', 'Albert A. Michelson'), ('universityName', 'Case Western Reserve University'), ('uniloc', 'Cleveland'), ('bloc', 'Strzelno')]\n",
      "[('personName', 'Albert Einstein'), ('universityName', 'University of Zurich'), ('uniloc', 'Zürich'), ('bloc', 'Ulm')]\n",
      "[('personName', 'Albert Einstein'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Ulm')]\n",
      "[('personName', 'Albert Einstein'), ('universityName', 'German University in Prague'), ('uniloc', 'Prague'), ('bloc', 'Ulm')]\n",
      "[('personName', 'Alexander Prokhorov'), ('universityName', 'Moscow State University'), ('uniloc', 'Moscow'), ('bloc', 'Atherton')]\n",
      "[('personName', 'Alexander Prokhorov'), ('universityName', 'Moscow Institute of Physics and Technology'), ('uniloc', 'Dolgoprudny'), ('bloc', 'Atherton')]\n",
      "[('personName', 'Arthur Compton'), ('universityName', 'Washington University in St.\\xa0Louis'), ('uniloc', 'St. Louis'), ('bloc', 'Wooster')]\n",
      "[('personName', 'Arthur Compton'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Wooster')]\n",
      "[('personName', 'Burton Richter'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'New York City')]\n",
      "[('personName', 'C. V. Raman'), ('universityName', 'Banaras Hindu University'), ('uniloc', 'Varanasi'), ('bloc', 'Trichy')]\n",
      "[('personName', 'Carl David Anderson'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'New York City')]\n",
      "[('personName', 'Carl Wieman'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Corvallis')]\n",
      "[('personName', 'Charles Glover Barkla'), ('universityName', 'University of London'), ('uniloc', 'London'), ('bloc', 'Widnes')]\n",
      "[('personName', 'Charles Hard Townes'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Greenville')]\n",
      "[('personName', 'Chen-ning Yang'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Hefei County')]\n",
      "[('personName', 'Chen-ning Yang'), ('universityName', 'Tsinghua University'), ('uniloc', 'Beijing'), ('bloc', 'Hefei County')]\n",
      "[('personName', 'Claude Cohen-Tannoudji'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Constantine')]\n",
      "[('personName', 'Clifford Shull'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Pittsburgh')]\n",
      "[('personName', 'Clinton Davisson'), ('universityName', 'University of Virginia'), ('uniloc', 'Charlottesville'), ('bloc', 'Bloomington')]\n",
      "[('personName', 'David Gross'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Washington, D.C.')]\n",
      "[('personName', 'David Gross'), ('universityName', 'University of California, Santa Barbara'), ('uniloc', 'Santa Barbara'), ('bloc', 'Washington, D.C.')]\n",
      "[('personName', 'David Lee'), ('universityName', 'Texas A&M University'), ('uniloc', 'College Station'), ('bloc', 'Rye')]\n",
      "[('personName', 'David Lee'), ('universityName', 'University of Florida'), ('uniloc', 'Gainesville'), ('bloc', 'Rye')]\n",
      "[('personName', 'Douglas Osheroff'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Aberdeen')]\n",
      "[('personName', 'Duncan Haldane'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'London')]\n",
      "[('personName', 'Edward Mills Purcell'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Taylorville')]\n",
      "[('personName', 'Eric Allin Cornell'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Palo Alto')]\n",
      "[('personName', 'Eugene Wigner'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Budapest')]\n",
      "[('personName', 'Felix Bloch'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Zürich')]\n",
      "[('personName', 'Felix Bloch'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Zürich')]\n",
      "[('personName', 'Frank Wilczek'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Mineola')]\n",
      "[('personName', 'Frank Wilczek'), ('universityName', 'University of California, Santa Barbara'), ('uniloc', 'Santa Barbara'), ('bloc', 'Mineola')]\n",
      "[('personName', 'Frank Wilczek'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Mineola')]\n",
      "[('personName', 'François Englert'), ('universityName', 'Tel Aviv University'), ('uniloc', 'Tel Aviv'), ('bloc', 'Etterbeek')]\n",
      "[('personName', 'François Englert'), ('universityName', 'Université libre de Bruxelles'), ('uniloc', 'Avenue Franklin Roosevelt - Franklin Rooseveltlaan'), ('bloc', 'Etterbeek')]\n",
      "[('personName', 'Frederick Reines'), ('universityName', 'Case Western Reserve University'), ('uniloc', 'Cleveland'), ('bloc', 'Paterson')]\n",
      "[('personName', \"Gerard 't Hooft\"), ('universityName', 'Utrecht University'), ('uniloc', 'Utrecht'), ('bloc', 'Den Helder')]\n",
      "[('personName', \"Gerard 't Hooft\"), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Den Helder')]\n",
      "[('personName', 'Gustav Ludwig Hertz'), ('universityName', 'Leipzig University'), ('uniloc', 'Leipzig'), ('bloc', 'Hamburg')]\n",
      "[('personName', 'Gérard Mourou'), ('universityName', 'University of Rochester'), ('uniloc', 'Rochester'), ('bloc', 'Albertville')]\n",
      "[('personName', 'Hannes Alfvén'), ('universityName', 'Uppsala University'), ('uniloc', 'Uppsala'), ('bloc', 'Norrköping')]\n",
      "[('personName', 'Hans Bethe'), ('universityName', 'University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Strasbourg')]\n",
      "[('personName', 'Hans Bethe'), ('universityName', 'Victoria University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Strasbourg')]\n",
      "[('personName', 'Hans Georg Dehmelt'), ('universityName', 'Duke University'), ('uniloc', 'Durham'), ('bloc', 'Görlitz')]\n",
      "[('personName', 'Heike Kamerlingh Onnes'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Groningen')]\n",
      "[('personName', 'Hendrik Lorentz'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Arnhem')]\n",
      "[('personName', 'Henry Way Kendall'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Boston')]\n",
      "[('personName', 'Herbert Kroemer'), ('universityName', 'University of California, Santa Barbara'), ('uniloc', 'Santa Barbara'), ('bloc', 'Weimar')]\n",
      "[('personName', 'Hiroshi Amano'), ('universityName', 'Nagoya University'), ('uniloc', 'Nagoya'), ('bloc', 'Hamamatsu')]\n",
      "[('personName', 'Hugh David Politzer'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'New York City')]\n",
      "[('personName', 'Isidor Isaac Rabi'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Rymanów')]\n",
      "[('personName', 'James Franck'), ('universityName', 'Johns Hopkins University'), ('uniloc', 'Baltimore'), ('bloc', 'Hamburg')]\n",
      "[('personName', 'Jerome Isaac Friedman'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Chicago')]\n",
      "[('personName', 'Johannes Diderik van der Waals'), ('universityName', 'University of Amsterdam'), ('uniloc', 'Amsterdam'), ('bloc', 'Leiden')]\n",
      "[('personName', 'John Hasbrouck Van Vleck'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Middletown')]\n",
      "[('personName', 'John Robert Schrieffer'), ('universityName', 'University of California, Santa Barbara'), ('uniloc', 'Santa Barbara'), ('bloc', 'Oak Park')]\n",
      "[('personName', 'Joseph Hooton Taylor'), ('universityName', 'University of Massachusetts Amherst'), ('uniloc', 'Amherst'), ('bloc', 'Philadelphia')]\n",
      "[('personName', 'Kai Siegbahn'), ('universityName', 'Uppsala University'), ('uniloc', 'Uppsala'), ('bloc', 'Lund')]\n",
      "[('personName', 'Karl Alexander Müller'), ('universityName', 'University of Zurich'), ('uniloc', 'Zürich'), ('bloc', 'Basel')]\n",
      "[('personName', 'Kip S. Thorne'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'Logan')]\n",
      "[('personName', 'Kip S. Thorne'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Logan')]\n",
      "[('personName', 'Konstantin Novoselov'), ('universityName', 'University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Nizhny Tagil')]\n",
      "[('personName', 'Lawrence Bragg'), ('universityName', 'Victoria University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Adelaide')]\n",
      "[('personName', 'Lawrence Bragg'), ('universityName', 'University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Adelaide')]\n",
      "[('personName', 'Leon M. Lederman'), ('universityName', 'Illinois Institute of Technology'), ('uniloc', 'Chicago'), ('bloc', 'New York City')]\n",
      "[('personName', 'Lev Landau'), ('universityName', 'National University of Kharkiv'), ('uniloc', 'Kharkiv'), ('bloc', 'Baku')]\n",
      "[('personName', 'Lev Landau'), ('universityName', 'Moscow Institute of Physics and Technology'), ('uniloc', 'Dolgoprudny'), ('bloc', 'Baku')]\n",
      "[('personName', 'Lev Landau'), ('universityName', 'Moscow State University'), ('uniloc', 'Moscow'), ('bloc', 'Baku')]\n",
      "[('personName', 'Manne Siegbahn'), ('universityName', 'Uppsala University'), ('uniloc', 'Uppsala'), ('bloc', 'Örebro Nikolai parish')]\n",
      "[('personName', 'Manne Siegbahn'), ('universityName', 'Lund University'), ('uniloc', 'Lund'), ('bloc', 'Örebro Nikolai parish')]\n",
      "[('personName', 'Maria Goeppert Mayer'), ('universityName', 'Johns Hopkins University'), ('uniloc', 'Baltimore'), ('bloc', 'Katowice')]\n",
      "[('personName', 'Martinus J. G. Veltman'), ('universityName', 'Utrecht University'), ('uniloc', 'Utrecht'), ('bloc', 'Waalwijk')]\n",
      "[('personName', 'Martinus J. G. Veltman'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Waalwijk')]\n",
      "[('personName', 'Max von Laue'), ('universityName', 'University of Zurich'), ('uniloc', 'Zürich'), ('bloc', 'Koblenz')]\n",
      "[('personName', 'Nicolaas Bloembergen'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Dordrecht')]\n",
      "[('personName', 'Niels Bohr'), ('universityName', 'University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Copenhagen')]\n",
      "[('personName', 'Niels Bohr'), ('universityName', 'Victoria University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'Copenhagen')]\n",
      "[('personName', 'Nikolay Basov'), ('universityName', 'National Research Nuclear University'), ('uniloc', 'Moscow'), ('bloc', 'Usman')]\n",
      "[('personName', 'Patrick Blackett, Baron Blackett'), ('universityName', 'University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'London')]\n",
      "[('personName', 'Patrick Blackett, Baron Blackett'), ('universityName', 'Victoria University of Manchester'), ('uniloc', 'Manchester'), ('bloc', 'London')]\n",
      "[('personName', 'Philipp Lenard'), ('universityName', 'Budapest University of Technology and Economics'), ('uniloc', 'Budapest'), ('bloc', 'Bratislava')]\n",
      "[('personName', 'Pieter Zeeman'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Zonnemaire')]\n",
      "[('personName', 'Pieter Zeeman'), ('universityName', 'Delft University of Technology'), ('uniloc', 'Delft'), ('bloc', 'Zonnemaire')]\n",
      "[('personName', 'Pieter Zeeman'), ('universityName', 'University of Amsterdam'), ('uniloc', 'Amsterdam'), ('bloc', 'Zonnemaire')]\n",
      "[('personName', 'Rainer Weiss'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Berlin')]\n",
      "[('personName', 'Riccardo Giacconi'), ('universityName', 'Johns Hopkins University'), ('uniloc', 'Baltimore'), ('bloc', 'Genoa')]\n",
      "[('personName', 'Richard E. Taylor'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Medicine Hat')]\n",
      "[('personName', 'Richard Feynman'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'Far Rockaway')]\n",
      "[('personName', 'Robert A. Millikan'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'Morrison')]\n",
      "[('personName', 'Robert B. Laughlin'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Visalia')]\n",
      "[('personName', 'Robert Hofstadter'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'New York City')]\n",
      "[('personName', 'Roger Penrose'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'Colchester')]\n",
      "[('personName', 'Roy J. Glauber'), ('universityName', 'Leiden University'), ('uniloc', 'Leiden'), ('bloc', 'New York City')]\n",
      "[('personName', 'Rudolf Mössbauer'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'Munich')]\n",
      "[('personName', 'Samuel C. C. Ting'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Ann Arbor')]\n",
      "[('personName', 'Steven Chu'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'St. Louis')]\n",
      "[('personName', 'Steven Weinberg'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'New York City')]\n",
      "[('personName', 'Theodor W. Hänsch'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'Heidelberg')]\n",
      "[('personName', 'Theodor W. Hänsch'), ('universityName', 'University of Florence'), ('uniloc', 'Florence'), ('bloc', 'Heidelberg')]\n",
      "[('personName', 'Werner Heisenberg'), ('universityName', 'Leipzig University'), ('uniloc', 'Leipzig'), ('bloc', 'Würzburg')]\n",
      "[('personName', 'William Alfred Fowler'), ('universityName', 'California Institute of Technology'), ('uniloc', 'California'), ('bloc', 'Pittsburgh')]\n",
      "[('personName', 'William Shockley'), ('universityName', 'Stanford University'), ('uniloc', 'Stanford'), ('bloc', 'London')]\n",
      "[('personName', 'Wolfgang Ketterle'), ('universityName', 'Massachusetts Institute of Technology'), ('uniloc', 'Cambridge'), ('bloc', 'Heidelberg')]\n",
      "103\n"
     ]
    }
   ],
   "source": [
    "#Checking the outputs\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?personName ?universityName ?uniloc ?bloc\n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher\n",
    "    ?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    #university employed \n",
    "    ?person wdt:P108 ?university.\n",
    "    ?university wdt:P31 wd:Q3918.\n",
    "    \n",
    "    #university location \n",
    "    \n",
    "    ?university wdt:P159 ?uniLocation .\n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    ?university sc:name ?universityName.\n",
    "    ?uniLocation sc:name ?uniloc.\n",
    "    ?birthPlace sc:name ?bloc.\n",
    "   \n",
    "} group by   ?personName ?u ?b\n",
    "order by ?personName\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "1aa3bb03-af55-4085-8931-a22212f1d49d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "#wdt:P106\toccupation\tpredicate\n",
    "#[('work', 'http://www.wikidata.org/entity/Q1622272'), ('workName', 'university teacher')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
    "#I deleted the condition being a university teacher because when you apply this condition the query has no results \n",
    "\n",
    "#Final \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?person ?personName ?university ?universityName\n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher \n",
    "    ?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    #university employed \n",
    "    ?person wdt:P108 ?university.\n",
    "    ?university wdt:P31 wd:Q3918.\n",
    "    \n",
    "    #university location \n",
    "    \n",
    "    ?university wdt:P159 ?uniLocation .\n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    ?university sc:name ?universityName.\n",
    "    ?uniLocation sc:name ?u.\n",
    "    ?birthPlace sc:name ?b\n",
    "    \n",
    "    FILTER (?u=?b)\n",
    "\n",
    "   \n",
    "} \n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ddd2627f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "4af58b96-f740-43bf-8461-47910a4fd136",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('person', 'http://www.wikidata.org/entity/Q202164'), ('personName', 'Makoto Kobayashi'), ('university', 'http://www.wikidata.org/entity/Q1191132'), ('universityName', 'Nagoya University')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q9130'), ('personName', 'Erwin Schrödinger'), ('university', 'http://www.wikidata.org/entity/Q165980'), ('universityName', 'University of Vienna')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q202168'), ('personName', 'Toshihide Maskawa'), ('university', 'http://www.wikidata.org/entity/Q1191132'), ('universityName', 'Nagoya University')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q188128'), ('personName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q4315005'), ('universityName', 'National University of Science and Technology')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q188128'), ('personName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q13164'), ('universityName', 'Moscow State University')]\n",
      "[('person', 'http://www.wikidata.org/entity/Q188128'), ('personName', 'Alexei Abrikosov'), ('university', 'http://www.wikidata.org/entity/Q1472245'), ('universityName', 'Bauman Moscow State Technical University')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#wdt:P106\toccupation\tpredicate\n",
    "#[('work', 'http://www.wikidata.org/entity/Q1622272'), ('workName', 'university teacher')]\n",
    "#[('obj', 'http://www.wikidata.org/entity/Q7191'), ('objName', 'Nobel Prize')]\n",
    "#I deleted the condition being a university teacher because when you apply this condition the query has no results \n",
    "\n",
    "#Final \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?person ?personName ?university ?universityName\n",
    "WHERE {\n",
    "    \n",
    "    #being pysict\n",
    "    ?person wdt:P106 wd:Q169470.\n",
    "    \n",
    "    #winner of Nobel of pysics\n",
    "    ?person wdt:P166 wd:Q38104.\n",
    "    \n",
    "    #being university teacher (DELETED BECAUSE WHEN ADD THIS CONDITION RETURNS NOTHING)\n",
    "    #?person wdt:P106 wd:Q1622272.\n",
    "    \n",
    "     #persons BirthPlace \n",
    "    ?person wdt:P19 ?birthPlace.\n",
    "    \n",
    "    #university employed \n",
    "    ?person wdt:P108 ?university.\n",
    "    ?university wdt:P31 wd:Q3918.\n",
    "    \n",
    "    #university location \n",
    "    \n",
    "    ?university wdt:P159 ?uniLocation .\n",
    "    \n",
    "    \n",
    "    \n",
    "    #labels\n",
    "    ?person sc:name ?personName .\n",
    "    ?university sc:name ?universityName.\n",
    "    ?uniLocation sc:name ?u.\n",
    "    ?birthPlace sc:name ?b\n",
    "    \n",
    "    FILTER (?u=?b)\n",
    "\n",
    "   \n",
    "} \n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ed99de8b-c8d7-48dd-834a-57f34184b335",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
