{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "56172287",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "bc36c445",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-ef712bc361-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1cf1cc32",
   "metadata": {},
   "source": [
    "# Sport Workflow Series (Basketball and NBA seasons explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    ">  investigate the world of basketball. Compare french teams and US teams, country of citizenship of NBA players, and teams which won NBA seasons."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0ec7ac99",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q41421`| Michael Jordan     | node |\n",
    "| `wd:Q25369`| Kobe Bryant     | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25dc68c0",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q41421 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Michael Jordan**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for basketball player.\n",
    "\n",
    "2. Identify the BGP for basketball.\n",
    "\n",
    "3. Identify the BGP for basketball team.\n",
    "\n",
    "4. Return all french basketball teams born before 1930 (the result set must be a list of triples basketball team IRI, label and year of inception).\n",
    "\n",
    "5. Return all the NBA season (the result set must be a list of couples NBA season IRI, label)\n",
    "\n",
    "6. Consider only the basketball teams which Michael Jordan and Kobe Bryant played. Return the number of NBA seasons won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team even if they never won a season).\n",
    "\n",
    "7. Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, label and #players)\n",
    "\n",
    "8. Identify the BGP for the NBA Defensive Player of the Year Award (see https://en.wikipedia.org/wiki/NBA_Defensive_Player_of_the_Year_Award)\n",
    "\n",
    "9. Consider the players who won the NBA Defensive Player of the Year Award. Return for these players the number of NBA Defensive Player of the Year Award won in their career (the result set must be triples of player IRI, label and #victories)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b5ee509a",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for basketball player."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "baa0459e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1048'), ('name', 'NCL ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('name', 'league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1285'), ('name', 'Munzinger Sport number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('name', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('name', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1447'), ('name', 'Sports-Reference.com Olympic athlete ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1449'), ('name', 'nickname')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1477'), ('name', 'birth name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1559'), ('name', 'name in native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1618'), ('name', 'sport number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1670'), ('name', 'Canadiana Authorities ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('name', 'owner of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1890'), ('name', 'CCAB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('name', 'Discogs artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2019'), ('name', 'AllMovie person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2032'), ('name', 'work period (end)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2048'), ('name', 'height')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2067'), ('name', 'mass')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('name', 'PORT person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2561'), ('name', 'name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('name', 'Kinopoisk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2626'), ('name', 'Danish National Filmography person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P271'), ('name', 'CiNii author ID (books)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P286'), ('name', 'head coach')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3056'), ('name', 'TCM Movie Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3065'), ('name', 'RERO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3348'), ('name', 'National Library of Greece ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('name', 'SNAC ARK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3478'), ('name', 'Songkick artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3527'), ('name', 'Eurobasket.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3542'), ('name', 'FIBA player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3630'), ('name', 'Babelio author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3696'), ('name', 'Sports-Reference.com college basketball player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3845'), ('name', 'TV Guide person ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3957'), ('name', 'RealGM basketball player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P413'), ('name', 'position played on team / speciality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4332'), ('name', 'Deutsche Synchronkartei actor ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P434'), ('name', 'MusicBrainz artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4438'), ('name', 'BFI Films, TV and people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4515'), ('name', 'Prisma ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4619'), ('name', 'National Library of Brazil ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4666'), ('name', 'CineMagia person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4790'), ('name', 'Basketball-Reference.com international player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5033'), ('name', 'Filmweb.pl person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5361'), ('name', 'BNB person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5421'), ('name', 'Trading Card Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P552'), ('name', 'handedness')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5534'), ('name', 'Open Media Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5617'), ('name', 'Evene ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6298'), ('name', 'bgm.tv person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6723'), ('name', 'BlackPast.org ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7369'), ('name', 'National Library of Chile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8179'), ('name', 'Canadiana NCF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8189'), ('name', 'National Library of Israel J9U ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8286'), ('name', 'Olympedia people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8548'), ('name', 'Proballers ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8796'), ('name', 'FilmPolski press collection ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8852'), ('name', 'facial hair')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9404'), ('name', 'OFDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P947'), ('name', 'RSL ID (person)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1826'), ('name', 'Baseball-Reference.com minor & foreign league player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2685'), ('name', 'Basketball Reference NBA player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3646'), ('name', 'Naismith Memorial Basketball Hall of Fame ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3647'), ('name', 'NBA.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3828'), ('name', 'wears')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P647'), ('name', 'drafted by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6865'), ('name', 'eurobasket.com coach ID')]\n",
      "145\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q41421 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 150\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "150a4527",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9b9ed127",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('job', 'http://www.wikidata.org/entity/Q131524'), ('jobName', 'entrepreneur')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q18814623'), ('jobName', 'autobiographer')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q33999'), ('jobName', 'actor')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q3665646'), ('jobName', 'basketball player')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q10871364'), ('jobName', 'baseball player')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q17221'), ('jobName', 'spokesperson')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?job ?jobName\n",
    "WHERE {\n",
    "   # using Profession property\n",
    "   wd:Q41421 wdt:P106 ?job .\n",
    "   \n",
    "   # get the label\n",
    "   ?job sc:name ?jobName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9e4021e2",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for basketball."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1bf4195f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sport', 'http://www.wikidata.org/entity/Q5369'), ('sportName', 'baseball')]\n",
      "[('sport', 'http://www.wikidata.org/entity/Q5372'), ('sportName', 'basketball')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sport ?sportName\n",
    "WHERE {\n",
    "   # using Profession property\n",
    "   wd:Q41421 wdt:P641 ?sport .\n",
    "   \n",
    "   # get the label\n",
    "   ?sport sc:name ?sportName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9ebca994",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "baedb692",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sport', 'http://www.wikidata.org/entity/Q5369'), ('sportName', 'baseball')]\n",
      "[('sport', 'http://www.wikidata.org/entity/Q5372'), ('sportName', 'basketball')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sport ?sportName\n",
    "WHERE {\n",
    "   # using Profession property\n",
    "   wd:Q41421 wdt:P641 ?sport .\n",
    "   \n",
    "   # get the label\n",
    "   ?sport sc:name ?sportName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04622e57",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for basketball team."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "47c9b7f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('job', 'http://www.wikidata.org/entity/Q131524'), ('jobName', 'entrepreneur')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q18814623'), ('jobName', 'autobiographer')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q33999'), ('jobName', 'actor')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q3665646'), ('jobName', 'basketball player')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q10871364'), ('jobName', 'baseball player')]\n",
      "[('job', 'http://www.wikidata.org/entity/Q17221'), ('jobName', 'spokesperson')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?job ?jobName\n",
    "WHERE {\n",
    "   # using Profession property\n",
    "   wd:Q41421 wdt:P106 ?job .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?job sc:name ?jobName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "2cfb83b0-d4fc-485e-9b6f-a375f9d53e3c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q18536342'), ('oname', 'competitive player')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P4557'), ('oname', 'Indiana Basketball Hall of Fame ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q28640'), ('oname', 'profession')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('pname', 'field of this occupation'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pname', 'sport'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2685'), ('oname', 'Basketball Reference NBA player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3647'), ('oname', 'NBA.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3696'), ('oname', 'Sports-Reference.com college basketball player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P4561'), ('oname', 'Basketball Reference WNBA player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P4744'), ('oname', 'Basketball-Reference.com NBA G League player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q2066131'), ('oname', 'athlete')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3957'), ('oname', 'RealGM basketball player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('pname', 'field of this occupation'), ('o', 'http://www.wikidata.org/entity/Q48890'), ('oname', 'college basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3685'), ('oname', 'ESPN.com NBA player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P6063'), ('oname', 'Scoresway basketball person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5722'), ('oname', 'Greek Basket League ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P5725'), ('oname', 'Baloncesto Superior Nacional ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P4796'), ('oname', 'Basketball-Reference.com NBL player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P4612'), ('oname', 'LKL player ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('job', 'http://www.wikidata.org/entity/Q3665646'), ('jobName', 'basketball player')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding basketball player properties\n",
    "   wd:Q3665646 ?p ?o .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24037ec4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "7f78ae86",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# From results: [('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'),\n",
    "#('o', 'http://www.wikidata.org/entity/Q13393265'),('oname', 'basketball team')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname\n",
    "WHERE {\n",
    "   # Using part of property\n",
    "   wd:Q3665646 wdt:P361 ?o .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   #?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "945f7f50",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return all french basketball teams born before 1930 (the result set must be a list of triples basketball team IRI, label and year of inception)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0629f180-bb35-4db3-a15e-2fe6cab8d999",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2747877'), ('teamName', 'Birmingham Barons')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3476102'), ('teamName', 'Scottsdale Scorpions')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4412061'), ('teamName', \"North Carolina Tar Heels men's basketball\")]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName\n",
    "WHERE {\n",
    "   # Finding basketball team properties\n",
    "   wd:Q41421 wdt:P54 ?team.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "72e9abe8-90ca-408d-962d-4e90303d852a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P859'), ('pname', 'sponsor'), ('o', 'http://www.wikidata.org/entity/Q174769'), ('oname', 'United Airlines')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P115'), ('pname', 'home venue'), ('o', 'http://www.wikidata.org/entity/Q639975'), ('oname', 'United Center')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('pname', 'headquarters location'), ('o', 'http://www.wikidata.org/entity/Q1297'), ('oname', 'Chicago')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pname', 'sport'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('pname', 'league'), ('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('pname', 'owned by'), ('o', 'http://www.wikidata.org/entity/Q5273097'), ('oname', 'Dick Klein')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q745984'), ('oname', 'Central Division')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8879406'), ('oname', 'Category:Chicago Bulls')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('pname', 'owned by'), ('o', 'http://www.wikidata.org/entity/Q2662152'), ('oname', 'Jerry Reinsdorf')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P286'), ('pname', 'head coach'), ('o', 'http://www.wikidata.org/entity/Q580808'), ('oname', 'Fred Hoiberg')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P859'), ('pname', 'sponsor'), ('o', 'http://www.wikidata.org/entity/Q37189902'), ('oname', 'Mr. Submarine')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P822'), ('pname', 'mascot'), ('o', 'http://www.wikidata.org/entity/Q4890070'), ('oname', 'Benny the Bull')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "#From results: [('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding sports club properties\n",
    "   wd:Q128109 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "e703ca8e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q51747567'), ('oname', 'squad')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q3665646'), ('oname', 'basketball player')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pname', 'sport'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q5137571'), ('oname', 'basketball coach')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q847017'), ('oname', 'sports club')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q5648512'), ('oname', 'Template:Infobox basketball club')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q5647277'), ('oname', 'Category:Basketball teams')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# [('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding basketball team properties\n",
    "   wd:Q13393265 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "b6557ab0-9e37-4a5d-bd19-ed640b094c9b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2670'), ('pname', 'has parts of the class'), ('o', 'http://www.wikidata.org/entity/Q51747567'), ('oname', 'squad')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q2657718'), ('oname', 'Armenian Soviet Encyclopedia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q4438121'), ('oname', 'sports organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q19467997'), ('oname', 'Template:Infobox athletics club')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q12973014'), ('oname', 'sports team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q988108'), ('oname', 'club')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q9717774'), ('oname', 'Category:Sports clubs')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q10730006'), ('oname', 'Template:Infobox sports team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P4999'), ('oname', 'number of clubs')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'),\n",
    "#('o', 'http://www.wikidata.org/entity/Q847017'),('oname', 'sports club')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding sports club properties\n",
    "   wd:Q847017 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "7c6a1d07-2174-4488-90eb-3773d4eeda34",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('pname', 'field of work'), ('o', 'http://www.wikidata.org/entity/Q349'), ('oname', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q43229'), ('oname', 'organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q4088044'), ('oname', 'Category:Sports organizations')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), \n",
    "#('o', 'http://www.wikidata.org/entity/Q4438121'), ('oname', 'sports organization')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding sports organization properties\n",
    "   wd:Q4438121 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "4ecc8848-1483-4a03-8193-24d3a3d2ba6a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3500'), ('oname', 'Ringgold ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P213'), ('oname', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1705'), ('oname', 'native label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3549'), ('oname', 'Australian Company Number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1278'), ('oname', 'Legal Entity Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1320'), ('oname', 'OpenCorporates ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from'), ('o', 'http://www.wikidata.org/entity/Q36993249'), ('oname', 'arranging')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1056'), ('oname', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1329'), ('oname', 'phone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality'), ('o', 'http://www.wikidata.org/entity/Q3535173'), ('oname', 'organizational life cycle')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q6671777'), ('oname', 'structure')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P159'), ('oname', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality'), ('o', 'http://www.wikidata.org/entity/Q17197366'), ('oname', 'type of organisation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q10756188'), ('oname', 'treasury')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2657'), ('oname', 'EU Transparency Register ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality'), ('o', 'http://www.wikidata.org/entity/Q730573'), ('oname', 'organizational culture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P17'), ('oname', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P112'), ('oname', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P571'), ('oname', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1128'), ('oname', 'employees')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), \n",
    "#('o', 'http://www.wikidata.org/entity/Q43229'), ('oname', 'organization')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding organization properties\n",
    "   wd:Q43229 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "03e92957-1cd1-4f7f-a629-00e669f97661",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q795707'), ('teamName', 'BCM Gravelines'), ('countryName', 'France'), ('inception', '1984-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1075934'), ('teamName', 'Cholet Basket'), ('countryName', 'France'), ('inception', '1975-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2892731'), ('teamName', 'Paris Université Club'), ('countryName', 'France'), ('inception', '1906-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q404421'), ('teamName', 'STB Le Havre'), ('countryName', 'France'), ('inception', '1924-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2887227'), ('teamName', 'Basket Landes'), ('countryName', 'France'), ('inception', '2003-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q40063'), ('teamName', 'Le Mans Sarthe Basket'), ('countryName', 'France'), ('inception', '1939-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2868091'), ('teamName', 'AS Monaco Basket'), ('countryName', 'France'), ('inception', '1924-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2352349'), ('teamName', 'JA Vichy'), ('countryName', 'France'), ('inception', '1933-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3178083'), ('teamName', 'JSA Bordeaux Basket'), ('countryName', 'France'), ('inception', '1938-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3532914'), ('teamName', 'Toulouse Métropole Basket'), ('countryName', 'France'), ('inception', '2008-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3549999'), ('teamName', 'LDLC ASVEL féminin'), ('countryName', 'France'), ('inception', '2000-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1076356'), ('teamName', 'Chorale Roanne Basket'), ('countryName', 'France'), ('inception', '1937-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1630650'), ('teamName', 'JL Bourg-en-Bresse'), ('countryName', 'France'), ('inception', '1910-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2819242'), ('teamName', 'ALM Évreux Basket'), ('countryName', 'France'), ('inception', '1962-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2868120'), ('teamName', 'Union Tours Basket Métropole'), ('countryName', 'France'), ('inception', '1925-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2931972'), ('teamName', 'Basket CRO Lyon'), ('countryName', 'France'), ('inception', '1927-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3237162'), ('teamName', 'Levallois Sporting Club Basket'), ('countryName', 'France'), ('inception', '1941-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3322888'), ('teamName', 'Montpellier Paillade Basket'), ('countryName', 'France'), ('inception', '1982-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3423824'), ('teamName', 'Reims Champagne Basket'), ('countryName', 'France'), ('inception', '1973-01-01T00:00:00Z')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3463255'), ('teamName', 'Saint-Quentin Basket-Ball'), ('countryName', 'France'), ('inception', '1973-01-01T00:00:00Z')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('o', 'http://www.wikidata.org/entity/P17'), ('oname', 'country')]\n",
    "\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('o', 'http://www.wikidata.org/entity/P571'), ('oname', 'inception')]\n",
    "\n",
    "# [('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName ?countryName ?inception\n",
    "WHERE {\n",
    "   \n",
    "   # set team as an instance of a basketball team\n",
    "   ?team wdt:P31 wd:Q13393265 ;\n",
    "         wdt:P17 ?country ;\n",
    "         wdt:P571 ?inception .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName .\n",
    "   ?country sc:name ?countryName.\n",
    "   \n",
    "   #filtering to get all French teams with their date of inception\n",
    "   \n",
    "   FILTER ( REGEX (?countryName, \"^[Ff]rance$\") )\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f878d6c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "4cf472b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q2892731'), ('teamName', 'Paris Université Club'), ('Inception', '1906')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q404421'), ('teamName', 'STB Le Havre'), ('Inception', '1924')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2868091'), ('teamName', 'AS Monaco Basket'), ('Inception', '1924')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1630650'), ('teamName', 'JL Bourg-en-Bresse'), ('Inception', '1910')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2868120'), ('teamName', 'Union Tours Basket Métropole'), ('Inception', '1925')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2931972'), ('teamName', 'Basket CRO Lyon'), ('Inception', '1927')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2887216'), ('teamName', 'BC Orchies'), ('Inception', '1922')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3592481'), ('teamName', 'Étoile de Charleville-Mézières'), ('Inception', '1921')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q638938'), ('teamName', 'Paris Basket Racing'), ('Inception', '1922')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1682230'), ('teamName', 'JDA Dijon Basket'), ('Inception', '1880')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1419876'), ('teamName', 'Limoges CSP'), ('Inception', '1929')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2737338'), ('teamName', 'SIG Basket'), ('Inception', '1928')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3550518'), ('teamName', 'Union Sportive Valenciennes Olympic'), ('Inception', '1923')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3496108'), ('teamName', 'Stade Français'), ('Inception', '1883')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1630255'), ('teamName', 'SPO Rouen Basket'), ('Inception', '1892')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1630671'), ('teamName', 'Nanterre 92'), ('Inception', '1927')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q303321'), ('teamName', 'Berck BC'), ('Inception', '1929')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q783067'), ('teamName', 'Alsace de Bagnolet'), ('Inception', '1908')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3134233'), ('teamName', 'Hermine de Nantes Atlantique'), ('Inception', '1891')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3459221'), ('teamName', 'Stade Auto Lyon'), ('Inception', '1916')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3351710'), ('teamName', 'Olympique Lille Basket'), ('Inception', '1924')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2955800'), ('teamName', 'Championnet Sports'), ('Inception', '1907')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3076509'), ('teamName', 'FC Grenoble'), ('Inception', '1911')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1415460'), ('teamName', 'Clermont UC'), ('Inception', '1921')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3547512'), ('teamName', 'US Métro'), ('Inception', '1928')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2930983'), ('teamName', 'CAUFA Reims'), ('Inception', '1919')]\n",
      "26\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName ( YEAR(?inception) as ?Inception ) \n",
    "WHERE {\n",
    "   \n",
    "   # Finding basketball team properties\n",
    "   ?team wdt:P31 wd:Q13393265 ;\n",
    "         wdt:P17 ?country ;\n",
    "         wdt:P571 ?inception .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName .\n",
    "   ?country sc:name ?countryName.\n",
    "   \n",
    "   FILTER ( REGEX (?countryName, \"^[Ff]rance$\") )\n",
    "   FILTER ( YEAR(?inception) < 1930 )\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12f033c9",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return all the NBA season (the result set must be a list of couples NBA season IRI, label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "3bd112af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q18536323'), ('oname', 'basketball league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q15986354'), ('oname', 'basketball association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q238240'), ('oname', 'Eastern Conference')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pname', 'owner of'), ('o', 'http://www.wikidata.org/entity/Q2455323'), ('oname', 'NBA TV')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces'), ('o', 'http://www.wikidata.org/entity/Q810343'), ('oname', 'Basketball Association of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6118'), ('pname', 'season ends'), ('o', 'http://www.wikidata.org/entity/Q118'), ('oname', 'April')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4794'), ('pname', 'season starts'), ('o', 'http://www.wikidata.org/entity/Q124'), ('oname', 'October')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q15991290'), ('oname', 'professional sports league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q16'), ('oname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2094'), ('pname', 'competition class'), ('o', 'http://www.wikidata.org/entity/Q46343203'), ('oname', \"men's basketball\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pname', 'sport'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q7094076'), ('oname', 'online database')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2500'), ('pname', 'league level below'), ('o', 'http://www.wikidata.org/entity/Q842793'), ('oname', 'NBA G League')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('pname', 'Wikidata property'), ('o', 'http://www.wikidata.org/entity/P3647'), ('oname', 'NBA.com player ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('pname', 'winner'), ('o', 'http://www.wikidata.org/entity/Q121783'), ('oname', 'Los Angeles Lakers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pname', 'owner of'), ('o', 'http://www.wikidata.org/entity/Q6952699'), ('oname', 'NBA Store')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q318389'), ('oname', 'Western Conference')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8663448'), ('oname', 'Category:National Basketball Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2500'), ('pname', 'league level below'), ('o', 'http://www.wikidata.org/entity/Q1287605'), ('oname', 'NBA Summer League')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q10950388'), ('oname', 'Template:NBA seasons')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pname', 'owner of'), ('o', 'http://www.wikidata.org/entity/Q1470803'), ('oname', 'Three-Point Contest')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# From Task 4 (properties for [('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls')] :\n",
    "\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P118'), ('pname', 'league'), \n",
    "#('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding National Basketball Association properties\n",
    "   wd:Q155223 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   #FILTER (REGEX(?oname , \".*season.*\"))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "4cdffee1-cec8-4ca5-b89f-765534bf9dd3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?inst ?instname\n",
    "WHERE {\n",
    "   # Finding National Basketball Association instances\n",
    "   ?inst wdt:P31 wd:Q155223 .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?instname .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "83a22c35-5d41-4676-95e6-648d25ae8b7a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1591'), ('pname', 'defendant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1423'), ('pname', 'template has topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('pname', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('pname', 'league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('pname', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('pname', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P137'), ('pname', 'operator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('pname', 'record label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('pname', \"category's main topic\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3450'), ('pname', 'sports season of league or competition')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('pname', 'occupant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P664'), ('pname', 'organizer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('pname', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P971'), ('pname', 'category combines topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1027'), ('pname', 'conferred by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2499'), ('pname', 'league level above')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1629'), ('pname', 'Wikidata item of this property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('pname', 'Wikidata property example')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9073'), ('pname', \"applicable 'stated in' value\")]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "#('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "WHERE {\n",
    "   # trying to find related property for NBA as an object\n",
    "    ?s ?p wd:Q155223 .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "96b9fde2-8868-4de0-89d6-5eddd8c166c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('season', 'http://www.wikidata.org/entity/Q600389'), ('seasonName', '1990–91 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264531'), ('seasonName', '1967–68 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q241834'), ('seasonName', '1989–90 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q602553'), ('seasonName', '1969–70 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2294127'), ('seasonName', '1971–72 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q113619'), ('seasonName', '2012–13 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16191100'), ('seasonName', '2014-15 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q19862716'), ('seasonName', '2015–16 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q631240'), ('seasonName', '1979–80 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1142320'), ('seasonName', '2005–06 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q281094'), ('seasonName', '1949–50 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q52702755'), ('seasonName', '2018–19 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1121549'), ('seasonName', '2007–08 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264502'), ('seasonName', '1961–62 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069853'), ('seasonName', '1983–84 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264540'), ('seasonName', '1975–76 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q548783'), ('seasonName', '1977–78 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q29098111'), ('seasonName', '2017–18 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1255750'), ('seasonName', '2011–12 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069810'), ('seasonName', '1980–81 NBA season')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P3450'), ('pname', 'sports season of league or competition')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?season ?seasonName\n",
    "WHERE {\n",
    "   # Finding National Basketball Association instances\n",
    "    ?season wdt:P3450 wd:Q155223 .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName.\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "839dad75",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2777b1a9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('season', 'http://www.wikidata.org/entity/Q600389'), ('seasonName', '1990–91 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264531'), ('seasonName', '1967–68 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q241834'), ('seasonName', '1989–90 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q602553'), ('seasonName', '1969–70 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2294127'), ('seasonName', '1971–72 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q113619'), ('seasonName', '2012–13 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16191100'), ('seasonName', '2014-15 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q19862716'), ('seasonName', '2015–16 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q631240'), ('seasonName', '1979–80 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1142320'), ('seasonName', '2005–06 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q281094'), ('seasonName', '1949–50 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q52702755'), ('seasonName', '2018–19 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1121549'), ('seasonName', '2007–08 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264502'), ('seasonName', '1961–62 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069853'), ('seasonName', '1983–84 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264540'), ('seasonName', '1975–76 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q548783'), ('seasonName', '1977–78 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q29098111'), ('seasonName', '2017–18 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1255750'), ('seasonName', '2011–12 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069810'), ('seasonName', '1980–81 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1132622'), ('seasonName', '2001–02 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1132641'), ('seasonName', '1999–2000 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1132659'), ('seasonName', '2003–04 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1132667'), ('seasonName', '2000–01 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1135932'), ('seasonName', '2002–03 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1164506'), ('seasonName', '1992–93 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1164516'), ('seasonName', '1994–95 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1165925'), ('seasonName', '1993–94 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1321737'), ('seasonName', '1995–96 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1321749'), ('seasonName', '1996–97 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1321776'), ('seasonName', '1998–99 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q925570'), ('seasonName', '1997–98 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q941115'), ('seasonName', '2004–05 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1999389'), ('seasonName', '1952–53 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q11144228'), ('seasonName', '2013–14 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q63637259'), ('seasonName', '2019–20 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q795347'), ('seasonName', '1946–47 BAA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q96083208'), ('seasonName', '2020–21 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069819'), ('seasonName', '1985–86 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q106495853'), ('seasonName', '2021–22 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1130071'), ('seasonName', '2009–10 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1130082'), ('seasonName', '2008–09 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1143957'), ('seasonName', '2010–11 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q23939796'), ('seasonName', '2016–17 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264628'), ('seasonName', '1964–65 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264617'), ('seasonName', '1962–63 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q997459'), ('seasonName', '2006–07 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q389447'), ('seasonName', '1972–73 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q795353'), ('seasonName', '1948–49 BAA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q517679'), ('seasonName', '1991–92 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q15719374'), ('seasonName', '2013 NBA Summer League')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2294141'), ('seasonName', '1966–67 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264581'), ('seasonName', '1973–74 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1341019'), ('seasonName', '1988–89 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q929005'), ('seasonName', '1970–71 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264512'), ('seasonName', '1960–61 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1464834'), ('seasonName', '1965–66 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264563'), ('seasonName', '1955–56 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069909'), ('seasonName', '1959–60 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2067270'), ('seasonName', '1978–79 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069838'), ('seasonName', '1986–87 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2001832'), ('seasonName', '1951–52 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q24909542'), ('seasonName', '2016 NBA Summer League')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264593'), ('seasonName', '1968–69 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264605'), ('seasonName', '1957–58 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1999363'), ('seasonName', '1950–51 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17107932'), ('seasonName', '2012 NBA Summer League')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264490'), ('seasonName', '1956–57 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264551'), ('seasonName', '1974–75 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1986458'), ('seasonName', '1987–88 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1986727'), ('seasonName', '1984–85 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069829'), ('seasonName', '1976–77 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2067173'), ('seasonName', '1982–83 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264639'), ('seasonName', '1958–59 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q30646987'), ('seasonName', '2017 NBA Summer League')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264522'), ('seasonName', '1963–64 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2264571'), ('seasonName', '1954–55 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1999399'), ('seasonName', '1953–54 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2069861'), ('seasonName', '1981–82 NBA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q795349'), ('seasonName', '1947–48 BAA season')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17001379'), ('seasonName', '2014 NBA Summer League')]\n",
      "81\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?season ?seasonName\n",
    "WHERE {\n",
    "   # Finding National Basketball Association instances\n",
    "    ?season wdt:P3450 wd:Q155223 .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName.\n",
    "  \n",
    "   \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b16dcd88",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Consider only the basketball teams which Michael Jordan and Kobe Bryant played. Return the number of NBA seasons won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team even if they never won a season)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "563b082b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('player', 'http://www.wikidata.org/entity/Q25369'), ('playerName', 'Kobe Bryant'), ('team', 'http://www.wikidata.org/entity/Q121783'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('team', 'http://www.wikidata.org/entity/Q2747877'), ('teamName', 'Birmingham Barons')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('team', 'http://www.wikidata.org/entity/Q3476102'), ('teamName', 'Scottsdale Scorpions')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('team', 'http://www.wikidata.org/entity/Q4412061'), ('teamName', \"North Carolina Tar Heels men's basketball\")]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?player ?playerName ?team ?teamName\n",
    "WHERE {\n",
    "   \n",
    "   VALUES ?player { wd:Q41421 wd:Q25369 }\n",
    "   # using member of sports team property\n",
    "   ?player  wdt:P54 ?team .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?player sc:name ?playerName .\n",
    "   ?team sc:name ?teamName .\n",
    "}\n",
    "LIMIT 150\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "57e786cf-052f-4048-a1e6-ad4c73138057",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q8172698'), ('oname', 'Category:1990–91 NBA season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2348'), ('pname', 'time period'), ('o', 'http://www.wikidata.org/entity/Q53389240'), ('oname', '1990-1991 one-year-period')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q27020041'), ('oname', 'sports season')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('o', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2094'), ('pname', 'competition class'), ('o', 'http://www.wikidata.org/entity/Q46343203'), ('oname', \"men's basketball\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pname', 'sport'), ('o', 'http://www.wikidata.org/entity/Q5372'), ('oname', 'basketball')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3450'), ('pname', 'sports season of league or competition'), ('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P664'), ('pname', 'organizer'), ('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1346'), ('pname', 'winner'), ('o', 'http://www.wikidata.org/entity/Q128109'), ('oname', 'Chicago Bulls')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#From Task 5 as an example of a season:\n",
    "#[('season', 'http://www.wikidata.org/entity/Q600389'),('seasonName', '1990–91 NBA season')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname\n",
    "WHERE {\n",
    "   # Finding an NBA season properties\n",
    "   wd:Q600389 ?p ?o.\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "af20d9ae-cb48-45ac-b15e-4a873d0b7e94",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('seasonName', '1990–91 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1971–72 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1979–80 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1949–50 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1977–78 NBA season'), ('teamName', 'Washington Wizards')]\n",
      "[('seasonName', '2001–02 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1999–2000 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '2000–01 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1992–93 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1995–96 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1996–97 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1997–98 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1952–53 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '2019–20 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '2009–10 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '2008–09 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1948–49 BAA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1991–92 NBA season'), ('teamName', 'Chicago Bulls')]\n",
      "[('seasonName', '1986–87 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('seasonName', '1951–52 NBA season'), ('teamName', 'Los Angeles Lakers')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P1346'), ('pname', 'winner'),\n",
    "#('o', 'http://www.wikidata.org/entity/Q128109'), ('oname', 'Chicago Bulls')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?seasonName ?teamName\n",
    "WHERE {\n",
    "\n",
    "   #All teams Jordan and Kobe played in\n",
    "   VALUES ?team { wd:Q121783 wd:Q128109 wd:Q169165 wd:Q2747877 wd:Q3476102 wd:Q4412061 } \n",
    "   # all NBA seasons\n",
    "   ?season wdt:P3450 wd:Q155223 .\n",
    "   \n",
    "   ?season wdt:P1346 ?team .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName .\n",
    "   ?team sc:name ?teamName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c85c2a17",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('teamName', 'Los Angeles Lakers'), ('winner', '17')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards'), ('winner', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls'), ('winner', '6')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName (COUNT(?season) as ?winner)\n",
    "WHERE {\n",
    "\n",
    " \n",
    "   #All teams Jordan and Kobe played in\n",
    "   VALUES ?team { wd:Q121783 wd:Q128109 wd:Q169165 wd:Q2747877 wd:Q3476102 wd:Q4412061 } \n",
    "\n",
    "   # all NBA seasons\n",
    "   ?season wdt:P3450 wd:Q155223 .\n",
    "   \n",
    "   # all seasons with a winner from ?team\n",
    "   ?season wdt:P1346 ?team .\n",
    "   \n",
    "   # get the label\n",
    "   ?season sc:name ?seasonName .\n",
    "   ?team sc:name ?teamName .\n",
    "}\n",
    "GROUP BY (?team) (?teamName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "3f2fd311-a1dc-4229-99e4-e4c3ff3db884",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('teamName', 'Los Angeles Lakers'), ('winner', '17')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3476102'), ('teamName', 'Scottsdale Scorpions'), ('winner', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards'), ('winner', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls'), ('winner', '6')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2747877'), ('teamName', 'Birmingham Barons'), ('winner', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4412061'), ('teamName', \"North Carolina Tar Heels men's basketball\"), ('winner', '1')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
    "#('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
    "#[('x', 'http://www.wikidata.org/prop/direct/P3450'), ('xname', 'sports season of league or competition')]\n",
    "#('xname', '1990–91 NBA season'), ('p', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?teamName (count (?team) as ?winner)\n",
    "WHERE {\n",
    "    VALUES ?player {wd:Q41421  wd:Q25369}\n",
    "   \n",
    "    ?player wdt:P54 ?team .\n",
    "    \n",
    "    optional{\n",
    "    ?season wdt:P3450 wd:Q155223.\n",
    "    ?season wdt:P1346 ?team.\n",
    "    }\n",
    "\n",
    "    ?team sc:name ?teamName.\n",
    " \n",
    "   \n",
    "}\n",
    "GROUP BY (?team) (?teamName)\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8990331",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "e427e851-e438-4684-b631-1654a276e611",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('teamName', 'Los Angeles Lakers'), ('winner', '17')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3476102'), ('teamName', 'Scottsdale Scorpions'), ('winner', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards'), ('winner', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls'), ('winner', '6')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2747877'), ('teamName', 'Birmingham Barons'), ('winner', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4412061'), ('teamName', \"North Carolina Tar Heels men's basketball\"), ('winner', '0')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName (COUNT(?season) as ?winner)\n",
    "WHERE {\n",
    "\n",
    " \n",
    "   #All teams Jordan and Kobe played in\n",
    "   VALUES ?team { wd:Q121783 wd:Q128109 wd:Q169165 wd:Q2747877 wd:Q3476102 wd:Q4412061 } \n",
    "\n",
    "   {\n",
    "   # all NBA seasons\n",
    "   ?season wdt:P3450 wd:Q155223 .\n",
    "   \n",
    "   # all seasons with a winner from ?team\n",
    "   ?season wdt:P1346 ?team .\n",
    "   \n",
    "     # get the label\n",
    "     ?season sc:name ?seasonName .\n",
    "     ?team sc:name ?teamName .\n",
    "   }\n",
    "   UNION\n",
    "   {\n",
    "   \n",
    "    ?team ?p ?o .\n",
    "   \n",
    "     # get the label\n",
    "     ?team sc:name ?teamName .\n",
    "   \n",
    "   }\n",
    " \n",
    "}\n",
    "GROUP BY (?team) (?teamName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2b23dc13",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, label and #players)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "b643f1e1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1591'), ('pname', 'defendant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1423'), ('pname', 'template has topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('pname', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('pname', 'league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('pname', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('pname', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P137'), ('pname', 'operator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('pname', 'record label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('pname', \"category's main topic\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3450'), ('pname', 'sports season of league or competition')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P466'), ('pname', 'occupant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P664'), ('pname', 'organizer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P710'), ('pname', 'participant')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('pname', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P971'), ('pname', 'category combines topics')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1027'), ('pname', 'conferred by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2499'), ('pname', 'league level above')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1629'), ('pname', 'Wikidata item of this property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('pname', 'Wikidata property example')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9073'), ('pname', \"applicable 'stated in' value\")]\n",
      "24\n"
     ]
    }
   ],
   "source": [
    "#('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "WHERE {\n",
    "   # trying to find related property for NBA as an object\n",
    "    ?s ?p wd:Q155223 .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "id": "49c4c19a-1da0-4703-9bfe-38da8fc97e93",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q131364'), ('teamName', 'New York Knicks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q162954'), ('teamName', 'Denver Nuggets')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q167253'), ('teamName', 'Portland Trail Blazers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q180950'), ('teamName', 'Oklahoma City Thunder')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q976396'), ('teamName', 'Los Angeles Clippers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q166105'), ('teamName', 'Sacramento Kings')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q170649'), ('teamName', 'Utah Jazz')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q138089'), ('teamName', 'Philadelphia 76ers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q161345'), ('teamName', 'Houston Rockets')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q164177'), ('teamName', 'Phoenix Suns')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q172339'), ('teamName', 'New Orleans Pelicans')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q161337'), ('teamName', 'Orlando Magic')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q159729'), ('teamName', 'San Antonio Spurs')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q572134'), ('teamName', 'Brooklyn Nets')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q159893'), ('teamName', 'Atlanta Hawks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169138'), ('teamName', 'Miami Heat')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3360254'), ('teamName', 'Anderson Packers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('teamName', 'Los Angeles Lakers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q128109'), ('teamName', 'Chicago Bulls')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q157376'), ('teamName', 'Golden State Warriors')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q163480'), ('teamName', 'Charlotte Hornets')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169165'), ('teamName', 'Washington Wizards')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169637'), ('teamName', 'Milwaukee Bucks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q131371'), ('teamName', 'Boston Celtics')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q162990'), ('teamName', 'Cleveland Cavaliers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q165529'), ('teamName', 'Memphis Grizzlies')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q132880'), ('teamName', 'Toronto Raptors')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q132893'), ('teamName', 'Dallas Mavericks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169661'), ('teamName', 'Detroit Pistons')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q170558'), ('teamName', 'Minnesota Timberwolves')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q170329'), ('teamName', 'Indiana Pacers')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2928124'), ('teamName', 'Baltimore Bullets')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q2354728'), ('teamName', 'Sheboygan Red Skins')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q513372'), ('teamName', 'Indianapolis Olympians')]\n",
      "34\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P118'), ('pname', 'league')]\n",
    "\n",
    "## [('o', 'http://www.wikidata.org/entity/Q13393265'), ('oname', 'basketball team')]\n",
    "##('o', 'http://www.wikidata.org/entity/Q155223'), ('oname', 'National Basketball Association')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?teamName\n",
    "WHERE {\n",
    "   # all NBA teams\n",
    "    ?team wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName.\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "id": "a35f0386-04d7-42ca-800b-0c861990951e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('playerName', 'Bill Bradley'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Stephon Marbury'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'DerMarr Johnson'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Jason Kidd'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Bruno Šundov'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Gene Shue'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Ernie Grunfeld'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Emmanuel Mudiay'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'James Bailey'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Danilo Gallinari'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Sergio Rodríguez'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Carmelo Anthony'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Scott Brooks'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Paul Westphal'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Patrick Ewing'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Derek Harper'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Larry Johnson'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Bill Walker'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Charles Oakley'), ('teamName', 'New York Knicks')]\n",
      "[('playerName', 'Mark Jackson'), ('teamName', 'New York Knicks')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
    "#[('job', 'http://www.wikidata.org/entity/Q3665646'), ('jobName', 'basketball player')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?playerName ?teamName\n",
    "WHERE {\n",
    "   # all NBA teams\n",
    "    ?team wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   \n",
    "   #all players played for an NBA team\n",
    "    ?player wdt:P31 wd:Q5 ;\n",
    "            wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P54 ?team .\n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName.\n",
    "   ?player sc:name ?playerName .\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "id": "fa2555e0-2039-4b45-9481-055e399e5663",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('playerName', 'Ime Udoka'), ('teamName', 'New York Knicks'), ('countryName', 'Nigeria')]\n",
      "[('playerName', 'Cheikh Samb'), ('teamName', 'New York Knicks'), ('countryName', 'Senegal')]\n",
      "[('playerName', 'Mouhamed Sene'), ('teamName', 'New York Knicks'), ('countryName', 'Senegal')]\n",
      "[('playerName', 'Joakim Noah'), ('teamName', 'New York Knicks'), ('countryName', 'France')]\n",
      "[('playerName', 'Ronny Turiaf'), ('teamName', 'New York Knicks'), ('countryName', 'France')]\n",
      "[('playerName', 'Frank Ntilikina'), ('teamName', 'New York Knicks'), ('countryName', 'France')]\n",
      "[('playerName', 'Kevin Seraphin'), ('teamName', 'New York Knicks'), ('countryName', 'France')]\n",
      "[('playerName', 'Alexey Shved'), ('teamName', 'New York Knicks'), ('countryName', 'Russia')]\n",
      "[('playerName', 'Timofey Mozgov'), ('teamName', 'New York Knicks'), ('countryName', 'Russia')]\n",
      "[('playerName', 'RJ Barrett'), ('teamName', 'New York Knicks'), ('countryName', 'Canada')]\n",
      "[('playerName', 'Samuel Dalembert'), ('teamName', 'New York Knicks'), ('countryName', 'Canada')]\n",
      "[('playerName', 'Ernie Vandeweghe'), ('teamName', 'New York Knicks'), ('countryName', 'Canada')]\n",
      "[('playerName', 'Iggy Brazdeikis'), ('teamName', 'New York Knicks'), ('countryName', 'Canada')]\n",
      "[('playerName', 'Frido Frey'), ('teamName', 'New York Knicks'), ('countryName', 'Germany')]\n",
      "[('playerName', 'Kristaps Porziņģis'), ('teamName', 'New York Knicks'), ('countryName', 'Latvia')]\n",
      "[('playerName', 'Beno Udrih'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia')]\n",
      "[('playerName', 'Anthony Randolph'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia')]\n",
      "[('playerName', 'Sasha Vujačić'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia')]\n",
      "[('playerName', 'Ernie Grunfeld'), ('teamName', 'New York Knicks'), ('countryName', 'Romania')]\n",
      "[('playerName', 'Bruno Šundov'), ('teamName', 'New York Knicks'), ('countryName', 'Croatia')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?playerName ?teamName ?countryName\n",
    "WHERE {\n",
    "   # all NBA teams\n",
    "    ?team wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   \n",
    "   #all players played for an NBA team with their nationality\n",
    "    ?player wdt:P31 wd:Q5 ;\n",
    "            wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P54 ?team ;\n",
    "            wdt:P27 ?country .\n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName.\n",
    "   ?player sc:name ?playerName .\n",
    "   ?country sc:name ?countryName .\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "1d2983b4-e40a-4105-8b3d-9100fcd8aa87",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('pname', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('pname', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('pname', 'facet of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1304'), ('pname', 'central bank')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('pname', 'located in the administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('pname', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pname', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('pname', 'religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('pname', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('pname', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('pname', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('pname', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1589'), ('pname', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1622'), ('pname', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('pname', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1740'), ('pname', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1791'), ('pname', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('pname', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P190'), ('pname', 'twinned administrative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('pname', 'office held by head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('pname', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('pname', 'located in or next to body of water')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('pname', 'executive body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P209'), ('pname', 'highest judicial authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('pname', 'history of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('pname', 'coat of arms')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2388'), ('pname', 'office held by head of the organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2596'), ('pname', 'culture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2633'), ('pname', 'geography of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2852'), ('pname', 'emergency telephone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2853'), ('pname', 'electrical plug type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2872'), ('pname', 'visitor centre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3075'), ('pname', 'official religion')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P35'), ('pname', 'head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('pname', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# trying to find properties related to continent \n",
    "# as an example:\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname \n",
    "WHERE {\n",
    "   # Finding country properties\n",
    "   ?person wdt:P31 wd:Q5 ;\n",
    "           wdt:P27 ?country .\n",
    "   ?country ?p ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?o sc:name ?oname .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "id": "88abab0f-5fc2-40f3-a433-45c5636e3e3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('playerName', 'Ime Udoka'), ('teamName', 'New York Knicks'), ('countryName', 'Nigeria'), ('continentName', 'Africa')]\n",
      "[('playerName', 'Cheikh Samb'), ('teamName', 'New York Knicks'), ('countryName', 'Senegal'), ('continentName', 'Africa')]\n",
      "[('playerName', 'Mouhamed Sene'), ('teamName', 'New York Knicks'), ('countryName', 'Senegal'), ('continentName', 'Africa')]\n",
      "[('playerName', 'Joakim Noah'), ('teamName', 'New York Knicks'), ('countryName', 'France'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Ronny Turiaf'), ('teamName', 'New York Knicks'), ('countryName', 'France'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Frank Ntilikina'), ('teamName', 'New York Knicks'), ('countryName', 'France'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Kevin Seraphin'), ('teamName', 'New York Knicks'), ('countryName', 'France'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Alexey Shved'), ('teamName', 'New York Knicks'), ('countryName', 'Russia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Timofey Mozgov'), ('teamName', 'New York Knicks'), ('countryName', 'Russia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Frido Frey'), ('teamName', 'New York Knicks'), ('countryName', 'Germany'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Kristaps Porziņģis'), ('teamName', 'New York Knicks'), ('countryName', 'Latvia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Beno Udrih'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Anthony Randolph'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Sasha Vujačić'), ('teamName', 'New York Knicks'), ('countryName', 'Slovenia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Ernie Grunfeld'), ('teamName', 'New York Knicks'), ('countryName', 'Romania'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Bruno Šundov'), ('teamName', 'New York Knicks'), ('countryName', 'Croatia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Mario Hezonja'), ('teamName', 'New York Knicks'), ('countryName', 'Croatia'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Sergio Rodríguez'), ('teamName', 'New York Knicks'), ('countryName', 'Spain'), ('continentName', 'Europe')]\n",
      "[('playerName', 'José Manuel Calderón'), ('teamName', 'New York Knicks'), ('countryName', 'Spain'), ('continentName', 'Europe')]\n",
      "[('playerName', 'Pablo Prigioni'), ('teamName', 'New York Knicks'), ('countryName', 'Spain'), ('continentName', 'Europe')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?playerName ?teamName ?countryName ?continentName\n",
    "WHERE {\n",
    "   # all NBA teams\n",
    "    ?team wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   \n",
    "   #all players played for an NBA team with their nationality\n",
    "    ?player wdt:P31 wd:Q5 ;\n",
    "            wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P54 ?team ;\n",
    "            wdt:P27 ?country .\n",
    "   # continent of the player citizenship\n",
    "    ?country wdt:P30 ?continent .\n",
    "   \n",
    "   # get the label\n",
    "   ?team sc:name ?teamName.\n",
    "   ?player sc:name ?playerName .\n",
    "   ?country sc:name ?countryName .\n",
    "   ?continent sc:name ?continentName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f88d746a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "6f10cd0a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentName', 'Europe'), ('players', '300')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q538'), ('continentName', 'Insular Oceania'), ('players', '3770')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q15'), ('continentName', 'Africa'), ('players', '60')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q48'), ('continentName', 'Asia'), ('players', '73')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q5401'), ('continentName', 'Eurasia'), ('players', '17')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q18'), ('continentName', 'South America'), ('players', '37')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q49'), ('continentName', 'North America'), ('players', '3820')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#From results: [('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?continent ?continentName (COUNT(DISTINCT ?player) as ?players)\n",
    "WHERE {\n",
    "   # all NBA teams\n",
    "    ?team wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   \n",
    "   #all players played for an NBA team with their nationality\n",
    "    ?player wdt:P31 wd:Q5 ;\n",
    "            wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P54 ?team ;\n",
    "            wdt:P27 ?country .\n",
    "   # continent of the player citizenship\n",
    "    ?country wdt:P30 ?continent .\n",
    "   \n",
    "   # get the label\n",
    "   #?team sc:name ?teamName.\n",
    "   #?player sc:name ?playerName .\n",
    "   #?country sc:name ?countryName .\n",
    "   ?continent sc:name ?continentName .\n",
    "}\n",
    "GROUP BY (?continent) (?continentName)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b751ca41",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Identify the BGP for the NBA Defensive Player of the Year Award (see https://en.wikipedia.org/wiki/NBA_Defensive_Player_of_the_Year_Award)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "c0e8fd79",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q1061233'), ('awardName', \"L'Équipe Champion of Champions\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17144'), ('awardName', 'Presidential Medal of Freedom')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q743122'), ('awardName', 'Associated Press Athlete of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q137003'), ('awardName', '50 Greatest Players in NBA History')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1418009'), ('awardName', 'NBA All-Rookie Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1465181'), ('awardName', 'NBA All-Defensive Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1641970'), ('awardName', 'John R. Wooden Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1653207'), ('awardName', 'Sports Illustrated Sportsperson of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q222047'), ('awardName', 'NBA Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2404133'), ('awardName', 'Oscar Robertson Trophy')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2666769'), ('awardName', 'Naismith College Player of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q31391'), ('awardName', 'NBA All-Star Game Kobe Bryant Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3304648'), ('awardName', \"Atlantic Coast Conference Men's Basketball Player of the Year\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4650547'), ('awardName', 'ACC Athlete of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4816371'), ('awardName', \"Atlantic Coast Conference Men's Basketball Rookie of the Year\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4896614'), ('awardName', 'Best Comeback Athlete ESPY Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4896724'), ('awardName', 'Best Male Athlete ESPY Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q586458'), ('awardName', 'FIBA Hall of Fame')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q644357'), ('awardName', 'NBA Rookie of the Year Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q674359'), ('awardName', 'All-NBA Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q739499'), ('awardName', 'Bill Russell NBA Finals Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q845884'), ('awardName', 'NBA Defensive Player of the Year Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q943106'), ('awardName', 'Best NBA Player ESPY Award')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "#From Task 1: [('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?awardName\n",
    "WHERE {\n",
    "   # awards received by Jordan\n",
    "    wd:Q41421 wdt:P166 ?award .\n",
    "   \n",
    "   # get the label\n",
    "   ?award sc:name ?awardName .\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0f9090f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b5feceec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q1061233'), ('awardName', \"L'Équipe Champion of Champions\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q17144'), ('awardName', 'Presidential Medal of Freedom')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q743122'), ('awardName', 'Associated Press Athlete of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q137003'), ('awardName', '50 Greatest Players in NBA History')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1418009'), ('awardName', 'NBA All-Rookie Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1465181'), ('awardName', 'NBA All-Defensive Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1641970'), ('awardName', 'John R. Wooden Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q1653207'), ('awardName', 'Sports Illustrated Sportsperson of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q222047'), ('awardName', 'NBA Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2404133'), ('awardName', 'Oscar Robertson Trophy')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q2666769'), ('awardName', 'Naismith College Player of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q31391'), ('awardName', 'NBA All-Star Game Kobe Bryant Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q3304648'), ('awardName', \"Atlantic Coast Conference Men's Basketball Player of the Year\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4650547'), ('awardName', 'ACC Athlete of the Year')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4816371'), ('awardName', \"Atlantic Coast Conference Men's Basketball Rookie of the Year\")]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4896614'), ('awardName', 'Best Comeback Athlete ESPY Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q4896724'), ('awardName', 'Best Male Athlete ESPY Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q586458'), ('awardName', 'FIBA Hall of Fame')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q644357'), ('awardName', 'NBA Rookie of the Year Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q674359'), ('awardName', 'All-NBA Team')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q739499'), ('awardName', 'Bill Russell NBA Finals Most Valuable Player Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q845884'), ('awardName', 'NBA Defensive Player of the Year Award')]\n",
      "[('award', 'http://www.wikidata.org/entity/Q943106'), ('awardName', 'Best NBA Player ESPY Award')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?awardName\n",
    "WHERE {\n",
    "   # awards received by Jordan\n",
    "    wd:Q41421 wdt:P166 ?award .\n",
    "   \n",
    "   # get the label\n",
    "   ?award sc:name ?awardName .\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "99003b20",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Consider the players who won the NBA Defensive Player of the Year Award. Return for these players the number of NBA Defensive Player of the Year Award won in their career (the result set must be triples of player IRI, label and #victories)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "09c45388",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('player', 'http://www.wikidata.org/entity/Q177928'), ('playerName', 'Sidney Moncrief')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q310968'), ('playerName', 'Alonzo Mourning')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q971538'), ('playerName', 'Michael Cooper')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q189240'), ('playerName', 'Kevin Garnett')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q273256'), ('playerName', 'Hakeem Olajuwon')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q211876'), ('playerName', 'David Robinson')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q361134'), ('playerName', 'Marcus Camby')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q295322'), ('playerName', 'Metta Sandiford-Artest')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q926248'), ('playerName', 'Kawhi Leonard')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q311735'), ('playerName', 'Joakim Noah')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q449245'), ('playerName', 'Alvin Robertson')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q201608'), ('playerName', 'Dennis Rodman')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q25278'), ('playerName', 'Dwight Howard')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q275889'), ('playerName', 'Marc Gasol')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q295364'), ('playerName', 'Ben Wallace')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q309872'), ('playerName', 'Gary Payton')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q313481'), ('playerName', 'Dikembe Mutombo')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q357757'), ('playerName', 'Mark Eaton')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q8991894'), ('playerName', 'Giannis Antetokounmpo')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q297146'), ('playerName', 'Tyson Chandler')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q3446792'), ('playerName', 'Rudy Gobert')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# From Task 8: [('award', 'http://www.wikidata.org/entity/Q845884'), ('awardName', 'NBA Defensive Player of the Year Award')]\n",
    "\n",
    "#[('job', 'http://www.wikidata.org/entity/Q3665646'), ('jobName', 'basketball player')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?player ?playerName\n",
    "WHERE {\n",
    "   # All basketball players who won NBA Defensive Player of the Year Award\n",
    "    ?player wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P166 wd:Q845884 .\n",
    "            \n",
    "   \n",
    "   # get the label\n",
    "   ?player sc:name ?playerName.\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "d952b03c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('player', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q357757'), ('playerName', 'Mark Eaton'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q361134'), ('playerName', 'Marcus Camby'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q201608'), ('playerName', 'Dennis Rodman'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q3446792'), ('playerName', 'Rudy Gobert'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q310968'), ('playerName', 'Alonzo Mourning'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q275889'), ('playerName', 'Marc Gasol'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q295322'), ('playerName', 'Metta Sandiford-Artest'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q311735'), ('playerName', 'Joakim Noah'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q211876'), ('playerName', 'David Robinson'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q926248'), ('playerName', 'Kawhi Leonard'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q25278'), ('playerName', 'Dwight Howard'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q8991894'), ('playerName', 'Giannis Antetokounmpo'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q309872'), ('playerName', 'Gary Payton'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q297146'), ('playerName', 'Tyson Chandler'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q177928'), ('playerName', 'Sidney Moncrief'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q273256'), ('playerName', 'Hakeem Olajuwon'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q295364'), ('playerName', 'Ben Wallace'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q971538'), ('playerName', 'Michael Cooper'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q189240'), ('playerName', 'Kevin Garnett'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q449245'), ('playerName', 'Alvin Robertson'), ('DPYaward', '1')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q313481'), ('playerName', 'Dikembe Mutombo'), ('DPYaward', '1')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?player ?playerName (COUNT(wd:Q845884) as ?DPYaward)\n",
    "WHERE {\n",
    "   # All basketball players who won NBA Defensive Player of the Year Award\n",
    "    ?player wdt:P106 wd:Q3665646 ;\n",
    "            wdt:P166 wd:Q845884 .\n",
    "            \n",
    "   \n",
    "   # get the label\n",
    "   ?player sc:name ?playerName.\n",
    "  \n",
    "   \n",
    "}\n",
    "GROUP BY (?player) (?playerName)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "02303daa-f8be-43e9-ad06-6f89c4cfedce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "# From Task 8: [('award', 'http://www.wikidata.org/entity/Q845884'), ('awardName', 'NBA Defensive Player of the Year Award')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "\n",
    "WHERE {\n",
    "   # NBA Defensive Player of the Year Award sub properties\n",
    "    wd:Q845884 wdt:P1647 ?o .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .\n",
    "  \n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "03707558-1801-489a-9c6d-e91662e40eb2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('winner', 'http://www.wikidata.org/entity/Q177928'), ('playerName', 'Sidney Moncrief')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q310968'), ('playerName', 'Alonzo Mourning')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q971538'), ('playerName', 'Michael Cooper')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q189240'), ('playerName', 'Kevin Garnett')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q41421'), ('playerName', 'Michael Jordan')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q273256'), ('playerName', 'Hakeem Olajuwon')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q211876'), ('playerName', 'David Robinson')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q361134'), ('playerName', 'Marcus Camby')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q295322'), ('playerName', 'Metta Sandiford-Artest')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q926248'), ('playerName', 'Kawhi Leonard')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q311735'), ('playerName', 'Joakim Noah')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q449245'), ('playerName', 'Alvin Robertson')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q201608'), ('playerName', 'Dennis Rodman')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q25278'), ('playerName', 'Dwight Howard')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q275889'), ('playerName', 'Marc Gasol')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q295364'), ('playerName', 'Ben Wallace')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q309872'), ('playerName', 'Gary Payton')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q313481'), ('playerName', 'Dikembe Mutombo')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q357757'), ('playerName', 'Mark Eaton')]\n",
      "[('winner', 'http://www.wikidata.org/entity/Q297146'), ('playerName', 'Tyson Chandler')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "\n",
    "queryString = \"\"\"\n",
    "SELECT ?winner ?playerName\n",
    "WHERE {\n",
    "   # All basketball players who won NBA Defensive Player of the Year Award\n",
    "    \n",
    "    wd:Q845884 wdt:P1346 ?winner.\n",
    "    \n",
    "\n",
    "            \n",
    "   \n",
    "   # get the label\n",
    "   ?winner sc:name ?playerName.\n",
    "   #?p sc:name ?pname .\n",
    "   #?o sc:name ?oname .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1020e490",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "id": "6223641d-3dd0-42c7-be59-4169a4d22a58",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'It seems it is impossible to count the number of awards each player won without \"point in time\" property and we do not have access to that. no other accessible property exists to distinguish same awards with different dates or at least I could not find that.'"
      ]
     },
     "execution_count": 118,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"\"\"It seems it is impossible to count the number of awards each player won without \"point in time\" property and we do not have access to that. no other accessible property exists to distinguish same awards with different dates or at least I could not find that.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61489b45-e63a-4f9c-a1ec-1f697735d127",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
