{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6eee719c",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "f6c536aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-03aeb85bfd-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ebfb38b",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Production company explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the main companies working on cinema-related content. We want to know which are the main television production companies and the film production companies, which company distributes more film and some consideration about awards."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b14312fa",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P106`     | profession   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q36479`    | The Lion King      | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "29477f88",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q36479 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Lion King**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for Netflix\n",
    "\n",
    "3. Identify the BGP for television production company\n",
    "\n",
    "4. Identify the BGP for film production company\n",
    "\n",
    "5. Find the top-5 companies (amongst television production company and film production company) which produced the highest number of crime films (the result set must be a list of triples company IRI, label and #crime film).\n",
    "\n",
    "6. Find the company (amongst television production company and film production company) which distributed more films (of any kind of film genre) that they did not produce (the result set must be a list of triples company IRI, label and #film).\n",
    "\n",
    "7. Find how many company are listed in every stock exchange market (the result set must be a list of triples stock exchange IRI, label and #companies). \n",
    "\n",
    "8. Identify the BGP for Academy Award\n",
    "\n",
    "9. Find the companies (among television and film production companies) that won at least 5 Academy Awards for Best Actress for the movies they produced (the result set must be a list of triples company IRI, label and #awards)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad997402",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "781e29ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P3092'), ('getname', 'film crew member')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P4021'), ('getname', 'danskefilm animated film ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P7679'), ('getname', 'Cinépolis KLIC ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1015'), ('getname', 'NORAF ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1040'), ('getname', 'film editor')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1237'), ('getname', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1258'), ('getname', 'Rotten Tomatoes ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1265'), ('getname', 'AlloCiné film ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1273'), ('getname', 'CANTIC ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1411'), ('getname', 'nominated for')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1417'), ('getname', 'Encyclopædia Britannica Online ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1434'), ('getname', 'takes place in fictional universe')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P144'), ('getname', 'based on')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1476'), ('getname', 'title')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P154'), ('getname', 'logo image')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1552'), ('getname', 'has quality')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P156'), ('getname', 'followed by')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P1562'), ('getname', 'AllMovie title ID')]\n",
      "[('get', 'http://www.wikidata.org/prop/direct/P162'), ('getname', 'producer')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?getname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 ?p ?obj .\n",
    "   #get the label\n",
    "   ?p sc:name ?getname.\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e05b203",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "532d6b9d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q2143665'), ('getname', \"children's film\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q130232'), ('getname', 'drama')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q842256'), ('getname', 'musical film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28968511'), ('getname', 'traditionally animated film')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?getname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 wdt:P136 ?p.\n",
    "   #get the label\n",
    "   ?p sc:name ?getname.\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "1ab2d986-9cc5-48ca-9ecb-f974b6686ccf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q17175676'), ('getname', 'animated cartoon')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q201658'), ('getname', 'film genre')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11425'), ('getname', 'animation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q202866'), ('getname', 'animated film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q184781'), ('getname', 'traditional animation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6643876'), ('getname', 'list of traditionally animated feature films')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q28968511'), ('getname', 'traditionally animated film')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?getname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q28968511 ?obj ?p.\n",
    "   #get the label\n",
    "   ?p sc:name ?getname.\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "8d2ff0d5-3437-4c36-b557-59f594c9538a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('getname', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('getname', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('getname', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('getname', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('getname', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('getname', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('getname', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('getname', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('getname', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('getname', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('getname', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('getname', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('getname', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('getname', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('getname', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4953'), ('getname', 'Library of Congress Genre/Form Terms ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('getname', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('getname', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('getname', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('getname', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('getname', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9318'), ('getname', 'Ávvir topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9545'), ('getname', 'Encyclopedia of China Online Database ID')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q28968511'), ('getname', 'traditionally animated film')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q842256'), ('getname', 'musical film')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?getname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q842256 ?p ?obj.\n",
    "   #get the label\n",
    "   ?p sc:name ?getname.\n",
    "\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "21c97ade",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for Netflix"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "e2471f6e-b183-4396-b0e6-7d9186433851",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q907311'), ('getname', 'Netflix')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P227'), ('getname', 'GND ID')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?getname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P227 ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?getname.\n",
    "   FILTER(REGEX(?getname, \"Netflix\"^^xsd:string))\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "7d2d1653",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q10689397'), ('op', 'television production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P400'), ('as', 'platform'), ('i', 'http://www.wikidata.org/entity/Q23930024'), ('op', 'streaming media receiver')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('as', 'award received'), ('i', 'http://www.wikidata.org/entity/Q838121'), ('op', 'Peabody Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('as', 'owned by'), ('i', 'http://www.wikidata.org/entity/Q849363'), ('op', 'The Vanguard Group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1056'), ('as', 'product or material produced'), ('i', 'http://www.wikidata.org/entity/Q220499'), ('op', 'streaming media')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('as', 'industry'), ('i', 'http://www.wikidata.org/entity/Q220499'), ('op', 'streaming media')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P400'), ('as', 'platform'), ('i', 'http://www.wikidata.org/entity/Q842729'), ('op', 'set-top box')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('as', 'language of work or name'), ('i', 'http://www.wikidata.org/entity/Q20923490'), ('op', 'multiple languages')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('as', 'owned by'), ('i', 'http://www.wikidata.org/entity/Q219635'), ('op', 'BlackRock')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('as', 'country'), ('i', 'http://www.wikidata.org/entity/Q30'), ('op', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('as', 'member of'), ('i', 'http://www.wikidata.org/entity/Q37033'), ('op', 'World Wide Web Consortium')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q4830453'), ('op', 'business')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('as', 'owned by'), ('i', 'http://www.wikidata.org/entity/Q505275'), ('op', 'Capital Group Companies')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q723685'), ('op', 'video on demand')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P414'), ('as', 'stock exchange'), ('i', 'http://www.wikidata.org/entity/Q82059'), ('op', 'NASDAQ')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('as', 'member of'), ('i', 'http://www.wikidata.org/entity/Q858851'), ('op', 'Linux Foundation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1454'), ('as', 'legal form'), ('i', 'http://www.wikidata.org/entity/Q891723'), ('op', 'public company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q891723'), ('op', 'public company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('as', 'member of'), ('i', 'http://www.wikidata.org/entity/Q20947086'), ('op', 'Alliance for Open Media')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('as', 'part of'), ('i', 'http://www.wikidata.org/entity/Q507306'), ('op', 'NASDAQ-100')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/entity/Q907311'), ('getname', 'Netflix')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?i ?op\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q907311 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71ed2c1f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c3beeff2",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for television production company"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9873c70c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q1762059'), ('op', 'film production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q19364326'), ('op', 'media studio facility')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('as', 'industry'), ('i', 'http://www.wikidata.org/entity/Q1407228'), ('op', 'television production')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q11396960'), ('op', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('as', \"topic's main category\"), ('i', 'http://www.wikidata.org/entity/Q8836004'), ('op', 'Category:Television production companies')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q10689397'), ('op', 'television production company')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q907311'), ('getname', 'Netflix')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?i ?op\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1068 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f2a2071",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "7b6af1e3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q1762059'), ('op', 'film production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q19364326'), ('op', 'media studio facility')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('as', 'industry'), ('i', 'http://www.wikidata.org/entity/Q1407228'), ('op', 'television production')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q11396960'), ('op', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('as', \"topic's main category\"), ('i', 'http://www.wikidata.org/entity/Q8836004'), ('op', 'Category:Television production companies')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# write your final query#[('p', 'http://www.wikidata.org/prop/direct/P31'), ('as', 'instance of'), ('i', 'http://www.wikidata.org/entity/Q10689397'), ('op', 'television production company')]\n",
    "#[('p', 'http://www.wikidata.org/entity/Q907311'), ('getname', 'Netflix')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?i ?op\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q10689397 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b6be1a81",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Identify the BGP for film production company"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "3923e620",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('as', 'different from'), ('i', 'http://www.wikidata.org/entity/Q375336'), ('op', 'film studio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('as', 'industry'), ('i', 'http://www.wikidata.org/entity/Q1415395'), ('op', 'film industry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q104649845'), ('op', 'film organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('as', 'part of'), ('i', 'http://www.wikidata.org/entity/Q625568'), ('op', 'show business')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q11396960'), ('op', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('as', \"topic's main category\"), ('i', 'http://www.wikidata.org/entity/Q6483398'), ('op', 'Category:Film production companies')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q1762059'), ('op', 'film production company')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?i ?op\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1762059 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "32017b75",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "f8b6171f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('as', 'different from'), ('i', 'http://www.wikidata.org/entity/Q375336'), ('op', 'film studio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('as', 'industry'), ('i', 'http://www.wikidata.org/entity/Q1415395'), ('op', 'film industry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q104649845'), ('op', 'film organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('as', 'part of'), ('i', 'http://www.wikidata.org/entity/Q625568'), ('op', 'show business')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q11396960'), ('op', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('as', \"topic's main category\"), ('i', 'http://www.wikidata.org/entity/Q6483398'), ('op', 'Category:Film production companies')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# write your final qu#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q1762059'), ('op', 'film production company')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?i ?op\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1762059 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "be0cc397",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find the top-5 companies (amongst television production company and film production company) which produced the highest number of crime films (the result set must be a list of triples company IRI, label and #crime film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "8fc76051",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13693967'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Cross'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20724304'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Purge: Election Year'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15865603'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'After Dark'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1755064'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', \"Sharky's Machine\"), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11510316'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Love Under Fire'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16020981'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Amazing Partnership'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028315'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Bruce Partington Plans'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028374'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Dancing Men'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028732'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Naval Treaty'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16200305'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Fangs of the Arctic'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16202837'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'China White'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17492514'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Talvar'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q9125658'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Red Dragon'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17036340'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Mad Dog Coll'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q60016'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Kiss the Girls'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17168799'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'murdered'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17212079'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Mosquito on the Tenth Floor'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17480384'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Take'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17511045'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Alias French Gertie'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46600556'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Anti-Social'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17625720'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Adventures Inc.'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17639912'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Lawless Woman'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4183371'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Peril at End House'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1107774'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'No Place to Hide'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18149041'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Criminal'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18149430'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', \"Don't Turn 'Em Loose\"), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18150133'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Double Danger'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18150397'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Grand Jury'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18153213'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Post Office Investigator'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1171611'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Silent Rage'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q180125'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Step Up'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7246065'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Private Detective 62'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7779266'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Top of the Lake'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7993855'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Whiskey Bay'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20945857'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Exit of Love Hotel'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949824'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Before Morning'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949912'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Missing Witnesses'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646989'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Shantytown'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647049'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Street of Fury'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22972733'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'A Woman Going in Reverse'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22975383'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Woman of Tuesday Night'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24206207'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Five'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26266013'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tatort: Die Kunst des Krieges'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26832942'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Rapl'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27039081'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Santoalla'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27040209'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Smooth Talker'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q263930'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Next Three Days'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30668183'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Big City Secret'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4373735'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Nobels testamente'), ('films', 'crime film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q35777951'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Bond of Fear'), ('films', 'crime film')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?obj ?top ?films\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P136 ?obj.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films\n",
    "   FILTER(REGEX(?films,\"crime film\"^^xsd:string ))\n",
    "\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "54b29478",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "af38214e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q26266013'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tatort: Die Kunst des Krieges'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2367528'), ('abc', 'Superfilm')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q459057'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Monster'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q5204823'), ('abc', 'DEJ Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q496113'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'City of Industry'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17346576'), ('abc', 'Largo Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q498983'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Young and Innocent'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q501105'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The 39 Steps'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q680573'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Thousand Eyes of Dr. Mabuse'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12131571'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Villain'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1146552'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Point Break'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17346576'), ('abc', 'Largo Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5376180'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Endless Night'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19850804'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Polizeiruf 110: Hexenjagd'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q19899'), ('abc', 'Rundfunk Berlin-Brandenburg')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1402883'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Nancy Drew'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17345505'), ('abc', 'Jerry Weintraub Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1490812'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Gacy'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q5204823'), ('abc', 'DEJ Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1055796'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Long Good Friday'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q733677'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Match Point'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q7752106'), ('abc', 'The Montecito Picture Company')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3441176'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Rome Express'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2370768'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Meeting Place Cannot Be Changed'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2628487'), ('abc', 'Odessa Film Studio')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5302848'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Down River'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1171580'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Seventh Victim'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2900179'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Better Luck Tomorrow'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1111024'), ('abc', 'MTV Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7738215'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Green Terror'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q590252'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Jack Reacher'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3005562'), ('abc', 'Cruise/Wagner Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q42759035'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Joker'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3011161'), ('abc', 'DC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q980257'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Evil Under the Sun'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1397969'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Unlawful Entry'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17346576'), ('abc', 'Largo Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7428145'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Saved from the Sea'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q288150'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Freedom Writers'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1111024'), ('abc', 'MTV Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24294510'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tatort: Wir – Ihr – Sie'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q19899'), ('abc', 'Rundfunk Berlin-Brandenburg')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28914444'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tatort: Kopper'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q700133'), ('abc', 'Südwestrundfunk')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14948592'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tracers'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17300077'), ('abc', 'Temple Hill Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q466436'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Shattered Glass'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3005562'), ('abc', 'Cruise/Wagner Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q774547'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Without a Clue'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q641723'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', \"Get Rich or Die Tryin'\"), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1111024'), ('abc', 'MTV Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q188000'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Crash'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q5204823'), ('abc', 'DEJ Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q442399'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Sherlock Holmes and the Deadly Necklace'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2610883'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Big Sleep'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7760806'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Ringer'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1868978'), ('abc', 'London Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16154183'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'And Then There Were None'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q6745872'), ('abc', 'Mammoth Screen')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q39659551'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Hate U Give'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17300077'), ('abc', 'Temple Hill Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7733216'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Fall of a Saint'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17017420'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Road House'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1131669'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Longest Yard'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1111024'), ('abc', 'MTV Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q798650'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Bad Boys'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q848297'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Death Wish V: The Face of Death'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4631061'), ('abc', '21st Century Film Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q598262'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', \"What Doesn't Kill You\"), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q7752106'), ('abc', 'The Montecito Picture Company')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1170538'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Terror of Doctor Mabuse'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1198144'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Strangler of Blackmoor Castle'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1392256'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Farewell, My Lovely'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2041890'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Out of the Blue'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1124579'), ('abc', 'Condor Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23043503'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Tatort: Bienzle und der Taximord'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q700133'), ('abc', 'Südwestrundfunk')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15558291'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Crime scene: Last days'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q700133'), ('abc', 'Südwestrundfunk')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1219673'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Invisible Dr. Mabuse'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q527563'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Der Todesrächer von Soho'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1063525'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Defiant Ones'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q107391544'), ('abc', 'Curtleigh Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1059914'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Death on the Nile'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3521099'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Grand Budapest Hotel'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q18155354'), ('abc', 'TSG Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q464111'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Boys from Brazil'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4762134'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Angel Esquire'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q500044'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Lady Vanishes'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1192773'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Confessions of a Police Captain'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3734691'), ('abc', 'Euro International Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4660755'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'A Woman in Pawn'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19871451'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Bracelets'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30321613'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Hotel Artemis'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17417784'), ('abc', 'Marc Platt Productions')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7754148'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Night of the Party'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7766112'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Squeaker'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1868978'), ('abc', 'London Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2543979'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', \"The Mirror Crack'd\"), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18209189'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Man in the River'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q71960'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Save the Last Dance'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q1111024'), ('abc', 'MTV Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q60661850'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'M – A City Hunts a Murderer'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2367528'), ('abc', 'Superfilm')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1216781'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Secret of Dr. Mabuse'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q676498'), ('abc', 'CCC Film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1678247'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'The Firechasers'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q761688'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Love and Bullets'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q3149951'), ('abc', 'ITC Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4241042'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Criminal Talent'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2628487'), ('abc', 'Odessa Film Studio')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7127738'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Pallard the Punter'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14949835'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Non-Stop New York'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q2756503'), ('abc', 'Gaumont-British Picture Corporation')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1193825'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Affliction'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17346576'), ('abc', 'Largo Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2753655'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Silver Bears'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q4353408'), ('abc', 'EMI Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28952116'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Angamaly Diaries'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q22080360'), ('abc', 'Friday Film House')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4373735'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Nobels testamente'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q8051674'), ('abc', 'Yellow Bird')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q604912'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'Cop or Hood'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q18331625'), ('abc', 'Cerito Films')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q654474'), ('obj', 'http://www.wikidata.org/entity/Q959790'), ('top', 'T-Men'), ('films', 'crime film'), ('pcn', 'http://www.wikidata.org/entity/Q17377479'), ('abc', 'Edward Small Productions')]\n",
      "80\n"
     ]
    }
   ],
   "source": [
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "#[('get', 'http://www.wikidata.org/entity/Q11424'), ('getname', 'film')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?obj ?top ?films ?pcn ?abc\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P136 ?obj;\n",
    "      wdt:P272 ?pcn.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films.\n",
    "   ?pcn sc:name ?abc\n",
    "   FILTER(REGEX(?films,\"crime film\"^^xsd:string ))\n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 80\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2c50cc54",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "Find the company (amongst television production company and film production company) which distributed more films (of any kind of film genre) that they did not produce (the result set must be a list of triples company IRI, label and #film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "796574fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q47153414'), ('abc', 'Athos Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q108183211'), ('abc', 'Lumen Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q17377479'), ('abc', 'Edward Small Productions')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q605307'), ('abc', 'Les films du losange')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q624886'), ('abc', 'FilmDistrict')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q82110'), ('abc', 'Steven Seagal')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q4341103'), ('abc', 'Profit')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2748604'), ('abc', 'Film i Väst')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q7127609'), ('abc', 'Palisades Tartan')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q43380'), ('abc', 'CBS')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q5453219'), ('abc', 'First Look Studios')]\n",
      "[('tf', '4'), ('pcn', 'http://www.wikidata.org/entity/Q262386'), ('abc', 'Österreichischer Rundfunk')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q500088'), ('abc', 'DreamWorks Animation')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2910457'), ('abc', 'IFC Films')]\n",
      "[('tf', '12'), ('pcn', 'http://www.wikidata.org/entity/Q648034'), ('abc', 'Bavaria Film')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q277626'), ('abc', 'A&M Records')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q544560'), ('abc', 'Televisión Española')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q1243548'), ('abc', 'Dor Film')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q457893'), ('abc', 'Amblin Entertainment')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3614056'), ('abc', 'American Empirical Pictures')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q3285496'), ('abc', 'Mandeville Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q11887890'), ('abc', 'Phoenix Pictures')]\n",
      "[('tf', '5'), ('pcn', 'http://www.wikidata.org/entity/Q3750890'), ('abc', 'Franchise Pictures')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q947354'), ('abc', 'Shaw Brothers Studio')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q609069'), ('abc', 'Boll KG')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q1066018'), ('abc', 'Toei Company')]\n",
      "[('tf', '4'), ('pcn', 'http://www.wikidata.org/entity/Q1891982'), ('abc', 'Nordisk Film')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q7890890'), ('abc', 'United States Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q10941826'), ('abc', 'Sun Entertainment Culture')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q122741'), ('abc', 'Sega')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q6940434'), ('abc', 'Muse Entertainment')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q214683'), ('abc', 'TF1')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q216364'), ('abc', 'Epic Records')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2906631'), ('abc', 'Blinding Edge Pictures')]\n",
      "[('tf', '90'), ('pcn', 'http://www.wikidata.org/entity/Q434841'), ('abc', '20th Century Studios')]\n",
      "[('tf', '27'), ('pcn', 'http://www.wikidata.org/entity/Q497155'), ('abc', 'Touchstone Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3648415'), ('abc', 'C2 Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q15851886'), ('abc', 'UFA Fiction')]\n",
      "[('tf', '4'), ('pcn', 'http://www.wikidata.org/entity/Q2793276'), ('abc', 'Participant')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q5099920'), ('abc', 'China Star Entertainment Group')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q5061074'), ('abc', 'Central Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3128481'), ('abc', 'Haut et Court')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2257015'), ('abc', 'Cabinet Entertainment')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q7929325'), ('abc', 'Vijayta Films')]\n",
      "[('tf', '13'), ('pcn', 'http://www.wikidata.org/entity/Q564960'), ('abc', 'Constantin Film')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q300323'), ('abc', 'A Band Apart')]\n",
      "[('tf', '5'), ('pcn', 'http://www.wikidata.org/entity/Q1755165'), ('abc', 'Twisted Pictures')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q1324070'), ('abc', 'El Deseo')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q2714773'), ('abc', 'Caravan Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q1414782'), ('abc', 'Filmistan')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q4050610'), ('abc', 'TOR film studio')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q1022286'), ('abc', 'C-Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q49851272'), ('abc', 'Cinévidéo')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q5285236'), ('abc', 'Django Films')]\n",
      "[('tf', '6'), ('pcn', 'http://www.wikidata.org/entity/Q3406645'), ('abc', 'Producers Releasing Corporation')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q719998'), ('abc', 'Tallinnfilm')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q1916145'), ('abc', 'MediaNews Group')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q527751'), ('abc', 'Mascot Pictures')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q7924435'), ('abc', 'Viacom 18 Motion Pictures')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q5389773'), ('abc', 'Erler Film')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q1523434'), ('abc', 'Maurice Tourneur')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q28071268'), ('abc', 'Canana Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q7883673'), ('abc', 'Underground contenidos')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q57832058'), ('abc', 'Bidibul Productions')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q17067950'), ('abc', 'Jaaz Multimedia')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q64667698'), ('abc', 'Zodiac Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3429960'), ('abc', 'Auvergne-Rhône-Alpes Cinéma')]\n",
      "[('tf', '3'), ('pcn', 'http://www.wikidata.org/entity/Q5448895'), ('abc', 'FilmNation Entertainment')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3294957'), ('abc', 'Mars Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2861044'), ('abc', 'Argos Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q3875639'), ('abc', 'Newmarket Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q6952279'), ('abc', 'NALA Films')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q85795495'), ('abc', 'RSVP Movies')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q17385899'), ('abc', 'Solar Productions')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q3232649'), ('abc', 'Les Films du Carrosse')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q10590609'), ('abc', 'Mushroom Pictures')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q2155901'), ('abc', 'Road Movies Filmproduktion')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q24190766'), ('abc', 'No Trace Camping')]\n",
      "[('tf', '2'), ('pcn', 'http://www.wikidata.org/entity/Q55237528'), ('abc', 'STXfilms')]\n",
      "[('tf', '1'), ('pcn', 'http://www.wikidata.org/entity/Q7983208'), ('abc', 'Werc Werk Works')]\n",
      "80\n"
     ]
    }
   ],
   "source": [
    "#TOTAL FILMS BY EACH COMPANY\n",
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "#[('get', 'http://www.wikidata.org/entity/Q11424'), ('getname', 'film')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?p) AS ?tf) ?pcn ?abc\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P136 ?obj;\n",
    "      wdt:P272 ?pcn.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films.\n",
    "   ?pcn sc:name ?abc\n",
    "   FILTER(REGEX(?films,\"crime film\"^^xsd:string ))\n",
    "   \n",
    "\n",
    "}\n",
    "GROUP BY ?abc ?pcn\n",
    "LIMIT 80\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc3cc171",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "f838c35f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tf', '161'), ('pcn', 'http://www.wikidata.org/entity/Q126399'), ('abc', 'Warner Bros.')]\n",
      "[('tf', '118'), ('pcn', 'http://www.wikidata.org/entity/Q186941'), ('abc', 'Columbia Pictures')]\n",
      "[('tf', '113'), ('pcn', 'http://www.wikidata.org/entity/Q168383'), ('abc', 'Universal Pictures')]\n",
      "[('tf', '112'), ('pcn', 'http://www.wikidata.org/entity/Q179200'), ('abc', 'Metro-Goldwyn-Mayer')]\n",
      "[('tf', '109'), ('pcn', 'http://www.wikidata.org/entity/Q159846'), ('abc', 'Paramount Pictures')]\n",
      "[('tf', '90'), ('pcn', 'http://www.wikidata.org/entity/Q434841'), ('abc', '20th Century Studios')]\n",
      "[('tf', '87'), ('pcn', 'http://www.wikidata.org/entity/Q267282'), ('abc', 'RKO Pictures')]\n",
      "[('tf', '37'), ('pcn', 'http://www.wikidata.org/entity/Q913462'), ('abc', 'Gaumont Film Company')]\n",
      "[('tf', '35'), ('pcn', 'http://www.wikidata.org/entity/Q2450848'), ('abc', 'StudioCanal')]\n",
      "[('tf', '34'), ('pcn', 'http://www.wikidata.org/entity/Q79202'), ('abc', 'New Line Cinema')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# TOP 10 FILM PRODUCTION COMPANIES\n",
    "#[('get', 'http://www.wikidata.org/prop/direct/P136'), ('getname', 'genre')]\n",
    "#[('get', 'http://www.wikidata.org/entity/Q11424'), ('getname', 'film')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?p) AS ?tf) ?pcn ?abc\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P136 ?obj;\n",
    "      wdt:P272 ?pcn.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films.\n",
    "   ?pcn sc:name ?abc\n",
    "   FILTER(REGEX(?films,\"crime film\"^^xsd:string ))\n",
    "   \n",
    "\n",
    "}\n",
    "GROUP BY ?abc ?pcn\n",
    "ORDER BY DESC(?tf)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "92b99932",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Find how many company are listed in every stock exchange market (the result set must be a list of triples stock exchange IRI, label and #companies)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "d1c42994",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('as', 'field of work'), ('op', 'audiovisual production'), ('i', 'http://www.wikidata.org/entity/Q21198548')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'media company'), ('i', 'http://www.wikidata.org/entity/Q1331793')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'company'), ('i', 'http://www.wikidata.org/entity/Q783794')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('as', 'Wikidata property'), ('op', 'production company'), ('i', 'http://www.wikidata.org/entity/P272')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# WE USE SUB CLASS OF PRODUCTION COMPANY FROM TASK 3 RESULT TO CHECK COMPANIES LISTED IN STOCK EXCHANGE\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('i', 'http://www.wikidata.org/entity/Q11396960'), ('op', 'production company')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?op ?i\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11396960 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "719094bb",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "ffd4b45f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('as', 'different from'), ('op', 'media studio facility'), ('i', 'http://www.wikidata.org/entity/Q19364326')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'business'), ('i', 'http://www.wikidata.org/entity/Q4830453')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('as', 'uses'), ('op', 'communication'), ('i', 'http://www.wikidata.org/entity/Q11024')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('as', 'field of work'), ('op', 'mass media'), ('i', 'http://www.wikidata.org/entity/Q11033')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('as', 'field of work'), ('op', 'communication medium'), ('i', 'http://www.wikidata.org/entity/Q340169')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('as', 'uses'), ('op', 'communication medium'), ('i', 'http://www.wikidata.org/entity/Q340169')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'company'), ('i', 'http://www.wikidata.org/entity/Q783794')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('as', \"topic's main category\"), ('op', 'Category:Mass media companies'), ('i', 'http://www.wikidata.org/entity/Q7110212')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# WE WILL FURTHER ELABORATE MEDIA COMPANY TO CHECK COMPANIES INVOLVED IN STOCK EXCHANGE\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'media company'), ('i', 'http://www.wikidata.org/entity/Q1331793')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?op ?i\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1331793 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "4fd5109b-6e02-420f-a42e-11b6328346f4",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'stock exchange'), ('i', 'http://www.wikidata.org/entity/P414')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'Twitter username'), ('i', 'http://www.wikidata.org/entity/P2002')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'Legal Entity Identifier'), ('i', 'http://www.wikidata.org/entity/P1278')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'OpenCorporates ID'), ('i', 'http://www.wikidata.org/entity/P1320')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'product or material produced'), ('i', 'http://www.wikidata.org/entity/P1056')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'phone number'), ('i', 'http://www.wikidata.org/entity/P1329')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'headquarters location'), ('i', 'http://www.wikidata.org/entity/P159')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'dissolved, abolished or demolished date'), ('i', 'http://www.wikidata.org/entity/P576')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'country'), ('i', 'http://www.wikidata.org/entity/P17')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'organization'), ('i', 'http://www.wikidata.org/entity/Q43229')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#NOW WE SELECT BUSSINESS FROM RESULTS AND FURTHER EXPLORE.\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P279'), ('as', 'subclass of'), ('op', 'business'), ('i', 'http://www.wikidata.org/entity/Q4830453')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?op ?i\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q4830453 ?p ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "ce195ebd-1f00-43ff-9fea-586c1b3a5492",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/P348'), ('as', 'software version identifier'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/P4669'), ('as', 'tabular software version'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/P747'), ('as', 'has edition or translation'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1002728'), ('as', 'Fonsi Nieto'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100326534'), ('as', \"Al Stewart's albums in chronological order\"), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100327667'), ('as', 'Category:Adelina Lopes Vieira'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100343342'), ('as', 'Lubomír Stoklásek'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1007576'), ('as', 'Ciudad Vieja'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100879156'), ('as', 'Echániz'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10100'), ('as', 'Natuna'), ('op', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# HERE IT IS WE GOT STOCK EXCHANGE IN FIRST ROW IN PREVIOUS RESULT NOW WE FURTHER EXPLORE STOCK EXCHANGE.\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('as', 'properties for this type'), ('op', 'stock exchange'), ('i', 'http://www.wikidata.org/entity/P414')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?as ?op ?i\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?P wdt:P414 ?i.\n",
    "   #get the label\n",
    "   ?p sc:name ?as.\n",
    "   ?i sc:name ?op\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "a933bf5f-6ced-4995-a294-b609c45cd3d0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tnc', '40'), ('old', 'SIX Swiss Exchange'), ('i', 'http://www.wikidata.org/entity/Q661834')]\n",
      "[('tnc', '6'), ('old', 'Xetra'), ('i', 'http://www.wikidata.org/entity/Q819468')]\n",
      "[('tnc', '460'), ('old', 'Tokyo Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q217475')]\n",
      "[('tnc', '1'), ('old', 'Bilbao Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q4890307')]\n",
      "[('tnc', '11'), ('old', 'PFTS Ukraine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1984912')]\n",
      "[('tnc', '346'), ('old', 'Nepal Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q6529599')]\n",
      "[('tnc', '58'), ('old', 'Nasdaq Helsinki'), ('i', 'http://www.wikidata.org/entity/Q581755')]\n",
      "[('tnc', '3'), ('old', 'Bulgarian Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1003968')]\n",
      "[('tnc', '1'), ('old', 'CEX.io'), ('i', 'http://www.wikidata.org/entity/Q22907145')]\n",
      "[('tnc', '2'), ('old', 'Euronext Growth'), ('i', 'http://www.wikidata.org/entity/Q2718247')]\n",
      "[('tnc', '1'), ('old', 'Old Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q3557929')]\n",
      "[('tnc', '3'), ('old', 'Pakistan Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q22907578')]\n",
      "[('tnc', '1'), ('old', 'Uniswap'), ('i', 'http://www.wikidata.org/entity/Q104438477')]\n",
      "[('tnc', '1'), ('old', 'Amsterdam Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q74039053')]\n",
      "[('tnc', '257'), ('old', 'Warsaw Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q59551')]\n",
      "[('tnc', '9'), ('old', 'Budapest Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q851259')]\n",
      "[('tnc', '1'), ('old', 'S&P 400'), ('i', 'http://www.wikidata.org/entity/Q7386994')]\n",
      "[('tnc', '25'), ('old', 'JSE Limited'), ('i', 'http://www.wikidata.org/entity/Q627514')]\n",
      "[('tnc', '6'), ('old', 'Euronext Brussels'), ('i', 'http://www.wikidata.org/entity/Q1146518')]\n",
      "[('tnc', '40'), ('old', 'Euronext Paris'), ('i', 'http://www.wikidata.org/entity/Q2385849')]\n",
      "[('tnc', '493'), ('old', 'Shenzhen Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q517750')]\n",
      "[('tnc', '11'), ('old', 'OMX AB'), ('i', 'http://www.wikidata.org/entity/Q1132158')]\n",
      "[('tnc', '1'), ('old', 'Moscow Interbank Currency Exchange'), ('i', 'http://www.wikidata.org/entity/Q1421543')]\n",
      "[('tnc', '8'), ('old', 'Taipei Exchange'), ('i', 'http://www.wikidata.org/entity/Q5598539')]\n",
      "[('tnc', '6'), ('old', 'Borsa Istanbul'), ('i', 'http://www.wikidata.org/entity/Q1407995')]\n",
      "[('tnc', '3'), ('old', 'Q-Board'), ('i', 'http://www.wikidata.org/entity/Q11240145')]\n",
      "[('tnc', '697'), ('old', 'Indonesia Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1661737')]\n",
      "[('tnc', '8'), ('old', 'Stock Exchange in Milano'), ('i', 'http://www.wikidata.org/entity/Q3642744')]\n",
      "[('tnc', '8'), ('old', 'Alternative Investment Market'), ('i', 'http://www.wikidata.org/entity/Q438511')]\n",
      "[('tnc', '1'), ('old', 'Pacific Exchange'), ('i', 'http://www.wikidata.org/entity/Q4458741')]\n",
      "[('tnc', '1'), ('old', 'Bolsa de Valores y Productos de Asunción'), ('i', 'http://www.wikidata.org/entity/Q8250595')]\n",
      "[('tnc', '8'), ('old', 'Binance'), ('i', 'http://www.wikidata.org/entity/Q51403327')]\n",
      "[('tnc', '1'), ('old', 'Casablanca Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2602796')]\n",
      "[('tnc', '1'), ('old', 'HitBTC'), ('i', 'http://www.wikidata.org/entity/Q97574930')]\n",
      "[('tnc', '1'), ('old', 'FTSE Italia All-Share'), ('i', 'http://www.wikidata.org/entity/Q3737357')]\n",
      "[('tnc', '7'), ('old', 'Bursa Malaysia'), ('i', 'http://www.wikidata.org/entity/Q43335')]\n",
      "[('tnc', '7'), ('old', 'Euronext Lisbon'), ('i', 'http://www.wikidata.org/entity/Q2415561')]\n",
      "[('tnc', '16'), ('old', 'Wiener Börse'), ('i', 'http://www.wikidata.org/entity/Q698535')]\n",
      "[('tnc', '27'), ('old', 'New Zealand Exchange'), ('i', 'http://www.wikidata.org/entity/Q627019')]\n",
      "[('tnc', '7'), ('old', 'Osaka Exchange'), ('i', 'http://www.wikidata.org/entity/Q1320224')]\n",
      "[('tnc', '13'), ('old', 'Athens Exchange'), ('i', 'http://www.wikidata.org/entity/Q755341')]\n",
      "[('tnc', '1'), ('old', 'Börse München'), ('i', 'http://www.wikidata.org/entity/Q681683')]\n",
      "[('tnc', '1'), ('old', 'CoinMarketCap'), ('i', 'http://www.wikidata.org/entity/Q56251056')]\n",
      "[('tnc', '6'), ('old', 'Buenos Aires Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q891560')]\n",
      "[('tnc', '2'), ('old', 'GDAX'), ('i', 'http://www.wikidata.org/entity/Q97574837')]\n",
      "[('tnc', '3'), ('old', 'Nasdaq Tallinn'), ('i', 'http://www.wikidata.org/entity/Q1433248')]\n",
      "[('tnc', '3'), ('old', 'Bermuda Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2382352')]\n",
      "[('tnc', '1'), ('old', 'BET-10'), ('i', 'http://www.wikidata.org/entity/Q795840')]\n",
      "[('tnc', '1'), ('old', 'Nigerian Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q838766')]\n",
      "[('tnc', '16'), ('old', 'KOSDAQ'), ('i', 'http://www.wikidata.org/entity/Q491503')]\n",
      "[('tnc', '1'), ('old', 'Saint Petersburg Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2306284')]\n",
      "[('tnc', '91'), ('old', 'Euronext'), ('i', 'http://www.wikidata.org/entity/Q842108')]\n",
      "[('tnc', '156'), ('old', 'B3'), ('i', 'http://www.wikidata.org/entity/Q796297')]\n",
      "[('tnc', '8'), ('old', 'Kazakhstan Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1734773')]\n",
      "[('tnc', '2'), ('old', 'Riga Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1624698')]\n",
      "[('tnc', '50'), ('old', 'Tehran Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1805567')]\n",
      "[('tnc', '4'), ('old', 'Dhaka Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1974408')]\n",
      "[('tnc', '35'), ('old', 'Bombay Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q638398')]\n",
      "[('tnc', '1'), ('old', 'Iceland Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1674303')]\n",
      "[('tnc', '5'), ('old', 'Coinbase'), ('i', 'http://www.wikidata.org/entity/Q16972754')]\n",
      "[('tnc', '2'), ('old', 'Kraken'), ('i', 'http://www.wikidata.org/entity/Q22906202')]\n",
      "[('tnc', '5'), ('old', 'Philippine Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1526647')]\n",
      "[('tnc', '2'), ('old', 'Belgrade Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q550050')]\n",
      "[('tnc', '61'), ('old', 'Korea Exchange'), ('i', 'http://www.wikidata.org/entity/Q495372')]\n",
      "[('tnc', '1'), ('old', 'International Standard Industrial Classification'), ('i', 'http://www.wikidata.org/entity/Q1666934')]\n",
      "[('tnc', '3'), ('old', 'Bolsa de Valores de Barcelona'), ('i', 'http://www.wikidata.org/entity/Q4202960')]\n",
      "[('tnc', '2'), ('old', 'Montenegro Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q4513926')]\n",
      "[('tnc', '128'), ('old', 'Moscow Exchange'), ('i', 'http://www.wikidata.org/entity/Q2632892')]\n",
      "[('tnc', '12'), ('old', 'Zagreb Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q140388')]\n",
      "[('tnc', '2'), ('old', 'Palestine Exchange'), ('i', 'http://www.wikidata.org/entity/Q4992224')]\n",
      "[('tnc', '141'), ('old', 'National Stock Exchange of India'), ('i', 'http://www.wikidata.org/entity/Q638740')]\n",
      "[('tnc', '16'), ('old', 'Mothers'), ('i', 'http://www.wikidata.org/entity/Q11340130')]\n",
      "[('tnc', '417'), ('old', 'Korea Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q495364')]\n",
      "[('tnc', '20'), ('old', 'Fukuoka Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q5507703')]\n",
      "[('tnc', '8'), ('old', 'NYSE American'), ('i', 'http://www.wikidata.org/entity/Q846626')]\n",
      "[('tnc', '3'), ('old', 'zero two desnuda'), ('i', 'http://www.wikidata.org/entity/Q2387368')]\n",
      "[('tnc', '1'), ('old', 'NEO Exchange'), ('i', 'http://www.wikidata.org/entity/Q39052382')]\n",
      "[('tnc', '32'), ('old', 'Bolsa de Madrid'), ('i', 'http://www.wikidata.org/entity/Q617426')]\n",
      "[('tnc', '604'), ('old', 'London Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q171240')]\n",
      "[('tnc', '364'), ('old', 'OTC Markets Group'), ('i', 'http://www.wikidata.org/entity/Q1930860')]\n",
      "[('tnc', '356'), ('old', 'Shanghai Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q739514')]\n",
      "[('tnc', '11'), ('old', 'Euronext Amsterdam'), ('i', 'http://www.wikidata.org/entity/Q478720')]\n",
      "[('tnc', '1'), ('old', 'Valencia Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q4202719')]\n",
      "[('tnc', '180'), ('old', 'Tadawul'), ('i', 'http://www.wikidata.org/entity/Q2006583')]\n",
      "[('tnc', '55'), ('old', 'Tel Aviv Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1507974')]\n",
      "[('tnc', '1'), ('old', 'TMX Group'), ('i', 'http://www.wikidata.org/entity/Q3117577')]\n",
      "[('tnc', '2'), ('old', 'Osaka Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q17239431')]\n",
      "[('tnc', '1'), ('old', 'Ghana Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1521374')]\n",
      "[('tnc', '1'), ('old', 'The Far East Exchange Limited'), ('i', 'http://www.wikidata.org/entity/Q18236250')]\n",
      "[('tnc', '2'), ('old', 'Bolsas y Mercados Españoles'), ('i', 'http://www.wikidata.org/entity/Q609159')]\n",
      "[('tnc', '9'), ('old', 'Tokyo Pro Market'), ('i', 'http://www.wikidata.org/entity/Q11249728')]\n",
      "[('tnc', '2'), ('old', 'Bucharest Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1003245')]\n",
      "[('tnc', '1'), ('old', 'Iraq Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1369913')]\n",
      "[('tnc', '2'), ('old', 'eToro'), ('i', 'http://www.wikidata.org/entity/Q5324516')]\n",
      "[('tnc', '1'), ('old', 'Tradegate Exchange'), ('i', 'http://www.wikidata.org/entity/Q1305960')]\n",
      "[('tnc', '1'), ('old', 'BATS Global Markets'), ('i', 'http://www.wikidata.org/entity/Q795469')]\n",
      "[('tnc', '1'), ('old', 'Dar es Salaam Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q490028')]\n",
      "[('tnc', '1'), ('old', 'NASDAQ Global Select Market'), ('i', 'http://www.wikidata.org/entity/Q69336177')]\n",
      "[('tnc', '2'), ('old', 'over-the-counter trading'), ('i', 'http://www.wikidata.org/entity/Q66320')]\n",
      "[('tnc', '97'), ('old', 'Frankfurt Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q151139')]\n",
      "[('tnc', '1'), ('old', 'NASDAQ-100'), ('i', 'http://www.wikidata.org/entity/Q507306')]\n",
      "[('tnc', '1832'), ('old', 'New York Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q13677')]\n",
      "[('tnc', '1799'), ('old', 'Hong Kong Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q496672')]\n",
      "[('tnc', '34'), ('old', 'Italian Bourse'), ('i', 'http://www.wikidata.org/entity/Q936563')]\n",
      "[('tnc', '99'), ('old', 'Nasdaq Copenhagen'), ('i', 'http://www.wikidata.org/entity/Q1019983')]\n",
      "[('tnc', '84'), ('old', 'Taiwan Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q548621')]\n",
      "[('tnc', '7'), ('old', 'RM-SYSTÉM, česká burza cenných papírů'), ('i', 'http://www.wikidata.org/entity/Q12048417')]\n",
      "[('tnc', '23'), ('old', 'Sapporo Securities Exchange'), ('i', 'http://www.wikidata.org/entity/Q11093491')]\n",
      "[('tnc', '1'), ('old', 'Hamburg Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q558551')]\n",
      "[('tnc', '6'), ('old', 'Yangon Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q20992132')]\n",
      "[('tnc', '2'), ('old', 'PFTS index'), ('i', 'http://www.wikidata.org/entity/Q1593991')]\n",
      "[('tnc', '1'), ('old', 'American depositary receipt'), ('i', 'http://www.wikidata.org/entity/Q463881')]\n",
      "[('tnc', '1'), ('old', 'S&P/ASX 50'), ('i', 'http://www.wikidata.org/entity/Q2204387')]\n",
      "[('tnc', '4'), ('old', 'Bitfinex'), ('i', 'http://www.wikidata.org/entity/Q29647473')]\n",
      "[('tnc', '1'), ('old', 'KuCoin Exchange'), ('i', 'http://www.wikidata.org/entity/Q97572932')]\n",
      "[('tnc', '37'), ('old', 'Santiago Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q891561')]\n",
      "[('tnc', '39'), ('old', 'Prague Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1752646')]\n",
      "[('tnc', '394'), ('old', 'Toronto Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q818723')]\n",
      "[('tnc', '9'), ('old', 'Euronext Dublin'), ('i', 'http://www.wikidata.org/entity/Q144458')]\n",
      "[('tnc', '49'), ('old', 'Nasdaq Stockholm'), ('i', 'http://www.wikidata.org/entity/Q1019992')]\n",
      "[('tnc', '1'), ('old', 'Hong Kong Exchanges and Clearing Limited'), ('i', 'http://www.wikidata.org/entity/Q751361')]\n",
      "[('tnc', '2'), ('old', 'Australian Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q12721279')]\n",
      "[('tnc', '1'), ('old', 'Glasgow Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q5566927')]\n",
      "[('tnc', '13'), ('old', 'JASDAQ Securities Exchange'), ('i', 'http://www.wikidata.org/entity/Q1683760')]\n",
      "[('tnc', '1'), ('old', 'IEX'), ('i', 'http://www.wikidata.org/entity/Q16846407')]\n",
      "[('tnc', '3'), ('old', 'Spotlight Stock Market'), ('i', 'http://www.wikidata.org/entity/Q93360933')]\n",
      "[('tnc', '1'), ('old', 'MetaMask'), ('i', 'http://www.wikidata.org/entity/Q97175280')]\n",
      "[('tnc', '2'), ('old', 'Lima Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2380045')]\n",
      "[('tnc', '1'), ('old', 'Muscat Securities Market'), ('i', 'http://www.wikidata.org/entity/Q4117996')]\n",
      "[('tnc', '1755'), ('old', 'NASDAQ'), ('i', 'http://www.wikidata.org/entity/Q82059')]\n",
      "[('tnc', '2'), ('old', 'S&P 500'), ('i', 'http://www.wikidata.org/entity/Q242345')]\n",
      "[('tnc', '1'), ('old', 'Dubai Financial Market'), ('i', 'http://www.wikidata.org/entity/Q1973019')]\n",
      "[('tnc', '1'), ('old', 'Kuwait Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q4164626')]\n",
      "[('tnc', '3'), ('old', 'Paris Bourse'), ('i', 'http://www.wikidata.org/entity/Q178513')]\n",
      "[('tnc', '1'), ('old', 'Cyprus Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2888321')]\n",
      "[('tnc', '154'), ('old', 'Oslo Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q909158')]\n",
      "[('tnc', '1'), ('old', 'Jakarta Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2573852')]\n",
      "[('tnc', '1'), ('old', 'TSX Venture Exchange'), ('i', 'http://www.wikidata.org/entity/Q7671764')]\n",
      "[('tnc', '3'), ('old', 'Chicago Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2633007')]\n",
      "[('tnc', '2'), ('old', 'Trinidad and Tobago Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q4491717')]\n",
      "[('tnc', '1'), ('old', 'Ambitious'), ('i', 'http://www.wikidata.org/entity/Q11285412')]\n",
      "[('tnc', '2'), ('old', 'Huobi'), ('i', 'http://www.wikidata.org/entity/Q19892740')]\n",
      "[('tnc', '3'), ('old', 'Bratislava Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q74603')]\n",
      "[('tnc', '2'), ('old', 'Armenia Securities Exchange'), ('i', 'http://www.wikidata.org/entity/Q683787')]\n",
      "[('tnc', '7'), ('old', 'Fundsquare Market Infrastructure'), ('i', 'http://www.wikidata.org/entity/Q74662')]\n",
      "[('tnc', '2'), ('old', 'Chittagong Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q3349831')]\n",
      "[('tnc', '1'), ('old', 'Germany'), ('i', 'http://www.wikidata.org/entity/Q183')]\n",
      "[('tnc', '146'), ('old', 'Australian Securities Exchange'), ('i', 'http://www.wikidata.org/entity/Q732670')]\n",
      "[('tnc', '1'), ('old', 'CAC Small'), ('i', 'http://www.wikidata.org/entity/Q1022714')]\n",
      "[('tnc', '1'), ('old', 'stock'), ('i', 'http://www.wikidata.org/entity/Q1196314')]\n",
      "[('tnc', '14'), ('old', 'Stock Exchange of Thailand'), ('i', 'http://www.wikidata.org/entity/Q1330208')]\n",
      "[('tnc', '13'), ('old', 'Russian Trading System'), ('i', 'http://www.wikidata.org/entity/Q1344438')]\n",
      "[('tnc', '3'), ('old', 'Deutsche Börse'), ('i', 'http://www.wikidata.org/entity/Q157852')]\n",
      "[('tnc', '1'), ('old', 'Qatar Exchange'), ('i', 'http://www.wikidata.org/entity/Q1648198')]\n",
      "[('tnc', '1'), ('old', 'OTCQX 30'), ('i', 'http://www.wikidata.org/entity/Q18355668')]\n",
      "[('tnc', '3'), ('old', 'OTC Bulletin Board'), ('i', 'http://www.wikidata.org/entity/Q1391676')]\n",
      "[('tnc', '1'), ('old', 'Stock Exchange of Mauritius'), ('i', 'http://www.wikidata.org/entity/Q4491713')]\n",
      "[('tnc', '1'), ('old', 'Egyptian Exchange'), ('i', 'http://www.wikidata.org/entity/Q2509254')]\n",
      "[('tnc', '2'), ('old', 'Milan'), ('i', 'http://www.wikidata.org/entity/Q490')]\n",
      "[('tnc', '2'), ('old', 'NYSE Euronext'), ('i', 'http://www.wikidata.org/entity/Q13683')]\n",
      "[('tnc', '9'), ('old', 'Mexican Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q891559')]\n",
      "[('tnc', '41'), ('old', 'Nagoya Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1188840')]\n",
      "[('tnc', '12'), ('old', 'Singapore Exchange'), ('i', 'http://www.wikidata.org/entity/Q1515558')]\n",
      "[('tnc', '1'), ('old', 'National Equities Exchange and Quotations'), ('i', 'http://www.wikidata.org/entity/Q23308122')]\n",
      "[('tnc', '1'), ('old', 'IBEX 35'), ('i', 'http://www.wikidata.org/entity/Q938032')]\n",
      "[('tnc', '5'), ('old', 'NewConnect'), ('i', 'http://www.wikidata.org/entity/Q10855618')]\n",
      "[('tnc', '1'), ('old', 'Ukrainian Exchange'), ('i', 'http://www.wikidata.org/entity/Q4470480')]\n",
      "[('tnc', '1'), ('old', 'Malta Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q2922440')]\n",
      "[('tnc', '1'), ('old', 'Berliner Börse'), ('i', 'http://www.wikidata.org/entity/Q571760')]\n",
      "[('tnc', '1'), ('old', 'Nairobi Securities Exchange'), ('i', 'http://www.wikidata.org/entity/Q2384385')]\n",
      "[('tnc', '1'), ('old', 'Russell 1000 Index'), ('i', 'http://www.wikidata.org/entity/Q921581')]\n",
      "[('tnc', '1'), ('old', 'Euronext NOTC'), ('i', 'http://www.wikidata.org/entity/Q12005867')]\n",
      "[('tnc', '2'), ('old', 'Karachi Stock Exchange'), ('i', 'http://www.wikidata.org/entity/Q1977283')]\n",
      "[('tnc', '1'), ('old', 'BitBay'), ('i', 'http://www.wikidata.org/entity/Q104786134')]\n",
      "[('tnc', '1'), ('old', 'Indice de Precios y Cotizaciones'), ('i', 'http://www.wikidata.org/entity/Q291740')]\n",
      "[('tnc', '1'), ('old', 'BOERSE DUESSELDORF'), ('i', 'http://www.wikidata.org/entity/Q1019978')]\n",
      "[('tnc', '1'), ('old', 'Spotlight Stock Market'), ('i', 'http://www.wikidata.org/entity/Q10404117')]\n",
      "177\n"
     ]
    }
   ],
   "source": [
    "# TOTAL NUMBEROF COMPANIES IN STOCK EXCHANGE\n",
    "# TOTAL 200 COUNTRIES IN WORLD RIGHTNOW WE SET LIMIT FOR 200 TO SEE NUMBER OF COMPANIES IN EACH COUNTRY STOCK EXCHAGE. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?P) as ?tnc)?old ?i\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?P wdt:P414 ?i.\n",
    "   #get the label\n",
    "   ?i sc:name ?old\n",
    "   \n",
    "   \n",
    "\n",
    "}\n",
    "GROUP BY ?old ?i\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b851215",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 8\n",
    "Identify the BGP for Academy Award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "f479c8fa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'software version identifier'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'tabular software version'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'has edition or translation'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Fonsi Nieto'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', \"Al Stewart's albums in chronological order\"), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Category:Adelina Lopes Vieira'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Lubomír Stoklásek'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Ciudad Vieja'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Echániz'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Natuna'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', \"Acid Mothers Temple's albums in chronological order\"), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Relaño'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2002 in transport'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2006 in transport'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Category:1920 elections in Oceania'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Category:2002 elections in South America'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Category:Teluk Sebong'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Võnnu Rural Municipality'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Kojiro Kobayashi'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Miguel E. M. Herrera'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Category:Akita Shoten magazines'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', \"2010 CONCACAF Women's Gold Cup\"), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2014 FIFA World Cup venues'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'ambassador of Guatemala to France'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Estação Ferroviária de Mafra'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Faculdade de Letras da Universidade de Coimbra'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Faculty of Arts and Humanities of the University of Porto'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Aji'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Urucu'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'jikimiyake'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'war horse'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2010 Pacific hurricane season'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1972 in economics'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2020 Winter Youth Olympics'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Hitachi Province'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Lightiella'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'compilation album released this year'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'region of Ethiopia'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Mateo Egea'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1942 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1958 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1964 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1971 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '1989 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2000 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '2003 in meteorology'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Nemėžis'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', '530 BC'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'ambassador of China to Peru'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2579'), ('top', 'Pleomothra'), ('films', 'film studies'), ('obj', 'http://www.wikidata.org/entity/Q1660187')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {{\n",
    "   # bind something\n",
    "   wd:Q11424 ?P ?obj.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films.\n",
    "   }\n",
    "   Union\n",
    "   {\n",
    "   ?P ?obj wd:Q11424.\n",
    "   ?p sc:name ?top.\n",
    "   ?obj sc:name ?films.\n",
    "   }\n",
    "   }\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "080fa56b-9de5-4310-9646-8fc5766e7a6c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Category:Academy Award for Best Documentary Feature templates'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Category:Academy Award for Best Original Song templates'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Category:Films whose cinematographer won the Best Cinematography Academy Award'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Africa Movie Academy Award for Most Promising Actor'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '\"Sunshine\", \"Queen\" in the spotlight as 79th Annual Academy Award nominations announced'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', \"'Aviator,' 'Baby' dominate 2005 Academy Awards\"), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Elton John AIDS Foundation Party to mark the 2007 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'list of Indian submissions for the Academy Award for Best Foreign Language Film'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '89th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Category:2017 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Category:Best Documentary Short Subject Academy Award winners'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Template:Indian Television Academy Award Most Promising Child Star'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '16th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'International Indian Film Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '45th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '51st Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '52nd Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '1929 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '1946 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '1978 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '1981 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '1988 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '2001 Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Comedian Jon Stewart to host 78th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Nominations announced for 78th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Africa Movie Academy Award for Best Cinematography'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Africa Movie Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Student Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Cinematography, Black-and-White'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Art Direction, Color'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Score, Adaptation or Treatment'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Live Action Short Film'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Makeup and Hairstyling'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Story'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Short Subject, Novelty'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Documentary (Short Subject)'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Animated Short Film'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Original Score, no Musical'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Live Action Short Film, Comedy'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award for Best Director, Dramatic Picture'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '57th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '58th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '90th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Academy Award of the Hungarian Academy of Sciences'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', 'Special Achievement Academy Award'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8201073'), ('top', '14th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q25421476')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#now we have to filter out academy awards\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?P wdt:P166 ?obj.\n",
    "   #get the label\n",
    "   ?p sc:name ?top.\n",
    "   FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "2629c564",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/entity/Q231276'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q16194334'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q8062489'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q24289792'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q13638782'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q24572815'), ('top', 'Africa Movie Academy Award for Best Actress in a Supporting Role'), ('obj', 'http://www.wikidata.org/entity/Q17001892')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q16832217'), ('top', 'Africa Movie Academy Award for Most Promising Actor'), ('obj', 'http://www.wikidata.org/entity/Q17001922')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q24577229'), ('top', 'Africa Movie Academy Award for Most Promising Actor'), ('obj', 'http://www.wikidata.org/entity/Q17001922')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q504191'), ('top', '16th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q148609')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q708870'), ('top', '16th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q148609')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q732397'), ('top', 'International Indian Film Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q655089')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q2573055'), ('top', 'International Indian Film Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q655089')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q2087610'), ('top', 'International Indian Film Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q655089')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q489951'), ('top', '45th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q918125')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q261314'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q317272'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q542484'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1361541'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q273502'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q218894'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q775970'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1338008'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q182944'), ('top', 'Academy Award for Best Original Musical or Comedy Score'), ('obj', 'http://www.wikidata.org/entity/Q22235305')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q21288229'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q9210238'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q20640094'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q585823'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q9153714'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q11721328'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q11766007'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q11766110'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1095425'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q103988746'), ('top', 'Polish Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q547575')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q57699425'), ('top', 'Africa Movie Academy Award for Best Cinematography'), ('obj', 'http://www.wikidata.org/entity/Q18204254')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q6509232'), ('top', 'Student Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q375039')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q67915808'), ('top', 'Student Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q375039')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q7496448'), ('top', 'Student Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q375039')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1699139'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q504191'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q568941'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q606928'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q436704'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q657828'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1706396'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q323827'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1346696'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q210873'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q1217612'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q607280'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/entity/Q645627'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#now we have to filter out academy awards with respect to object\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "    ?P wdt:P166 ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "e5644181-9463-4e88-8b86-45e9ce2296b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P166'), ('top', '45th Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q918125')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1411'), ('top', 'Academy Award for Best Cinematography, Color'), ('obj', 'http://www.wikidata.org/entity/Q21995136')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P166'), ('top', 'Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q19020')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1411'), ('top', 'Academy Award for Best Cinematography'), ('obj', 'http://www.wikidata.org/entity/Q131520')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P166'), ('top', 'Academy Award for Best Cinematography'), ('obj', 'http://www.wikidata.org/entity/Q131520')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P166'), ('top', '53rd Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q767355')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# here we further explore 45th academy awards \n",
    "#[('P', 'http://www.wikidata.org/entity/Q489951'), ('top', '45th Academy Awards'),\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q489951 ?P ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "7c97d3f3-3d0e-4974-b9e1-4734d59d76aa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Picture'), ('obj', 'http://www.wikidata.org/entity/Q102427')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Director'), ('obj', 'http://www.wikidata.org/entity/Q103360')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Actress'), ('obj', 'http://www.wikidata.org/entity/Q103618')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Supporting Actress'), ('obj', 'http://www.wikidata.org/entity/Q106301')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Writing, Adapted Screenplay'), ('obj', 'http://www.wikidata.org/entity/Q107258')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Original Song'), ('obj', 'http://www.wikidata.org/entity/Q112243')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P17'), ('top', 'United States of America'), ('obj', 'http://www.wikidata.org/entity/Q30')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Writing, Original Screenplay'), ('obj', 'http://www.wikidata.org/entity/Q41417')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Actor'), ('obj', 'http://www.wikidata.org/entity/Q103916')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Foreign Language Film'), ('obj', 'http://www.wikidata.org/entity/Q105304')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Supporting Actor'), ('obj', 'http://www.wikidata.org/entity/Q106291')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P31'), ('top', 'group of awards'), ('obj', 'http://www.wikidata.org/entity/Q107655869')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Cinematography'), ('obj', 'http://www.wikidata.org/entity/Q131520')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Costume Design'), ('obj', 'http://www.wikidata.org/entity/Q277536')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P279'), ('top', 'film award'), ('obj', 'http://www.wikidata.org/entity/Q4220917')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Original Score'), ('obj', 'http://www.wikidata.org/entity/Q488651')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Animated Feature'), ('obj', 'http://www.wikidata.org/entity/Q106800')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1889'), ('top', 'Academy Awards ceremony'), ('obj', 'http://www.wikidata.org/entity/Q16913666')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1027'), ('top', 'Academy of Motion Picture Arts and Sciences'), ('obj', 'http://www.wikidata.org/entity/Q212329')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Original Dramatic Score'), ('obj', 'http://www.wikidata.org/entity/Q22235329')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Documentary Feature'), ('obj', 'http://www.wikidata.org/entity/Q111332')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1343'), ('top', 'Disney A to Z'), ('obj', 'http://www.wikidata.org/entity/Q3710090')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1889'), ('top', 'Academy Award'), ('obj', 'http://www.wikidata.org/entity/Q4671334')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P2517'), ('top', 'Category:Academy Award winners'), ('obj', 'http://www.wikidata.org/entity/Q6468204')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P527'), ('top', 'Academy Award for Best Director (Comedy picture)'), ('obj', 'http://www.wikidata.org/entity/Q3451157')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1424'), ('top', 'Template:Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q5483199')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P910'), ('top', 'Category:Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q7148118')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P4622'), ('top', 'Oscar statuette'), ('obj', 'http://www.wikidata.org/entity/Q11291954')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1424'), ('top', 'Template:Infobox Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q13361762')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P1889'), ('top', 'Óscar'), ('obj', 'http://www.wikidata.org/entity/Q21475960')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#FINAL QUERY\n",
    "#BGP FOR ACADEMY AWARDS\n",
    "#[('P', 'http://www.wikidata.org/prop/direct/P166'), ('top', 'Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q19020')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19020 ?P ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   #FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f86aecc3",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Find the companies (among television and film production companies) that won at least 5 Academy Awards for Best Actress for the movies they produced (the result set must be a list of triples company IRI, label and #awards)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "5bd34abc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('top', 'Category:Academy Award winners'), ('obj', 'http://www.wikidata.org/entity/Q6468204')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#USING CATEGORY OF ACADEMY AWARS WINNERS\n",
    "\n",
    "#[('P', 'http://www.wikidata.org/prop/direct/P2517'),\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19020 wdt:P2517 ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   #FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "acde335d-bbaa-4f51-9773-08441428e972",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P971'), ('top', 'award winner'), ('obj', 'http://www.wikidata.org/entity/Q21096945')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P971'), ('top', 'Academy Awards'), ('obj', 'http://www.wikidata.org/entity/Q19020')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P31'), ('top', 'Wikimedia category'), ('obj', 'http://www.wikidata.org/entity/Q4167836')]\n",
      "[('P', 'http://www.wikidata.org/prop/direct/P4224'), ('top', 'human'), ('obj', 'http://www.wikidata.org/entity/Q5')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#[('top', 'Category:Academy Award winners'), ('obj', 'http://www.wikidata.org/entity/Q6468204')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q6468204 ?P ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   #FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "24605805",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('top', 'Category:1920 elections in Oceania'), ('obj', 'http://www.wikidata.org/entity/Q10145708')]\n",
      "[('top', 'Category:2002 elections in South America'), ('obj', 'http://www.wikidata.org/entity/Q10147007')]\n",
      "[('top', 'Category:Akita Shoten magazines'), ('obj', 'http://www.wikidata.org/entity/Q10237146')]\n",
      "[('top', 'Category:2009 in Australian sport'), ('obj', 'http://www.wikidata.org/entity/Q11167612')]\n",
      "[('top', 'Category:1981 in New Zealand sport'), ('obj', 'http://www.wikidata.org/entity/Q11721574')]\n",
      "[('top', 'Category:1926 in Argentine sport'), ('obj', 'http://www.wikidata.org/entity/Q13237425')]\n",
      "[('top', 'Category:1928 in Argentine sport'), ('obj', 'http://www.wikidata.org/entity/Q13237485')]\n",
      "[('top', 'Category:1928 in South American sport'), ('obj', 'http://www.wikidata.org/entity/Q13237495')]\n",
      "[('top', 'Category:1932 in table tennis'), ('obj', 'http://www.wikidata.org/entity/Q13237669')]\n",
      "[('top', 'Category:1944 in Antarctica'), ('obj', 'http://www.wikidata.org/entity/Q13238087')]\n",
      "[('top', 'Category:1955 in swimming'), ('obj', 'http://www.wikidata.org/entity/Q13238540')]\n",
      "[('top', 'Category:1964 in English sport'), ('obj', 'http://www.wikidata.org/entity/Q13238939')]\n",
      "[('top', 'Category:1971 in Central American sport'), ('obj', 'http://www.wikidata.org/entity/Q13239271')]\n",
      "[('top', 'Category:1971 in bobsleigh'), ('obj', 'http://www.wikidata.org/entity/Q13239287')]\n",
      "[('top', 'Category:1973 in bobsleigh'), ('obj', 'http://www.wikidata.org/entity/Q13239384')]\n",
      "[('top', 'Category:1976 in Hawaii'), ('obj', 'http://www.wikidata.org/entity/Q13239542')]\n",
      "[('top', 'Category:1977 in Belgian sport'), ('obj', 'http://www.wikidata.org/entity/Q13239595')]\n",
      "[('top', 'Category:1982 in ski jumping'), ('obj', 'http://www.wikidata.org/entity/Q13239894')]\n",
      "[('top', 'Category:1988 in Canadian sports'), ('obj', 'http://www.wikidata.org/entity/Q13240187')]\n",
      "[('top', 'Category:1989 in bobsleigh'), ('obj', 'http://www.wikidata.org/entity/Q13240245')]\n",
      "[('top', 'Category:1991 in German sport'), ('obj', 'http://www.wikidata.org/entity/Q13240372')]\n",
      "[('top', 'Category:1994 in Swiss sport'), ('obj', 'http://www.wikidata.org/entity/Q13240562')]\n",
      "[('top', 'Category:1994 in bobsleigh'), ('obj', 'http://www.wikidata.org/entity/Q13240568')]\n",
      "[('top', 'Category:1995 in water polo'), ('obj', 'http://www.wikidata.org/entity/Q13240638')]\n",
      "[('top', 'Category:2006 elections in North America'), ('obj', 'http://www.wikidata.org/entity/Q13241549')]\n",
      "[('top', 'Category:2006 in Swedish association football leagues'), ('obj', 'http://www.wikidata.org/entity/Q13241605')]\n",
      "[('top', 'Category:2009 in English sport'), ('obj', 'http://www.wikidata.org/entity/Q13241911')]\n",
      "[('top', 'Category:2015 in table tennis'), ('obj', 'http://www.wikidata.org/entity/Q13242423')]\n",
      "[('top', 'Category:Airlines disestablished in 1983'), ('obj', 'http://www.wikidata.org/entity/Q13243867')]\n",
      "[('top', 'Category:2013 in table tennis'), ('obj', 'http://www.wikidata.org/entity/Q13316531')]\n",
      "[('top', 'Category:1971 in Canadian sports'), ('obj', 'http://www.wikidata.org/entity/Q13347381')]\n",
      "[('top', 'Category:1973 in Canadian sports'), ('obj', 'http://www.wikidata.org/entity/Q13347382')]\n",
      "[('top', 'Category:1994 in Canadian sports'), ('obj', 'http://www.wikidata.org/entity/Q13347390')]\n",
      "[('top', 'Category:2003 in Canadian sports'), ('obj', 'http://www.wikidata.org/entity/Q13347393')]\n",
      "[('top', 'Category:2013 in British sport'), ('obj', 'http://www.wikidata.org/entity/Q13347473')]\n",
      "[('top', 'Category:1944 in American sports'), ('obj', 'http://www.wikidata.org/entity/Q13347547')]\n",
      "[('top', 'Category:2017 in the United Kingdom'), ('obj', 'http://www.wikidata.org/entity/Q14566599')]\n",
      "[('top', 'Category:2013–14 ISU Speed Skating World Cup'), ('obj', 'http://www.wikidata.org/entity/Q14594590')]\n",
      "[('top', 'Category:18th century in Malta'), ('obj', 'http://www.wikidata.org/entity/Q15097765')]\n",
      "[('top', 'Category:1919 in Hawaii'), ('obj', 'http://www.wikidata.org/entity/Q15102953')]\n",
      "[('top', 'Category:1934 in American sports'), ('obj', 'http://www.wikidata.org/entity/Q15105200')]\n",
      "[('top', 'Category:1938 in Algeria'), ('obj', 'http://www.wikidata.org/entity/Q15106039')]\n",
      "[('top', 'Category:1944 in Italian sport'), ('obj', 'http://www.wikidata.org/entity/Q15107613')]\n",
      "[('top', 'Category:1947 in Argentine sport'), ('obj', 'http://www.wikidata.org/entity/Q15108638')]\n",
      "[('top', 'Category:1952 domestic association football leagues'), ('obj', 'http://www.wikidata.org/entity/Q15110843')]\n",
      "[('top', 'Category:1959 in Swedish sport'), ('obj', 'http://www.wikidata.org/entity/Q15113759')]\n",
      "[('top', 'Category:1963 in Hawaii'), ('obj', 'http://www.wikidata.org/entity/Q15115446')]\n",
      "[('top', 'Category:1973 in Hawaii'), ('obj', 'http://www.wikidata.org/entity/Q15117976')]\n",
      "[('top', 'Category:1981 in go'), ('obj', 'http://www.wikidata.org/entity/Q15120313')]\n",
      "[('top', 'Category:1982 in table tennis'), ('obj', 'http://www.wikidata.org/entity/Q15120435')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#all award winners\n",
    "#[('P', 'http://www.wikidata.org/prop/direct/P971'), ('top', 'award winner'),\n",
    "#[('top', 'Category:Academy Award winners'), ('obj', 'http://www.wikidata.org/entity/Q6468204')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?P ?top ?films ?obj\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?p wdt:P971 ?obj.\n",
    "   #get the label\n",
    "   ?obj sc:name ?top.\n",
    "   #FILTER(REGEX(?top,\"Academy Award\"^^xsd:))\n",
    "   }\n",
    "   \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
