{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "379736a8",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3e2ce3d8",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-7f8b8f0ef0-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "05541941",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Tv series HIMYM explorative search\") \n",
    "\n",
    "\n",
    "Consider the following exploratory scenario:\n",
    "\n",
    "\n",
    "> we are interested in the TV series \"How I met your mother\" and we want to investigate the main aspects related to the actors and directors involved in the production, know the numerber of seasons and check what are the episodes which got the higher success/impact.\n",
    "\n",
    "\n",
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P4969`    | derivative work      | predicate |\n",
    "| `wd:Q147235` | How I met your mother        | node |\n",
    "| `wd:Q23831` | The Office (US)        | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q23831 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Office (US)**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should\n",
    "\n",
    "1. Identify the BGP for tv series\n",
    "\n",
    "2. Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes).\n",
    "\n",
    "3. Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)\n",
    "\n",
    "4. Check who is the actor who acted in more films while working on \"How I met your mother\" (the result set must be a list of triples actor/actress IRI, label and #films).\n",
    "\n",
    "5. Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members).\n",
    "\n",
    "6. Return how many of the actors who are members of the cast of the tv series have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label).\n",
    "\n",
    "7. Consider the actors who are members of the cast of HIMYM. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "948f882b",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for tv series"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3a1217bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1113'), ('name', 'number of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1267'), ('name', 'AlloCiné series ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('name', 'list of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('name', 'aspect ratio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q23831 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "885fc82f-10ea-4886-8c6b-f1f6a56b38ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sName', 'Harpist of Keros'), ('oName', 'Cycladic art')]\n",
      "[('sName', 'Ayinde Barrister'), ('oName', 'fuji music')]\n",
      "[('sName', 'Crying for No Reason'), ('oName', 'breakstep')]\n",
      "[('sName', 'Chapliniana'), ('oName', 'ballet film')]\n",
      "[('sName', 'Scribblenauts Unmasked: A DC Comics Adventure'), ('oName', 'emergent gameplay')]\n",
      "[('sName', 'Ajin'), ('oName', 'supernatural anime and manga')]\n",
      "[('sName', 'Rygar'), ('oName', 'spacesynth')]\n",
      "[('sName', 'Amoeba Cleansing Syndrome'), ('oName', 'progressive soul')]\n",
      "[('sName', 'Love Steaks'), ('oName', 'Mumblecore')]\n",
      "[('sName', 'Nimrod Borenstein'), ('oName', 'ballet')]\n",
      "[('sName', 'Shakey Jake Harris'), ('oName', 'Chicago blues')]\n",
      "[('sName', 'Da Funk'), ('oName', 'acid house')]\n",
      "[('sName', 'Lee Kwang-ki'), ('oName', 'trot')]\n",
      "[('sName', 'Seo In-ah'), ('oName', 'trot')]\n",
      "[('sName', 'Kim Ji-ae'), ('oName', 'trot')]\n",
      "[('sName', 'Oöphoi'), ('oName', 'dark ambient')]\n",
      "[('sName', 'Necrophagist'), ('oName', 'technical death metal')]\n",
      "[('sName', 'Rivers of Nihil'), ('oName', 'technical death metal')]\n",
      "[('sName', 'Aura Hiemis'), ('oName', 'death-doom')]\n",
      "[('sName', 'Rich Homie Quan'), ('oName', 'trap music')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#P136 genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sName ?oName\n",
    "WHERE {\n",
    "   ?s wdt:P136 ?o .\n",
    "   ?s sc:name ?sName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "b6d0924a-3362-4b65-8dc9-b0043dd92979",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q15594658'), ('sName', 'Cutthroat Kitchen'), ('oName', 'list of Cutthroat Kitchen episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15731300'), ('sName', 'Power Rangers Dino Charge'), ('oName', 'List of Power Rangers Dino Charge episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16039926'), ('sName', 'Garo: Makai no Hana'), ('oName', 'list of Garo: Makai no Hana episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13479326'), ('sName', 'RWBY'), ('oName', 'list of RWBY episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q60740094'), ('sName', 'Danganronpa: The Animation'), ('oName', 'list of Danganronpa: The Animation episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2757796'), ('sName', 'Nisekoi'), ('oName', 'list of Nisekoi episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2555936'), ('sName', 'Meine Liebe'), ('oName', 'list of Meine Liebe episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15303732'), ('sName', 'The Tonight Show Starring Jimmy Fallon'), ('oName', 'list of The Tonight Show Starring Jimmy Fallon episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17034872'), ('sName', 'Sirens'), ('oName', 'list of Sirens (2014 TV series) episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17010736'), ('sName', \"RuPaul's Drag U\"), ('oName', \"list of RuPaul's Drag U episodes\")]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17053914'), ('sName', 'Your Pretty Face Is Going to Hell'), ('oName', 'list of Your Pretty Face Is Going to Hell episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17501992'), ('sName', 'Dora and Friends: Into the City!'), ('oName', 'list of Dora and Friends: Into the City! episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16138249'), ('sName', 'Sailor Moon Crystal'), ('oName', 'list of Sailor Moon Crystal episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17635847'), ('sName', 'K.C. Undercover'), ('oName', 'list of K.C. Undercover episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18151386'), ('sName', 'Kirby Buckets'), ('oName', 'list of Kirby Buckets episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18127230'), ('sName', 'Life is Beautiful'), ('oName', 'list of Life Is Beautiful episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18151589'), ('sName', 'The Late Late Show with James Corden'), ('oName', 'list of The Late Late Show with James Corden episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q318649'), ('sName', 'Ghost Whisperer'), ('oName', 'list of Ghost Whisperer episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q19349423'), ('sName', 'King of Mask Singer'), ('oName', 'list of King of Mask Singer episodes')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3533342'), ('sName', 'W.I.T.C.H.'), ('oName', 'list of W.I.T.C.H. episodes')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#P1811 list of episodes\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sName ?oName\n",
    "WHERE {\n",
    "   ?s wdt:P1811 ?o .\n",
    "   ?s sc:name ?sName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d2b1b2f1-6d3f-4592-8005-38b4a9a915e7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('pName', 'list of episodes'), ('o', 'http://www.wikidata.org/entity/Q27665409'), ('oName', 'list of Cutthroat Kitchen episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q846662'), ('oName', 'game show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('pName', 'language of work or name'), ('o', 'http://www.wikidata.org/entity/Q1860'), ('oName', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin'), ('o', 'http://www.wikidata.org/entity/Q30'), ('oName', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q5398426'), ('oName', 'television series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('pName', 'distribution format'), ('o', 'http://www.wikidata.org/entity/Q723685'), ('oName', 'video on demand')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by'), ('o', 'http://www.wikidata.org/entity/Q1630304'), ('oName', 'Hulu')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P449'), ('pName', 'original broadcaster'), ('o', 'http://www.wikidata.org/entity/Q1435969'), ('oName', 'Food Network')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('o', 'http://www.wikidata.org/entity/Q2111686'), ('oName', 'culinary art')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "#Q15594658 Cutthroat Kitchen\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?o ?oName\n",
    "WHERE {\n",
    "   wd:Q15594658 ?p ?o .\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d6d0e752-5891-4c8a-9dcc-4e1ce5722972",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q5398426'), ('televisionSeriesName', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Q5398426 television series\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?televisionSeries ?televisionSeriesName\n",
    "WHERE {\n",
    "    wd:Q15594658 wdt:P31 ?televisionSeries .\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "87779b23",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "777ec0f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('televisionSeries', 'http://www.wikidata.org/entity/Q5398426'), ('televisionSeriesName', 'television series')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#Cutthroat Kitchen(wd:Q15594658) is an instance of (wdt:P31) of televisionSeries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?televisionSeries ?televisionSeriesName\n",
    "WHERE {\n",
    "    wd:Q15594658 wdt:P31 ?televisionSeries .\n",
    "   ?televisionSeries sc:name ?televisionSeriesName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e825b7a9",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Return the number of seasons and episodes per season of the tv series (the result set must be triples of season IRI, label and #episodes)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "fc85d9c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1154217'), ('tvseriesName', 'Ironfist Chinmi')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q691528'), ('tvseriesName', 'Wallace and Gromit')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q8193809'), ('tvseriesName', 'Shomuni')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q33323'), ('tvseriesName', 'Everybody Hates Chris')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q500769'), ('tvseriesName', 'Freaks and Geeks')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q8350955'), ('tvseriesName', 'Cordel Encantado')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1145054'), ('tvseriesName', 'The NBC Mystery Movie')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q344081'), ('tvseriesName', 'Recess')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q13647845'), ('tvseriesName', 'Grijpstra & De Gier')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q708661'), ('tvseriesName', 'Lindenstraße')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15099450'), ('tvseriesName', 'Prime Minister and I')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15476155'), ('tvseriesName', 'The Full Sun')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15933273'), ('tvseriesName', 'Big Man')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q548335'), ('tvseriesName', 'Angelina Ballerina')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15581035'), ('tvseriesName', 'El cielo es para todos')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15594658'), ('tvseriesName', 'Cutthroat Kitchen')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15731300'), ('tvseriesName', 'Power Rangers Dino Charge')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15737024'), ('tvseriesName', '37 Days')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15933384'), ('tvseriesName', 'Special Affairs Team TEN')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q27889400'), ('tvseriesName', 'Power Rangers Ninja Steel')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName\n",
    "WHERE {\n",
    "    ?tvseries wdt:P31 wd:Q5398426 .\n",
    "   ?tvseries sc:name ?tvseriesName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "9e6f8a31-c46c-4d73-ba95-af1be9769648",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pName', 'follows'), ('oName', 'Power Rangers Dino Charge')]\n",
      "[('pName', 'original broadcaster'), ('oName', 'Nickelodeon')]\n",
      "[('pName', 'distributed by'), ('oName', 'Saban Entertainment')]\n",
      "[('pName', 'producer'), ('oName', 'Toei Company')]\n",
      "[('pName', 'creator'), ('oName', 'Toei Company')]\n",
      "[('pName', 'creator'), ('oName', 'Haim Saban')]\n",
      "[('pName', 'executive producer'), ('oName', 'Haim Saban')]\n",
      "[('pName', 'language of work or name'), ('oName', 'English')]\n",
      "[('pName', 'country of origin'), ('oName', 'United States of America')]\n",
      "[('pName', 'instance of'), ('oName', 'television series')]\n",
      "[('pName', 'distribution format'), ('oName', 'video on demand')]\n",
      "[('pName', 'distributed by'), ('oName', 'Netflix')]\n",
      "[('pName', 'distributed by'), ('oName', 'MarVista Entertainment')]\n",
      "[('pName', 'genre'), ('oName', 'tokusatsu')]\n",
      "[('pName', 'producer'), ('oName', 'Saban Capital Group')]\n",
      "[('pName', 'subclass of'), ('oName', 'Power Rangers')]\n",
      "[('pName', 'has part'), ('oName', 'Power Rangers Super Ninja Steel')]\n",
      "[('pName', 'based on'), ('oName', 'Shuriken Sentai Ninninger')]\n",
      "[('pName', 'executive producer'), ('oName', 'Judd Lynn')]\n",
      "[('pName', 'director'), ('oName', 'Judd Lynn')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Q27889400 Power Rangers Ninja Steel\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pName ?oName\n",
    "WHERE {\n",
    "    wd:Q27889400 ?p ?o .\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "429a3172-3fea-4e4e-b4d3-74b54c41c3d4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sName', 'Power Rangers Dino Charge'), ('p', 'http://www.wikidata.org/prop/direct/P156'), ('pName', 'followed by')]\n",
      "[('sName', 'Power Rangers Super Ninja Steel'), ('p', 'http://www.wikidata.org/prop/direct/P179'), ('pName', 'part of the series')]\n",
      "[('sName', 'Power Rangers Ninja Steel, season 1'), ('p', 'http://www.wikidata.org/prop/direct/P179'), ('pName', 'part of the series')]\n",
      "[('sName', 'Power Rangers Beast Morphers'), ('p', 'http://www.wikidata.org/prop/direct/P155'), ('pName', 'follows')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#Q15737024 Power Rangers Ninja Steel\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sName ?p ?pName\n",
    "WHERE {\n",
    "     ?s ?p wd:Q27889400 .\n",
    "   ?p sc:name ?pName.\n",
    "   ?s sc:name ?sName.\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "849be70f-3340-4b42-bc73-76b81352f191",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseriesName', 'Fantasy Island'), ('numseasons', '7')]\n",
      "[('tvseriesName', 'Mr. Novak'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'American Chopper: Senior vs. Junior'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'Family'), ('numseasons', '5')]\n",
      "[('tvseriesName', 'Jem'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'Peter Punk'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Danmarks Næste Topmodel'), ('numseasons', '6')]\n",
      "[('tvseriesName', 'I liceali'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'The Eleventh Hour'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'Witchblade'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Armchair Thriller'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Survivor Philippines'), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Bob Hope Presents the Chrysler Theatre'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'The Colbys'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Star Trek: Strange New Worlds'), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Class of the Titans'), ('numseasons', '1')]\n",
      "[('tvseriesName', \"Bring 'Em Back Alive\"), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Homecoming'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'World of Dance'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'Tough as Nails'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Tracy e Polpetta'), ('numseasons', '6')]\n",
      "[('tvseriesName', 'Conan the Adventurer'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'A Place to Call Home'), ('numseasons', '6')]\n",
      "[('tvseriesName', 'Bloodline'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'The Mist'), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Queer Eye'), ('numseasons', '5')]\n",
      "[('tvseriesName', 'Amazing Stories'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Alcoa Presents: One Step Beyond'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'Sydney to the Max'), ('numseasons', '3')]\n",
      "[('tvseriesName', \"Persia's Got Talent\"), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Golpe de Sorte'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'Floor Is Lava'), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Drag Race Holland'), ('numseasons', '1')]\n",
      "[('tvseriesName', 'Broken Arrow'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Graf Yoster'), ('numseasons', '5')]\n",
      "[('tvseriesName', \"TV Reader's Digest\"), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Reign'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'The Lawless Years'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'The Path'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'Nebbie e delitti'), ('numseasons', '3')]\n",
      "[('tvseriesName', 'Show Me Yours'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Drag Race Thailand'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Rawhide'), ('numseasons', '8')]\n",
      "[('tvseriesName', 'The Mod Squad'), ('numseasons', '5')]\n",
      "[('tvseriesName', 'The Restless Gun'), ('numseasons', '2')]\n",
      "[('tvseriesName', 'Deal or No Deal'), ('numseasons', '7')]\n",
      "[('tvseriesName', 'The Edison Twins'), ('numseasons', '6')]\n",
      "[('tvseriesName', 'Richard Diamond, Private Detective'), ('numseasons', '4')]\n",
      "[('tvseriesName', 'Bella and the Bulldogs'), ('numseasons', '2')]\n",
      "[('tvseriesName', \"Asia's Got Talent\"), ('numseasons', '3')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#episodes per seasons \n",
    "# P179 part of the series\n",
    "queryString = \"\"\"\n",
    "SELECT ?tvseriesName (COUNT(?seasonName) AS ?numseasons)\n",
    "WHERE \n",
    "{\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName .\n",
    "    ?season wdt:P179 ?tvseries ;\n",
    "       sc:name ?seasonName .\n",
    "\n",
    "   FILTER REGEX(?seasonName, \"season*\")   \n",
    "}\n",
    "GROUP BY ?tvseriesName \n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "32db2f4e-3a6e-4ce8-87e7-fdaf315d95c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pName', 'part of the series'), ('oName', 'Everybody Hates Chris')]\n",
      "[('pName', 'original language of film or TV show'), ('oName', 'English')]\n",
      "[('pName', 'distribution format'), ('oName', 'video on demand')]\n",
      "[('pName', 'instance of'), ('oName', 'television series season')]\n",
      "[('pName', 'distribution format'), ('oName', 'digital download')]\n",
      "[('pName', 'distributed by'), ('oName', 'iTunes')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#Q1615887 Everybody Hates Chris, season 3\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pName ?oName\n",
    "WHERE {\n",
    "    wd:Q1615887 ?p ?o .\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6f2000b6",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "78905a29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('season', 'http://www.wikidata.org/entity/Q64520767'), ('seasonName', 'Power Couple (Brazilian season 4)'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q18819122'), ('seasonName', 'Banshee, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q39072926'), ('seasonName', 'Instant Mom, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q56229087'), ('seasonName', 'Megasztár, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q66486674'), ('seasonName', 'Sacred Games, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q60521583'), ('seasonName', 'Food Paradise, season 8'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q60521582'), ('seasonName', 'Food Paradise, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3730143'), ('seasonName', 'The Big C, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q60977808'), ('seasonName', 'The Ranch, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q50894634'), ('seasonName', 'Nix Festes, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q18351177'), ('seasonName', 'Alice, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q56489525'), ('seasonName', 'Blindspot, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q65078107'), ('seasonName', \"America's Got Talent, season 14\"), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q30900599'), ('seasonName', 'You Me Her, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q21186109'), ('seasonName', 'Suits, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16553844'), ('seasonName', 'The League, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q98801120'), ('seasonName', 'The Brady Bunch, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q56325028'), ('seasonName', 'Mindhunter, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q102350818'), ('seasonName', 'SOKO Donau, season 9'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q60765217'), ('seasonName', 'I Can See Your Voice Indonesia, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q60765211'), ('seasonName', 'I Can See Your Voice Indonesia, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q105038345'), ('seasonName', 'The Voice (U.S. season 19)'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q63524413'), ('seasonName', \"Schitt's Creek, season 3\"), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q99745924'), ('seasonName', 'Dance Smash, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q65057978'), ('seasonName', \"Ellen's Game of Games, season 2\"), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q25217857'), ('seasonName', 'The Bachelor, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q101229740'), ('seasonName', 'Alfons Åberg, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729398'), ('seasonName', 'Cagney & Lacey, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16553988'), ('seasonName', 'V.I.P., season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q25218140'), ('seasonName', 'Shark Tank, Australia season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q28453361'), ('seasonName', 'Doble Kara, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q28451291'), ('seasonName', 'The Real Housewives of Orange County, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q98355691'), ('seasonName', 'The Adventures of Ozzie and Harriet, season 11'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q99743321'), ('seasonName', 'Pawn Stars, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q69355558'), ('seasonName', 'Shameless, season 10'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q30901596'), ('seasonName', 'El Ministerio del Tiempo, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3726997'), ('seasonName', 'The Jeffersons, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q30900792'), ('seasonName', 'One Day at a Time, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q94096400'), ('seasonName', 'Doogie Howser, M.D., season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q97370183'), ('seasonName', 'Perfect Strangers, season 8'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q97370069'), ('seasonName', 'The Onedin Line, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q97370040'), ('seasonName', 'Crazy like a Fox, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q59386626'), ('seasonName', 'Scènes de ménage, season 9'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3729041'), ('seasonName', 'Law & Order: Special Victims Unit, season 12'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q12096640'), ('seasonName', '2nd season of The Voice Ukraine'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17329040'), ('seasonName', 'The Voice of China, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17153875'), ('seasonName', 'The Bob Newhart Show, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17152873'), ('seasonName', 'The Bob Newhart Show, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q18636778'), ('seasonName', 'Storage Wars, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q104913539'), ('seasonName', 'Kath & Kim season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q15194029'), ('seasonName', 'Vain elämää, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q70142759'), ('seasonName', 'Vain elämää, season 10'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q61356268'), ('seasonName', 'Vild med dans, season 16'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q11889190'), ('seasonName', 'Putous, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q7715216'), ('seasonName', 'The Bachelor, season 15'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q7715212'), ('seasonName', 'The Bachelor, season 11'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q41535948'), ('seasonName', 'Soy Luna, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q24042652'), ('seasonName', 'La familia P. Luche, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q66619395'), ('seasonName', 'Rosario Tijeras, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3468983'), ('seasonName', 'Star Trek: The Next Generation, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q7579107'), ('seasonName', 'Spooks, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16552699'), ('seasonName', 'Wagon Train, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q106696020'), ('seasonName', 'Hey Arnold!, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q100990501'), ('seasonName', 'Hallo, Onkel Doc!, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16850678'), ('seasonName', 'Johnny Test, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3727539'), ('seasonName', 'Alfred Hitchcock Presents, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q105491052'), ('seasonName', 'In the Heat of the Night, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2127141'), ('seasonName', 'Spoed, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q39072235'), ('seasonName', 'Gotham, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2083225'), ('seasonName', '90210, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q29000871'), ('seasonName', 'Arrow, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17079382'), ('seasonName', 'Saturday Night Live, season 40'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q7426684'), ('seasonName', 'Saturday Night Live, season 21'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q5334460'), ('seasonName', 'Ed, Edd n Eddy, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q12981844'), ('seasonName', 'The DuPont Show with June Allyson, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q12912808'), ('seasonName', 'Schlitz Playhouse of Stars, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q51800792'), ('seasonName', 'Airwolf, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q98107757'), ('seasonName', 'Big Town, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q98107759'), ('seasonName', 'Big Town, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16552853'), ('seasonName', 'Dog with a Blog, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q15102594'), ('seasonName', 'The Voice of Germany, season 3'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q51643311'), ('seasonName', 'New Girl, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q28657742'), ('seasonName', 'Santa Clarita Diet, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q9670762'), ('seasonName', 'CSI: Crime Scene Investigation, season 14'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q65084975'), ('seasonName', 'Supergirl, season 5'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3469079'), ('seasonName', \"That '70s Show, season 7\"), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1611030'), ('seasonName', 'Doctor Who, season 13'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q1610863'), ('seasonName', 'Doctor Who, season 10'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q20987112'), ('seasonName', 'NCIS: Los Angeles, season 7'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q17629959'), ('seasonName', 'Superman: The Animated Series, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3727165'), ('seasonName', 'Il maresciallo Rocca, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q2661631'), ('seasonName', 'Buffy the Vampire Slayer, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3465736'), ('seasonName', 'Mad Men, season 1'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q16206901'), ('seasonName', 'Casualty, season 28'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q65158256'), ('seasonName', 'The Walking Dead, season 10'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3727918'), ('seasonName', 'Californication, season 6'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3730563'), ('seasonName', \"Wingin' It, season 1\"), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3468898'), ('seasonName', 'Star Trek: Enterprise, season 4'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q3468607'), ('seasonName', 'Touch, season 2'), ('numseasons', '1')]\n",
      "[('season', 'http://www.wikidata.org/entity/Q105103817'), ('seasonName', 'The Life and Times of Grizzly Adams, season 1'), ('numseasons', '1')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT ?season ?seasonName (COUNT(?seasonName) AS ?numseasons)\n",
    "WHERE \n",
    "{\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName .\n",
    "    ?season wdt:P179 ?tvseries ;\n",
    "       sc:name ?seasonName .\n",
    "\n",
    "   FILTER REGEX(?seasonName, \"season*\")   \n",
    "}\n",
    "GROUP BY ?season ?seasonName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "391925fc",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Get the number of episodes in which the cast members played a role. Who are the most present actors? (the result set must be a list of triples actor/actress IRI, label and #episodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "3c6c9933",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('pName', 'follows'), ('oName', 'Power Rangers Dino Charge')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P449'), ('pName', 'original broadcaster'), ('oName', 'Nickelodeon')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by'), ('oName', 'Saban Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('pName', 'producer'), ('oName', 'Toei Company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('pName', 'creator'), ('oName', 'Toei Company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('pName', 'creator'), ('oName', 'Haim Saban')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1431'), ('pName', 'executive producer'), ('oName', 'Haim Saban')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('pName', 'language of work or name'), ('oName', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin'), ('oName', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('oName', 'television series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('pName', 'distribution format'), ('oName', 'video on demand')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by'), ('oName', 'Netflix')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by'), ('oName', 'MarVista Entertainment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre'), ('oName', 'tokusatsu')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('pName', 'producer'), ('oName', 'Saban Capital Group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pName', 'subclass of'), ('oName', 'Power Rangers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('oName', 'Power Rangers Super Ninja Steel')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('pName', 'based on'), ('oName', 'Shuriken Sentai Ninninger')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1431'), ('pName', 'executive producer'), ('oName', 'Judd Lynn')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('pName', 'director'), ('oName', 'Judd Lynn')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#Q27889400 Power Rangers Ninja Steel\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?oName\n",
    "WHERE {\n",
    "    wd:Q27889400 ?p ?o .\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "d9cfa7c9-7d89-4887-9f22-28b31b0163c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q8193809'), ('sName', 'Shomuni'), ('oName', 'Takayoshi Watanabe')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q21008514'), ('sName', 'Murder in Pacot'), ('oName', 'Raoul Peck')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8452990'), ('sName', \"Sunday League - Pepik Hnatek's Final Match\"), ('oName', 'Jan Prušinovský')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3611806'), ('sName', 'Alimony'), ('oName', 'Emmett J. Flynn')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8350955'), ('sName', 'Cordel Encantado'), ('oName', 'Amora Mautner')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q20949971'), ('sName', 'Stolen Heaven'), ('oName', 'Andrew L. Stone')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q21646939'), ('sName', 'Roommate'), ('oName', 'Takeshi Furusawa')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18040186'), ('sName', \"Charlie Don't Surf\"), ('oName', 'Jason Bloom')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q23419147'), ('sName', 'Anna Regina'), ('oName', 'Peter Kosminsky')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q23419171'), ('sName', 'Entirely Beloved'), ('oName', 'Peter Kosminsky')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16943346'), ('sName', 'Mabudachi'), ('oName', 'Tomoyuki Furumaya')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13643224'), ('sName', 'Carl & Bertha'), ('oName', 'Till Endemann')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15475237'), ('sName', 'Mediastan'), ('oName', 'Johannes Wahlström')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15464247'), ('sName', 'What the Fish'), ('oName', 'Gurmeet Singh')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15584559'), ('sName', 'Salvation Nell'), ('oName', 'George E. Middleton')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15724887'), ('sName', 'Bahu Heba Emiti'), ('oName', 'Vijay Bhaskar')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15725414'), ('sName', 'Haata Dhari Chaaluthaa'), ('oName', 'Himanshu Parija')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15725300'), ('sName', 'Sakhi Rahila Ae Singha Duara'), ('oName', 'Sanjay Nayak')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15724803'), ('sName', 'Basanti Apa'), ('oName', 'Jalal Adeni')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15724695'), ('sName', 'Priyatama'), ('oName', 'Biswajit Das')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#P57 director\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sName ?oName\n",
    "WHERE {\n",
    "   ?s wdt:P57 ?o .\n",
    "   ?s sc:name ?sName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "6a8b527e-3a4c-45f7-b4ba-2cf872826019",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('pName', 'director'), ('oName', 'Raoul Peck')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('pName', 'producer'), ('oName', 'Rémi Grellety')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('pName', 'director of photography'), ('oName', 'Éric Guichard')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('pName', 'screenwriter'), ('oName', 'Lyonel Trouillot')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('oName', 'Thibault Vinçon')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('pName', 'composer'), ('oName', 'Alexei Gennadjewitsch Aigi')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('oName', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin'), ('oName', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('pName', 'original language of film or TV show'), ('oName', 'French')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin'), ('oName', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1981'), ('pName', 'FSK film rating'), ('oName', 'FSK 12')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('pName', 'color'), ('oName', 'color')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin'), ('oName', 'Haiti')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P915'), ('pName', 'filming location'), ('oName', 'Port-au-Prince')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('oName', 'Alex Descas')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('oName', 'Zinedine Soualem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member'), ('oName', 'Ayọ')]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "#Q21008514 Murder in Pacot\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?oName\n",
    "WHERE {\n",
    "   wd:Q21008514 ?p ?o .\n",
    "   ?p sc:name ?pName.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "11cc9cb5-ba88-4eb3-b70b-a1304e4f15be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2735277'), ('actorName', 'Prem Nazir'), ('numfilm', '525')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q946745'), ('actorName', 'Broncho Billy Anderson'), ('numfilm', '351')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q379604'), ('actorName', 'Mithun Chakraborty'), ('numfilm', '346')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2721855'), ('actorName', 'Mammootty'), ('numfilm', '340')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q72911'), ('actorName', 'Oliver Hardy'), ('numfilm', '335')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q317574'), ('actorName', 'Mack Sennett'), ('numfilm', '297')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q316955'), ('actorName', 'Michael Dorn'), ('numfilm', '294')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2050534'), ('actorName', 'Mohanlal'), ('numfilm', '291')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q184572'), ('actorName', 'Martin Sheen'), ('numfilm', '286')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q32522'), ('actorName', 'Jennifer Aniston'), ('numfilm', '285')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q179041'), ('actorName', 'Lisa Kudrow'), ('numfilm', '279')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1395425'), ('actorName', 'Sivaji Ganesan'), ('numfilm', '279')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q58912'), ('actorName', 'Courteney Cox'), ('numfilm', '278')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q16296'), ('actorName', 'Patrick Stewart'), ('numfilm', '274')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q171758'), ('actorName', 'Matthew Perry'), ('numfilm', '270')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q188792'), ('actorName', 'David Schwimmer'), ('numfilm', '268')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q103946'), ('actorName', 'Kiefer Sutherland'), ('numfilm', '262')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q277417'), ('actorName', 'Madhu'), ('numfilm', '261')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q186896'), ('actorName', 'Matt LeBlanc'), ('numfilm', '255')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3595596'), ('actorName', 'Adoor Bhasi'), ('numfilm', '252')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q6122250'), ('actorName', 'Jagathy Sreekumar'), ('numfilm', '251')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1344801'), ('actorName', 'Harry Carey'), ('numfilm', '251')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1361838'), ('actorName', 'Francis Ford'), ('numfilm', '249')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3126801'), ('actorName', 'Hank Mann'), ('numfilm', '247')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q918741'), ('actorName', 'Harry Todd'), ('numfilm', '241')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q513849'), ('actorName', 'Bess Flowers'), ('numfilm', '240')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q104109'), ('actorName', 'Mary Pickford'), ('numfilm', '236')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q379157'), ('actorName', 'Dharmendra'), ('numfilm', '236')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q355209'), ('actorName', 'Richard Schiff'), ('numfilm', '232')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q229487'), ('actorName', 'Allison Janney'), ('numfilm', '231')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2522555'), ('actorName', 'Victor Potel'), ('numfilm', '231')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q311453'), ('actorName', 'Brent Spiner'), ('numfilm', '229')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q232945'), ('actorName', 'Marina Sirtis'), ('numfilm', '226')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q278980'), ('actorName', 'Akkineni Nageswara Rao'), ('numfilm', '222')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q995160'), ('actorName', 'Bryant Washburn'), ('numfilm', '220')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q346595'), ('actorName', 'Jonathan Frakes'), ('numfilm', '220')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q313789'), ('actorName', 'Robert Picardo'), ('numfilm', '220')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q308124'), ('actorName', 'Anthony LaPaglia'), ('numfilm', '216')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q966972'), ('actorName', 'Owen Moore'), ('numfilm', '216')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1281212'), ('actorName', 'Moe Howard'), ('numfilm', '214')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q255577'), ('actorName', 'Bebe Daniels'), ('numfilm', '214')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q352180'), ('actorName', 'Bradley Whitford'), ('numfilm', '210')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1383202'), ('actorName', 'Leo White'), ('numfilm', '206')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q661079'), ('actorName', 'Arthur V. Johnson'), ('numfilm', '206')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q508858'), ('actorName', 'Alice Joyce'), ('numfilm', '205')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q5225034'), ('actorName', 'Mihir Das'), ('numfilm', '204')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1621558'), ('actorName', 'Hobart Bosworth'), ('numfilm', '203')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q256968'), ('actorName', 'Florence Lawrence'), ('numfilm', '203')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q104340'), ('actorName', 'Harold Lloyd'), ('numfilm', '200')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q6167450'), ('actorName', 'Jayabharathi'), ('numfilm', '197')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#number of films actor/actress act\n",
    "#P161 cast member\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName (COUNT(?filmName) AS ?numfilm)\n",
    "WHERE {\n",
    "   ?film wdt:P161 ?actor .\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "}\n",
    "GROUP BY ?actor ?actorName\n",
    "ORDER BY DESC (?numfilm)\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "8c7b552b-5e97-4ee7-86d6-217f9109f6f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Terry Crews')]\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Imani Hakim')]\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Tichina Arnold')]\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Tyler James Williams')]\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Vincent Martella')]\n",
      "[('tvseriesName', 'Everybody Hates Chris'), ('actorName', 'Tequan Richmond')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Linda Cardellini')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Samm Levine')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Jerry Messing')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Busy Philipps')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Becky Ann Baker')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Thomas F. Wilson')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Joe Flaherty')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Natasha Melnick')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'John Francis Daley')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Seth Rogen')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Dave Allen')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'James Franco')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Chauncey Leopardi')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Jason Segel')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Ben Foster')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Martin Starr')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Kayla Ewell')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Shaun Weiss')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Steve Bannos')]\n",
      "[('tvseriesName', 'Freaks and Geeks'), ('actorName', 'Sarah Hagan')]\n",
      "[('tvseriesName', 'Cordel Encantado'), ('actorName', 'Cauã Reymond')]\n",
      "[('tvseriesName', 'The NBC Mystery Movie'), ('actorName', 'Patrick McGoohan')]\n",
      "[('tvseriesName', 'The NBC Mystery Movie'), ('actorName', 'Peter Falk')]\n",
      "[('tvseriesName', 'The NBC Mystery Movie'), ('actorName', 'Susan Saint James')]\n",
      "[('tvseriesName', 'The NBC Mystery Movie'), ('actorName', 'Jessica Walter')]\n",
      "[('tvseriesName', 'The NBC Mystery Movie'), ('actorName', 'Dennis Weaver')]\n",
      "[('tvseriesName', 'Grijpstra & De Gier'), ('actorName', 'Jack Wouterse')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Sontje Peplow')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Liz Baffoe')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Reinhold Lampe')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Christoph Wortberg')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Gérard Hérold')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Herbert Steinmetz')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Annette Kreft')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Tatjana Blacher')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Dietrich Siegl')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Moritz Hein')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Martin Walde')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Anja Antonowicz')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Annemarie Wendl')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Philipp Sonntag')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Ulrike C. Tscharre')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Thorsten Nindel')]\n",
      "[('tvseriesName', 'Lindenstraße'), ('actorName', 'Til Schweiger')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "#\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseriesName ?actorName\n",
    "WHERE {\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName .\n",
    "   ?tvseries wdt:P161 ?actor .\n",
    "   ?actor sc:name ?actorName .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "id": "ad4ae026-2f46-4e1b-9957-0281c17202e4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pName', 'genre'), ('oName', 'drama')]\n",
      "[('pName', 'cast member'), ('oName', 'Marc Cartes i Ivern')]\n",
      "[('pName', 'cast member'), ('oName', 'Roger Casamajor')]\n",
      "[('pName', 'cast member'), ('oName', 'Jordi Dauder')]\n",
      "[('pName', 'cast member'), ('oName', 'Sophie Evans')]\n",
      "[('pName', 'cast member'), ('oName', 'Santi Millán')]\n",
      "[('pName', 'cast member'), ('oName', 'Mercè Pons')]\n",
      "[('pName', 'cast member'), ('oName', 'Cayetana Guillén Cuervo')]\n",
      "[('pName', 'instance of'), ('oName', 'film')]\n",
      "[('pName', 'original language of film or TV show'), ('oName', 'Spanish')]\n",
      "[('pName', 'country of origin'), ('oName', 'Spain')]\n",
      "[('pName', 'director'), ('oName', 'Ventura Pons')]\n",
      "[('pName', 'composer'), ('oName', 'Carles Cases')]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "#Q8197668 FILM Idiot Love\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pName ?oName\n",
    "WHERE {\n",
    "   wd:Q8197668 ?p ?o.\n",
    "   ?o sc:name ?oName .\n",
    "   ?p sc:name ?pName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "id": "7783ca81-8694-4cee-889a-93f696768867",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pName', 'native language'), ('oName', 'Malayalam')]\n",
      "[('pName', 'occupation'), ('oName', 'actor')]\n",
      "[('pName', 'filmography'), ('oName', 'Prem Nazir filmography')]\n",
      "[('pName', 'religion'), ('oName', 'Islam')]\n",
      "[('pName', 'languages spoken, written or signed'), ('oName', 'Malayalam')]\n",
      "[('pName', 'award received'), ('oName', 'Padma Shri in arts')]\n",
      "[('pName', 'award received'), ('oName', 'Padma Bhushan')]\n",
      "[('pName', 'place of birth'), ('oName', 'Chirayinkizhu Block Panchayat')]\n",
      "[('pName', 'place of death'), ('oName', 'Chennai')]\n",
      "[('pName', 'sex or gender'), ('oName', 'male')]\n",
      "[('pName', 'country of citizenship'), ('oName', 'British India')]\n",
      "[('pName', 'country of citizenship'), ('oName', 'India')]\n",
      "[('pName', 'country of citizenship'), ('oName', 'Dominion of India')]\n",
      "[('pName', 'instance of'), ('oName', 'human')]\n",
      "[('pName', 'sibling'), ('oName', 'Prem Nawas')]\n",
      "[('pName', 'child'), ('oName', 'Shanawas')]\n",
      "[('pName', 'educated at'), ('oName', 'St. Berchmans College')]\n",
      "[('pName', 'given name'), ('oName', 'Prem')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "# Q2735277 actor Prem Nazir\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pName ?oName\n",
    "WHERE {\n",
    "   wd:Q2735277 ?p ?o.\n",
    "   ?o sc:name ?oName .\n",
    "   ?p sc:name ?pName .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5f565a1",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "aa2c557b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12042457'), ('actorName', 'Oldřich Vlach'), ('numseries', '26')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q10292775'), ('actorName', 'Guilherme Filipe'), ('numseries', '21')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2058853'), ('actorName', 'Hernesta Derbez'), ('numseries', '21')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q741577'), ('actorName', 'Radoslav Brzobohatý'), ('numseries', '20')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1683633'), ('actorName', 'Jaroslav Moučka'), ('numseries', '20')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q101209973'), ('actorName', 'Jiří Wohanka'), ('numseries', '20')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q11752586'), ('actorName', 'Ladislav Trojan'), ('numseries', '20')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q374447'), ('actorName', 'Sam Anderson'), ('numseries', '20')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q29525305'), ('actorName', 'Zdeněk Žák'), ('numseries', '19')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12022899'), ('actorName', 'Jan Novotný'), ('numseries', '19')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q514606'), ('actorName', 'Jacqueline Andere'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q5179830'), ('actorName', 'Pavel Kříž'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q94741643'), ('actorName', 'Ludmilla Roubíková'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q228852'), ('actorName', 'Jane Lynch'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q8067970'), ('actorName', 'Zdeněk Srstka'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q386249'), ('actorName', 'Michael Gaston'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2529744'), ('actorName', 'Jessica Tuck'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q149389'), ('actorName', 'Glória Pires'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2885767'), ('actorName', 'Barry Livingston'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q463272'), ('actorName', 'Amparo Rivelles'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q464320'), ('actorName', 'Stephen Root'), ('numseries', '18')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12022103'), ('actorName', 'Ivo Niederle'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3505255'), ('actorName', 'Václav Vydra'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q290996'), ('actorName', 'Stella Zázvorková'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q453724'), ('actorName', 'John Billingsley'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q601743'), ('actorName', 'Victoria Ruffo'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12023093'), ('actorName', 'Jan Skopeček'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q589015'), ('actorName', 'Glenn Morshower'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q11915750'), ('actorName', 'Vlastimil Zavřel'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2064678'), ('actorName', 'Pavel Zedníček'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2515601'), ('actorName', 'František Němec'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q512613'), ('actorName', 'Daniela Kolářová'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1351441'), ('actorName', 'Eric Lange'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12025679'), ('actorName', 'Jiří Štěpnička'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q498263'), ('actorName', 'Alan Ruck'), ('numseries', '17')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q176277'), ('actorName', 'Brett Cullen'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q95215073'), ('actorName', 'Vladimír Krška'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1704337'), ('actorName', 'Josef Bláha'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q2940994'), ('actorName', 'Casey Sander'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1417643'), ('actorName', 'Jiří Lábus'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q5357354'), ('actorName', 'Todd Stashwick'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1309502'), ('actorName', 'Otakar Brousek, Sr.'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12032940'), ('actorName', 'Lenka Termerová'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12002390'), ('actorName', 'Věra Tichánková'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1689754'), ('actorName', 'Jiří Bartoška'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q958791'), ('actorName', 'George Wyner'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3858922'), ('actorName', 'Miroslav Táborský'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12037784'), ('actorName', 'Mirko Musil'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3193117'), ('actorName', 'Karen Maruyama'), ('numseries', '16')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q12023020'), ('actorName', 'Jan Přeučil'), ('numseries', '16')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName (COUNT(?tvseriesName) AS ?numseries)\n",
    "WHERE {\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName .\n",
    "   ?tvseries wdt:P161 ?actor .\n",
    "   ?actor sc:name ?actorName .\n",
    "}\n",
    "GROUP BY ?actor ?actorName\n",
    "ORDER BY DESC (?numseries)\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "edc2c18b",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Check who is the actor who acted in more films while working on \"How I met your mother\" (the result set must be a list of triples actor/actress IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "2f0401f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Annie Ilonzeh')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Julianna Guill')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Benjamin Koldyke')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Nikki Griffin')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'John Cho')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Mircea Monroe')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Virginia Williams')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Kate Micucci')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Cobie Smulders')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q147235'), ('filmName', 'How I Met Your Mother'), ('actorName', 'Ashley Williams')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#actor/actress act in \"How I met your mother\"\n",
    "#P161 cast member\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?film ?filmName ?actorName\n",
    "WHERE {\n",
    "   ?film wdt:P161 ?actor .\n",
    "   ?film sc:name ?filmName .\n",
    "   ?actor sc:name ?actorName .\n",
    "   FILTER REGEX(?filmName , \"[Mm]other*\")\n",
    "   FILTER REGEX(?filmName , \"[Hh]ow*\")\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37587e01-b56b-4d6a-8877-4401dd7ca8d0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT ?season ?seasonName (COUNT(?seasonName) AS ?numseasons)\n",
    "WHERE \n",
    "{\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName .\n",
    "    ?season wdt:P179 ?tvseries ;\n",
    "       sc:name ?seasonName .\n",
    "\n",
    "   FILTER REGEX(?seasonName, \"season*\")   \n",
    "}\n",
    "GROUP BY ?season ?seasonName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "id": "7d50efa0-644c-4bba-9e48-4a140d19099c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pName', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P449'), ('pName', 'original broadcaster')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('pName', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pName', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('pName', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2670'), ('pName', 'has parts of the class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pName', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('pName', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('pName', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('pName', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2061'), ('pName', 'aspect ratio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7501'), ('pName', 'audio system')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4312'), ('pName', 'camera setup')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('pName', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('pName', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('pName', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('pName', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('pName', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P725'), ('pName', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pName', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1881'), ('pName', 'list of characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('pName', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1811'), ('pName', 'list of episodes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pName', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2438'), ('pName', 'narrator')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# Q147235 How I Met Your Mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName #?oName\n",
    "WHERE {\n",
    "   wd:Q147235 ?p ?o .\n",
    "   ?p sc:name ?pName .\n",
    "   ?o sc:name ?oName .\n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "7ba77779-74a9-4a90-a22c-5aa82919cd82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q485310'), ('actorName', 'Neil Patrick Harris'), ('numfilm', '187')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q200566'), ('actorName', 'Cobie Smulders'), ('numfilm', '173')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199927'), ('actorName', 'Alyson Hannigan'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q202304'), ('actorName', 'Jason Segel'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q223455'), ('actorName', 'Josh Radnor'), ('numfilm', '155')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q192165'), ('actorName', 'Danny Glover'), ('numfilm', '117')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q471018'), ('actorName', 'Ernie Hudson'), ('numfilm', '75')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q536437'), ('actorName', 'Edward Herrmann'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q311271'), ('actorName', 'John Lithgow'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q236189'), ('actorName', 'Judy Greer'), ('numfilm', '72')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q298777'), ('actorName', 'Michael York'), ('numfilm', '70')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q297128'), ('actorName', 'David Henrie'), ('numfilm', '67')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q186757'), ('actorName', 'Seth Green'), ('numfilm', '66')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q530646'), ('actorName', 'Ray Wise'), ('numfilm', '64')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q229914'), ('actorName', 'Lyndsy Fonseca'), ('numfilm', '63')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q309900'), ('actorName', 'Peter Gallagher'), ('numfilm', '62')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1332676'), ('actorName', 'William Schallert'), ('numfilm', '61')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q545172'), ('actorName', 'Matt Frewer'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q123849'), ('actorName', 'Jane Seymour'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q207506'), ('actorName', 'Kyle MacLachlan'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q888178'), ('actorName', 'Bob Odenkirk'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199929'), ('actorName', 'Jennifer Morrison'), ('numfilm', '53')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q23547'), ('actorName', 'Bryan Cranston'), ('numfilm', '52')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3045427'), ('actorName', 'George Cheung'), ('numfilm', '50')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q233882'), ('actorName', 'Frances Conroy'), ('numfilm', '49')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q238117'), ('actorName', 'Christina Pickles'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705'), ('actorName', 'John Cho'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q234514'), ('actorName', 'Camryn Manheim'), ('numfilm', '47')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1319539'), ('actorName', 'Thomas Lennon'), ('numfilm', '46')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q131332'), ('actorName', 'Amanda Peet'), ('numfilm', '46')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# Q147235 How I Met Your Mother\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName (COUNT(?film) AS ?numfilm)\n",
    "WHERE {\n",
    "   wd:Q147235 wdt:P161 ?actor .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?film wdt:P161 ?actor .\n",
    "}\n",
    "GROUP BY ?actor ?actorName\n",
    "ORDER BY DESC (?numfilm)\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26ac26fe",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "id": "79f444b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q485310'), ('actorName', 'Neil Patrick Harris'), ('numfilm', '187')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q200566'), ('actorName', 'Cobie Smulders'), ('numfilm', '173')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199927'), ('actorName', 'Alyson Hannigan'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q202304'), ('actorName', 'Jason Segel'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q223455'), ('actorName', 'Josh Radnor'), ('numfilm', '155')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q192165'), ('actorName', 'Danny Glover'), ('numfilm', '117')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q471018'), ('actorName', 'Ernie Hudson'), ('numfilm', '75')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q536437'), ('actorName', 'Edward Herrmann'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q311271'), ('actorName', 'John Lithgow'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q236189'), ('actorName', 'Judy Greer'), ('numfilm', '72')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q298777'), ('actorName', 'Michael York'), ('numfilm', '70')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q297128'), ('actorName', 'David Henrie'), ('numfilm', '67')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q186757'), ('actorName', 'Seth Green'), ('numfilm', '66')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q530646'), ('actorName', 'Ray Wise'), ('numfilm', '64')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q229914'), ('actorName', 'Lyndsy Fonseca'), ('numfilm', '63')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q309900'), ('actorName', 'Peter Gallagher'), ('numfilm', '62')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1332676'), ('actorName', 'William Schallert'), ('numfilm', '61')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q545172'), ('actorName', 'Matt Frewer'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q123849'), ('actorName', 'Jane Seymour'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q207506'), ('actorName', 'Kyle MacLachlan'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q888178'), ('actorName', 'Bob Odenkirk'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199929'), ('actorName', 'Jennifer Morrison'), ('numfilm', '53')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q23547'), ('actorName', 'Bryan Cranston'), ('numfilm', '52')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3045427'), ('actorName', 'George Cheung'), ('numfilm', '50')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q233882'), ('actorName', 'Frances Conroy'), ('numfilm', '49')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q238117'), ('actorName', 'Christina Pickles'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705'), ('actorName', 'John Cho'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q234514'), ('actorName', 'Camryn Manheim'), ('numfilm', '47')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1319539'), ('actorName', 'Thomas Lennon'), ('numfilm', '46')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q131332'), ('actorName', 'Amanda Peet'), ('numfilm', '46')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName (COUNT(?film) AS ?numfilm)\n",
    "WHERE {\n",
    "   wd:Q147235 wdt:P161 ?actor .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?film wdt:P161 ?actor .\n",
    "}\n",
    "GROUP BY ?actor ?actorName\n",
    "ORDER BY DESC (?numfilm)\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a740a422",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Compare HIMYM with the tv series \"The Office (US)\" in terms of number of seasons, episods and cast members (the result set must be two elements -one for each tv series- of tv series IRI, label, #seasons, #episodes and #cast members)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "c6ec86f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q485310'), ('actorName', 'Neil Patrick Harris'), ('numfilm', '187')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q200566'), ('actorName', 'Cobie Smulders'), ('numfilm', '173')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199927'), ('actorName', 'Alyson Hannigan'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q202304'), ('actorName', 'Jason Segel'), ('numfilm', '170')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q223455'), ('actorName', 'Josh Radnor'), ('numfilm', '155')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q192165'), ('actorName', 'Danny Glover'), ('numfilm', '117')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q471018'), ('actorName', 'Ernie Hudson'), ('numfilm', '75')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q536437'), ('actorName', 'Edward Herrmann'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q311271'), ('actorName', 'John Lithgow'), ('numfilm', '74')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q236189'), ('actorName', 'Judy Greer'), ('numfilm', '72')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q298777'), ('actorName', 'Michael York'), ('numfilm', '70')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q297128'), ('actorName', 'David Henrie'), ('numfilm', '67')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q186757'), ('actorName', 'Seth Green'), ('numfilm', '66')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q530646'), ('actorName', 'Ray Wise'), ('numfilm', '64')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q229914'), ('actorName', 'Lyndsy Fonseca'), ('numfilm', '63')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q309900'), ('actorName', 'Peter Gallagher'), ('numfilm', '62')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1332676'), ('actorName', 'William Schallert'), ('numfilm', '61')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q545172'), ('actorName', 'Matt Frewer'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q123849'), ('actorName', 'Jane Seymour'), ('numfilm', '60')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q207506'), ('actorName', 'Kyle MacLachlan'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q888178'), ('actorName', 'Bob Odenkirk'), ('numfilm', '54')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q199929'), ('actorName', 'Jennifer Morrison'), ('numfilm', '53')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q23547'), ('actorName', 'Bryan Cranston'), ('numfilm', '52')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3045427'), ('actorName', 'George Cheung'), ('numfilm', '50')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q233882'), ('actorName', 'Frances Conroy'), ('numfilm', '49')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q238117'), ('actorName', 'Christina Pickles'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q312705'), ('actorName', 'John Cho'), ('numfilm', '48')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q234514'), ('actorName', 'Camryn Manheim'), ('numfilm', '47')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q1319539'), ('actorName', 'Thomas Lennon'), ('numfilm', '46')]\n",
      "[('actor', 'http://www.wikidata.org/entity/Q131332'), ('actorName', 'Amanda Peet'), ('numfilm', '46')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q147235 How I Met Your Mother number of films\n",
    "# ?tvseries wdt:P31 wd:Q5398426 . instance of tvseries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT \n",
    "WHERE {\n",
    "   wd:Q147235 wdt:P161 ?actor .\n",
    "   ?actor sc:name ?actorName .\n",
    "   ?film wdt:P161 ?actor .\n",
    "}\n",
    "GROUP BY ?actor ?actorName\n",
    "ORDER BY DESC (?numfilm)\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "id": "61c035ab-e0c1-4213-9030-2de13c70f240",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q28419054'), ('tvseriesName', 'Radiant Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23829'), ('tvseriesName', 'The Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23831'), ('tvseriesName', 'The Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q6532522'), ('tvseriesName', \"Let's Play Post Office\")]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q7079129'), ('tvseriesName', 'Office Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q65043588'), ('tvseriesName', 'The Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q5759839'), ('tvseriesName', 'Office Girls')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q6928472'), ('tvseriesName', 'Mr. Box Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q6402787'), ('tvseriesName', 'Queen of the Office')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q7764423'), ('tvseriesName', 'The Singing Office')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Q5398426 tvseries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName\n",
    "WHERE {\n",
    "   ?tvseries wdt:P31 wd:Q5398426 .\n",
    "   ?tvseries sc:name ?tvseriesName .\n",
    "   FILTER REGEX(?tvseriesName , \"[Oo]ffice*\")\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "id": "c36da244-d250-4991-a766-74d193695aec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P136'), ('p1Name', 'genre'), ('o1Name', 'sitcom')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P136'), ('p1Name', 'genre'), ('o1Name', 'mockumentary')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P1552'), ('p1Name', 'has quality'), ('o1Name', 'breaking the fourth wall')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Patrick Baladi')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Ralph Ineson')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Ricky Gervais')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Martin Freeman')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Lucy Davis')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Oliver Chris')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Stirling Gallacher')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Mackenzie Crook')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P161'), ('p1Name', 'cast member'), ('o1Name', 'Stacey Roca')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P170'), ('p1Name', 'creator'), ('o1Name', 'Ricky Gervais')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P170'), ('p1Name', 'creator'), ('o1Name', 'Stephen Merchant')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P1811'), ('p1Name', 'list of episodes'), ('o1Name', 'list of The Office episodes')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P1889'), ('p1Name', 'different from'), ('o1Name', 'The Office')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P2061'), ('p1Name', 'aspect ratio'), ('o1Name', '16:9 aspect ratio')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P2670'), ('p1Name', 'has parts of the class'), ('o1Name', 'two-part episode')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P2747'), ('p1Name', 'Filmiroda rating'), ('o1Name', 'Category II')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P31'), ('p1Name', 'instance of'), ('o1Name', 'television series')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P364'), ('p1Name', 'original language of film or TV show'), ('o1Name', 'English')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P437'), ('p1Name', 'distribution format'), ('o1Name', 'video on demand')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P449'), ('p1Name', 'original broadcaster'), ('o1Name', 'BBC Two')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P449'), ('p1Name', 'original broadcaster'), ('o1Name', 'BBC One')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P495'), ('p1Name', 'country of origin'), ('o1Name', 'United Kingdom')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'The Office')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'Kontoret')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'Stromberg')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'La Job')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'La Ofis')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'HaMisrad')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P4969'), ('p1Name', 'derivative work'), ('o1Name', 'Le Bureau')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P750'), ('p1Name', 'distributed by'), ('o1Name', 'Netflix')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P750'), ('p1Name', 'distributed by'), ('o1Name', 'Hulu')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P8411'), ('p1Name', 'set in environment'), ('o1Name', 'island')]\n",
      "[('p1', 'http://www.wikidata.org/prop/direct/P910'), ('p1Name', \"topic's main category\"), ('o1Name', 'Category:The Office (British TV series)')]\n",
      "36\n"
     ]
    }
   ],
   "source": [
    "#P495 country of origin\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p1 ?p1Name ?o1Name #?p2Name ?o2Name\n",
    "WHERE {\n",
    "   wd:Q23829 ?p1 ?o1 .\n",
    "   wd:Q23831 ?p2 ?o2 .\n",
    "   ?p1 sc:name ?p1Name .\n",
    "   ?o1 sc:name ?o1Name .\n",
    "    ?p2 sc:name ?p2Name .\n",
    "   ?o2 sc:name ?o2Name .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "id": "aa43ef4a-9f8a-4c28-9c84-df21c2d84445",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country1', 'http://www.wikidata.org/entity/Q145'), ('country1Name', 'United Kingdom'), ('country2', 'http://www.wikidata.org/entity/Q30'), ('country2Name', 'United States of America')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#P495 country of origin\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country1 ?country1Name ?country2 ?country2Name\n",
    "WHERE {\n",
    "   wd:Q23829 wdt:P495 ?country1 .\n",
    "   wd:Q23831 wdt:P495 ?country2 .\n",
    "   ?country1 sc:name ?country1Name .\n",
    "   ?country2 sc:name ?country2Name .\n",
    "   \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 214,
   "id": "ec901b03-a364-4d9f-9cb7-f76de449bd3e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', 'http://www.wikidata.org/entity/Q23831'), ('theofficeName', 'The Office'), ('numseaonOffice', '9'), ('numepisodeoffice', '226'), ('numofficeactor', '25')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT wd:Q23831 ?theofficeName ?numseaonOffice ?numepisodeoffice ?numofficeactor\n",
    "WHERE\n",
    "{              \n",
    "    {\n",
    "        SELECT DISTINCT ?theofficeName (COUNT(?officeseasonName) AS ?numseaonOffice)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q23831 sc:name ?theofficeName .\n",
    "            ?officeseason wdt:P179 wd:Q23831 ;\n",
    "               sc:name ?officeseasonName .\n",
    "           FILTER REGEX(?officeseasonName, \"season*\") \n",
    "        }\n",
    "       GROUP BY ?theofficeName\n",
    "    }\n",
    "\n",
    "    {\n",
    "        SELECT DISTINCT ?theofficeName (COUNT(?officeepisodeName) AS ?numepisodeoffice)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q23831 sc:name ?theofficeName .\n",
    "            ?officeepisode wdt:P179 wd:Q23831 ;\n",
    "               sc:name ?officeepisodeName .\n",
    "        }\n",
    "       GROUP BY ?theofficeName\n",
    "   }\n",
    "\n",
    "\n",
    "   {\n",
    "       SELECT DISTINCT ?theofficeName (COUNT(?officeactorName) AS ?numofficeactor)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q23831 sc:name ?theofficeName .\n",
    "            wd:Q23831 wdt:P161 ?officeactor .\n",
    "            ?officeactor sc:name ?officeactorName .\n",
    "\n",
    "        }\n",
    "       GROUP BY ?theofficeName\n",
    "   }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "93f67f42-0995-4c45-91fa-668ca4267019",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', 'http://www.wikidata.org/entity/Q147235'), ('himymName', 'How I Met Your Mother'), ('numseaonHimym', '9'), ('numepisodeHimym', '226'), ('numhimymactor', '480')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT wd:Q147235 ?himymName ?numseaonHimym ?numepisodeHimym ?numhimymactor\n",
    "WHERE\n",
    "{ \n",
    "    {\n",
    "        SELECT DISTINCT ?himymName (COUNT(?himymseasonName) AS ?numseaonHimym)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q147235 sc:name ?himymName .\n",
    "            ?himymseason wdt:P179  wd:Q23831 ; \n",
    "                   sc:name ?himymseasonName .\n",
    "            FILTER REGEX(?himymseasonName, \"season*\") \n",
    "        }\n",
    "       GROUP BY ?himymName\n",
    "   }\n",
    "    {\n",
    "        SELECT DISTINCT ?himymName (COUNT(?himymepisodeName) AS ?numepisodeHimym)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q147235 sc:name ?himymName .\n",
    "            ?himymepisode wdt:P179  wd:Q23831 ; \n",
    "                   sc:name ?himymepisodeName .\n",
    "        }\n",
    "       GROUP BY ?himymName\n",
    "   }\n",
    "\n",
    "\n",
    "   {\n",
    "       SELECT DISTINCT ?himymName (COUNT(?himymactorName) AS ?numhimymactor)  \n",
    "        WHERE\n",
    "        {\n",
    "            wd:Q147235 sc:name ?himymName .\n",
    "            wd:Q147235 wdt:P161 ?himymactor .\n",
    "            ?himymactor sc:name ?himymactorName .\n",
    "\n",
    "        }\n",
    "       GROUP BY ?himymName\n",
    "   }\n",
    "\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 215,
   "id": "9699c238-3705-4a67-a783-76dd7f9cc404",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', 'http://www.wikidata.org/entity/Q23831'), ('theofficeName', 'The Office'), ('numseaonOffice', '9'), ('numepisodeoffice', '226'), ('numofficeactor', '25'), ('callret-5', 'http://www.wikidata.org/entity/Q147235'), ('himymName', 'How I Met Your Mother'), ('numseaonHimym', '9'), ('numepisodeHimym', '226'), ('numhimymactor', '480')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#compare number of seasons\n",
    "# wd:Q23831 the tv series \"The Office (US)\"\n",
    "# wd:Q147235 How I Met Your Mother (HIMYM)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT \n",
    "wd:Q23831 ?theofficeName ?numseaonOffice ?numepisodeoffice ?numofficeactor\n",
    "wd:Q147235 ?himymName ?numseaonHimym ?numepisodeHimym ?numhimymactor\n",
    "WHERE \n",
    "{\n",
    "        {              \n",
    "            {\n",
    "                SELECT DISTINCT ?theofficeName (COUNT(?officeseasonName) AS ?numseaonOffice)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    ?officeseason wdt:P179 wd:Q23831 ;\n",
    "                       sc:name ?officeseasonName .\n",
    "                   FILTER REGEX(?officeseasonName, \"season*\") \n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "            }\n",
    "\n",
    "            {\n",
    "                SELECT DISTINCT ?theofficeName (COUNT(?officeepisodeName) AS ?numepisodeoffice)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    ?officeepisode wdt:P179 wd:Q23831 ;\n",
    "                       sc:name ?officeepisodeName .\n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "           }\n",
    "\n",
    "\n",
    "           {\n",
    "               SELECT DISTINCT ?theofficeName (COUNT(?officeactorName) AS ?numofficeactor)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    wd:Q23831 wdt:P161 ?officeactor .\n",
    "                    ?officeactor sc:name ?officeactorName .\n",
    "\n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "           }\n",
    "        }\n",
    "\n",
    "        { \n",
    "            {\n",
    "                SELECT DISTINCT ?himymName (COUNT(?himymseasonName) AS ?numseaonHimym)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    ?himymseason wdt:P179  wd:Q23831 ; \n",
    "                           sc:name ?himymseasonName .\n",
    "                    FILTER REGEX(?himymseasonName, \"season*\") \n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "            {\n",
    "                SELECT DISTINCT ?himymName (COUNT(?himymepisodeName) AS ?numepisodeHimym)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    ?himymepisode wdt:P179  wd:Q23831 ; \n",
    "                           sc:name ?himymepisodeName .\n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "\n",
    "\n",
    "           {\n",
    "               SELECT DISTINCT ?himymName (COUNT(?himymactorName) AS ?numhimymactor)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    wd:Q147235 wdt:P161 ?himymactor .\n",
    "                    ?himymactor sc:name ?himymactorName .\n",
    "\n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "\n",
    "        }\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2887cfc",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "b9cac22d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', 'http://www.wikidata.org/entity/Q23831'), ('theofficeName', 'The Office'), ('numseaonOffice', '9'), ('numepisodeoffice', '226'), ('numofficeactor', '25'), ('callret-5', 'http://www.wikidata.org/entity/Q147235'), ('himymName', 'How I Met Your Mother'), ('numseaonHimym', '9'), ('numepisodeHimym', '226'), ('numhimymactor', '480')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT \n",
    "wd:Q23831 ?theofficeName ?numseaonOffice ?numepisodeoffice ?numofficeactor\n",
    "wd:Q147235 ?himymName ?numseaonHimym ?numepisodeHimym ?numhimymactor\n",
    "WHERE \n",
    "{\n",
    "        {              \n",
    "            {\n",
    "                SELECT DISTINCT ?theofficeName (COUNT(?officeseasonName) AS ?numseaonOffice)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    ?officeseason wdt:P179 wd:Q23831 ;\n",
    "                       sc:name ?officeseasonName .\n",
    "                   FILTER REGEX(?officeseasonName, \"season*\") \n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "            }\n",
    "\n",
    "            {\n",
    "                SELECT DISTINCT ?theofficeName (COUNT(?officeepisodeName) AS ?numepisodeoffice)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    ?officeepisode wdt:P179 wd:Q23831 ;\n",
    "                       sc:name ?officeepisodeName .\n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "           }\n",
    "\n",
    "\n",
    "           {\n",
    "               SELECT DISTINCT ?theofficeName (COUNT(?officeactorName) AS ?numofficeactor)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q23831 sc:name ?theofficeName .\n",
    "                    wd:Q23831 wdt:P161 ?officeactor .\n",
    "                    ?officeactor sc:name ?officeactorName .\n",
    "\n",
    "                }\n",
    "               GROUP BY ?theofficeName\n",
    "           }\n",
    "        }\n",
    "\n",
    "        { \n",
    "            {\n",
    "                SELECT DISTINCT ?himymName (COUNT(?himymseasonName) AS ?numseaonHimym)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    ?himymseason wdt:P179  wd:Q23831 ; \n",
    "                           sc:name ?himymseasonName .\n",
    "                    FILTER REGEX(?himymseasonName, \"season*\") \n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "            {\n",
    "                SELECT DISTINCT ?himymName (COUNT(?himymepisodeName) AS ?numepisodeHimym)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    ?himymepisode wdt:P179  wd:Q23831 ; \n",
    "                           sc:name ?himymepisodeName .\n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "\n",
    "\n",
    "           {\n",
    "               SELECT DISTINCT ?himymName (COUNT(?himymactorName) AS ?numhimymactor)  \n",
    "                WHERE\n",
    "                {\n",
    "                    wd:Q147235 sc:name ?himymName .\n",
    "                    wd:Q147235 wdt:P161 ?himymactor .\n",
    "                    ?himymactor sc:name ?himymactorName .\n",
    "\n",
    "                }\n",
    "               GROUP BY ?himymName\n",
    "           }\n",
    "\n",
    "        }\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0fe033c0",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Return how many of the actors who are members of the cast of the tv series have [Kavin Bacon number](https://en.wikipedia.org/wiki/Six_Degrees_of_Kevin_Bacon#:~:text=Kevin%20Bacon%20himself%20has%20a,Bacon%20number%20is%20N%2B1.) equal to 2 (the result set must be a list of couples actor/actress IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 224,
   "id": "a9fee1cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('actor', 'http://www.wikidata.org/entity/Q3454165'), ('actorName', 'Kevin Bacon')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?actor ?actorName\n",
    "WHERE {\n",
    "    ?tvseries wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName.\n",
    "    ?tvseries wdt:P161 ?actor .\n",
    "    ?actor sc:name ?actorName .\n",
    "    FILTER REGEX(?actorName, \"Kevin Bacon\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 239,
   "id": "937bcc4c-fb87-445d-9da2-6a2d314619be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('howmany', '67568')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#Q3454165 Kevin Bacon\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  (COUNT(?actorBaconnum2Name) AS ?howmany)\n",
    "WHERE \n",
    "{\n",
    "    ?tvseries1 wdt:P161 wd:Q3454165 .\n",
    "    ?tvseries2 wdt:P161 wd:Q3454165 .\n",
    "    ?tvseries1 sc:name ?tvseries1Name .\n",
    "    ?tvseries1 wdt:P161 ?actorBaconnum1 .\n",
    "    ?tvseries2 wdt:P161 ?actorBaconnum1 .\n",
    "    ?tvseries2 wdt:P161 ?actorBaconnum2 .\n",
    "    ?tvseries1 sc:name ?tvseries1Name .\n",
    "    ?tvseries2 sc:name ?tvseries2Name .\n",
    "    ?actorBaconnum1 sc:name ?actorBaconnum1Name .\n",
    "    ?actorBaconnum2 sc:name ?actorBaconnum2Name .\n",
    "    FILTER (?tvseries1 != ?tvseries2)\n",
    "    FILTER (?actorBaconnum1Name != ?actorBaconnum2Name)\n",
    "\n",
    "} \n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ac84e3df",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 240,
   "id": "9b9f680f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('howmany', '67568')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  (COUNT(?actorBaconnum2Name) AS ?howmany)\n",
    "WHERE \n",
    "{\n",
    "    ?tvseries1 wdt:P161 wd:Q3454165 .\n",
    "    ?tvseries2 wdt:P161 wd:Q3454165 .\n",
    "    ?tvseries1 sc:name ?tvseries1Name .\n",
    "    ?tvseries1 wdt:P161 ?actorBaconnum1 .\n",
    "    ?tvseries2 wdt:P161 ?actorBaconnum1 .\n",
    "    ?tvseries2 wdt:P161 ?actorBaconnum2 .\n",
    "    ?tvseries1 sc:name ?tvseries1Name .\n",
    "    ?tvseries2 sc:name ?tvseries2Name .\n",
    "    ?actorBaconnum1 sc:name ?actorBaconnum1Name .\n",
    "    ?actorBaconnum2 sc:name ?actorBaconnum2Name .\n",
    "    FILTER (?tvseries1 != ?tvseries2)\n",
    "    FILTER (?actorBaconnum1Name != ?actorBaconnum2Name)\n",
    "\n",
    "} \n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8da55d6b",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider the actors who are members of the cast of HIMYM. Amongst the tv series which these actors acted return only those which received more than 2 awards (the result set must be triples of tv series IRI, label, #awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 244,
   "id": "c2aa00ad",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q500769'), ('tvseriesName', 'Freaks and Geeks')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q17049828'), ('tvseriesName', 'Bad Samaritans')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q377923'), ('tvseriesName', 'Some Came Running')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q15072819'), ('tvseriesName', 'Halt and Catch Fire')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q17627616'), ('tvseriesName', 'Miss Meadows')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q17635617'), ('tvseriesName', 'Nantucket')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1197932'), ('tvseriesName', 'Magic Mike')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q18151386'), ('tvseriesName', 'Kirby Buckets')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q22908690'), ('tvseriesName', 'The Good Place')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q210676'), ('tvseriesName', 'Nashville')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1607657'), ('tvseriesName', 'Under Wraps')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1808437'), ('tvseriesName', 'The Jerk')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23558'), ('tvseriesName', 'House')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q487978'), ('tvseriesName', 'Austin Powers: The Spy Who Shagged Me')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q498109'), ('tvseriesName', 'Rush Hour 3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q498569'), ('tvseriesName', 'Rules of Engagement')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q500093'), ('tvseriesName', 'Legally Blonde')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q500460'), ('tvseriesName', 'Evolution')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q531675'), ('tvseriesName', 'Angel Eyes')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q547863'), ('tvseriesName', 'Montana Sky')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName\n",
    "WHERE \n",
    "{\n",
    "    wd:Q147235 wdt:P161 ?actor .\n",
    "    ?actor sc:name ?actorName .\n",
    "    ?tvseries wdt:P161 ?actor .\n",
    "    ?tvseries sc:name ?tvseriesName .\n",
    "} \n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 259,
   "id": "c0f36c88-627a-4d73-a87d-09b445aba211",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('awardName', 'Primetime Emmy Award for Outstanding Art Direction for a Contemporary Program')]\n",
      "[('awardName', \"Critics' Choice Television Award for Best Supporting Actor in a Comedy Series\")]\n",
      "[('awardName', 'International TV Audience Award for Best Comedy TV Series')]\n",
      "[('awardName', 'Primetime Emmy Award for Outstanding Cinematography for a Multi-Camera Series')]\n",
      "[('awardName', 'Primetime Emmy Award for Outstanding Multi-Camera Picture Editing for a Comedy Series')]\n",
      "[('awardName', 'Primetime Emmy Award for Outstanding Single-Camera Picture Editing for a Comedy Series')]\n",
      "[('awardName', 'Streamy Awards')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?awardName\n",
    "WHERE \n",
    "{\n",
    "    wd:Q147235 wdt:P166 ?award .\n",
    "    ?award sc:name ?awardName .\n",
    "} \n",
    "GROUP BY ?tvseriesName\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "id": "8875ee86-bb5e-4f66-8346-c9153d3e13c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23628'), ('tvseriesName', 'The Sopranos'), ('numaward', '22')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1079'), ('tvseriesName', 'Breaking Bad'), ('numaward', '21')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1132439'), ('tvseriesName', 'The Practice'), ('numaward', '12')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q16756'), ('tvseriesName', 'Modern Family'), ('numaward', '11')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q8539'), ('tvseriesName', 'The Big Bang Theory'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q79784'), ('tvseriesName', 'Friends'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1136370'), ('tvseriesName', 'General Hospital'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q244803'), ('tvseriesName', 'Ally McBeal'), ('numaward', '9')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q438406'), ('tvseriesName', \"Grey's Anatomy\"), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1030713'), ('tvseriesName', 'Another World'), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1068952'), ('tvseriesName', 'St. Elsewhere'), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q147235'), ('tvseriesName', 'How I Met Your Mother'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q34659'), ('tvseriesName', 'My Name Is Earl'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q186219'), ('tvseriesName', 'True Blood'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q117396'), ('tvseriesName', 'CSI: Vegas'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q2085'), ('tvseriesName', 'Twin Peaks'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q7099650'), ('tvseriesName', 'Orange Is the New Black'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1168760'), ('tvseriesName', 'Upstairs, Downstairs'), ('numaward', '5')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q833322'), ('tvseriesName', 'Murder, She Wrote'), ('numaward', '4')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q19570'), ('tvseriesName', 'The Good Wife'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q232737'), ('tvseriesName', 'The Walking Dead'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q30603704'), ('tvseriesName', 'Pose'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1144624'), ('tvseriesName', 'Family Ties'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q7103920'), ('tvseriesName', 'Orphan Black'), ('numaward', '2')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23609'), ('tvseriesName', 'Weeds'), ('numaward', '2')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23594'), ('tvseriesName', 'Homeland'), ('numaward', '2')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1122661'), ('tvseriesName', 'Project Runway'), ('numaward', '2')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q4525'), ('tvseriesName', 'NCIS'), ('numaward', '1')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q256527'), ('tvseriesName', 'Spin City'), ('numaward', '1')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q183513'), ('tvseriesName', 'Buffy the Vampire Slayer'), ('numaward', '1')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#wd:Q147235 HIMYM \n",
    "#P166 award received\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName (COUNT(?awardName) AS ?numaward)\n",
    "WHERE \n",
    "{\n",
    "    wd:Q147235 wdt:P161 ?actor .\n",
    "    ?actor sc:name ?actorName .\n",
    "    \n",
    "    ?tvseries wdt:P161 ?actor ;\n",
    "            wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName ;\n",
    "            wdt:P166 ?award .\n",
    "    ?award sc:name ?awardName .\n",
    "    \n",
    "} \n",
    "GROUP BY ?tvseries ?tvseriesName ?actorName\n",
    "ORDER BY DESC (?numaward)\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d352a9e7",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 310,
   "id": "76049972",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q23628'), ('tvseriesName', 'The Sopranos'), ('numaward', '22')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1079'), ('tvseriesName', 'Breaking Bad'), ('numaward', '21')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1132439'), ('tvseriesName', 'The Practice'), ('numaward', '12')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q16756'), ('tvseriesName', 'Modern Family'), ('numaward', '11')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q8539'), ('tvseriesName', 'The Big Bang Theory'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q79784'), ('tvseriesName', 'Friends'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1136370'), ('tvseriesName', 'General Hospital'), ('numaward', '10')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q244803'), ('tvseriesName', 'Ally McBeal'), ('numaward', '9')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q438406'), ('tvseriesName', \"Grey's Anatomy\"), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1030713'), ('tvseriesName', 'Another World'), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1068952'), ('tvseriesName', 'St. Elsewhere'), ('numaward', '8')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q147235'), ('tvseriesName', 'How I Met Your Mother'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q34659'), ('tvseriesName', 'My Name Is Earl'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q186219'), ('tvseriesName', 'True Blood'), ('numaward', '7')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q117396'), ('tvseriesName', 'CSI: Vegas'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q2085'), ('tvseriesName', 'Twin Peaks'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q7099650'), ('tvseriesName', 'Orange Is the New Black'), ('numaward', '6')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1168760'), ('tvseriesName', 'Upstairs, Downstairs'), ('numaward', '5')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q833322'), ('tvseriesName', 'Murder, She Wrote'), ('numaward', '4')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q19570'), ('tvseriesName', 'The Good Wife'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q232737'), ('tvseriesName', 'The Walking Dead'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q30603704'), ('tvseriesName', 'Pose'), ('numaward', '3')]\n",
      "[('tvseries', 'http://www.wikidata.org/entity/Q1144624'), ('tvseriesName', 'Family Ties'), ('numaward', '3')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?tvseries ?tvseriesName (COUNT(?awardName) AS ?numaward)\n",
    "WHERE \n",
    "{\n",
    "    wd:Q147235 wdt:P161 ?actor .\n",
    "    ?actor sc:name ?actorName .\n",
    "    \n",
    "    ?tvseries wdt:P161 ?actor ;\n",
    "            wdt:P31 wd:Q5398426 ;\n",
    "            sc:name ?tvseriesName ;\n",
    "            wdt:P166 ?award .\n",
    "    ?award sc:name ?awardName .\n",
    "} \n",
    "GROUP BY ?tvseries ?tvseriesName ?actorName\n",
    "HAVING (COUNT(?awardName) > 2)\n",
    "ORDER BY DESC (?numaward)\n",
    "\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b43a4d12-5d97-45a8-97d2-66a702039812",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
