{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "26ad782d",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d3b4bf89",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-81c563df6f-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fd83dbce",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Film Genre and directors explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the directors for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ada9c11",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n",
    "| `wd:Q3772`| Quentin Tarantino      | node |\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f38de5b",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for director\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films).\n",
    "\n",
    "5. Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films). \n",
    "\n",
    "6. Identify the BGP for Academy Awards \n",
    "\n",
    "7. Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won).\n",
    "\n",
    "8. Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "70008d5b",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "ad939494",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('name', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('name', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('name', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('name', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('name', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "99cb79a2-fa38-4100-8936-bfa405c76b4f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after'), ('obj', 'http://www.wikidata.org/entity/Q349357'), ('objname', 'Woody Herman')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse'), ('obj', 'http://www.wikidata.org/entity/Q1140914'), ('objname', 'Soon-Yi Previn')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child'), ('obj', 'http://www.wikidata.org/entity/Q22673707'), ('objname', 'Bechet Dumaine Allen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child'), ('obj', 'http://www.wikidata.org/entity/Q22673708'), ('objname', 'Manzie Tio Allen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth'), ('obj', 'http://www.wikidata.org/entity/Q18426'), ('objname', 'The Bronx')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner'), ('obj', 'http://www.wikidata.org/entity/Q102642'), ('objname', 'Diane Keaton')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q3404523'), ('objname', 'David di Donatello for Best Foreign Actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer'), ('obj', 'http://www.wikidata.org/entity/Q599316'), ('objname', 'New School')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name'), ('obj', 'http://www.wikidata.org/entity/Q19961034'), ('objname', 'Woody')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work'), ('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling'), ('obj', 'http://www.wikidata.org/entity/Q3831197'), ('objname', 'Letty Aronson')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q31579'), ('objname', 'David di Donatello')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q3241784'), ('objname', 'Golden Lion for Lifetime Achievements')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q50616934'), ('objname', 'honorary doctorate of Pompeu Fabra University')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q3404587'), ('objname', 'FIPRESCI Prize of the Festival de Cannes')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography'), ('obj', 'http://www.wikidata.org/entity/Q2455835'), ('objname', 'Woody Allen filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work'), ('obj', 'http://www.wikidata.org/entity/Q971865'), ('objname', \"What's Up, Tiger Lily?\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q3822438'), ('objname', 'Butaca Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for'), ('obj', 'http://www.wikidata.org/entity/Q103360'), ('objname', 'Academy Award for Best Director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q103360'), ('objname', 'Academy Award for Best Director')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "#checking the objects of properties to find a clue \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 ?p ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "    ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "d28f9d5b-6205-4e1a-9a6a-2ae098734af6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q971865'), ('objname', \"What's Up, Tiger Lily?\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1004531'), ('objname', 'Bullets Over Broadway')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1354109'), ('objname', 'Mighty Aphrodite')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q729026'), ('objname', 'Broadway Danny Rose')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q733677'), ('objname', 'Match Point')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q740143'), ('objname', 'Husbands and Wives')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q806092'), ('objname', 'Bananas')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1321004'), ('objname', 'You Will Meet a Tall Dark Stranger')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14511869'), ('objname', 'Magic in the Moonlight')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q614009'), ('objname', 'Anything Else')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q187423'), ('objname', 'Zelig')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27703144'), ('objname', 'Wonder Wheel')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q786585'), ('objname', 'Sweet and Lowdown')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1052826'), ('objname', 'Celebrity')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1218888'), ('objname', 'Love and Death')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q181555'), ('objname', 'Crimes and Misdemeanors')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q682002'), ('objname', 'scoop')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q653518'), ('objname', 'Stardust Memories')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q977372'), ('objname', 'New York Stories')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#finding some films to find the BGP\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P800 ?obj .\n",
    "   \n",
    "   # get the label\n",
    " \n",
    "    ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "21551b60-7541-4ccd-85c6-ed5ca59478ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q22963890'), ('resname', 'Angel Caban')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q19668406'), ('resname', 'Yolonda Ross')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q184103'), ('resname', 'Christina Ricci')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q448005'), ('resname', 'David Ortiz')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q126455'), ('resname', 'Peter Hobbs')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q132616'), ('resname', 'Naomi Watts')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q1383628'), ('resname', 'George Furth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('pname', 'director of photography'), ('res', 'http://www.wikidata.org/entity/Q155423'), ('resname', 'Néstor Almendros')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q266467'), ('resname', 'Kate Nelligan')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q3376428'), ('resname', 'Peter Appel')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('pname', 'production company'), ('res', 'http://www.wikidata.org/entity/Q7752106'), ('resname', 'The Montecito Picture Company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q138327'), ('resname', 'Catherine McCormack')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q1933837'), ('resname', 'Brigitte Bako')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q446481'), ('resname', 'Harvey Fierstein')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q544165'), ('resname', 'Penelope Wilton')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q175195'), ('resname', 'Peter Gabriel')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q253282'), ('resname', 'Marie Dressler')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q284876'), ('resname', 'Sam Waterston')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q3264820'), ('resname', 'Luc Florian')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('pname', 'cast member'), ('res', 'http://www.wikidata.org/entity/Q3439224'), ('resname', 'Roger Lumont')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')]\n",
    "\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#checking film properties \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?res ?resname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P800 ?obj .\n",
    "   ?obj ?p ?res .\n",
    "   # get the label\n",
    " \n",
    "    ?p sc:name ?pname.\n",
    "    ?res sc:name ?resname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ce0c50a2",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "18645044",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q5398426'), ('classname', 'television series')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')]\n",
    "#checking film properties \n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?class ?classname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P800 ?film .\n",
    "   ?film wdt:P31 ?class .\n",
    "   # get the label\n",
    " \n",
    "    ?class sc:name ?classname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a2766169",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for director"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "20be69fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q10800557'), ('name', 'film actor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15981151'), ('name', 'jazz musician')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18844224'), ('name', 'science fiction writer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1930187'), ('name', 'journalist')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q214917'), ('name', 'playwright')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q245068'), ('name', 'comedian')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2526255'), ('name', 'film director')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q28389'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3282637'), ('name', 'film producer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q36180'), ('name', 'writer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q36834'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q482980'), ('name', 'author')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q639669'), ('name', 'musician')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q948329'), ('name', 'character actor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q118865'), ('name', 'clarinetist')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wdt:P106\toccupation\tpredicate\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P106 ?p .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "id": "9abf7e4e-b3e4-4134-8c98-50294c6f74f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('result', 'http://www.wikidata.org/entity/Q28225718'), ('resultname', 'science fiction author')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q47541952'), ('resultname', 'producer')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q33999'), ('resultname', 'actor')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q3455803'), ('resultname', 'director')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q36180'), ('resultname', 'writer')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q482980'), ('resultname', 'author')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q483501'), ('resultname', 'artist')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q639669'), ('resultname', 'musician')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q3391743'), ('resultname', 'visual artist')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q101546515'), ('resultname', 'woodwind instrument player')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q2500638'), ('resultname', 'creator')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q15980804'), ('resultname', 'media professional')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q58635633'), ('resultname', 'media profession')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q3406858'), ('resultname', 'film professional')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q108289407'), ('resultname', 'authors, journalists and linguists')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wdt:P106\toccupation\tpredicate\n",
    "#wdt:P279\tsubclass\tpredicate\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?result  ?resultname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P106 ?occupation.\n",
    "   ?occupation wdt:P279 ?result .\n",
    "   # get the label\n",
    "   ?result sc:name ?resultname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "45605ab4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "id": "7db47b68",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('result', 'http://www.wikidata.org/entity/Q3455803'), ('resultname', 'director')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wdt:P106\toccupation\tpredicate\n",
    "#wdt:P279\tsubclass\tpredicate\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?result  ?resultname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q25089 wdt:P106 ?occupation.\n",
    "   ?occupation wdt:P279 ?result .\n",
    "   # get the label\n",
    "   ?result sc:name ?resultname.\n",
    "   FILTER(REGEX(?resultname ,'director'))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "558707df",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for film genre"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "a01b68a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')] \n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "\n",
    "#using the node that we founf to find the genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q206124 ?p ?obj .\n",
    "   # get the label\n",
    "\n",
    "    ?p sc:name ?name.\n",
    "    FILTER(REGEX(?name , '[Gg]enre'))\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "id": "ccc6b808-03db-4fa4-a8b9-9fa16e922a33",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('class', 'http://www.wikidata.org/entity/Q1054574'), ('classname', 'romance film')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q157443'), ('classname', 'comedy film')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q24925'), ('classname', 'science fiction')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q2973181'), ('classname', 'speculative fiction film')]\n",
      "[('class', 'http://www.wikidata.org/entity/Q132311'), ('classname', 'fantasy')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')] \n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "#wdt:P279\tsubclass\tpredicate\n",
    "#using the node that we find to find the genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?class ?classname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q206124 wdt:P136 ?genre .\n",
    "   ?genre wdt:P279 ?class .\n",
    "   # get the label\n",
    "\n",
    "    ?class sc:name ?classname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "15ea52fe",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 166,
   "id": "d6d2fcdf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('result', 'http://www.wikidata.org/entity/Q108329096'), ('resultname', 'genre by art form')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
      "[('result', 'http://www.wikidata.org/entity/Q20076756'), ('resultname', 'speculative fiction genre')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#wdt:P31\tinstance of\tpredicate\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')\n",
    "#('obj', 'http://www.wikidata.org/entity/Q206124'), ('objname', 'Midnight in Paris')] \n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "#wdt:P279\tsubclass\tpredicate\n",
    "#using the node that we find to find the genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?result ?resultname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q206124 wdt:P136 ?genre .\n",
    "   ?genre wdt:P279 ?class .\n",
    "   ?class wdt:P31 ?result .\n",
    "   # get the label\n",
    "\n",
    "    ?result sc:name ?resultname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5aeb5d49",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Find how many western films are been released in each european country from 2010-01-01 to 2015-31-12 (the result set must be country IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "id": "2e0d6ce8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('genre', 'http://www.wikidata.org/entity/Q268854'), ('genrename', 'Red Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q4235011'), ('genrename', 'Space Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q491158'), ('genrename', 'Revisionist Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q6804274'), ('genrename', 'meat pie Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q5461696'), ('genrename', 'Florida Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q4674071'), ('genrename', 'Acid Western')]\n",
      "[('genre', 'http://www.wikidata.org/entity/Q8066387'), ('genrename', 'Zapata Western')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?genre ?genrename\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?genre wdt:P31 wd:Q201658 .\n",
    "   \n",
    "   # get the label\n",
    "    ?genre sc:name ?genrename.\n",
    "    \n",
    "    FILTER (REGEX(?genrename , 'Western'))\n",
    "}  order by ?sname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ebed534a-8bd3-4a4e-942e-e413a0f2e565",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#finding Country  properties for films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11424 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?obj sc:name ?objname.\n",
    "   FILTER(REGEX(?objname ,'country'))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "a8483a0b-eac6-4247-b3e6-32c95f057896",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#finding date  properties for films\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q11424 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pname.\n",
    "   ?obj sc:name ?objname.\n",
    "   FILTER(REGEX(?objname ,'date'))\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6870f3f7-29a1-4533-968e-856c43f1f417",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'software version identifier'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'tabular software version'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'has edition or translation'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Fonsi Nieto'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', \"Al Stewart's albums in chronological order\"), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Category:Adelina Lopes Vieira'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Lubomír Stoklásek'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Ciudad Vieja'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Echániz'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'Natuna'), ('country', 'http://www.wikidata.org/entity/Q30'), ('countryname', 'United States of America')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "\n",
    "#FOR EACH FILM FOUNDS THE COUNTRY OF ORIGIN AND PUBLICATION DATE AND FILTERS THE DATES \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT    ?film ?filmname ?country ?countryname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   #the film having the western genre \n",
    "   ?film wdt:P136 wd:Q172980 ;\n",
    "         wdt:P495 ?country;\n",
    "         wdt:P577 ?date.\n",
    "         \n",
    "         \n",
    "   \n",
    "   # get the label\n",
    "   ?fil sc:name ?filmname.\n",
    "   ?country sc:name ?countryname\n",
    "   #filtring the date\n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a4c4dccf-3bff-4038-bf90-fa94e15d50c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q5107'), ('name', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q2418896'), ('name', 'part of the world')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q855697'), ('name', 'subcontinent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q82794'), ('name', 'geographic region')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q55833'), ('name', 'supercontinent')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "\n",
    "\n",
    "\n",
    "#CHECKING FOR THE CONTINENT OF THE COuNTRY\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname ?n ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P136 wd:Q172980 ;\n",
    "         wdt:P495 ?country;\n",
    "         wdt:P577 ?date.\n",
    "    ?country ?p ?obj .\n",
    "    ?obj wdt:P31 ?n .\n",
    "         \n",
    "   \n",
    "   # get the label\n",
    "   \n",
    "  \n",
    "    ?p sc:name ?pname.\n",
    "    ?n sc:name ?name\n",
    "   FILTER(REGEX(?pname ,'continent'))\n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "8fd4d08a-93a0-42e0-903d-9b4cb32a359f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('continent', 'http://www.wikidata.org/entity/Q15'), ('continentname', 'Africa')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentname', 'Europe')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q48'), ('continentname', 'Asia')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q49'), ('continentname', 'North America')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q538'), ('continentname', 'Insular Oceania')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q5401'), ('continentname', 'Eurasia')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'),\n",
    "#('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q5107'), ('name', 'continent')]\n",
    "\n",
    "\n",
    "\n",
    "#FINDING CONTINENT NAMES AND CODES\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?continent  ?continentname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P136 wd:Q172980 ;\n",
    "         wdt:P495 ?country;\n",
    "         wdt:P577 ?date.\n",
    "    ?country wdt:P30 ?continent .\n",
    "    \n",
    "         \n",
    "   \n",
    "   # get the label\n",
    "   \n",
    "  \n",
    "    ?continent  sc:name ?continentname.\n",
    "    \n",
    "   \n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "76564fd7-25f0-4937-a964-33c7f8d3dd62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countryname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('countryname', 'United Kingdom')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q159'), ('countryname', 'Russia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('countryname', 'Germany')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q221'), ('countryname', 'North Macedonia')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('countryname', 'Spain')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('countryname', 'Belgium')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryname', 'Sweden')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryname', 'Denmark')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('countryname', 'Austria')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q43'), ('countryname', 'Turkey')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'),\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#[('class', 'http://www.wikidata.org/entity/Q11424'), ('classname', 'film')]\n",
    "#[('result', 'http://www.wikidata.org/entity/Q201658'), ('resultname', 'film genre')]\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "#finding all film genres that contain western\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'),\n",
    "#('pname', 'continent'), ('n', 'http://www.wikidata.org/entity/Q5107'), ('name', 'continent')]\n",
    "#[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentname', 'Europe')]\n",
    "\n",
    "#AADING BEING EUROPEAN CONDITION \n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?country  ?countryname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P136 wd:Q172980 ;\n",
    "         wdt:P495 ?country;\n",
    "         wdt:P577 ?date.\n",
    "    ?country wdt:P30 wd:Q46. \n",
    "    \n",
    "         \n",
    "   \n",
    "   # get the label\n",
    "  \n",
    "    ?country  sc:name ?countryname.\n",
    "\n",
    "   \n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} \n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53ee2847",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "7757ec45",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('countryname', 'Germany'), ('numberOfFilms', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('countryname', 'Belgium'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryname', 'Sweden'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('countryname', 'Spain'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countryname', 'France'), ('numberOfFilms', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('countryname', 'Austria'), ('numberOfFilms', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q221'), ('countryname', 'North Macedonia'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryname', 'Denmark'), ('numberOfFilms', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('countryname', 'United Kingdom'), ('numberOfFilms', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q159'), ('countryname', 'Russia'), ('numberOfFilms', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q43'), ('countryname', 'Turkey'), ('numberOfFilms', '1')]\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
    "#[('genre', 'http://www.wikidata.org/entity/Q172980'), ('genrename', 'Western film')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P30'),\n",
    "#[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentname', 'Europe')]\n",
    "\n",
    "\n",
    "#FINAL QUERY\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?country  ?countryname (count (?film) AS ?numberOfFilms)\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?film wdt:P136 wd:Q172980;\n",
    "       wdt:P495 ?country;\n",
    "       wdt:P577 ?date.\n",
    "    ?country wdt:P30 wd:Q46. \n",
    "    \n",
    "   # get the label\n",
    "  \n",
    "    ?country  sc:name ?countryname.\n",
    "\n",
    "   \n",
    "    FILTER (YEAR(?date)>2009 && YEAR(?date)<2016)\n",
    "} group by ?country  ?countryname\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    " "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bcbd3340",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Consider only films directed by Woody Allen or Quentin Tarantino. Then consider the date of publication of these films (take the first one if there are more than one date of publication). Return the year with more films release for the two director (the result set must be two elements and for each element there must be present the director IRI, the label of the IRI, the year and the number of films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "45856c41",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('c', 'http://www.wikidata.org/entity/P344'), ('cname', 'director of photography')]\n",
      "[('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#CHECKING FILM PROPERTIES TO FIND THE DIRECTOR PROPERTY \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT   ?c ?cname\n",
    "WHERE {\n",
    "    VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "    wd:Q11424 ?p ?c.\n",
    "    ?p sc:name ?pname.\n",
    "    ?c sc:name ?cname\n",
    "    filter(regex(?cname , 'director'))\n",
    "    \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "4f83cbaf-d18c-44a4-b623-5521bcc69165",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('name', 'The Concert for New York City'), ('callret-2', '2001')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('name', 'Midnight in Paris'), ('callret-2', '2011')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('name', 'Alice'), ('callret-2', '1990')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('name', 'Alice'), ('callret-2', '1991')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\"), ('callret-2', '1966')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('name', 'Bullets Over Broadway'), ('callret-2', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('name', 'Bullets Over Broadway'), ('callret-2', '1995')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('name', 'Mighty Aphrodite'), ('callret-2', '1995')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('name', 'Mighty Aphrodite'), ('callret-2', '1996')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('name', 'Broadway Danny Rose'), ('callret-2', '1984')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('name', 'Match Point'), ('callret-2', '2005')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('name', 'Husbands and Wives'), ('callret-2', '1992')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('name', 'Husbands and Wives'), ('callret-2', '1993')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('name', 'Bananas'), ('callret-2', '1971')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('name', 'Bananas'), ('callret-2', '1974')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('name', 'You Will Meet a Tall Dark Stranger'), ('callret-2', '2010')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('name', 'Magic in the Moonlight'), ('callret-2', '2014')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('name', 'Anything Else'), ('callret-2', '2003')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('name', 'Zelig'), ('callret-2', '1983')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('name', 'Wonder Wheel'), ('callret-2', '2017')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('name', 'Wonder Wheel'), ('callret-2', '2018')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('name', 'Sweet and Lowdown'), ('callret-2', '1999')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('name', 'Sweet and Lowdown'), ('callret-2', '2000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('name', 'Celebrity'), ('callret-2', '1998')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('name', 'Celebrity'), ('callret-2', '1999')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('name', 'Love and Death'), ('callret-2', '1975')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('name', 'Crimes and Misdemeanors'), ('callret-2', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('name', 'Crimes and Misdemeanors'), ('callret-2', '1990')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('name', 'scoop'), ('callret-2', '2006')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('name', 'Stardust Memories'), ('callret-2', '1980')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('name', 'Stardust Memories'), ('callret-2', '1981')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('name', 'New York Stories'), ('callret-2', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('name', \"Rifkin's Festival\"), ('callret-2', '2020')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('name', 'Sleeper'), ('callret-2', '1973')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('name', 'Sleeper'), ('callret-2', '1974')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('name', 'Small Time Crooks'), ('callret-2', '2000')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('name', 'Shadows and Fog'), ('callret-2', '1991')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('name', 'Shadows and Fog'), ('callret-2', '1992')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('name', 'Manhattan Murder Mystery'), ('callret-2', '1993')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('name', 'Manhattan Murder Mystery'), ('callret-2', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('name', 'Take the Money and Run'), ('callret-2', '1969')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('name', 'Melinda and Melinda'), ('callret-2', '2004')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('name', 'Melinda and Melinda'), ('callret-2', '2005')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('name', 'Blue Jasmine'), ('callret-2', '2013')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q198611'), ('name', \"Don't Drink the Water\"), ('callret-2', '1994')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('name', 'Manhattan'), ('callret-2', '1979')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('name', \"Cassandra's Dream\"), ('callret-2', '2007')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('name', \"Cassandra's Dream\"), ('callret-2', '2008')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('name', 'Everything You Always Wanted to Know About Sex*'), ('callret-2', '1972')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('name', 'The Purple Rose of Cairo'), ('callret-2', '1985')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('name', 'September'), ('callret-2', '1987')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('name', 'September'), ('callret-2', '1988')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3305681'), ('name', 'Men of Crisis: The Harvey Wallinger Story'), ('callret-2', '1971')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('name', 'Whatever Works'), ('callret-2', '2009')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('name', 'Irrational Man'), ('callret-2', '2015')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('name', 'To Rome with Love'), ('callret-2', '2012')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('name', 'Café Society'), ('callret-2', '2016')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('name', \"A Midsummer Night's Sex Comedy\"), ('callret-2', '1982')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('name', 'Another Woman'), ('callret-2', '1988')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('name', 'Another Woman'), ('callret-2', '1989')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('name', 'Radio Days'), ('callret-2', '1987')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('name', 'A Rainy Day in New York'), ('callret-2', '2019')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('name', 'Everyone Says I Love You'), ('callret-2', '1996')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('name', 'Everyone Says I Love You'), ('callret-2', '1997')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('name', 'Vicky Cristina Barcelona'), ('callret-2', '2008')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('name', 'Annie Hall'), ('callret-2', '1977')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('name', 'The Curse of the Jade Scorpion'), ('callret-2', '2001')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('name', 'Deconstructing Harry'), ('callret-2', '1997')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('name', 'Deconstructing Harry'), ('callret-2', '1998')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('name', 'Hollywood Ending'), ('callret-2', '2002')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('name', 'Hannah and Her Sisters'), ('callret-2', '1986')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q961403'), ('name', 'Interiors'), ('callret-2', '1978')]\n",
      "72\n"
     ]
    }
   ],
   "source": [
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')] \n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND THEIR PUBLICATION YEAR\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?film ?name  YEAR(?date)\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 wd:Q25089;\n",
    "        wdt:P577 ?date .\n",
    "   \n",
    "    ?film sc:name ?name  \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 387,
   "id": "d0eedac3-eb25-47ae-bd92-23b18ac40029",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('year', '1987'), ('name', \"My Best Friend's Birthday\")]\n",
      "[('year', '1992'), ('name', 'Reservoir Dogs')]\n",
      "[('year', '1994'), ('name', 'Pulp Fiction')]\n",
      "[('year', '1995'), ('name', 'Four Rooms')]\n",
      "[('year', '1997'), ('name', 'Jackie Brown')]\n",
      "[('year', '2003'), ('name', 'Kill Bill: The Whole Bloody Affair')]\n",
      "[('year', '2003'), ('name', 'Kill Bill Volume 1')]\n",
      "[('year', '2004'), ('name', 'Kill Bill Volume 2')]\n",
      "[('year', '2005'), ('name', 'Grave Danger')]\n",
      "[('year', '2005'), ('name', 'Grave Danger: Part 2')]\n",
      "[('year', '2005'), ('name', 'Grave Danger: Part 1')]\n",
      "[('year', '2005'), ('name', 'Sin City')]\n",
      "[('year', '2007'), ('name', 'Grindhouse')]\n",
      "[('year', '2007'), ('name', 'Death Proof')]\n",
      "[('year', '2009'), ('name', 'Inglourious Basterds')]\n",
      "[('year', '2012'), ('name', 'Django Unchained')]\n",
      "[('year', '2015'), ('name', 'The Hateful Eight')]\n",
      "[('year', '2019'), ('name', 'Once Upon a Time in Hollywood')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND THEIR FIRST PUBLICATION YEAR\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "WHERE {\n",
    " VALUES ?director { wd:Q3772} .\n",
    "    ?director sc:name ?directorname.\n",
    "   ?film wdt:P57 wd:Q3772;\n",
    "        wdt:P577 ?date .\n",
    "        \n",
    "   \n",
    "    ?film sc:name ?name  \n",
    "}group by  ?name  \n",
    "order by ?year\n",
    "limit 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "a398d757-24f9-480d-ab07-46c939bd6a5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1966'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1980'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1984'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1998'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2011'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1982'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1986'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1988'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1997'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2014'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2017'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1971'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1975'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1999'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1994'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2010'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2004'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2007'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2020'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1969'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1979'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1995'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2000'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2009'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2013'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2002'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2008'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2019'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1977'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1978'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1987'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1991'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2001'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2016'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1989'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2012'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1972'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1985'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1993'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2003'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2005'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2006'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1973'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1983'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1990'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1992'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1996'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '2015'), ('number', '1')]\n",
      "48\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen  AND THEIR FIRST PUBLICATION YEAR\n",
    "queryString = \"\"\"\n",
    "\n",
    "select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q25089 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q25089;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 389,
   "id": "7d12fc7e-f70f-42d8-bd60-6749a069b55e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2005'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2003'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2007'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '1995'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '1987'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2004'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2012'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2015'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '1994'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2019'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '1997'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '1992'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2009'), ('number', '1')]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#('obj', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen  AND THEIR FIRST PUBLICATION YEAR\n",
    "queryString = \"\"\"\n",
    "\n",
    "select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q3772 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q3772;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "order by desc(?number )\n",
    "}\n",
    "}order by desc(?number)\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 401,
   "id": "ac5f382c-3851-4d82-8649-7e3f3dd4088f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2005'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1971'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q3772 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q3772;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q25089 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q25089;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "        \n",
    "}\n",
    "}group by ?year \n",
    "limit 2\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bf3207be",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "d4f9ef2c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('year', '2005'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('year', '1971'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#AS THE TASK DESCRIPTION WAS AMBIGUOUS AND I COULD NOT FIND OUT WHICH OF BELOW QUERIES IS ASSUMED I DID IN THIS WAY\n",
    "# FIRST ASSUME WAS RETURN THE YEAR THAT SUM OF THEIR WORKS WAS THE MAX WHICH IS 2005 THAT TRENTINO HAD 4 FILMS \n",
    "#AND Allen DIRECTED ONLY ONE . BUT IT DID NOT SEEM RIGHT \n",
    "#SO I RETURNED THE YEARS THAT EACH ONE HAD MORE WORKS \n",
    "#FOR TERENTINO IT WAS NOT A PROBLEM BECAUSE IN 2005 HE HAD 4 FILMS \n",
    "#BUT FOR ALLEN HE HAD IN MAX 2 FILMS IN A YEAR \n",
    "#AND THERE WAS 5 CASES THAT ALLEN HAD 2 FILMS IN A YEAR (1971-1994-1987-2001 ,..)\n",
    "#SO AS THE TASK ASKED ONLY TWO ELEMENTS (ONE FOR EACH DIRECTOE ) I DECIDED TO RETURN THE FIRST RECORD FOR \n",
    "#ALLEN .\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q3772 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q3772;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "}\n",
    "UNION\n",
    "{\n",
    "    select ?director ?directorname ?year ?number \n",
    "{\n",
    "            VALUES ?director {wd:Q25089 } .\n",
    "            ?director sc:name ?directorname.\n",
    "    {\n",
    "    select (count(?name) as?number ) ?year \n",
    "    {\n",
    "    \n",
    "    {\n",
    "        SELECT DISTINCT (min(YEAR(?date) ) as ?year) ?name \n",
    "        WHERE {\n",
    "            \n",
    "           ?film wdt:P57 wd:Q25089;\n",
    "            wdt:P577 ?date .\n",
    "             ?film sc:name ?name  \n",
    "            }group by  ?name  \n",
    "            order by ?year\n",
    "            limit 100\n",
    "            \n",
    "        } \n",
    "}group by ?year \n",
    "}\n",
    "}order by desc(?number)\n",
    "limit 1 \n",
    "        \n",
    "}\n",
    "}group by ?year \n",
    "limit 2\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb122454",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Identify the BGP for Academy Awards"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "220e7f35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1003'), ('pname', 'National Library of Romania ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('pname', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1006'), ('pname', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('pname', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('pname', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('pname', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1150'), ('pname', 'Regensburg Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1207'), ('pname', 'NUKAT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1220'), ('pname', 'Internet Broadway Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1233'), ('pname', 'Internet Speculative Fiction Database author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1263'), ('pname', 'NNDB people ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1266'), ('pname', 'AlloCiné person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('pname', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1280'), ('pname', 'CONOR.SI ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('pname', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1284'), ('pname', 'Munzinger person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('pname', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('pname', 'instrument')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1309'), ('pname', 'EGAXA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1315'), ('pname', 'NLA Trove ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1317'), ('pname', 'floruit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1368'), ('pname', 'LNB ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1375'), ('pname', 'NSK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pname', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('pname', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('pname', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1455'), ('pname', 'list of works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1477'), ('pname', 'birth name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1559'), ('pname', 'name in native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1580'), ('pname', 'University of Barcelona authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1607'), ('pname', 'Dialnet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1695'), ('pname', 'NLP ID (unique)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1728'), ('pname', 'AllMusic artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1741'), ('pname', 'GTAA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pname', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1816'), ('pname', 'National Portrait Gallery (London) person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1819'), ('pname', 'genealogics.org person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1953'), ('pname', 'Discogs artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1969'), ('pname', 'MovieMeter director ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1977'), ('pname', 'Les Archives du Spectacle Person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2019'), ('pname', 'AllMovie person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2031'), ('pname', 'work period (start)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('pname', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('pname', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('pname', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('pname', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2168'), ('pname', 'Swedish Film Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2174'), ('pname', 'Museum of Modern Art artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2188'), ('pname', 'BiblioNet author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2190'), ('pname', 'C-SPAN person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2191'), ('pname', 'Vegetti Catalog of Fantastic Literature NILF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('pname', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('pname', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2387'), ('pname', 'Elonet person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2435'), ('pname', 'PORT person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('pname', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P245'), ('pname', 'Union List of Artist Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2469'), ('pname', 'Theatricalia person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('pname', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2519'), ('pname', 'Scope.dk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('pname', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2600'), ('pname', 'Geni.com profile ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2604'), ('pname', 'Kinopoisk person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2605'), ('pname', 'ČSFD person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2626'), ('pname', 'Danish National Filmography person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('pname', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('pname', 'record label')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('pname', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2688'), ('pname', 'Box Office Mojo person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('pname', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P271'), ('pname', 'CiNii author ID (books)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2734'), ('pname', 'Unz Review author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('pname', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2963'), ('pname', 'Goodreads author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3056'), ('pname', 'TCM Movie Database person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3065'), ('pname', 'RERO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('pname', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3136'), ('pname', 'elCinema person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3142'), ('pname', 'EDb person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('pname', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('pname', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3280'), ('pname', 'BAnQ author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3305'), ('pname', 'KINENOTE person ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3348'), ('pname', 'National Library of Greece ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3373'), ('pname', 'sibling')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('pname', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3430'), ('pname', 'SNAC ARK ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('pname', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3478'), ('pname', 'Songkick artist ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3479'), ('pname', 'Omni topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('pname', 'National Diet Library ID')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#wd:Q25089\tWoody Allen\tnode\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pname\n",
    "WHERE {\n",
    "    wd:Q25089 ?p ?obj .\n",
    "    \n",
    "    ?p sc:name ?pname\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "a00dac5d-e046-4856-a06d-21527414faa3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q103360'), ('pname', 'Academy Award for Best Director')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q41417'), ('pname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q103916'), ('pname', 'Academy Award for Best Actor')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1377772'), ('pname', 'European Film Award for Best Non-European Film')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?award ?awardname\n",
    "WHERE {\n",
    "    wd:Q25089 wdt:P1411 ?award.\n",
    "    \n",
    "    ?award sc:name ?awardname\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "id": "b304a382-b762-449c-8105-0fb1f3379cf7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('var', 'http://www.wikidata.org/entity/Q96474679'), ('varname', 'award for best direction')]\n",
      "[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
      "[('var', 'http://www.wikidata.org/entity/Q223740'), ('varname', 'European Film Awards')]\n",
      "[('var', 'http://www.wikidata.org/entity/Q96474691'), ('varname', 'award for best leading actor')]\n",
      "[('var', 'http://www.wikidata.org/entity/Q96474700'), ('varname', 'award for best screenplay')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('p', 'http://www.wikidata.org/entity/Q103360'), ('pname', 'Academy Award for Best Director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?var ?varname\n",
    "WHERE {\n",
    "    wd:Q25089 wdt:P1411 ?award.\n",
    "    ?award wdt:P31 ?var.\n",
    "    \n",
    "    ?var sc:name ?varname\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13c1f2cb",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "1b8e2994",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('p', 'http://www.wikidata.org/entity/Q103360'), ('pname', 'Academy Award for Best Director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wdt:P31\tinstance of\tpredicate\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?var ?varname\n",
    "WHERE {\n",
    "    wd:Q25089 wdt:P1411 ?award.\n",
    "    ?award wdt:P31 ?var.\n",
    "    \n",
    "    ?var sc:name ?varname\n",
    "    FILTER(REGEX(?varname , '[Aa]cademy'))\n",
    "   \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f5d4efd7",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider films directed by Woody Allen or Quentin Tarantino separately. Return the film which won more Academy Awards for the two directors (the result set must be two elements - one related to Allen and the other related to Tarantino -  and for each element there must be present the director IRI with its label, the film IRI with its label and the number of Academy awards won)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 210,
   "id": "21d06d95-002c-4cb3-9128-9744546f3b32",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('film', 'http://www.wikidata.org/entity/Q3986392'), ('name', 'The Concert for New York City')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q206124'), ('name', 'Midnight in Paris')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682262'), ('name', 'Alice')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q971865'), ('name', \"What's Up, Tiger Lily?\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1004531'), ('name', 'Bullets Over Broadway')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354109'), ('name', 'Mighty Aphrodite')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q729026'), ('name', 'Broadway Danny Rose')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q733677'), ('name', 'Match Point')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q740143'), ('name', 'Husbands and Wives')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q806092'), ('name', 'Bananas')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1321004'), ('name', 'You Will Meet a Tall Dark Stranger')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q14511869'), ('name', 'Magic in the Moonlight')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q614009'), ('name', 'Anything Else')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q187423'), ('name', 'Zelig')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q27703144'), ('name', 'Wonder Wheel')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q786585'), ('name', 'Sweet and Lowdown')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1052826'), ('name', 'Celebrity')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1218888'), ('name', 'Love and Death')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q181555'), ('name', 'Crimes and Misdemeanors')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q682002'), ('name', 'scoop')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q653518'), ('name', 'Stardust Memories')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q977372'), ('name', 'New York Stories')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q65552643'), ('name', \"Rifkin's Festival\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q750003'), ('name', 'Sleeper')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q610163'), ('name', 'Small Time Crooks')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q910523'), ('name', 'Shadows and Fog')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1133277'), ('name', 'Manhattan Murder Mystery')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1146315'), ('name', 'Take the Money and Run')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1354121'), ('name', 'Melinda and Melinda')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q2907178'), ('name', 'Blue Jasmine')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q198611'), ('name', \"Don't Drink the Water\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q18844733'), ('name', 'Crisis in Six Scenes')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q731310'), ('name', 'Manhattan')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q833530'), ('name', \"Cassandra's Dream\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q499697'), ('name', 'Everything You Always Wanted to Know About Sex*')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q912729'), ('name', 'The Purple Rose of Cairo')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1770003'), ('name', 'September')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q3305681'), ('name', 'Men of Crisis: The Harvey Wallinger Story')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q692208'), ('name', 'Whatever Works')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q17417520'), ('name', 'Irrational Man')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q29658'), ('name', 'To Rome with Love')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q20950014'), ('name', 'Café Society')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1306629'), ('name', \"A Midsummer Night's Sex Comedy\")]\n",
      "[('film', 'http://www.wikidata.org/entity/Q541185'), ('name', 'Another Woman')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q685109'), ('name', 'Radio Days')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q42307699'), ('name', 'A Rainy Day in New York')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q1334572'), ('name', 'Everyone Says I Love You')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q212123'), ('name', 'Vicky Cristina Barcelona')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q233464'), ('name', 'Annie Hall')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q335508'), ('name', 'The Curse of the Jade Scorpion')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q551762'), ('name', 'Deconstructing Harry')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q582021'), ('name', 'Hollywood Ending')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q845057'), ('name', 'Hannah and Her Sisters')]\n",
      "[('film', 'http://www.wikidata.org/entity/Q961403'), ('name', 'Interiors')]\n",
      "54\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?film ?name\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 wd:Q25089 .\n",
    "   \n",
    "    ?film sc:name ?name  \n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 216,
   "id": "eed379c3-6b1c-46e8-b51d-b8d9d508178e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Bullets Over Broadway'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Mighty Aphrodite'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Blue Jasmine'), ('awardname', 'Academy Award for Best Actress')]\n",
      "[('name', 'Vicky Cristina Barcelona'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Director')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Picture')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Actress')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Midnight in Paris'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Supporting Actor')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND THEIR ACADEMY AWARDS\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?name ?awardname \n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 wd:Q25089 ;\n",
    "        wdt:P166 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "    ?film sc:name ?name  .\n",
    "    ?awards sc:name ?awardname\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 235,
   "id": "efccb863-1174-4482-9398-037536239447",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Blue Jasmine'), ('awardname', 'Academy Award for Best Actress')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Actress')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Bullets Over Broadway'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Mighty Aphrodite'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Picture')]\n",
      "[('name', 'Vicky Cristina Barcelona'), ('awardname', 'Academy Award for Best Supporting Actress')]\n",
      "[('name', 'Midnight in Paris'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Supporting Actor')]\n",
      "[('name', 'Annie Hall'), ('awardname', 'Academy Award for Best Director')]\n",
      "[('name', 'Hannah and Her Sisters'), ('awardname', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND count THEIR ACADEMY AWARDS c\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?name ?awardname\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 wd:Q25089 ;\n",
    "        wdt:P166 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "    ?film sc:name ?name  .\n",
    "    ?awards sc:name ?awardname\n",
    "} group by ?name\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 254,
   "id": "cd4b3e38-259d-4ee4-a428-3840be5dbbe0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('number', '3')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND count THEIR ACADEMY AWARDS c\n",
    "queryString = \"\"\"\n",
    "SELECT  ?director ?directorname ?film ?filmname (count (?awardname ) as ?number )\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 ?director ;\n",
    "        wdt:P166 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "    ?film sc:name ?filmname  .\n",
    "    ?awards sc:name ?awardname.\n",
    "     ?director sc:name  ?directorname\n",
    "     \n",
    "} group by  ?director ?directorname ?film ?filmname \n",
    "order by desc(?number)\n",
    "\n",
    "\n",
    "LIMIT 2\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "id": "3c477b53-37ed-43fe-b1c1-e39ee4898c5e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q2907178'), ('filmname', 'Blue Jasmine'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmname', 'Django Unchained'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1354109'), ('filmname', 'Mighty Aphrodite'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q104123'), ('filmname', 'Pulp Fiction'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q845057'), ('filmname', 'Hannah and Her Sisters'), ('number', '3')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q47300912'), ('filmname', 'Once Upon a Time in Hollywood'), ('number', '2')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q153723'), ('filmname', 'Inglourious Basterds'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q18225084'), ('filmname', 'The Hateful Eight'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q206124'), ('filmname', 'Midnight in Paris'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q1004531'), ('filmname', 'Bullets Over Broadway'), ('number', '1')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q212123'), ('filmname', 'Vicky Cristina Barcelona'), ('number', '1')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND count THEIR ACADEMY AWARDS c\n",
    "queryString = \"\"\"\n",
    "SELECT  ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 ?director ;\n",
    "        wdt:P166 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "    ?film sc:name ?filmname  .\n",
    "    ?awards sc:name ?awardname.\n",
    "     ?director sc:name  ?directorname\n",
    "     \n",
    "} group by  ?director ?directorname ?film ?filmname \n",
    "\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 284,
   "id": "b7176ca5-be40-46b6-ba7f-9f909a3b499b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmname', 'Django Unchained'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FIRST APPROACH TO FIND THE ANSWER using union instead of value\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   SELECT   ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "        VALUES ?director {  wd:Q25089 }\n",
    "       ?film wdt:P57 ?director;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "     VALUES ?director { wd:Q3772  }\n",
    "       \n",
    "       ?film wdt:P57 ?director ;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "        \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "96456346",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 303,
   "id": "c791df96",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('director', 'http://www.wikidata.org/entity/Q25089'), ('directorname', 'Woody Allen'), ('film', 'http://www.wikidata.org/entity/Q233464'), ('filmname', 'Annie Hall'), ('number', '4')]\n",
      "[('director', 'http://www.wikidata.org/entity/Q3772'), ('directorname', 'Quentin Tarantino'), ('film', 'http://www.wikidata.org/entity/Q571032'), ('filmname', 'Django Unchained'), ('number', '2')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')] \n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FIRST APPROACH TO FIND THE ANSWER using union instead of value\n",
    "queryString = \"\"\"\n",
    "SELECT * WHERE\n",
    "{ \n",
    "{\n",
    "   SELECT   ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "        VALUES ?director {  wd:Q25089 }\n",
    "       ?film wdt:P57 ?director;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "}\n",
    "UNION\n",
    "{\n",
    "    SELECT ?director ?directorname ?film ?filmname (count(?awardname) as ?number ) \n",
    "    WHERE {\n",
    "     VALUES ?director { wd:Q3772  }\n",
    "       \n",
    "       ?film wdt:P57 ?director ;\n",
    "            wdt:P166 ?awards.\n",
    "        ?awards wdt:P31 wd:Q19020 .\n",
    "   \n",
    "        ?film sc:name ?filmname  .\n",
    "        ?awards sc:name ?awardname.\n",
    "         ?director sc:name  ?directorname\n",
    "     \n",
    "        } group by  ?director ?directorname ?film ?filmname \n",
    "        order by desc(?number) \n",
    "        LIMIT 1\n",
    "        \n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "29504f40",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Consider the set of films directed by Allen or Tarantino. Return for each Academy Award the total number of nomination of these films (the result set must be a list of triples Academy Award IRI, label and #nomination)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 301,
   "id": "f0d37494",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('awards', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay'), ('numberofNOM', '19')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q106301'), ('name', 'Academy Award for Best Supporting Actress'), ('numberofNOM', '11')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director'), ('numberofNOM', '9')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q106291'), ('name', 'Academy Award for Best Supporting Actor'), ('numberofNOM', '7')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q102427'), ('name', 'Academy Award for Best Picture'), ('numberofNOM', '6')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q277751'), ('name', 'Academy Award for Best Production Design'), ('numberofNOM', '5')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q131520'), ('name', 'Academy Award for Best Cinematography'), ('numberofNOM', '4')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103916'), ('name', 'Academy Award for Best Actor'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103618'), ('name', 'Academy Award for Best Actress'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q281939'), ('name', 'Academy Award for Best Film Editing'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q488645'), ('name', 'Academy Award for Best Sound Editing'), ('numberofNOM', '2')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q277536'), ('name', 'Academy Award for Best Costume Design'), ('numberofNOM', '2')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q488651'), ('name', 'Academy Award for Best Original Score'), ('numberofNOM', '1')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q830079'), ('name', 'Academy Award for Best Sound'), ('numberofNOM', '1')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')] \n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND count THEIR ACADEMY AWARDS c\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?awards ?name  (count (?name) as ?numberofNOM)\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 ?director ;\n",
    "        wdt:P1411 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "\n",
    "    ?awards sc:name ?name.\n",
    "} group by?awards ?name \n",
    "order by desc(?numberofNOM)\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e0f2564",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 302,
   "id": "5abc71e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('awards', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay'), ('numberofNOM', '19')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q106301'), ('name', 'Academy Award for Best Supporting Actress'), ('numberofNOM', '11')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director'), ('numberofNOM', '9')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q106291'), ('name', 'Academy Award for Best Supporting Actor'), ('numberofNOM', '7')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q102427'), ('name', 'Academy Award for Best Picture'), ('numberofNOM', '6')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q277751'), ('name', 'Academy Award for Best Production Design'), ('numberofNOM', '5')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q131520'), ('name', 'Academy Award for Best Cinematography'), ('numberofNOM', '4')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103916'), ('name', 'Academy Award for Best Actor'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q103618'), ('name', 'Academy Award for Best Actress'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q281939'), ('name', 'Academy Award for Best Film Editing'), ('numberofNOM', '3')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q488645'), ('name', 'Academy Award for Best Sound Editing'), ('numberofNOM', '2')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q277536'), ('name', 'Academy Award for Best Costume Design'), ('numberofNOM', '2')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q488651'), ('name', 'Academy Award for Best Original Score'), ('numberofNOM', '1')]\n",
      "[('awards', 'http://www.wikidata.org/entity/Q830079'), ('name', 'Academy Award for Best Sound'), ('numberofNOM', '1')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')] \n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), \n",
    "#('c', 'http://www.wikidata.org/entity/P57'), ('cname', 'director')]\n",
    "#wd:Q25089\tWoody Allen\tnode\n",
    "#wd:Q3772\tQuentin Tarantino\tnode\n",
    "#[('var', 'http://www.wikidata.org/entity/Q19020'), ('varname', 'Academy Awards')]\n",
    "\n",
    "#FINDING ALL THE MOVIES DIRECTED BY Woody Allen or Quentin Tarantino AND count THEIR ACADEMY AWARDS c\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?awards ?name  (count (?name) as ?numberofNOM)\n",
    "WHERE {\n",
    "   VALUES ?director {wd:Q25089 wd:Q3772} .\n",
    "   ?film wdt:P57 ?director ;\n",
    "        wdt:P1411 ?awards.\n",
    "    ?awards wdt:P31 wd:Q19020 .\n",
    "\n",
    "    ?awards sc:name ?name.\n",
    "} group by?awards ?name \n",
    "order by desc(?numberofNOM)\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
