{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-2a7c3e6009-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "       results = sparql.query()\n",
    "       json_results = results.convert()\n",
    "       if len(json_results['results']['bindings'])==0:\n",
    "          print(\"Empty\")\n",
    "          return 0\n",
    "    \n",
    "       for bindings in json_results['results']['bindings']:\n",
    "          print( [ (var, value['value'])  for var, value in bindings.items() ] )\n",
    "\n",
    "       return len(json_results['results']['bindings'])\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Politics Workflow Series (\"Politicians in E.U.\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> You investigating the careers of politicians in the E.U."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "\n",
    "\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P17`     | country       | predicate |\n",
    "| `wdt:P27`     | citizenship   | predicate |\n",
    "| `wdt:P39`     | position held   | predicate |\n",
    "| `wdt:P106`    | profession   | predicate |\n",
    "| `wd:Q82955`   | politician | node      |\n",
    "| `wd:Q46`      | Europe        | node |\n",
    "| `wd:Q38`      | Italy          | node |\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "?p wdt:P106/wdt:P279* wd:Q82955  . \n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **politicians**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Workload Goals\n",
    "\n",
    "\n",
    "1. Identify the BGP to retrieve E.U. countries and their politicians\n",
    "\n",
    "2. Identify the BGP for obtaining other occupations and properties of politicians\n",
    "\n",
    "3. How many politicians are recorder for each E.U. country?\n",
    "\n",
    "4. Are there politicians with double citizenship?\n",
    "\n",
    "5. Analyze the number of politicians in each country by occupation, for instance\n",
    " \n",
    "   5.1 What are the top-3 occupations for a politician in Italy and France?\n",
    "   \n",
    "   5.2 What if you consider only politicians for which we don't have a date of death?\n",
    "   \n",
    "   5.3 Which politicians had a spouse that was also a politician? How many in each country?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "24a853ab-830c-422c-afd3-e9e015b8b8ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "# start your workflow here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '15556')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT COUNT(*)\n",
    "WHERE { \n",
    "\n",
    "?p wdt:P106/wdt:P279 wd:Q82955  . \n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "7f2055ad-ad7a-4602-9c70-f425a9f03ef1",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1005'), ('relationName', 'Portuguese National Library ID'), ('node', '106839')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1036'), ('relationName', 'Dewey Decimal Classification'), ('node', '2--45')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1081'), ('relationName', 'Human Development Index'), ('node', '0.873')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1082'), ('relationName', 'population'), ('node', '60317000')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1120'), ('relationName', 'number of deaths'), ('node', '633133')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1151'), ('relationName', \"topic's main Wikimedia portal\"), ('node', 'http://www.wikidata.org/entity/Q10631821')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1198'), ('relationName', 'unemployment rate'), ('node', '12')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P122'), ('relationName', 'basic form of government'), ('node', 'http://www.wikidata.org/entity/Q4198907')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1225'), ('relationName', 'U.S. National Archives Identifier'), ('node', '10035812')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1225'), ('relationName', 'U.S. National Archives Identifier'), ('node', '10041770')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1245'), ('relationName', 'OmegaWiki Defined Meaning'), ('node', '5748')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1296'), ('relationName', 'Gran Enciclopèdia Catalana ID'), ('node', '0034099')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1313'), ('relationName', 'office held by head of government'), ('node', 'http://www.wikidata.org/entity/Q796897')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q19180675')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q2657718')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q302556')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q4086271')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q4114391')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q4173137')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q602358')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1343'), ('relationName', 'described by source'), ('node', 'http://www.wikidata.org/entity/Q867541')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1365'), ('relationName', 'replaces'), ('node', 'http://www.wikidata.org/entity/Q172579')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1417'), ('relationName', 'Encyclopædia Britannica Online ID'), ('node', 'place/Italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1419'), ('relationName', 'shape'), ('node', 'http://www.wikidata.org/entity/Q190868')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1438'), ('relationName', 'Jewish Encyclopedia ID (Russian)'), ('node', '11873')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1451'), ('relationName', 'motto text'), ('node', 'Made in Italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1464'), ('relationName', 'category for people born here'), ('node', 'http://www.wikidata.org/entity/Q9229082')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1465'), ('relationName', 'category for people who died here'), ('node', 'http://www.wikidata.org/entity/Q6334620')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1273')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1237')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1210')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1216')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1222')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1243')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1263')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1452')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1250')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1279')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1280')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1284')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1438')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1447')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1458')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1460')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1462')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1256')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1443')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P150'), ('relationName', 'contains administrative territorial entity'), ('node', 'http://www.wikidata.org/entity/Q1282')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1549'), ('relationName', 'demonym'), ('node', 'Italian')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P155'), ('relationName', 'follows'), ('node', 'http://www.wikidata.org/entity/Q172579')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1552'), ('relationName', 'has quality'), ('node', 'http://www.wikidata.org/entity/Q3174312')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1566'), ('relationName', 'GeoNames ID'), ('node', '3175395')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1589'), ('relationName', 'lowest point'), ('node', 'http://www.wikidata.org/entity/Q3687778')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1617'), ('relationName', 'BBC Things ID'), ('node', '0021de37-b64a-46ac-a4bb-5bdbdf0908ec')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1622'), ('relationName', 'driving side'), ('node', 'http://www.wikidata.org/entity/Q14565199')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P163'), ('relationName', 'flag'), ('node', 'http://www.wikidata.org/entity/Q42876')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1667'), ('relationName', 'Getty Thesaurus of Geographic Names ID'), ('node', '1000080')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P17'), ('relationName', 'country'), ('node', 'http://www.wikidata.org/entity/Q38')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1740'), ('relationName', 'category for films shot at this location'), ('node', 'http://www.wikidata.org/entity/Q7140608')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1791'), ('relationName', 'category of people buried here'), ('node', 'http://www.wikidata.org/entity/Q8328654')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1792'), ('relationName', 'category of associated people'), ('node', 'http://www.wikidata.org/entity/Q3919890')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1842'), ('relationName', 'Global Anabaptist Mennonite Encyclopedia Online ID'), ('node', 'Italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P1906'), ('relationName', 'office held by head of state'), ('node', 'http://www.wikidata.org/entity/Q332711')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P194'), ('relationName', 'legislative body'), ('node', 'http://www.wikidata.org/entity/Q1117578')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2004'), ('relationName', 'NALT ID'), ('node', '1813')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2046'), ('relationName', 'area'), ('node', '301338')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P206'), ('relationName', 'located in or next to body of water'), ('node', 'http://www.wikidata.org/entity/Q13924')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P206'), ('relationName', 'located in or next to body of water'), ('node', 'http://www.wikidata.org/entity/Q4918')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P206'), ('relationName', 'located in or next to body of water'), ('node', 'http://www.wikidata.org/entity/Q37495')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P206'), ('relationName', 'located in or next to body of water'), ('node', 'http://www.wikidata.org/entity/Q38882')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P206'), ('relationName', 'located in or next to body of water'), ('node', 'http://www.wikidata.org/entity/Q42820')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P208'), ('relationName', 'executive body'), ('node', 'http://www.wikidata.org/entity/Q3773971')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P209'), ('relationName', 'highest judicial authority'), ('node', 'http://www.wikidata.org/entity/Q1135541')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P213'), ('relationName', 'ISNI'), ('node', '0000 0001 2186 9395')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P214'), ('relationName', 'VIAF ID'), ('node', '152361066')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2163'), ('relationName', 'FAST ID'), ('node', '1204565')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2184'), ('relationName', 'history of topic'), ('node', 'http://www.wikidata.org/entity/Q7791')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2250'), ('relationName', 'life expectancy'), ('node', '82.5439')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2258'), ('relationName', 'mobile country code'), ('node', '222')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P227'), ('relationName', 'GND ID'), ('node', '4027833-5')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2347'), ('relationName', 'YSO ID'), ('node', '105111')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P237'), ('relationName', 'coat of arms'), ('node', 'http://www.wikidata.org/entity/Q199432')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P242'), ('relationName', 'locator map image'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/Italy%20on%20the%20globe%20%28Europe%20centered%29.svg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P244'), ('relationName', 'Library of Congress authority ID'), ('node', 'n79021783')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2573'), ('relationName', 'number of out-of-school children'), ('node', '178653')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2581'), ('relationName', 'BabelNet ID'), ('node', '00047705n')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2596'), ('relationName', 'culture'), ('node', 'http://www.wikidata.org/entity/Q1992919')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2633'), ('relationName', 'geography of topic'), ('node', 'http://www.wikidata.org/entity/Q216989')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2852'), ('relationName', 'emergency telephone number'), ('node', 'http://www.wikidata.org/entity/Q1061257')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2852'), ('relationName', 'emergency telephone number'), ('node', 'http://www.wikidata.org/entity/Q25648804')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2852'), ('relationName', 'emergency telephone number'), ('node', 'http://www.wikidata.org/entity/Q25648805')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2852'), ('relationName', 'emergency telephone number'), ('node', 'http://www.wikidata.org/entity/Q11185210')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2853'), ('relationName', 'electrical plug type'), ('node', 'http://www.wikidata.org/entity/Q1123613')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2853'), ('relationName', 'electrical plug type'), ('node', 'http://www.wikidata.org/entity/Q1378312')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2853'), ('relationName', 'electrical plug type'), ('node', 'http://www.wikidata.org/entity/Q1520890')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2855'), ('relationName', 'VAT-rate'), ('node', '22')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2884'), ('relationName', 'mains voltage'), ('node', '230')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2924'), ('relationName', 'Great Russian Encyclopedia Online ID'), ('node', '2026445')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33973')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33845')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33441')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q150')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q188')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33976')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q652')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q9063')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q1057898')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q14185')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q15085')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q15087')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q32724')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33754')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q612220')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q680517')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q777974')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q35754')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q36106')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q36202')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q36254')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q37053')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q33111')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q1075302')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q1641543')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q35348')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q375619')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q1145414')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q268130')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2936'), ('relationName', 'language used'), ('node', 'http://www.wikidata.org/entity/Q845441')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2950'), ('relationName', 'Nomisma ID'), ('node', 'italian_republic')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2950'), ('relationName', 'Nomisma ID'), ('node', 'italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2959'), ('relationName', 'permanent duplicated item'), ('node', 'http://www.wikidata.org/entity/Q20820609')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2959'), ('relationName', 'permanent duplicated item'), ('node', 'http://www.wikidata.org/entity/Q30277415')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P297'), ('relationName', 'ISO 3166-1 alpha-2 code'), ('node', 'IT')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2979'), ('relationName', 'maritime identification digits'), ('node', '247')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P298'), ('relationName', 'ISO 3166-1 alpha-3 code'), ('node', 'ITA')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2981'), ('relationName', 'UIC alphabetical country code'), ('node', 'I')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2982'), ('relationName', 'UIC numerical country code'), ('node', '83')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P299'), ('relationName', 'ISO 3166-1 numeric code'), ('node', '380')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P2997'), ('relationName', 'age of majority'), ('node', '18')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P30'), ('relationName', 'continent'), ('node', 'http://www.wikidata.org/entity/Q46')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3000'), ('relationName', 'marriageable age'), ('node', '16')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3000'), ('relationName', 'marriageable age'), ('node', '18')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3024'), ('relationName', 'ITU letter code'), ('node', 'I')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3067'), ('relationName', 'GS1 country code'), ('node', '800-839')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3068'), ('relationName', 'WIPO ST.3'), ('node', 'IT')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3097'), ('relationName', 'ISBN identifier group'), ('node', '978-88')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3097'), ('relationName', 'ISBN identifier group'), ('node', '979-12')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of'), ('node', 'http://www.wikidata.org/entity/Q3624078')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P31'), ('relationName', 'instance of'), ('node', 'http://www.wikidata.org/entity/Q6256')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3106'), ('relationName', 'Guardian topic ID'), ('node', 'world/italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3175'), ('relationName', 'Statoids ID'), ('node', 'uit')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3219'), ('relationName', 'Encyclopædia Universalis ID'), ('node', 'italie-vue-d-ensemble')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3221'), ('relationName', 'New York Times topic ID'), ('node', 'destination/italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3222'), ('relationName', 'NE.se ID'), ('node', 'italia')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3222'), ('relationName', 'NE.se ID'), ('node', 'italien')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3270'), ('relationName', 'compulsory education (minimum age)'), ('node', '6')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3271'), ('relationName', 'compulsory education (maximum age)'), ('node', '16')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3365'), ('relationName', 'Treccani ID'), ('node', 'italia')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3417'), ('relationName', 'Quora topic ID'), ('node', 'Italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3417'), ('relationName', 'Quora topic ID'), ('node', 'Italya')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3422'), ('relationName', 'INSEE countries and foreign territories code'), ('node', '99127')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3479'), ('relationName', 'Omni topic ID'), ('node', '147522ef37ba26fa349080740cbc56fce21227c1')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P349'), ('relationName', 'National Diet Library ID'), ('node', '00564289')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P35'), ('relationName', 'head of state'), ('node', 'http://www.wikidata.org/entity/Q3956186')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3509'), ('relationName', 'Dagens Nyheter topic ID'), ('node', 'italien')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3529'), ('relationName', 'median income'), ('node', '20085')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3553'), ('relationName', 'Zhihu topic ID'), ('node', '19571981')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P36'), ('relationName', 'capital'), ('node', 'http://www.wikidata.org/entity/Q220')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P361'), ('relationName', 'part of'), ('node', 'http://www.wikidata.org/entity/Q46')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3612'), ('relationName', 'Le Monde diplomatique subject ID'), ('node', 'pays/italie')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P37'), ('relationName', 'official language'), ('node', 'http://www.wikidata.org/entity/Q652')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P373'), ('relationName', 'Commons category'), ('node', 'Italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3743'), ('relationName', 'ITU/ISO/IEC object identifier'), ('node', '2.16.380')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P38'), ('relationName', 'currency'), ('node', 'http://www.wikidata.org/entity/Q4916')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3896'), ('relationName', 'geoshape'), ('node', 'http://commons.wikimedia.org/data/main/Data:Italia.map')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3911'), ('relationName', 'STW Thesaurus for Economics ID'), ('node', '17039-2')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3916'), ('relationName', 'UNESCO Thesaurus ID'), ('node', 'concept910')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P395'), ('relationName', 'licence plate code'), ('node', 'I')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3984'), ('relationName', 'subreddit'), ('node', 'it')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3984'), ('relationName', 'subreddit'), ('node', 'italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3987'), ('relationName', 'SHARE Catalogue author ID'), ('node', '440885')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P3987'), ('relationName', 'SHARE Catalogue author ID'), ('node', '423419')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P402'), ('relationName', 'OpenStreetMap relation ID'), ('node', '365331')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4073'), ('relationName', 'Fandom wiki ID'), ('node', 'italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P41'), ('relationName', 'flag image'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/Flag%20of%20Italy.svg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P417'), ('relationName', 'patron saint'), ('node', 'http://www.wikidata.org/entity/Q676555')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P417'), ('relationName', 'patron saint'), ('node', 'http://www.wikidata.org/entity/Q229190')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P421'), ('relationName', 'located in time zone'), ('node', 'http://www.wikidata.org/entity/Q5412122')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4342'), ('relationName', 'Store norske leksikon ID'), ('node', 'Italia')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4427'), ('relationName', 'GACS ID'), ('node', '547')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P443'), ('relationName', 'pronunciation audio'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/En-us-Italy.ogg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P443'), ('relationName', 'pronunciation audio'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/Fr-Italie.ogg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P443'), ('relationName', 'pronunciation audio'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/It-Italia.ogg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P443'), ('relationName', 'pronunciation audio'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/LL-Q7913%20%28ron%29-KlaudiuMihaila-Italia.wav')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P443'), ('relationName', 'pronunciation audio'), ('node', 'http://commons.wikimedia.org/wiki/Special:FilePath/Lb-Italien.ogg')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4527'), ('relationName', 'UK Parliament thesaurus ID'), ('node', '11075')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4613'), ('relationName', 'Encyclopedia of Modern Ukraine ID'), ('node', '12857')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q488981')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1153087')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q848633')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1043527')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1065')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1072120')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q123209')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q125761')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1377612')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q141720')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1480793')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q151991')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q161549')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q170424')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q17495')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q177773')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q188822')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q189946')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q191384')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q192177')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1928989')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1969730')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q19771')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q201054')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q233611')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q340195')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q37143')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q376150')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q3772571')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q386120')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q3866537')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q41550')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q41984')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q42262')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q42944')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q45177')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q458')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q47488')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q521227')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q54129')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q5611262')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q61923')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q656801')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q663492')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q689859')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7184')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7804')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7809')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7817')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7825')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q782942')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q81299')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q82151')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q826700')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q827525')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q842490')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q8475')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q8908')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q899770')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q132551')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q699036')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q176815')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q182000')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q7178')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q52847')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q605326')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q472311')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q309195')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1045198')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1374456')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1411881')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q1666759')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P463'), ('relationName', 'member of'), ('node', 'http://www.wikidata.org/entity/Q18816843')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4672'), ('relationName', 'EMLO location ID'), ('node', '6851bdbb-c4fa-4b58-8096-dd5153da907b')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4672'), ('relationName', 'EMLO location ID'), ('node', '68e102af-524a-4f20-8632-b5553c56dd5b')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q142')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q215')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q233')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q237')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q238')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q39')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P47'), ('relationName', 'shares border with'), ('node', 'http://www.wikidata.org/entity/Q40')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P474'), ('relationName', 'country calling code'), ('node', '+39')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4801'), ('relationName', 'LoC and MARC vocabularies ID'), ('node', 'countries/it')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P4841'), ('relationName', 'total fertility rate'), ('node', '1.39')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P486'), ('relationName', 'MeSH descriptor ID'), ('node', 'D007558')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P487'), ('relationName', 'Unicode character'), ('node', '🇮🇹')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5002'), ('relationName', 'Orthodox Encyclopedia ID'), ('node', '1237717')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5002'), ('relationName', 'Orthodox Encyclopedia ID'), ('node', '2033728')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5002'), ('relationName', 'Orthodox Encyclopedia ID'), ('node', '2040510')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5008'), ('relationName', 'on focus list of Wikimedia project'), ('node', 'http://www.wikidata.org/entity/Q54439832')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5008'), ('relationName', 'on focus list of Wikimedia project'), ('node', 'http://www.wikidata.org/entity/Q5460604')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5019'), ('relationName', 'Brockhaus Enzyklopädie online ID'), ('node', 'italien')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5063'), ('relationName', 'Interlingual Index ID'), ('node', 'i83107')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5125'), ('relationName', 'Wikimedia outline'), ('node', 'http://www.wikidata.org/entity/Q7112307')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5180'), ('relationName', 'CIVICUS Monitor country entry'), ('node', 'italy')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5198'), ('relationName', 'ASC Leiden Thesaurus ID'), ('node', '294918175')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5247'), ('relationName', 'Giant Bomb ID'), ('node', '3035-1451')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P5250'), ('relationName', 'IAB code'), ('node', '1326')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P530'), ('relationName', 'diplomatic relation'), ('node', 'http://www.wikidata.org/entity/Q1016')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P530'), ('relationName', 'diplomatic relation'), ('node', 'http://www.wikidata.org/entity/Q1045')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P530'), ('relationName', 'diplomatic relation'), ('node', 'http://www.wikidata.org/entity/Q114')]\n",
      "[('relation', 'http://www.wikidata.org/prop/direct/P530'), ('relationName', 'diplomatic relation'), ('node', 'http://www.wikidata.org/entity/Q115')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "300"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i find the relationships of a country using the country italy\n",
    "queryString = \"\"\"\n",
    "SELECT ?country ?relation ?relationName ?node\n",
    "WHERE { \n",
    "\n",
    " \n",
    "\n",
    "\n",
    "\n",
    "wd:Q38 ?relation ?node.\n",
    "\n",
    "?relation <http://schema.org/name> ?relationName.\n",
    "} \n",
    "LIMIT 300\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f108141e-9115-4386-8a0e-9f8e65d234ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "#i found the relationship member of trougth the BGP  P463 and the european unionwich has the BGP Q458"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1e44803d-9799-4b9a-b1cd-e1a3a3ce9b30",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "6b29ff02-83b1-47d9-874e-ec61ddcc04bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Patrick Buisson')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'René Bidal')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Stéphane Séjourné')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1369960'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Hugues Aubriot')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q354672'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Peter II of Courtenay')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q28964087'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Sophia Chikirou')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q51719'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Joscelin I, Count of Edessa')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q346'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Louis IX of France')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q165568'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'John XXII')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q65131729'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cname', 'France'), ('pname', 'Guillaume Lacroix')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Identify the BGP to retrieve E.U. countries and their politicians\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?politician ?country ?cname ?pname\n",
    "WHERE { \n",
    "?country wdt:P463 wd:Q458.\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 ?country.\n",
    "?country <http://schema.org/name> ?cname.\n",
    "?politician <http://schema.org/name> ?pname.\n",
    "}\n",
    "LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "58e3e323-ebcd-4911-9808-5badbf38f4a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'Ramon Coma i Casellas')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q99534387'), ('profession', 'http://www.wikidata.org/entity/Q703534'), ('professionname', 'employee'), ('pname', 'Claudine Rey')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Patrick Buisson')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Ramon Coma i Casellas')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Cristina López González')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Stéphane Séjourné')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q33133954'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Martin Speer')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q2531249'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Volker Riegger')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q28964087'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Sophia Chikirou')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q65131729'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Guillaume Lacroix')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Identify the BGP for obtaining other occupations and properties of politicians in the E.U. I'm assuming we are considering politicians inside the E.U.\n",
    "#this is the BGP for obtaining all the profession of the politicians\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?politician ?profession ?professionname ?pname\n",
    "WHERE { \n",
    "?country wdt:P463 wd:Q458.\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 ?country.\n",
    "?politician wdt:P106 ?profession.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "?politician <http://schema.org/name> ?pname.\n",
    "}\n",
    "LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4a2d517b-4893-42a6-860b-e75ba5a3daea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'member of political party'), ('propreties', 'http://www.wikidata.org/prop/direct/P102')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'second family name in Spanish name'), ('propreties', 'http://www.wikidata.org/prop/direct/P1950')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'Google Knowledge Graph ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2671')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'position held'), ('propreties', 'http://www.wikidata.org/prop/direct/P39')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'residence'), ('propreties', 'http://www.wikidata.org/prop/direct/P551')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q66775776'), ('professionname', 'commercial expert'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'member of political party'), ('propreties', 'http://www.wikidata.org/prop/direct/P102')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'member of political party'), ('propreties', 'http://www.wikidata.org/prop/direct/P102')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'member of political party'), ('propreties', 'http://www.wikidata.org/prop/direct/P102')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'native language'), ('propreties', 'http://www.wikidata.org/prop/direct/P103')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'employer'), ('propreties', 'http://www.wikidata.org/prop/direct/P108')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'employer'), ('propreties', 'http://www.wikidata.org/prop/direct/P108')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'MEP directory ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P1186')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'NUKAT ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P1207')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'award received'), ('propreties', 'http://www.wikidata.org/prop/direct/P166')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'image'), ('propreties', 'http://www.wikidata.org/prop/direct/P18')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'different from'), ('propreties', 'http://www.wikidata.org/prop/direct/P1889')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'second family name in Spanish name'), ('propreties', 'http://www.wikidata.org/prop/direct/P1950')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'second family name in Spanish name'), ('propreties', 'http://www.wikidata.org/prop/direct/P1950')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Twitter username'), ('propreties', 'http://www.wikidata.org/prop/direct/P2002')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Facebook ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2013')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'ISNI'), ('propreties', 'http://www.wikidata.org/prop/direct/P213')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'VIAF ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P214')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'VIAF ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P214')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'FAST ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2163')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'GND ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P227')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Library of Congress authority ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P244')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Google Knowledge Graph ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2671')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Google Knowledge Graph ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2671')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Bibliothèque nationale de France ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P268')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'IdRef ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P269')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Goodreads author ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2963')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'IMDb ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P345')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'candidacy in election'), ('propreties', 'http://www.wikidata.org/prop/direct/P3602')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Babelio author ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P3630')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'Commons category'), ('propreties', 'http://www.wikidata.org/prop/direct/P373')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'position held'), ('propreties', 'http://www.wikidata.org/prop/direct/P39')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'position held'), ('propreties', 'http://www.wikidata.org/prop/direct/P39')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'position held'), ('propreties', 'http://www.wikidata.org/prop/direct/P39')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', \"Who's Who in France biography ID\"), ('propreties', 'http://www.wikidata.org/prop/direct/P4124')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'LesBiographies.com ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P4434')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'LesBiographies.com ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P4434')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'unmarried partner'), ('propreties', 'http://www.wikidata.org/prop/direct/P451')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'member of'), ('propreties', 'http://www.wikidata.org/prop/direct/P463')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'residence'), ('propreties', 'http://www.wikidata.org/prop/direct/P551')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'residence'), ('propreties', 'http://www.wikidata.org/prop/direct/P551')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q19301647'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q8125919'), ('professionname', 'political adviser'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'award received'), ('propreties', 'http://www.wikidata.org/prop/direct/P166')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'image'), ('propreties', 'http://www.wikidata.org/prop/direct/P18')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'sex or gender'), ('propreties', 'http://www.wikidata.org/prop/direct/P21')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'Google Knowledge Graph ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2671')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'country of citizenship'), ('propreties', 'http://www.wikidata.org/prop/direct/P27')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'instance of'), ('propreties', 'http://www.wikidata.org/prop/direct/P31')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'position held'), ('propreties', 'http://www.wikidata.org/prop/direct/P39')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'LesBiographies.com ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P4434')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('profession', 'http://www.wikidata.org/entity/Q1285463'), ('professionname', 'prefect'), ('pname', 'date of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P569')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'member of political party'), ('propreties', 'http://www.wikidata.org/prop/direct/P102')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'occupation'), ('propreties', 'http://www.wikidata.org/prop/direct/P106')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'employer'), ('propreties', 'http://www.wikidata.org/prop/direct/P108')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'languages spoken, written or signed'), ('propreties', 'http://www.wikidata.org/prop/direct/P1412')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'place of birth'), ('propreties', 'http://www.wikidata.org/prop/direct/P19')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'second family name in Spanish name'), ('propreties', 'http://www.wikidata.org/prop/direct/P1950')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'Twitter username'), ('propreties', 'http://www.wikidata.org/prop/direct/P2002')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q21780326'), ('profession', 'http://www.wikidata.org/entity/Q5780518'), ('professionname', 'communicator'), ('pname', 'Facebook ID'), ('propreties', 'http://www.wikidata.org/prop/direct/P2013')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "100"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Identify the BGP for obtaining other occupations and properties of politicians in the E.U.\n",
    "#this is the BGP for obtaining all the profession of the politicians and all their other propreties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?politician ?profession ?professionname ?pname ?propreties\n",
    "WHERE { \n",
    "?country wdt:P463 wd:Q458.\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 ?country.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "?propreties <http://schema.org/name> ?pname.\n",
    "}\n",
    "LIMIT 100\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "1cf1a3b5-a067-4fe3-8f46-496e78b7d94d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '1302'), ('cname', 'Slovenia')]\n",
      "[('callret-0', '1452'), ('cname', 'Estonia')]\n",
      "[('callret-0', '5324'), ('cname', 'Poland')]\n",
      "[('callret-0', '2281'), ('cname', 'Czech Republic')]\n",
      "[('callret-0', '82748'), ('cname', 'France')]\n",
      "[('callret-0', '4471'), ('cname', 'Hungary')]\n",
      "[('callret-0', '33607'), ('cname', 'Spain')]\n",
      "[('callret-0', '8137'), ('cname', 'Belgium')]\n",
      "[('callret-0', '4859'), ('cname', 'Greece')]\n",
      "[('callret-0', '12411'), ('cname', 'United Kingdom')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#How many politicians are recorder for each E.U. country?\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT COUNT(?politician) ?cname\n",
    "WHERE { \n",
    "?country wdt:P463 wd:Q458.\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 ?country.\n",
    "\n",
    "\n",
    "\n",
    "?country <http://schema.org/name> ?cname.\n",
    "}GROUP BY(?cname)\n",
    "LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "08489bf6-5049-4626-8619-f0c563344f0f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q1654394'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q26251285'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q48321355'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q1369960'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q354672'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q28964087'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q51719'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q346'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q165568'), ('cname', 'France')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('politician', 'http://www.wikidata.org/entity/Q65131729'), ('cname', 'France')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "10"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#Are there EU politicians with double citizenship?\n",
    "#this returnthe politician whith the country look at the followings queries to find politicians whit double citizenship\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country  ?politician ?cname\n",
    "WHERE { \n",
    "?country wdt:P463 wd:Q458.\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 ?country.\n",
    "\n",
    "?country <http://schema.org/name> ?cname.\n",
    "}\n",
    "LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2f34e4f4-bbe7-484b-ac45-e8c0d3e36901",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "6ad11c39-7973-4330-8699-14412c6e555f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'head': {'link': [], 'vars': ['politician']},\n",
       " 'results': {'distinct': False,\n",
       "  'ordered': True,\n",
       "  'bindings': [{'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q211681'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q63886'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q480717'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q4721414'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q4977632'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q3108729'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q19276856'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q3434633'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q6514674'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q218270'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q99654415'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q63987238'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q63753450'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q5246470'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q98433663'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q5271209'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q1581488'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q5405855'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q55815836'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q22230789'}}]}}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#this return the politicians who have more than 1 citizenship\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?politician\n",
    "WHERE { \n",
    " ?politician wdt:P27 ?country.\n",
    " ?country wdt:P463 wd:Q458.\n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 ?country1.\n",
    " ?politician wdt:P27 ?country2.\n",
    " \n",
    "\n",
    "  \n",
    "\n",
    "  \n",
    "  \n",
    "  \n",
    " \n",
    "  FILTER(?country1!=?country2)\n",
    "}LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "0785849b-e496-4e8d-9610-f22bdcba325e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'head': {'link': []}, 'boolean': True}"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Are there EU politicians with double citizenship?\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "ASK WHERE{\n",
    "SELECT DISTINCT ?politician \n",
    "WHERE { \n",
    " ?politician wdt:P27 ?country.\n",
    " ?country wdt:P463 wd:Q458.\n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 ?country1.\n",
    " ?politician wdt:P27 ?country2.\n",
    " \n",
    "\n",
    "  \n",
    "\n",
    "  \n",
    "  \n",
    "  \n",
    " \n",
    "  FILTER(?country1!=?country2)\n",
    "\n",
    "\n",
    "} \n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15f12ff9-2782-4973-86c5-1bdab173ba4d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# What are the top-3 occupations for a politician in Italy and France?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "ba8d62fd-9daf-4c84-a998-ec0687197840",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('professionname', 'political adviser')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q48321355'), ('professionname', 'political adviser')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q28964087'), ('professionname', 'political adviser')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q65131729'), ('professionname', 'political adviser')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q28964087'), ('professionname', 'communications adviser')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q51719'), ('professionname', 'feudatory')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q721440'), ('professionname', 'feudatory')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('professionname', 'prefect')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q8772'), ('professionname', 'prefect')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1369960'), ('professionname', 'Intendant des finances')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q354672'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q51719'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q346'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q165568'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q516986'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q721440'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q365620'), ('professionname', 'ruler')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q51719'), ('professionname', 'monarch')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('professionname', 'political scientist')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q8772'), ('professionname', 'university teacher')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q8772'), ('professionname', 'physicist')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q8772'), ('professionname', 'mathematician')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1369960'), ('professionname', 'jurist')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('professionname', 'journalist')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('professionname', 'historian')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q8772'), ('professionname', 'historian')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q165568'), ('professionname', 'cleric')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q1654394'), ('professionname', 'film director')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q165568'), ('professionname', 'writer')]\n",
      "[('politician', 'http://www.wikidata.org/entity/Q26251285'), ('professionname', 'official')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "30"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#the BGP for italy is wd:Q38, the one for france is wd:Q142 already found in the first notebook\n",
    "#return politician and their occupation\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?politician ?professionname  \n",
    "WHERE {\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q142.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q38.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "\n",
    "}\n",
    "}\n",
    "LIMIT 30\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e116eb76-ffd9-4f8b-b8c4-64079cd081da",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('number', '91897'), ('professionname', 'politician')]\n",
      "[('number', '14819'), ('professionname', 'pensioner')]\n",
      "[('number', '5433'), ('professionname', 'anciens cadres')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#return the top profession for politicians in italy and france including the profession politician\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT COUNT(distinct ?politician) AS ?number ?professionname \n",
    "WHERE {\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q38.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "\n",
    "}\n",
    "UNION\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q142.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "\n",
    "}\n",
    "}GROUP BY (?professionname)\n",
    "ORDER BY DESC(?number)\n",
    "LIMIT 3\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "dc8adfe7-6b0d-4792-93d4-ede85df4eb57",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('number', '63602'), ('professionname', 'politician')]\n",
      "[('number', '14708'), ('professionname', 'pensioner')]\n",
      "[('number', '5433'), ('professionname', 'anciens cadres')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#What if you consider only politicians for which we don't have a date of death?\n",
    "#here i get the top profession for politicians who don't have a date of death whose BGP I found in the previous queries and it is P570\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT COUNT(distinct ?politician) AS ?number ?professionname \n",
    "WHERE {\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q38.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "FILTER NOT EXISTS{?politician wdt:P570 ?death}.\n",
    "}\n",
    "UNION\n",
    "{\n",
    "\n",
    "?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    "?politician wdt:P27 wd:Q142.\n",
    "?politician wdt:P106 ?profession.\n",
    "?politician ?propreties ?object.\n",
    "\n",
    "?profession <http://schema.org/name> ?professionname.\n",
    "FILTER NOT EXISTS{?politician wdt:P570 ?death}.\n",
    "}\n",
    "}GROUP BY (?professionname)\n",
    "ORDER BY DESC(?number)\n",
    "LIMIT 3\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a508b932-5af5-4d72-9001-6c3dc9f9ab2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Which politicians had a spouse that was also a politician? How many in each country? the BGP for spouse is P26 found in the previous queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "72f6813e-30cb-41e5-8492-d2f7f58932a0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed EndPointInternalError: endpoint returned code 500 and response. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 42000 Error TN...: Exceeded 1000000000 bytes in transitive temp memory.  use t_distinct, t_max or more T_MAX_memory options to limit the search or increase the pool\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-2a7c3e6009-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\n\\n\\nSELECT DISTINCT ?politician ?spouse\\nWHERE { \\n\\n  ?country wdt:P463 wd:Q458.\\n ?politician wdt:P106/wdt:P279* wd:Q82955  . \\n ?politician wdt:P27 ?country.\\n ?politician wdt:P26 ?spouse.\\n ?spouse wdt:P106/wdt:P279* wd:Q82955  .\\n \\n} \\nLIMIT 10\\n'\n"
     ]
    }
   ],
   "source": [
    "#SBAGLIATA VAI ALLA PROSSIMA\n",
    "#Which politicians had a spouse that was also a politician? I return the EU politician which have a spouse which is also a politician\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?politician ?spouse\n",
    "WHERE { \n",
    "\n",
    "  ?country wdt:P463 wd:Q458.\n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 ?country.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* wd:Q82955  .\n",
    " \n",
    "} \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a7c9a314-5469-4b8e-ab16-d4964f1d1cfe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed timed out\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#penso sia corretta ma ci mette troppo tempo rifare\n",
    "#VAI ALLA PROSSIMA\n",
    "#Which politicians had a spouse that was also a politician, How many in each country?\n",
    "\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT COUNT(?politician) ?country\n",
    "WHERE { \n",
    "\n",
    "  ?country wdt:P463 wd:Q458.\n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 ?country.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* ?profession  .\n",
    " FILTER(?profession=wd:Q82955)\n",
    "} GROUP BY (?country)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "d50cfc36-089a-4603-bff6-d68abbe5bd5a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed EndPointInternalError: endpoint returned code 500 and response. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 42000 Error TN...: Exceeded 1000000000 bytes in transitive temp memory.  use t_distinct, t_max or more T_MAX_memory options to limit the search or increase the pool\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-2a7c3e6009-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\n\\n\\nSELECT DISTINCT COUNT(distinct ?politician) ?country\\nWHERE { \\n\\n ?country wdt:P463 wd:Q458.\\n ?politician wdt:P106/wdt:P279* wd:Q82955  . \\n ?politician wdt:P27 ?country.\\n ?politician wdt:P26 ?spouse.\\n ?spouse wdt:P106/wdt:P279* wd:Q82955  .\\n \\n} GROUP BY (?country)\\nLIMIT 10\\n'\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#Which politicians had a spouse that was also a politician, How many in each country?\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT COUNT(distinct ?politician) ?country\n",
    "WHERE { \n",
    "\n",
    " ?country wdt:P463 wd:Q458.\n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 ?country.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* wd:Q82955  .\n",
    " \n",
    "} GROUP BY (?country)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "36567e69-51f2-4ae5-9be7-6c2cac1725d9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed EndPointInternalError: endpoint returned code 500 and response. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 42000 Error TN...: Exceeded 1000000000 bytes in transitive temp memory.  use t_distinct, t_max or more T_MAX_memory options to limit the search or increase the pool\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-2a7c3e6009-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\n\\n\\nSELECT DISTINCT ?politician\\nWHERE { \\n\\n  \\n ?politician wdt:P106/wdt:P279* wd:Q82955  . \\n \\n ?politician wdt:P26 ?spouse.\\n ?spouse wdt:P106/wdt:P279* wd:Q82955  .\\n \\n} \\nLIMIT 1\\n'\n"
     ]
    }
   ],
   "source": [
    "#here i try to get the politician who have a spouse which is also a politician\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?politician\n",
    "WHERE { \n",
    "\n",
    "  \n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " \n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* wd:Q82955  .\n",
    " \n",
    "} \n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4c3967ad-6a4f-4af7-a1f5-c11154a2f2e5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'head': {'link': [], 'vars': ['number']},\n",
       " 'results': {'distinct': False,\n",
       "  'ordered': True,\n",
       "  'bindings': [{'number': {'type': 'typed-literal',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#integer',\n",
       "     'value': '78'}}]}}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i get the number of italian politician who get a spouse which was also a politician\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT COUNT(?politician) AS ?number{\n",
    "SELECT DISTINCT ?politician\n",
    "WHERE { \n",
    "\n",
    "\n",
    " \n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 wd:Q38.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* wd:Q82955  .\n",
    " \n",
    "} \n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8c0d223e-bce6-43c5-8dca-6d0b3dba9f1c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'head': {'link': [], 'vars': ['politician']},\n",
       " 'results': {'distinct': False,\n",
       "  'ordered': True,\n",
       "  'bindings': [{'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q721440'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q354672'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q3291630'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q99535161'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q99534387'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q16948142'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q577795'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q2105'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q517'}},\n",
       "   {'politician': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q223771'}}]}}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#here i get the French politician who get a spouse which was also a politician\n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "\n",
    "SELECT DISTINCT ?politician\n",
    "WHERE { \n",
    "\n",
    "\n",
    " \n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 wd:Q142.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " ?spouse wdt:P106/wdt:P279* wd:Q82955  .\n",
    " \n",
    " \n",
    "}LIMIT 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "14f6f60c-f442-45e0-8b32-0dad6bb5dd04",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed EndPointInternalError: endpoint returned code 500 and response. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 42000 Error TN...: Exceeded 1000000000 bytes in transitive temp memory.  use t_distinct, t_max or more T_MAX_memory options to limit the search or increase the pool\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-2a7c3e6009-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\n\\nSELECT COUNT(?politician) AS ?number{\\nSELECT DISTINCT ?politician\\nWHERE { \\n\\n\\n \\n ?politician wdt:P106/wdt:P279* wd:Q82955  . \\n ?politician wdt:P27 wd:Q142.\\n ?politician wdt:P26 ?spouse.\\n \\n \\n FILTER EXISTS   {?spouse wdt:P106/wdt:P279* wd:Q82955  .}\\n}\\n}\\n'\n"
     ]
    }
   ],
   "source": [
    "#here i get the number of french politicin who have a spouse which is also a politician\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT COUNT(?politician) AS ?number{\n",
    "SELECT DISTINCT ?politician\n",
    "WHERE { \n",
    "\n",
    "\n",
    " \n",
    " ?politician wdt:P106/wdt:P279* wd:Q82955  . \n",
    " ?politician wdt:P27 wd:Q142.\n",
    " ?politician wdt:P26 ?spouse.\n",
    " \n",
    " \n",
    " FILTER EXISTS   {?spouse wdt:P106/wdt:P279* wd:Q82955  .}\n",
    "}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_ask_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b9f3794-0071-4587-bc64-4f7e9163309f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
