{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "9c0b087e",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f60f5932",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-3cae106501-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "208bc5ed",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Cultural Movements explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the cultural movements, in particular the Renaissance, Baroque and Romanticsm. We'd like to get an overview of the main artists belonging to these movements, musicians, poets, sculptors and painters."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ebe58f1",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q37562`| Donatello    | node |\n",
    "| `wd:Q19675`| Louvre Museum | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fae6cbde",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q37562 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Donatello**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for Cultural Movement\n",
    "\n",
    "2. Identify the BGP for Renassaince, Baroque and Romanticism\n",
    "\n",
    "3. Identify the BGP for composer, painter, sculptor and poet\n",
    "\n",
    "4. Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)\n",
    "\n",
    "5. Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures).\n",
    "\n",
    "6. For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets).\n",
    "\n",
    "7. Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e84e32a2",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 1\n",
    "Identify the BGP for Cultural Movement"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a14d4e5a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('name', 'work location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9493'), ('name', 'artist files at')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "# I explore the node donatello to see what properties has. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1583069-7aa7-40c4-9b04-bd2d52fe9198",
   "metadata": {},
   "source": [
    "With this result, I am going to try and see what properties has "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "9ce06571-ce2e-47f1-9cf9-57a656b3cba5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P129'), ('name', 'physically interacts with')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1542'), ('name', 'has effect')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('name', 'studied by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2670'), ('name', 'has parts of the class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4733'), ('name', 'produced sound')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5555'), ('name', 'schematic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8972'), ('name', 'small logo or icon')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8512'), ('name', 'size comparison diagram')]\n",
      "29\n"
     ]
    }
   ],
   "source": [
    "# I explore the node, human, to see his properties. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q5 ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "18c83221-49d3-4ef2-b04d-3ea5db99c5e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1659'), ('name', 'see also')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1629'), ('name', 'Wikidata item of this property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1855'), ('name', 'Wikidata property example')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2302'), ('name', 'property constraint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2875'), ('name', 'property usage tracking category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3734'), ('name', 'category for value same as Wikidata')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7087'), ('name', 'inverse label item')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# I am going to look for the properties of movement. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:P135 ?p ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "3d43700b-d224-4e3a-b0d5-721168a1e9bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1472236'), ('iname', 'Early Renaissance')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1474884'), ('iname', 'High Renaissance')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# I explore movements on Donatello to see the values for him. \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   ?obj wdt:P135 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "f3233bda-0265-4c1a-a0d8-8ed0ca2d7bc7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "# I look for the values of high renaissance, one of the values from the previus query. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1474884 ?p ?obj .\n",
    "   \n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "6d87e7df-339e-4e7b-a065-493c6389bdc2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2198855'), ('iname', 'cultural movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q32880'), ('iname', 'architectural style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q968159'), ('iname', 'art movement')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('iname', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167836'), ('iname', 'Wikimedia category')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11514315'), ('iname', 'historical period')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1292119'), ('iname', 'style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3533467'), ('iname', 'group action')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('iname', 'concept')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# On this query, I am going to look from who it's instance High Renaissance \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1474884 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "65b8fa37-05ab-471e-8ac4-3e2abdfdbd92",
   "metadata": {},
   "source": [
    "I found cultural movement so that is the final query. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "52fc9b77",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "854e0e7f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2198855'), ('iname', 'cultural movement')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1474884 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst .\n",
    "   \n",
    "   #I use \"values\" to only show the value from cultural movement wich I've got from the previous query. \n",
    "   VALUES ?inst { wd:Q2198855 } \n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1121f2a",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 2\n",
    "Identify the BGP for Renassaince, Baroque and Romanticism"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "e6d434b0-0c29-4461-8ead-d4d7a2509660",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q8210150'), ('name', 'Avanzada Regia')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q211481'), ('name', 'Dogme 95')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q2046861'), ('name', 'Palaeologan Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1400430'), ('name', 'Macedonian Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q430167'), ('name', 'Spanish Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1814286'), ('name', 'Young Estonia')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q2614483'), ('name', 'Pre-romanticism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q39427'), ('name', 'surrealism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q2349908'), ('name', 'French Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q878985'), ('name', 'modernism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q466887'), ('name', 'Belle Époque')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q12539'), ('name', 'Age of Enlightenment')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q265581'), ('name', 'fin de siècle')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q42865'), ('name', 'Orientalism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q934618'), ('name', 'Danish Golden Age')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3488076'), ('name', 'La Sape')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q3083331'), ('name', 'Andean Baroque')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1753636'), ('name', 'Gilded Age')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q131808'), ('name', 'Mannerism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q1404472'), ('name', 'Italian Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q751880'), ('name', 'japonism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q620629'), ('name', 'deism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q744738'), ('name', 'encyclopédistes')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q863679'), ('name', 'chinoiserie')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q4745501'), ('name', 'American modernism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q164800'), ('name', 'Symbolism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q5653011'), ('name', 'North Group')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# I explore the instances of Curtural Movement\n",
    "queryString = \"\"\"\n",
    "SELECT ?item ?name \n",
    "WHERE {\n",
    "  \n",
    "   ?item wdt:P31 wd:Q2198855. #all items that hace instance of- with the value Q2198855 \"cultural movement\" \n",
    "   # get the label\n",
    "   ?item sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8d0605ea",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "58390911-3268-4ff8-af50-377dde604966",
   "metadata": {},
   "source": [
    "I found out with the last query the 3 BGPs that I was looking for. So now I filter to only show the ones that we want. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "a4436a06-b026-4189-8574-79db2c502165",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('item', 'http://www.wikidata.org/entity/Q37068'), ('name', 'Romanticism')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q37853'), ('name', 'Baroque')]\n",
      "[('item', 'http://www.wikidata.org/entity/Q4692'), ('name', 'Renaissance')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# I explore the instances of Curtural Movement\n",
    "queryString = \"\"\"\n",
    "SELECT ?item ?name \n",
    "WHERE {\n",
    "  \n",
    "   ?item wdt:P31 wd:Q2198855. #all items that hace instance of- with the value Q2198855 \"cultural movement\" \n",
    "   \n",
    "   VALUES ?item {\n",
    "   wd:Q4692 #Renaissance\n",
    "   wd:Q37853 #Baroque\n",
    "   wd:Q37068 #Romanticism\n",
    "   }\n",
    "   # get the label\n",
    "   ?item sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13b5393b",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 3\n",
    "Identify the BGP for composer, painter, sculptor and poet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "85babdb0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('name', 'work location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9493'), ('name', 'artist files at')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "#I start looking for the identifier for the property occupation in donatello \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "6f8ad43b-fed9-47d4-b9e7-727e5adda6db",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1028181'), ('iname', 'painter')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1281618'), ('iname', 'sculptor')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1281618'), ('iname', 'sculptor')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1281618'), ('iname', 'sculptor')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q42973'), ('iname', 'architect')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1708232'), ('iname', 'medalist')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#now that I have the value for the property of occupation, I look for the values for donatello\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   ?obj wdt:P106 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "17b1b21c-8cdc-4f0f-ac06-3cddfa56d07b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1709'), ('name', 'equivalent class')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3847'), ('name', 'Open Library subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P417'), ('name', 'patron saint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4946'), ('name', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5844'), ('name', 'Treccani Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8785'), ('name', 'AniDB tag ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "33\n"
     ]
    }
   ],
   "source": [
    "#I Look for all the properties of painter\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1028181 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "ad149a56-86f6-4407-94ca-c3f0c05a0952",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5'), ('iname', 'human')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19887878'), ('iname', 'Wikimedia infobox template')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1799072'), ('iname', 'method')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q97584729'), ('iname', 'Wikidata property related to biographical dictionaries')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1792644'), ('iname', 'art style')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q55653847'), ('iname', 'Wikidata property for authority control for artists')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('iname', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167836'), ('iname', 'Wikimedia category')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24017414'), ('iname', 'second-order class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167410'), ('iname', 'Wikimedia disambiguation page')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11266439'), ('iname', 'Wikimedia template')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q88789639'), ('iname', 'artistic profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1437361'), ('iname', 'form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56055944'), ('iname', 'art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q214609'), ('iname', 'material')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30432511'), ('iname', 'metacategory in Wikimedia projects')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108300140'), ('iname', 'occupation group according to ISCO')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1231896'), ('iname', 'painting technique')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3300034'), ('iname', 'painting material')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('iname', 'concept')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Now I try to find all the instances of painter\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1028181 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "0923460c-8f7d-4e86-bfbf-17ffbfa1e86b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1282'), ('name', 'OpenStreetMap tag or key')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4801'), ('name', 'LoC and MARC vocabularies ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4946'), ('name', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8785'), ('name', 'AniDB tag ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2521'), ('name', 'female form of label')]\n",
      "32\n"
     ]
    }
   ],
   "source": [
    "#I'm going to look now the properties from sculpor\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1281618 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "b51054bd-b532-47d6-b17c-b256cfc6bd74",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q59542487'), ('iname', 'Wikimedia set category')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19887878'), ('iname', 'Wikimedia infobox template')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1799072'), ('iname', 'method')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3331189'), ('iname', 'version, edition, or translation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('iname', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24017414'), ('iname', 'second-order class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q66666236'), ('iname', 'Wikimedia list of persons by occupation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11266439'), ('iname', 'Wikimedia template')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q88789639'), ('iname', 'artistic profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56055944'), ('iname', 'art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30432511'), ('iname', 'metacategory in Wikimedia projects')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108300140'), ('iname', 'occupation group according to ISCO')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('iname', 'concept')]\n",
      "13\n"
     ]
    }
   ],
   "source": [
    "#all the instances of sculpor\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1281618 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "4bb5b15f-d6d0-4df2-9d41-3dbc752a98c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1014'), ('name', 'Art & Architecture Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1282'), ('name', 'OpenStreetMap tag or key')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('name', 'Wikidata property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P417'), ('name', 'patron saint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4212'), ('name', 'PACTOLS thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4801'), ('name', 'LoC and MARC vocabularies ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4946'), ('name', 'Library of Congress Demographic Group Terms ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5198'), ('name', 'ASC Leiden Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6293'), ('name', 'YSA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6900'), ('name', 'NicoNicoPedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8406'), ('name', 'Grove Art Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9106'), ('name', 'Oxford Classical Dictionary ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1022'), ('name', 'CNO-11 occupation code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1043'), ('name', 'IDEO Job ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8629'), ('name', 'Occupational Outlook Handbook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P867'), ('name', 'ROME Occupation Code (v3)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P919'), ('name', 'SOC Code (2010)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P952'), ('name', 'ISCO-88 occupation code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8679'), ('name', 'Dictionary of Occupational Titles Code (fourth edition, revised)')]\n",
      "52\n"
     ]
    }
   ],
   "source": [
    "# Now all the properties of architect \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q42973 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "fbdfc6fb-9b4c-47be-8541-b0d2377310c9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q5'), ('iname', 'human')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21070568'), ('iname', 'human who may be fictional')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28640'), ('iname', 'profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19887878'), ('iname', 'Wikimedia infobox template')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q97584729'), ('iname', 'Wikidata property related to biographical dictionaries')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q21745557'), ('iname', 'Wikidata property to identify organizations')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q187588'), ('iname', 'social class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q17152639'), ('iname', 'thesaurus')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56216473'), ('iname', 'Wikidata property for authority control for architects')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q11862829'), ('iname', 'academic discipline')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q19361238'), ('iname', 'Wikidata metaclass')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4167836'), ('iname', 'Wikimedia category')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1047113'), ('iname', 'specialty')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q46275839'), ('iname', 'Wikidata property related to theater')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q64264420'), ('iname', 'Wikidata property related to Christianity')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q7094076'), ('iname', 'online database')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24017414'), ('iname', 'second-order class')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3958441'), ('iname', 'economic sector')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q309100'), ('iname', 'planning')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28916621'), ('iname', 'Wikidata property to identify architectural structures')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q12737077'), ('iname', 'occupation')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q62589316'), ('iname', 'Wikidata property for an identifier that suggests notability')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8148'), ('iname', 'industry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1580166'), ('iname', 'dictionary entry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q88789639'), ('iname', 'artistic profession')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15647814'), ('iname', 'Wikimedia administration category')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q13582682'), ('iname', 'classification')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q56055944'), ('iname', 'art form')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q20643955'), ('iname', 'human biblical figure')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q10389811'), ('iname', 'reference work entry')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1469824'), ('iname', 'controlled vocabulary')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q24075706'), ('iname', 'Wikidata property for authority control, with reciprocal use of Wikidata')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30432511'), ('iname', 'metacategory in Wikimedia projects')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q8187769'), ('iname', 'economic activity')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43831109'), ('iname', 'Wikidata property related to architecture')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q108300140'), ('iname', 'occupation group according to ISCO')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q151885'), ('iname', 'concept')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q18618644'), ('iname', 'Wikidata property for items about works')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "#all the instaces of architect \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q42973 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "028e3df0-551d-4641-9845-3e2dcbc71e97",
   "metadata": {},
   "source": [
    "I see that that 3 occupations have one instance in common, artistic profession, so I am going to try and look for all the occupations form artistic profession. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "115ec3ae-bc16-40b2-b3e2-f58676449116",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1799072'), ('iname', 'method')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q828962'), ('iname', 'job classification system')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#Q108300140\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q108300140 ?p ?obj .\n",
    "   ?obj wdt:P31 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "GROUP BY ?inst ?iname\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "77eb92fb-b3aa-49c2-9177-e1b387898576",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q98552221'), ('occupationsName', 'plastic artist')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q3391743'), ('occupationsName', 'visual artist')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q280447'), ('occupationsName', 'Carnivalesque')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q108596703'), ('occupationsName', 'urushi artist')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q108605121'), ('occupationsName', 'dye artist')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q40749908'), ('occupationsName', 'bronze sculptor')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q106669359'), ('occupationsName', 'interdisciplinary artist')]\n",
      "[('occupations', 'http://www.wikidata.org/entity/Q56299528'), ('occupationsName', 'bonsai artist')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "#All the instance from artistic profession \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupations ?occupationsName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?occupations wdt:P31 wd:Q88789639 . \n",
    "    \n",
    "   # get the label \n",
    "   ?occupations sc:name ?occupationsName . \n",
    "   \n",
    "   \n",
    "}\n",
    "#ORDER BY ASC (?occupationsName)\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d0000147-ac67-4ffa-8e19-4b4e3481c915",
   "metadata": {},
   "source": [
    "With the last queries didn't worked, I am going to try to find the occupations through the people that belong to the movements like donatello. and see if I can get it through this path. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "28b6a825-6155-4eeb-b11f-8bdab6fbf50a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('artist', 'http://www.wikidata.org/entity/Q12222083'), ('artistName', \"'A'isha al-Ba'uniyya\")]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q182800'), ('artistName', 'A. B. Shah')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q278583'), ('artistName', 'A. C. Grayling')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q399986'), ('artistName', 'A. D. Gordon')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q55524030'), ('artistName', 'A. D. Painter')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3600312'), ('artistName', 'A. D. Winans')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q315059'), ('artistName', 'A. E. van Vogt')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q243757'), ('artistName', 'A. J. Ayer')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q179059'), ('artistName', 'A. J. Cronin')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q278872'), ('artistName', 'A. L. Kennedy')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q720153'), ('artistName', 'A. Philip Randolph')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q279088'), ('artistName', 'A. R. Penck')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q107650462'), ('artistName', 'A. Wilfrid Johns')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q4649967'), ('artistName', 'AA Bronson')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q43549329'), ('artistName', 'AFM Khalid Hossain')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q300786'), ('artistName', 'Aafia Siddiqui')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q45011'), ('artistName', 'Aarno Ruusuvuori')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q4661858'), ('artistName', 'Aaron Bohrod')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q4661979'), ('artistName', 'Aaron Douglas')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q4662288'), ('artistName', 'Aaron Naparstek')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#I'll try to show all the people that has the property movement. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?artist ?artistName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?artist wdt:P31 wd:Q5 . #all instance of human \n",
    "   ?artist wdt:P135 ?m. #all that has the property movement.   \n",
    "   # get the label \n",
    "   ?artist sc:name ?artistName . \n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?artistName)\n",
    "LIMIT 20 #I put the limit because there's gonna be a huge amount of people. \n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8bdff3dd-b33a-456d-b947-9aaa227c13fc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('artist', 'http://www.wikidata.org/entity/Q2782415'), ('artistName', 'Achille Falcone')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3606113'), ('artistName', 'Aert Mijtens')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q395689'), ('artistName', 'Agostino Nifo')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5660492'), ('artistName', 'Agustí Pujol')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3615832'), ('artistName', 'Andrea Marone')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q283580'), ('artistName', 'Andrea Riccio')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q495110'), ('artistName', 'Andrea Solari')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q183458'), ('artistName', 'Andrea del Verrocchio')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q195655'), ('artistName', 'Andrea della Robbia')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q2849524'), ('artistName', 'Angelo di Costanzo')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q941609'), ('artistName', 'Antonio Badile')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3620091'), ('artistName', 'Antonio Riccoboni')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q605447'), ('artistName', 'Antonio Tempesta')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q217547'), ('artistName', 'Antonio Urceo')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q8457'), ('artistName', 'Antonio da Correggio')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q4525915'), ('artistName', 'Auguste Chaudet')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q531677'), ('artistName', 'Bartholomäus Zeitblom')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q55225153'), ('artistName', 'Bartolomeo Arnigio')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Now I get only the ones of the movement Renaissance (Q4692), I get the identifier from previous tasks. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?artist ?artistName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?artist wdt:P31 wd:Q5 . #all instance of human \n",
    "   ?artist wdt:P135 wd:Q4692 . #all that has the property movement.   \n",
    "   # get the label \n",
    "   ?artist sc:name ?artistName . \n",
    "   \n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?artistName)\n",
    "LIMIT 20 #I put the limit because there's gonna be a huge amount of people. \n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "910eadd8-7f6d-4f9b-9323-ad87f82a4164",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('artist', 'http://www.wikidata.org/entity/Q2782415'), ('artistName', 'Achille Falcone'), ('occupationsName', 'composer')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis'), ('occupationsName', 'painter')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis'), ('occupationsName', 'engraver')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis'), ('occupationsName', 'photographer')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis'), ('occupationsName', 'illustrator')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q1115404'), ('artistName', 'Adolfo de Carolis'), ('occupationsName', 'fashion figure artist')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3606113'), ('artistName', 'Aert Mijtens'), ('occupationsName', 'painter')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q395689'), ('artistName', 'Agostino Nifo'), ('occupationsName', 'university teacher')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q395689'), ('artistName', 'Agostino Nifo'), ('occupationsName', 'writer')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q395689'), ('artistName', 'Agostino Nifo'), ('occupationsName', 'philosopher')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5660492'), ('artistName', 'Agustí Pujol'), ('occupationsName', 'sculptor')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'painter')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'printmaker')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'sculptor')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'copperplate engraver')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'drawer')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q5681'), ('artistName', 'Andrea Mantegna'), ('occupationsName', 'illuminator')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q3615832'), ('artistName', 'Andrea Marone'), ('occupationsName', 'poet')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q283580'), ('artistName', 'Andrea Riccio'), ('occupationsName', 'sculptor')]\n",
      "[('artist', 'http://www.wikidata.org/entity/Q283580'), ('artistName', 'Andrea Riccio'), ('occupationsName', 'architect')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#The next step now that I have all the artists from that period is to get the occupations \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?artist ?artistName ?occupationsName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?artist wdt:P31 wd:Q5 . #all instance of human \n",
    "   ?artist wdt:P135 wd:Q4692 . #all that has the property movement. \n",
    "   ?artist wdt:P106 ?occupation . \n",
    "   \n",
    "   # get the label \n",
    "   ?artist sc:name ?artistName . \n",
    "   ?occupation sc:name ?occupationsName .\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?artistName)\n",
    "LIMIT 20 #I put the limit because there's gonna be a huge amount of people. \n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b96402f0-e3c5-422f-91f3-914bb0a18d37",
   "metadata": {},
   "source": [
    "On the first 20 people we can already see all the professions that we were looking for, so lets resume that. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b7c81406-ae41-4636-9245-e3ae3d07c0b2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q90878511'), ('occupationsName', 'Carmelite friar')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q250867'), ('occupationsName', 'Catholic priest')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1636680'), ('occupationsName', 'Renaissance humanist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q21550346'), ('occupationsName', 'aesthetician')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q42973'), ('occupationsName', 'architect')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1792450'), ('occupationsName', 'art historian')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q17391638'), ('occupationsName', 'art theorist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1294787'), ('occupationsName', 'artisan')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q483501'), ('occupationsName', 'artist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q155647'), ('occupationsName', 'astrologer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q11063'), ('occupationsName', 'astronomer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q864380'), ('occupationsName', 'biographer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q559597'), ('occupationsName', 'cabinetmaker')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1734662'), ('occupationsName', 'cartographer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1840507'), ('occupationsName', 'carver')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q7541856'), ('occupationsName', 'ceramicist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationsName', 'composer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q13365770'), ('occupationsName', 'copperplate engraver')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q5322166'), ('occupationsName', 'designer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q193391'), ('occupationsName', 'diplomat')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q14623005'), ('occupationsName', 'draftsperson')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q15296811'), ('occupationsName', 'drawer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q329439'), ('occupationsName', 'engraver')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q3744886'), ('occupationsName', 'fashion figure artist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q22669155'), ('occupationsName', 'fresco painter')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q25339110'), ('occupationsName', 'full professor')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q211423'), ('occupationsName', 'goldsmith')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q15991187'), ('occupationsName', 'grammarian')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1925963'), ('occupationsName', 'graphic artist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q201788'), ('occupationsName', 'historian')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q998628'), ('occupationsName', 'illuminator')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q644687'), ('occupationsName', 'illustrator')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q185351'), ('occupationsName', 'jurist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q215793'), ('occupationsName', 'kapellmeister')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q14467526'), ('occupationsName', 'linguist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q6673651'), ('occupationsName', 'literary')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q4263842'), ('occupationsName', 'literary critic')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q13570226'), ('occupationsName', 'literary historian')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q21166956'), ('occupationsName', 'lutenist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q30185'), ('occupationsName', 'mayor')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1708232'), ('occupationsName', 'medalist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q733786'), ('occupationsName', 'monk')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q282718'), ('occupationsName', 'mosaicist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q16031530'), ('occupationsName', 'music theorist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q639669'), ('occupationsName', 'musician')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q14915627'), ('occupationsName', 'musicologist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationsName', 'painter')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q13418253'), ('occupationsName', 'philologist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q4964182'), ('occupationsName', 'philosopher')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q33231'), ('occupationsName', 'photographer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q39631'), ('occupationsName', 'physician')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q214917'), ('occupationsName', 'playwright')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q49757'), ('occupationsName', 'poet')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1209498'), ('occupationsName', 'poet lawyer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q82955'), ('occupationsName', 'politician')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q42603'), ('occupationsName', 'priest')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q11569986'), ('occupationsName', 'printmaker')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q24205162'), ('occupationsName', 'printseller')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q2516866'), ('occupationsName', 'publisher')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q2504617'), ('occupationsName', 'romanist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1281618'), ('occupationsName', 'sculptor')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q2216340'), ('occupationsName', 'silversmith')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q177220'), ('occupationsName', 'singer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q37226'), ('occupationsName', 'teacher')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1234713'), ('occupationsName', 'theologian')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q333634'), ('occupationsName', 'translator')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1229025'), ('occupationsName', 'typographer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1622272'), ('occupationsName', 'university teacher')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q3391743'), ('occupationsName', 'visual artist')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q157798'), ('occupationsName', 'watchmaker')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36180'), ('occupationsName', 'writer')]\n",
      "71\n"
     ]
    }
   ],
   "source": [
    "#Now I change the query to only get the occupation and that each ocupation only will be show one time. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupation ?occupationsName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?artist wdt:P31 wd:Q5 . #all instance of human \n",
    "   ?artist wdt:P135 wd:Q4692 . #all that has the property movement. \n",
    "   ?artist wdt:P106 ?occupation . #the value from occupation on the variable ?occupation \n",
    "   \n",
    "   # get the label \n",
    "   \n",
    "   ?occupation sc:name ?occupationsName .\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?occupationsName)\n",
    "LIMIT 200\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9ff3c35b-d581-4640-8e57-68b0cd698d3c",
   "metadata": {},
   "source": [
    "We've got all the occupations from that period and we found there the ones that we've been looking for, so we filter to get only that ones"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fb636aab",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "027470bd-5b8c-442b-a133-bedf686428a9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationsName', 'composer')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationsName', 'painter')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q49757'), ('occupationsName', 'poet')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1281618'), ('occupationsName', 'sculptor')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#Now we change the last query to show only composer (Q36834), painter (Q1028181), sculpor (Q1281618) and poet (Q49757) . \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupation ?occupationsName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   ?artist wdt:P31 wd:Q5 . #all instance of human \n",
    "   ?artist wdt:P135 wd:Q4692 . #all that has the property movement. \n",
    "   ?artist wdt:P106 ?occupation . \n",
    "   \n",
    "   VALUES ?occupation {wd:Q36834 wd:Q1028181 wd:Q1281618 wd:Q49757 } #This limit the values for ?occupation to only the ones between the brackets. \n",
    "   \n",
    "   # get the label \n",
    "   \n",
    "   ?occupation sc:name ?occupationsName .\n",
    "   \n",
    "}\n",
    "ORDER BY ASC (?occupationsName)\n",
    "LIMIT 200\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "35a97bcf",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Consider Renaissance, Baroque and Romanticism. Find how many composers, painters, sculptors and poets belong to those cultural movements (the results set must be a list of triples movement, job, #people)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "54b6de14-d994-4d5e-802d-76137e978154",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('painters', 'http://www.wikidata.org/entity/Q21647924'), ('paintersName', '\"Tattoo Jack\" Cripe')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q98971886'), ('paintersName', \"'Abbas Kowsari\")]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q12817104'), ('paintersName', \"'Abd Allah Musawwir\")]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q13422938'), ('paintersName', \"'Abd al-Hayy\")]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q28465157'), ('paintersName', \"'the other' Jan van Kessel\")]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q21452732'), ('paintersName', '(Agnes) Mabel Mackinlay')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q59369592'), ('paintersName', '(Américo ?) Aragundo (Aragunde)')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q18608042'), ('paintersName', '(B.?) van Kessel')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q28720006'), ('paintersName', '(C. or O. ) Williams')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q41784927'), ('paintersName', '(Robert) Reuben Cole')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q21463256'), ('paintersName', '(Walter) Bertram Potter')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q1141445'), ('paintersName', '108')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q99529391'), ('paintersName', '2dmaxo/Olu Ajayi')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q86818374'), ('paintersName', '3 Persons from Mali')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q4656945'), ('paintersName', 'A Ge')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q4657536'), ('paintersName', 'A K Dolven')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q76339407'), ('paintersName', 'A M Phillips')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q28728323'), ('paintersName', 'A Robert Pullin')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q83702747'), ('paintersName', 'A Ryyppö')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q28728332'), ('paintersName', 'A Shelley')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q106688917'), ('paintersName', 'A Steenbeek')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q105044104'), ('paintersName', 'A-One')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q2818868'), ('paintersName', 'A-Sun Wu')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q16488425'), ('paintersName', 'A.  Khlobystin')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q41305882'), ('paintersName', 'A.  Molenaer (active 1641-1652)')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q78806720'), ('paintersName', 'A. A. Koudriavtseff')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q22002320'), ('paintersName', 'A. A. Lawrence')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q33130695'), ('paintersName', 'A. A. Montano')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q4647491'), ('paintersName', 'A. A. Raiba')]\n",
      "[('painters', 'http://www.wikidata.org/entity/Q48954419'), ('paintersName', 'A. A. Suvorov')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#First I get all the humans that are painters. \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?painters ?paintersName \n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   ?painters wdt:P31 wd:Q5 . #I filter all the humans in the variable ?painters\n",
    "   ?painters wdt:P106 wd:Q1028181 . #now I add the condition to the occupation has to be \"painters\"\n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   ?painters sc:name ?paintersName . \n",
    "   \n",
    "}\n",
    "ORDER BY ?paintersName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "a79fc348-a500-4580-9850-fd6dd509770c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('humans', 'http://www.wikidata.org/entity/Q21647924'), ('humansName', '\"Tattoo Jack\" Cripe'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q98971886'), ('humansName', \"'Abbas Kowsari\"), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q12817104'), ('humansName', \"'Abd Allah Musawwir\"), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q13422938'), ('humansName', \"'Abd al-Hayy\"), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q28465157'), ('humansName', \"'the other' Jan van Kessel\"), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q21452732'), ('humansName', '(Agnes) Mabel Mackinlay'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q59369592'), ('humansName', '(Américo ?) Aragundo (Aragunde)'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q18608042'), ('humansName', '(B.?) van Kessel'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q28720006'), ('humansName', '(C. or O. ) Williams'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q41784927'), ('humansName', '(Robert) Reuben Cole'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q21463256'), ('humansName', '(Walter) Bertram Potter'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q1141445'), ('humansName', '108'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q99529391'), ('humansName', '2dmaxo/Olu Ajayi'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q86818374'), ('humansName', '3 Persons from Mali'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q4656945'), ('humansName', 'A Ge'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q4657536'), ('humansName', 'A K Dolven'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q76339407'), ('humansName', 'A M Phillips'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q28728323'), ('humansName', 'A Robert Pullin'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q83702747'), ('humansName', 'A Ryyppö'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q28728332'), ('humansName', 'A Shelley'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q106688917'), ('humansName', 'A Steenbeek'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q105044104'), ('humansName', 'A-One'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q2818868'), ('humansName', 'A-Sun Wu'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q16488425'), ('humansName', 'A.  Khlobystin'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q41305882'), ('humansName', 'A.  Molenaer (active 1641-1652)'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q78806720'), ('humansName', 'A. A. Koudriavtseff'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q22002320'), ('humansName', 'A. A. Lawrence'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q33130695'), ('humansName', 'A. A. Montano'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q4647491'), ('humansName', 'A. A. Raiba'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q48954419'), ('humansName', 'A. A. Suvorov'), ('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#Now I get the painters but with a diferent form and showing the occupation to prepare the query to add the rest of occupations. \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?humans ?humansName ?occupation ?occupationName\n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 . \n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation \n",
    "                        #painters\n",
    "   VALUES ?occupation { wd:Q1028181 } #With values I stablish the value for occupation to painters. \n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   ?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName\n",
    "   \n",
    "}\n",
    "ORDER BY ?humansName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "9a0287e8-32cc-4a4d-a82a-a9599e9d15c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('humans', 'http://www.wikidata.org/entity/Q11686949'), ('humansName', 'José Ximénez'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q11871976'), ('humansName', 'Klaus Wirzenius'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q240377'), ('humansName', 'Amanda Palmer'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q328722'), ('humansName', 'Sebastián Durón'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q3430855'), ('humansName', 'Richard Hazard'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q8199438'), ('humansName', 'Andrés de Sola'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q8210913'), ('humansName', 'Azucena Maizani'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q950204'), ('humansName', 'Alex Clare'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q1077158'), ('humansName', 'Chris Cutler'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q11927727'), ('humansName', 'Joan Gols i Soler'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q273654'), ('humansName', 'Olga Neuwirth'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q293218'), ('humansName', 'Joan Tower'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q367410'), ('humansName', 'Ernest Ashworth'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q371075'), ('humansName', 'Charles Earland'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q457178'), ('humansName', 'Federico Mompou'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q485961'), ('humansName', 'Dobie Gray'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q57257'), ('humansName', 'Peter Cornelius'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q572761'), ('humansName', 'Eiza González'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q6128878'), ('humansName', 'Simón Char'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q674739'), ('humansName', 'Alexander Mackenzie'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q1383538'), ('humansName', 'Red Allen'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q256065'), ('humansName', 'Rokia Traoré'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q3120486'), ('humansName', 'William I of Baux'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q332471'), ('humansName', 'Paul Desmond'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q582981'), ('humansName', 'Mr. Lif'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q77034'), ('humansName', 'Paul van Dyk'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q8731252'), ('humansName', 'Jan Gregus'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q9337241'), ('humansName', 'Sir Michu'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q13637684'), ('humansName', 'Franz Pollak'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "[('humans', 'http://www.wikidata.org/entity/Q13640667'), ('humansName', 'Geir Sundbø'), ('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#Now I add to the painters, the composers, sculptors and poets. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?humans ?humansName ?occupation ?occupationName \n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 .\n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation  \n",
    "                        #Composer   #painters   #sculptors  #poets \n",
    "   VALUES ?occupation { wd:Q36834 wd:Q1028181 wd:Q1281618  wd:Q49757} # With values I stablish the value for occupation to all of the occupations. \n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   ?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName\n",
    "   \n",
    "}\n",
    "ORDER BY ?occupationName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "92358a56-ea47-4a1a-8774-7a460d4de8ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer'), ('people', '90917')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter'), ('people', '176719')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q49757'), ('occupationName', 'poet'), ('people', '93463')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1281618'), ('occupationName', 'sculptor'), ('people', '44250')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#Now I count how many of each occupation are. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupation ?occupationName (COUNT(*) AS ?people)\n",
    "WHERE {\n",
    "\n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 .\n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation \n",
    "                        #Composer   #painters   #sculpors  #poets \n",
    "   VALUES ?occupation { wd:Q36834 wd:Q1028181 wd:Q1281618  wd:Q49757} # With values I stablish the value for occupation to all of the occupations.\n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   #?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName\n",
    "   \n",
    "}\n",
    "GROUP BY ?occupation ?occupationName\n",
    "ORDER BY ?occupationName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "3db3c912-77a8-49cb-ba48-7ec9f016e0ee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer'), ('people', '8')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter'), ('people', '55')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q49757'), ('occupationName', 'poet'), ('people', '15')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1281618'), ('occupationName', 'sculptor'), ('people', '18')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# I've already have all the people for each occupation, now, I have to filter those who belong to the diferent movements. \n",
    "# First I'll try it only with those who belong to Renaissance. \n",
    "\n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupation ?occupationName (COUNT(*) AS ?people)\n",
    "WHERE {\n",
    "    \n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 .\n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation \n",
    "                        #Composer   #painters   #sculpors  #poets \n",
    "   VALUES ?occupation { wd:Q36834 wd:Q1028181 wd:Q1281618  wd:Q49757} # With values I stablish the value for occupation to all of the occupations.\n",
    "    \n",
    "   ?humans wdt:P135 ?movement . #I put the values for movement from everyone to the variable ?movement\n",
    "                    #renaissance   \n",
    "   VALUES ?movement { wd:Q4692 } # I use values to filter the variable ?movement and that only gets the ones from Renaissance\n",
    "   \n",
    "   # get the label \n",
    "   #?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName\n",
    "   \n",
    "}\n",
    "GROUP BY ?occupation ?occupationName\n",
    "ORDER BY ?occupationName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "d88d4612-576a-4cf1-9bd1-7fc33a9d31f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q36834'), ('occupationName', 'composer'), ('people', '27')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1028181'), ('occupationName', 'painter'), ('people', '585')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q49757'), ('occupationName', 'poet'), ('people', '205')]\n",
      "[('occupation', 'http://www.wikidata.org/entity/Q1281618'), ('occupationName', 'sculptor'), ('people', '358')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#I add the rest of movements to the filter. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?occupation ?occupationName (COUNT(*) AS ?people)\n",
    "WHERE {\n",
    "   \n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 .\n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation \n",
    "                        #Composer   #painters   #sculpors  #poets \n",
    "   VALUES ?occupation { wd:Q36834 wd:Q1028181 wd:Q1281618  wd:Q49757} # With values I stablish the value for occupation to all of the occupations.\n",
    "   \n",
    "   ?humans wdt:P135 ?movement . #I put the values for movement from everyone to the variable ?movement\n",
    "                    #renaissance  #Baroque   #Romanticism\n",
    "   VALUES ?movement { wd:Q4692    wd:Q37853   wd:Q37068} # # I use values to filter the variable ?movement to get all the ones from the three movements\n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   #?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName\n",
    "   \n",
    "}\n",
    "GROUP BY ?occupation ?occupationName\n",
    "ORDER BY ?occupationName\n",
    "\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43653ffa",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "b2f29455",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('movementName', 'Baroque'), ('occupationName', 'sculptor'), ('people', '326')]\n",
      "[('movementName', 'Baroque'), ('occupationName', 'poet'), ('people', '39')]\n",
      "[('movementName', 'Baroque'), ('occupationName', 'painter'), ('people', '378')]\n",
      "[('movementName', 'Baroque'), ('occupationName', 'composer'), ('people', '6')]\n",
      "[('movementName', 'Renaissance'), ('occupationName', 'sculptor'), ('people', '18')]\n",
      "[('movementName', 'Renaissance'), ('occupationName', 'poet'), ('people', '15')]\n",
      "[('movementName', 'Renaissance'), ('occupationName', 'composer'), ('people', '8')]\n",
      "[('movementName', 'Renaissance'), ('occupationName', 'painter'), ('people', '55')]\n",
      "[('movementName', 'Romanticism'), ('occupationName', 'composer'), ('people', '13')]\n",
      "[('movementName', 'Romanticism'), ('occupationName', 'painter'), ('people', '152')]\n",
      "[('movementName', 'Romanticism'), ('occupationName', 'sculptor'), ('people', '14')]\n",
      "[('movementName', 'Romanticism'), ('occupationName', 'poet'), ('people', '151')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Now I show the result separated by movement and occupation. \n",
    "#To do that I add to the select the variable ?movementName, I add movement to the group by, and i order by the movement. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?movementName ?occupationName (COUNT(*) AS ?people) \n",
    "WHERE {\n",
    "   \n",
    "   \n",
    "   #bind something \n",
    "   \n",
    "   ?humans wdt:P31 wd:Q5 .\n",
    "   ?humans wdt:P106 ?occupation. #I get all the occupations of the humans on the variable ?occupation \n",
    "                        #Composer   #painters   #sculpors  #poets \n",
    "   VALUES ?occupation { wd:Q36834 wd:Q1028181 wd:Q1281618  wd:Q49757}  # With values I stablish the value for occupation to all of the occupations.\n",
    "   \n",
    "   ?humans wdt:P135 ?movement . #I put the values for movement from everyone to the variable ?movement\n",
    "                    #renaissance  #Baroque   #Romanticism\n",
    "   VALUES ?movement { wd:Q4692    wd:Q37853   wd:Q37068} # I use values to filter the variable ?movement to get all the ones from the three movements\n",
    "   \n",
    "   # get the label \n",
    "   #?humans sc:name ?humansName .\n",
    "   ?occupation sc:name ?occupationName .\n",
    "   ?movement sc:name ?movementName. \n",
    "}\n",
    "GROUP BY ?movementName ?occupationName\n",
    "ORDER BY ?movementName\n",
    "LIMIT 30\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b0550f9d",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 5\n",
    "Find how many sculptures were made in Italy during Renaissance, Baroque, and Romanticism movements. Please consider all the sculptures and all the sculpture subtypes. (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "40a51685",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P937'), ('name', 'work location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9493'), ('name', 'artist files at')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "#First I have to find the BGP for sculpture. \n",
    "#For that I take a look to the properties of Donatello.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "e707addd-6b76-4798-91fb-4ee8cc0785d8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q3853558'), ('iname', 'Medal of the Pazzi conspiracy')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#For the previous task, I know that donatello is a sculptor. \n",
    "#One of his properties is notable work, so I'm going to see what are the values for that propertie. \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   ?obj wdt:P800 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "932d9566-8222-4444-ae01-e3c5fced14e7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P425'), ('name', 'field of this occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('name', 'category for eponymous categories')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#I get a medal not a sculpture so I explore other paths to get to the sculpture. \n",
    "#I'll try with exploring the properties of sculptor. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1281618  ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "6525bf8e-bc3d-407d-9d02-691e4f1943c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36649'), ('iname', 'visual art')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q860861'), ('iname', 'sculpture')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#The first property for sculptor is product or material produced, I search what's inside that property. \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q1281618 ?p ?obj .\n",
    "   ?obj wdt:P1056 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bfc6070f-108c-49d9-92ea-85e64b3f04e4",
   "metadata": {},
   "source": [
    "Now that I have the BGP for sculpture, I search for all the subtypes, for that I look for all the things that on the property subclass of has the value for sculpture. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "5f419ae3-5fd7-4493-88db-ae969c2ae0b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q106766811'), ('subtypesName', 'A Way of Organising a Pig')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q402996'), ('subtypesName', 'Ahu in Easter Island')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q63098560'), ('subtypesName', 'Aphrodite in ancient Greek sculptures')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q104904962'), ('subtypesName', 'Big thing')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q43302581'), ('subtypesName', 'Bodhisattva statues of Sri Lanka')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5068850'), ('subtypesName', 'Chalkware')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5738113'), ('subtypesName', 'Chavin Tenon-heads')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q282158'), ('subtypesName', 'Cuauhxicalli')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q637011'), ('subtypesName', 'Cubist sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5228052'), ('subtypesName', 'Daunian stele')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q19872684'), ('subtypesName', 'Dolphin lamp standard')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5305319'), ('subtypesName', 'Dragon boundary mark')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q404417'), ('subtypesName', 'French Imperial Eagle')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5526362'), ('subtypesName', 'Gas sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q28803342'), ('subtypesName', 'Gothic boxwood miniature')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q4216659'), ('subtypesName', 'Kasli iron sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q106766481'), ('subtypesName', 'Lost in Biliterate and Trilingual')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q6932025'), ('subtypesName', 'Muffler Men')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2554632'), ('subtypesName', 'Nail Men')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2864715'), ('subtypesName', 'Olmec figurine')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q106768870'), ('subtypesName', 'Persistent Bodies')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7234778'), ('subtypesName', 'Potbelly sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2936151'), ('subtypesName', 'Rubber Duck')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q509424'), ('subtypesName', 'Sheela na gig')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q84355061'), ('subtypesName', 'Sir Guy and the Dun Cow')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q43278379'), ('subtypesName', 'Sri Lankan Ivory Art')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q21203364'), ('subtypesName', 'Stay')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1740033'), ('subtypesName', 'Stone mace heads')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1699758'), ('subtypesName', 'Tabula Iliaca')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q9298509'), ('subtypesName', 'Tau tau')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q65665461'), ('subtypesName', 'The Settlers')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2560222'), ('subtypesName', 'Tree of Life')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1074070'), ('subtypesName', 'Tò he')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q933665'), ('subtypesName', 'Unique Forms of Continuity in Space')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7959462'), ('subtypesName', 'Waga sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q829304'), ('subtypesName', 'Wallace fountain')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q8026764'), ('subtypesName', 'Wire sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q229765'), ('subtypesName', 'Zun (vessel)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q4731380'), ('subtypesName', 'allegorical sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q12332981'), ('subtypesName', 'amber bear')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q3476508'), ('subtypesName', 'animal sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q3476515'), ('subtypesName', 'architectural sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197136'), ('subtypesName', 'arm')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q14562306'), ('subtypesName', 'bas-relief')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2074546'), ('subtypesName', 'bisj pole')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q4922530'), ('subtypesName', 'blackamoor')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1159994'), ('subtypesName', 'block statue')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5416402'), ('subtypesName', 'bozzetto')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q103847318'), ('subtypesName', 'carved ornament')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q97570030'), ('subtypesName', 'carving')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q21008864'), ('subtypesName', 'cast')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2387515'), ('subtypesName', 'centrepiece')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1088535'), ('subtypesName', 'chryselephantine sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197142'), ('subtypesName', 'civil sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q5738005'), ('subtypesName', 'colossal head')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q60297127'), ('subtypesName', 'concrete sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q108557527'), ('subtypesName', 'construction')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1111117'), ('subtypesName', 'crocket')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q27679552'), ('subtypesName', 'crucifixion group')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q40555'), ('subtypesName', 'death mask')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q104829843'), ('subtypesName', 'decorative wall')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q17769566'), ('subtypesName', 'empaquetage')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q27538033'), ('subtypesName', 'environment')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q41804287'), ('subtypesName', 'fiberglass sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197154'), ('subtypesName', 'fig human (sculpture)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197147'), ('subtypesName', 'figure (sculpture)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197149'), ('subtypesName', 'figure crib')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197152'), ('subtypesName', 'figure hybrid (sculpture)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q729329'), ('subtypesName', 'figurehead')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197156'), ('subtypesName', 'figurine (sculpture)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q19574608'), ('subtypesName', 'floating tap fountain')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197162'), ('subtypesName', 'foot')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q483453'), ('subtypesName', 'fountain')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197144'), ('subtypesName', 'fountain')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q4404699'), ('subtypesName', 'garden sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q215194'), ('subtypesName', 'gargoyle')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q11832720'), ('subtypesName', 'grave slab')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q849376'), ('subtypesName', 'haniwa')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197137'), ('subtypesName', 'head')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1570646'), ('subtypesName', 'hogback')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1101968'), ('subtypesName', 'ice sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q20437094'), ('subtypesName', 'installation artwork')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1048711'), ('subtypesName', 'inuksuk')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q220919'), ('subtypesName', 'keystone')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q29857932'), ('subtypesName', 'kinetic object')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1134627'), ('subtypesName', 'kugel fountain')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197164'), ('subtypesName', 'leg')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q29885984'), ('subtypesName', 'light sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1813198'), ('subtypesName', 'loam sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q26883973'), ('subtypesName', 'lost sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q104439007'), ('subtypesName', 'lost sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q17126762'), ('subtypesName', 'maquette')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q837249'), ('subtypesName', 'marble sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1365301'), ('subtypesName', 'mascaron')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q64850080'), ('subtypesName', 'memorial sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q29382748'), ('subtypesName', 'metal sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q3476533'), ('subtypesName', 'monumental sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q72931585'), ('subtypesName', 'neon sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q9325291'), ('subtypesName', 'outdoor sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7201702'), ('subtypesName', 'plaquette')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q41033985'), ('subtypesName', 'plastic sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q75094134'), ('subtypesName', 'play sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q26997384'), ('subtypesName', 'polychrome sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7226499'), ('subtypesName', 'polyhedron model')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q28777669'), ('subtypesName', 'portrait sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q831477'), ('subtypesName', 'prayer nut')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2113757'), ('subtypesName', 'protome')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q245117'), ('subtypesName', 'relief sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q16675884'), ('subtypesName', 'religious sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1792321'), ('subtypesName', 'roundabout art')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q327561'), ('subtypesName', 'sand sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q63722576'), ('subtypesName', 'sculpted column')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2293362'), ('subtypesName', 'sculptural group')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q17489156'), ('subtypesName', 'sculpture capital')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2520013'), ('subtypesName', 'sculpture in the round')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q11341006'), ('subtypesName', 'sculpture of Mary')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q104132541'), ('subtypesName', 'sculpture of Tiki')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q11299104'), ('subtypesName', 'sculpture of William S. Clark')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q833972'), ('subtypesName', 'snow sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q98565230'), ('subtypesName', 'soft art')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2236597'), ('subtypesName', 'sound sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7595713'), ('subtypesName', 'stabile')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q179700'), ('subtypesName', 'statue')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q12573007'), ('subtypesName', 'stone sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q3476513'), ('subtypesName', 'sugar sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197158'), ('subtypesName', 'thumbnail (sculpture)')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q79938'), ('subtypesName', 'tin figure')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q57518057'), ('subtypesName', 'topiary sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q107197166'), ('subtypesName', 'torso')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q2988353'), ('subtypesName', 'verraco')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1930585'), ('subtypesName', 'victory column')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q7927987'), ('subtypesName', 'video sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q1055622'), ('subtypesName', 'wax sculpture')]\n",
      "[('subtypes', 'http://www.wikidata.org/entity/Q26997323'), ('subtypesName', 'wooden sculpture')]\n",
      "134\n"
     ]
    }
   ],
   "source": [
    "#I try to get all the subtypes of sculpture. \n",
    "queryString = \"\"\"\n",
    "SELECT ?subtypes ?subtypesName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   \n",
    "   ?subtypes wdt:P279 wd:Q860861 . \n",
    "   \n",
    "   # get the label\n",
    "   ?subtypes sc:name ?subtypesName .\n",
    "}\n",
    "ORDER BY ?subtypesName \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "1aebdc5b-1965-4939-b467-cedbbb5c041c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q17044462'), ('sculpturesName', \"Mamas Don't Let Your Babies Grow Up To Be Cowboys\")]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q22248929'), ('sculpturesName', 'Statue of Liberty (Place de la Concorde)')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q22936897'), ('sculpturesName', 'Heaven of Delight')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q20741519'), ('sculpturesName', 'Rheinmetall/Victoria 8')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q27229650'), ('sculpturesName', 'Klausstud')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q27229991'), ('sculpturesName', 'Gottfried Keller Gedenkstätte')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q29111872'), ('sculpturesName', 'Saint sépulcre de Marienthal')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q1922245'), ('sculpturesName', 'Merzbau')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q20741397'), ('sculpturesName', 'VALIE EXPORT SMART EXPORT')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q20741909'), ('sculpturesName', 'Time and Countertime')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#With the last query that provides all the subtypes from sculpture, now I have to make an upper query to get all the items. \n",
    "queryString = \"\"\"\n",
    "SELECT ?sculptures ?sculpturesName\n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 ?subtypes. #Now I get all the items that are sculptures or some subtype of sculpture.\n",
    "   \n",
    "    \n",
    "  \n",
    "  {\n",
    "        #This gets all the subtypes from sculpture. \n",
    "        \n",
    "        SELECT ?subtypes ?subtypesName\n",
    "        WHERE {\n",
    "           # bind something\n",
    "   \n",
    "           ?subtypes wdt:P279 wd:Q860861 .\n",
    "   \n",
    "           # get the label\n",
    "           ?subtypes sc:name ?subtypesName .\n",
    "        }\n",
    "        ORDER BY ?subtypesName \n",
    "\n",
    "  \n",
    "  \n",
    "  }\n",
    "   \n",
    "   # get the label\n",
    "   ?sculptures sc:name ?sculpturesName.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "1d2544bd-24e5-4fb5-9c0d-a8f28a6d870a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P186'), ('name', 'made from material')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P84'), ('name', 'architect')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5816'), ('name', 'state of conservation')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Then I have to see the properties from the sculptures to get the property for country to filter those from Italy. \n",
    "#I explore statue of liberty Q22248929\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q22248929  ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "f4ee5f5a-6a62-4e10-82bc-5440067723b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2044'), ('iname', 'Florence')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2044'), ('iname', 'Florence')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q2044'), ('iname', 'Florence')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#Now I need the identifier for Italy. \n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q37562 ?p ?obj .\n",
    "   ?obj wdt:P19 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "155a69c8-d736-45b3-91f1-bde2f761a7a4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1376'), ('name', 'capital of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('name', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('name', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1740'), ('name', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1791'), ('name', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('name', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P190'), ('name', 'twinned administrative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('name', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('name', 'located in or next to body of water')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('name', 'executive body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2716'), ('name', 'collage image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P417'), ('name', 'patron saint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('name', 'located in time zone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('name', 'shares border with')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6'), ('name', 'head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('name', 'category for maps')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8402'), ('name', 'open data portal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8592'), ('name', 'aerial view')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('name', 'economy of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P94'), ('name', 'coat of arms image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P963'), ('name', 'streaming media URL')]\n",
      "43\n"
     ]
    }
   ],
   "source": [
    "#Now the properties for Florence \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2044 ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "d2b66664-d107-4208-9c8d-6b1c997664b1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q1028'), ('iname', 'Morocco')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q142'), ('iname', 'France')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q142'), ('iname', 'France')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q145'), ('iname', 'United Kingdom')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q148'), ('iname', \"People's Republic of China\")]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q148540'), ('iname', 'Republic of Florence')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q155'), ('iname', 'Brazil')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q17'), ('iname', 'Japan')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q17'), ('iname', 'Japan')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q172579'), ('iname', 'Kingdom of Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q172579'), ('iname', 'Kingdom of Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q183'), ('iname', 'Germany')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q183'), ('iname', 'Germany')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q211'), ('iname', 'Latvia')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q212'), ('iname', 'Ukraine')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q213'), ('iname', 'Czech Republic')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q219060'), ('iname', 'State of Palestine')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q219060'), ('iname', 'State of Palestine')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q222'), ('iname', 'Albania')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q225'), ('iname', 'Bosnia and Herzegovina')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q237'), ('iname', 'Vatican City')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q238'), ('iname', 'San Marino')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q252'), ('iname', 'Indonesia')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q262'), ('iname', 'Algeria')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q265'), ('iname', 'Uzbekistan')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q28'), ('iname', 'Hungary')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q29'), ('iname', 'Spain')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30'), ('iname', 'United States of America')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30'), ('iname', 'United States of America')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q30'), ('iname', 'United States of America')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q33'), ('iname', 'Finland')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q34'), ('iname', 'Sweden')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q36'), ('iname', 'Poland')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q38'), ('iname', 'Italy')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q39'), ('iname', 'Switzerland')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q399'), ('iname', 'Armenia')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q408'), ('iname', 'Australia')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q41'), ('iname', 'Greece')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q419'), ('iname', 'Peru')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43'), ('iname', 'Turkey')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43'), ('iname', 'Turkey')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q43'), ('iname', 'Turkey')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q739'), ('iname', 'Colombia')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q794'), ('iname', 'Iran')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q801'), ('iname', 'Israel')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q817'), ('iname', 'Kuwait')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q858'), ('iname', 'Syria')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q96'), ('iname', 'Mexico')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q986'), ('iname', 'Eritrea')]\n",
      "76\n"
     ]
    }
   ],
   "source": [
    "#Now the value on country P17.\n",
    "queryString = \"\"\"\n",
    "SELECT ?inst ?iname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q2044 ?p ?obj .\n",
    "   ?obj wdt:P17 ?inst.\n",
    "   \n",
    "   # get the label\n",
    "   ?inst sc:name ?iname.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "d0535001-7ab5-481e-bf7c-f506e32b65ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q13431140'), ('sculpturesName', 'Panel relief showing Marcus Aurelius performing a sacrifice')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q23301804'), ('sculpturesName', 'Il contrabbandiere')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q3983835'), ('sculpturesName', 'Teodelapio')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q24686949'), ('sculpturesName', 'The Floating Piers')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q59192597'), ('sculpturesName', 'Apotheosis of Sabina')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q56605032'), ('sculpturesName', 'Sette rilievi in via Terraggio')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q107091012'), ('sculpturesName', 'Buddha in contemplation (Garau, Milan)')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q3786839'), ('sculpturesName', 'Hortus Conclusus')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q66823293'), ('sculpturesName', 'Cercivento: una Bibbia a cielo aperto')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q66773567'), ('sculpturesName', 'Tunnel nel tempo')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#The property Country is P17 so now I get only the ones in Italy Q38. \n",
    "queryString = \"\"\"\n",
    "SELECT ?sculptures ?sculpturesName ?countryName\n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 ?subtypes. #Now I get all the items that are sculptures or some subtype of sculpture.\n",
    "   ?sculptures wdt:P17 wd:Q38 . #I get the country to be Italy.\n",
    "   ?sculptures \n",
    "  \n",
    "  {\n",
    "        #This gets all the subtypes from sculpture. \n",
    "        \n",
    "        SELECT ?subtypes ?subtypesName\n",
    "        WHERE {\n",
    "           # bind something\n",
    "   \n",
    "           ?subtypes wdt:P279 wd:Q860861 .\n",
    "   \n",
    "           # get the label\n",
    "           ?subtypes sc:name ?subtypesName .\n",
    "        }\n",
    "        ORDER BY ?subtypesName \n",
    "  \n",
    "  }\n",
    "   \n",
    "   # get the label\n",
    "   ?sculptures sc:name ?sculpturesName.\n",
    "   #?country sc:name ?countryName .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "b2d7129d-8d1d-40db-967d-318d8b1635fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('creator', 'http://www.wikidata.org/entity/Q183458'), ('creatorName', 'Andrea del Verrocchio')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q183458'), ('creatorName', 'Andrea del Verrocchio')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q195655'), ('creatorName', 'Andrea della Robbia')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q314797'), ('creatorName', 'Jacopo della Quercia')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q314797'), ('creatorName', 'Jacopo della Quercia')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q861385'), ('creatorName', 'Pellegrino Tibaldi')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#Now I try to limit the property to only the ones in the movement renaissance Q4692. To do that the only idea that occurs to me is to find it through \n",
    "#the property creator, and then see to what movement the creator of the sculptor belongs. \n",
    "queryString = \"\"\"\n",
    "SELECT  ?creator ?creatorName \n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 ?subtypes. #Now I get all the items that are sculptures or some subtype of sculpture.\n",
    "   ?sculptures wdt:P17 wd:Q38 . #I get the country to be Italy.\n",
    "   ?sculptures wdt:P170 ?creator . #I get creator  \n",
    "   ?creator wdt:P135 wd:Q4692 .\n",
    "\n",
    "  {\n",
    "        #This gets all the subtypes from sculpture. \n",
    "        \n",
    "        SELECT ?subtypes ?subtypesName\n",
    "        WHERE {\n",
    "           # bind something\n",
    "   \n",
    "           ?subtypes wdt:P279 wd:Q860861 .\n",
    "   \n",
    "           # get the label\n",
    "           ?subtypes sc:name ?subtypesName .\n",
    "        }\n",
    "        ORDER BY ?subtypesName \n",
    "  \n",
    "  }\n",
    "   \n",
    "   # get the label\n",
    "   ?sculptures sc:name ?sculpturesName.\n",
    "   ?creator sc:name ?creatorName .\n",
    "}\n",
    "ORDER BY ?creatorName \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "d01c564e-828c-449a-9eb4-5b01f0264270",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('creator', 'http://www.wikidata.org/entity/Q122328'), ('creatorName', 'Carlo Maderno'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q122328'), ('creatorName', 'Carlo Maderno'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q122328'), ('creatorName', 'Carlo Maderno'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q160538'), ('creatorName', 'Gian Lorenzo Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q160538'), ('creatorName', 'Gian Lorenzo Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q160538'), ('creatorName', 'Gian Lorenzo Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q160538'), ('creatorName', 'Gian Lorenzo Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q160538'), ('creatorName', 'Gian Lorenzo Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q1657584'), ('creatorName', 'Ignazio Buceti'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q1657584'), ('creatorName', 'Ignazio Buceti'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q333323'), ('creatorName', 'Pietro da Cortona'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q712397'), ('creatorName', 'Pietro Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q712397'), ('creatorName', 'Pietro Bernini'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q16977527'), ('creatorName', 'Salvatore Garau'), ('movementName', 'Romanticism')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q2424763'), ('creatorName', 'Pietro Afesa'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q1453766'), ('creatorName', 'Gioacchino Vitagliano'), ('movementName', 'Baroque')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q183458'), ('creatorName', 'Andrea del Verrocchio'), ('movementName', 'Renaissance')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q183458'), ('creatorName', 'Andrea del Verrocchio'), ('movementName', 'Renaissance')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q861385'), ('creatorName', 'Pellegrino Tibaldi'), ('movementName', 'Renaissance')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q314797'), ('creatorName', 'Jacopo della Quercia'), ('movementName', 'Renaissance')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q314797'), ('creatorName', 'Jacopo della Quercia'), ('movementName', 'Renaissance')]\n",
      "[('creator', 'http://www.wikidata.org/entity/Q195655'), ('creatorName', 'Andrea della Robbia'), ('movementName', 'Renaissance')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "#Now I add the movements Baroque an Romanticism. \n",
    "queryString = \"\"\"\n",
    "SELECT  ?creator ?creatorName ?movementName\n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 ?subtypes. #Now I get all the items that are sculptures or some subtype of sculpture.\n",
    "   ?sculptures wdt:P17 wd:Q38 . #I get the country to be Italy.\n",
    "   ?sculptures wdt:P170 ?creator . #I get creator  \n",
    "   ?creator wdt:P135 ?movement . \n",
    "   \n",
    "        #renaissance  #Baroque   #Romanticism\n",
    "   VALUES ?movement { wd:Q4692    wd:Q37853   wd:Q37068} # # I use values to filter the variable ?movement to get all the ones from the three movements\n",
    "\n",
    "  {\n",
    "        #This gets all the subtypes from sculpture. \n",
    "        \n",
    "        SELECT ?subtypes ?subtypesName\n",
    "        WHERE {\n",
    "           # bind something\n",
    "   \n",
    "           ?subtypes wdt:P279 wd:Q860861 .\n",
    "   \n",
    "           # get the label\n",
    "           ?subtypes sc:name ?subtypesName .\n",
    "        }\n",
    "        ORDER BY ?subtypesName \n",
    "  \n",
    "  }\n",
    "   \n",
    "   # get the label\n",
    "   ?creator sc:name ?creatorName .\n",
    "   ?movement sc:name ?movementName .\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f6041efc",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "d14b39ca-86a0-4bf4-9595-817e1b70ef1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('movement', 'http://www.wikidata.org/entity/Q4692'), ('movementName', 'Renaissance'), ('sculptures', '6')]\n",
      "[('movement', 'http://www.wikidata.org/entity/Q37853'), ('movementName', 'Baroque'), ('sculptures', '15')]\n",
      "[('movement', 'http://www.wikidata.org/entity/Q37068'), ('movementName', 'Romanticism'), ('sculptures', '1')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "#The last thing to do is count the sculptures and do the \n",
    "queryString = \"\"\"\n",
    "SELECT  ?movement ?movementName (COUNT(*) AS ?sculptures)\n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 ?subtypes. #Now I get all the items that are sculptures or some subtype of sculpture.\n",
    "   ?sculptures wdt:P17 wd:Q38 . #I get the country to be Italy.\n",
    "   ?sculptures wdt:P170 ?creator . #I get creator  \n",
    "   ?creator wdt:P135 ?movement . \n",
    "   \n",
    "        #renaissance  #Baroque   #Romanticism\n",
    "   VALUES ?movement { wd:Q4692    wd:Q37853   wd:Q37068} # # I use values to filter the variable ?movement to get all the ones from the three movements\n",
    "\n",
    "  {\n",
    "        #This gets all the subtypes from sculpture. \n",
    "        \n",
    "        SELECT ?subtypes ?subtypesName\n",
    "        WHERE {\n",
    "           # bind something\n",
    "   \n",
    "           ?subtypes wdt:P279 wd:Q860861 .\n",
    "   \n",
    "           # get the label\n",
    "           ?subtypes sc:name ?subtypesName .\n",
    "        }\n",
    "        ORDER BY ?subtypesName \n",
    "  \n",
    "  }\n",
    "   \n",
    "   # get the label\n",
    "  \n",
    "   ?movement sc:name ?movementName .\n",
    "}\n",
    "GROUP BY ?movement ?movementName\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e0436a76-cf0a-4502-a837-7f56f9c6bd2c",
   "metadata": {},
   "source": [
    "NOTE: Probably there are only a few because I'm only considering only the movements and not all the variances."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94e7a899",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "For each European country find how many poets belong to Romanticism (the result set must be a list of triples country IRI, label and #poets)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "bf9df2d4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8432'), ('name', 'Österreichisches Musiklexikon Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2436'), ('name', 'voltage')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1198'), ('name', 'unemployment rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4841'), ('name', 'total fertility rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P78'), ('name', 'top-level Internet domain')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('name', 'shares border with')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1419'), ('name', 'shape')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5658'), ('name', 'railway traffic side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P832'), ('name', 'public holiday')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('name', 'population')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P417'), ('name', 'patron saint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8402'), ('name', 'open data portal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('name', 'office held by head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2573'), ('name', 'number of out-of-school children')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1120'), ('name', 'number of deaths')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1451'), ('name', 'motto text')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2258'), ('name', 'mobile country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7422'), ('name', 'minimum temperature record')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3529'), ('name', 'median income')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3000'), ('name', 'marriageable age')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2979'), ('name', 'maritime identification digits')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2884'), ('name', 'mains voltage')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P92'), ('name', 'main regulatory text')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1589'), ('name', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('name', 'located in/on physical feature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('name', 'located in time zone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('name', 'located in or next to body of water')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2250'), ('name', 'life expectancy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P395'), ('name', 'licence plate code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('name', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('name', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7471'), ('name', 'iNaturalist place ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8217'), ('name', 'iDAI.gazetteer ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P610'), ('name', 'highest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P209'), ('name', 'highest judicial authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P35'), ('name', 'head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6'), ('name', 'head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3896'), ('name', 'geoshape')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2633'), ('name', 'geography of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('name', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('name', 'executive body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2852'), ('name', 'emergency telephone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2853'), ('name', 'electrical plug type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8826'), ('name', 'edition humboldt digital ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('name', 'economy of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1622'), ('name', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('name', 'diplomatic relation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1549'), ('name', 'demonym')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9241'), ('name', 'demographics of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2596'), ('name', 'culture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P474'), ('name', 'country calling code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3270'), ('name', 'compulsory education (minimum age)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3271'), ('name', 'compulsory education (maximum age)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P94'), ('name', 'coat of arms image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('name', 'coat of arms')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1791'), ('name', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('name', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('name', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('name', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('name', 'category for maps')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1740'), ('name', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('name', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('name', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2046'), ('name', 'area')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5573'), ('name', 'archINFORM location ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P85'), ('name', 'anthem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2997'), ('name', 'age of majority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6293'), ('name', 'YSA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7012'), ('name', 'World Encyclopedia of Puppetry Arts ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5125'), ('name', 'Wikimedia outline')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6766'), ('name', \"Who's on First ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3068'), ('name', 'WIPO ST.3')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2855'), ('name', 'VAT-rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P487'), ('name', 'Unicode character')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2982'), ('name', 'UIC numerical country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2981'), ('name', 'UIC alphabetical country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6404'), ('name', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7157'), ('name', 'The Top Tens ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5456'), ('name', 'TasteAtlas ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7314'), ('name', 'TDV İslam Ansiklopedisi ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3175'), ('name', 'Statoids ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9122'), ('name', 'SportsLogos.net team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9757'), ('name', 'Schoenberg Database of Manuscripts place ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3911'), ('name', 'STW Thesaurus for Economics ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3987'), ('name', 'SHARE Catalogue author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8974'), ('name', 'SAPA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9223'), ('name', 'Provenio UUID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5739'), ('name', 'Pontificia Università della Santa Croce ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5002'), ('name', 'Orthodox Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6592'), ('name', 'OpenStreetMap zoom level')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P402'), ('name', 'OpenStreetMap relation ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2950'), ('name', 'Nomisma ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P605'), ('name', 'NUTS code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2004'), ('name', 'NALT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P982'), ('name', 'MusicBrainz area ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P486'), ('name', 'MeSH descriptor ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7322'), ('name', 'Marine Regions Geographic IDentifier (MRGID)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4801'), ('name', 'LoC and MARC vocabularies ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7208'), ('name', 'Liber Liber author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3612'), ('name', 'Le Monde diplomatique subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7850'), ('name', 'Joconde location ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7960'), ('name', 'Joconde discovery ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1438'), ('name', 'Jewish Encyclopedia ID (Russian)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6413'), ('name', 'JORFSearch organization ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5698'), ('name', 'Invasive Species Compendium Datasheet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3743'), ('name', 'ITU/ISO/IEC object identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3024'), ('name', 'ITU letter code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P299'), ('name', 'ISO 3166-1 numeric code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P298'), ('name', 'ISO 3166-1 alpha-3 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P297'), ('name', 'ISO 3166-1 alpha-2 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3097'), ('name', 'ISBN identifier group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P898'), ('name', 'IPA transcription')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P984'), ('name', 'IOC country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3422'), ('name', 'INSEE countries and foreign territories code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5250'), ('name', 'IAB code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1081'), ('name', 'Human Development Index')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5843'), ('name', 'Gynopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8406'), ('name', 'Grove Art Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7295'), ('name', 'Gregorian calendar start date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1842'), ('name', 'Global Anabaptist Mennonite Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5247'), ('name', 'Giant Bomb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1667'), ('name', 'Getty Thesaurus of Geographic Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1566'), ('name', 'GeoNames ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5400'), ('name', 'GeoNLP ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3067'), ('name', 'GS1 country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4427'), ('name', 'GACS ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P901'), ('name', 'FIPS 10-4 (countries and regions)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5437'), ('name', 'EuroVoc ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "200\n"
     ]
    }
   ],
   "source": [
    "#I obtained the identifier for Italy so I'm going to look for his properties. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "ORDER BY DESC (?name)\n",
    "LIMIT 200\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "0537f611-7d65-420c-8a5e-dcf0de2b80d9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q46'), ('oName', 'Europe')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#I find one called continen P30 so we take a look at its value\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 wdt:P30 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "8df4de66-1555-4cb9-bb03-59eacb1084ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poets', 'http://www.wikidata.org/entity/Q5932129'), ('poetsName', 'Joaquín José Cervino'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q5258787'), ('poetsName', 'Tobias Barreto'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q5340521'), ('poetsName', 'Eduardo Asquerino'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q573223'), ('poetsName', 'Patricio de la Escosura'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q688529'), ('poetsName', 'Johannes Carsten Hauch'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q597298'), ('poetsName', 'Antoni Edward Odyniec'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q645491'), ('poetsName', 'Yevhen Hrebinka'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q93343'), ('poetsName', 'Percy Bysshe Shelley'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q378133'), ('poetsName', 'Hendrik Conscience'), ('romanticsName', 'Romanticism')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q352914'), ('poetsName', 'Karel Jaromír Erben'), ('romanticsName', 'Romanticism')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Let's start to find all the poets form the romanticism\n",
    "#I use the properties movement, and romanticism form previous queries. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?poets ?poetsName ?romanticsName\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   ?poets wdt:P31 wd:Q5 . #I filter all the humans in the variable ?poets\n",
    "   ?poets wdt:P106 wd:Q49757 . # I make that the occupation has to be poet\n",
    "   ?poets wdt:P135 ?romantics. #I put on romantics the value for movement. \n",
    "   \n",
    "   VALUES ?romantics { wd:Q37068 } #The value for romantics has to be romanticism. \n",
    "   \n",
    "   # get the label \n",
    "   ?poets sc:name ?poetsName . \n",
    "   ?romantics sc:name ?romanticsName .\n",
    "}\n",
    "ORDER BY DESC (?romanticsName)\n",
    "\n",
    "LIMIT 10\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "59ce2075-d075-47a5-b82a-1af8a7d6867f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('poets', 'http://www.wikidata.org/entity/Q352914'), ('poetsName', 'Karel Jaromír Erben'), ('country', 'http://www.wikidata.org/entity/Q28513'), ('countryName', 'Austria-Hungary')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q3498826'), ('poetsName', 'Stevan Kaćanski'), ('country', 'http://www.wikidata.org/entity/Q28513'), ('countryName', 'Austria-Hungary')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q362089'), ('poetsName', 'Jovan Jovanović Zmaj'), ('country', 'http://www.wikidata.org/entity/Q28513'), ('countryName', 'Austria-Hungary')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q352914'), ('poetsName', 'Karel Jaromír Erben'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q1031'), ('poetsName', 'France Prešeren'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q938402'), ('poetsName', 'Laza Kostić'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q3498826'), ('poetsName', 'Stevan Kaćanski'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q362089'), ('poetsName', 'Jovan Jovanović Zmaj'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q376416'), ('poetsName', 'Janko Kráľ'), ('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q4161627'), ('poetsName', 'Mirvarid Dilbazi'), ('country', 'http://www.wikidata.org/entity/Q227'), ('countryName', 'Azerbaijan')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q378133'), ('poetsName', 'Hendrik Conscience'), ('country', 'http://www.wikidata.org/entity/Q31'), ('countryName', 'Belgium')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q13000'), ('poetsName', 'Karel Lodewijk Ledeganck'), ('country', 'http://www.wikidata.org/entity/Q31'), ('countryName', 'Belgium')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q3580060'), ('poetsName', 'Édouard Wacken'), ('country', 'http://www.wikidata.org/entity/Q31'), ('countryName', 'Belgium')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q79822'), ('poetsName', 'Adam Mickiewicz'), ('country', 'http://www.wikidata.org/entity/Q221457'), ('countryName', 'Congress Poland')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q688529'), ('poetsName', 'Johannes Carsten Hauch'), ('country', 'http://www.wikidata.org/entity/Q35'), ('countryName', 'Denmark')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q168356'), ('poetsName', 'Adam Oehlenschläger'), ('country', 'http://www.wikidata.org/entity/Q35'), ('countryName', 'Denmark')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q5673'), ('poetsName', 'Hans Christian Andersen'), ('country', 'http://www.wikidata.org/entity/Q35'), ('countryName', 'Denmark')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q215945'), ('poetsName', 'Jens Baggesen'), ('country', 'http://www.wikidata.org/entity/Q35'), ('countryName', 'Denmark')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q60684'), ('poetsName', 'Novalis'), ('country', 'http://www.wikidata.org/entity/Q156199'), ('countryName', 'Electorate of Saxony')]\n",
      "[('poets', 'http://www.wikidata.org/entity/Q761705'), ('poetsName', 'Louis Bouilhet'), ('country', 'http://www.wikidata.org/entity/Q142'), ('countryName', 'France')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Now the next step is to take the country from every poet and it has to be on Europe. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?poets ?poetsName ?country ?countryName\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   ?poets wdt:P31 wd:Q5 . #I filter all the humans in the variable ?poets\n",
    "   ?poets wdt:P106 wd:Q49757 . # I make that the occupation has to be poet\n",
    "   ?poets wdt:P27 ?country. \n",
    "   ?country wdt:P30 wd:Q46 .\n",
    "   \n",
    "   ?poets wdt:P135 ?romantics. #I put on romantics the value for movement. \n",
    "   \n",
    "   VALUES ?romantics { wd:Q37068 } #The value for romantics has to be romanticism. \n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   ?poets sc:name ?poetsName .\n",
    "   ?country sc:name ?countryName .\n",
    "}\n",
    "ORDER BY ?countryName\n",
    "LIMIT 20\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26d55e00",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "9d40ed1e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q28513'), ('countryName', 'Austria-Hungary'), ('poets', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q131964'), ('countryName', 'Austrian Empire'), ('poets', '6')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q227'), ('countryName', 'Azerbaijan'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('countryName', 'Belgium'), ('poets', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q221457'), ('countryName', 'Congress Poland'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryName', 'Denmark'), ('poets', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q156199'), ('countryName', 'Electorate of Saxony'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('countryName', 'France'), ('poets', '16')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q151624'), ('countryName', 'German Confederation'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('countryName', 'Germany'), ('poets', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q161885'), ('countryName', 'Great Britain'), ('poets', '8')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q12548'), ('countryName', 'Holy Roman Empire'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28'), ('countryName', 'Hungary'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q699923'), ('countryName', 'Illyrian Provinces'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q27306'), ('countryName', 'Kingdom of Prussia'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q203493'), ('countryName', 'Kingdom of Romania'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q12560'), ('countryName', 'Ottoman Empire'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q172107'), ('countryName', 'Polish–Lithuanian Commonwealth'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('countryName', 'Portugal'), ('poets', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q10957559'), ('countryName', 'Principality of Moldavia'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('countryName', 'Romania'), ('poets', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q159'), ('countryName', 'Russia'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q403'), ('countryName', 'Serbia'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q15180'), ('countryName', 'Soviet Union'), ('poets', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('countryName', 'Spain'), ('poets', '47')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q80702'), ('countryName', 'Spanish Empire'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q39'), ('countryName', 'Switzerland'), ('poets', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('countryName', 'United Kingdom'), ('poets', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q174193'), ('countryName', 'United Kingdom of Great Britain and Ireland'), ('poets', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q958291'), ('countryName', 'United Principalities'), ('poets', '1')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#Now we don't show the poet and count all the poets. \n",
    "queryString = \"\"\"\n",
    "\n",
    "SELECT DISTINCT ?country ?countryName (COUNT(*) AS ?poets)\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   ?poets wdt:P31 wd:Q5 . #I filter all the humans in the variable ?poets\n",
    "   ?poets wdt:P106 wd:Q49757 . # I make that the occupation has to be poet\n",
    "   ?poets wdt:P27 ?country. \n",
    "   ?country wdt:P30 wd:Q46 .\n",
    "   \n",
    "   ?poets wdt:P135 ?romantics. #I put on romantics the value for movement. \n",
    "   \n",
    "   VALUES ?romantics { wd:Q37068 } #The value for romantics has to be romanticism. \n",
    "   \n",
    "   \n",
    "   # get the label \n",
    "   ?poets sc:name ?poetsName .\n",
    "   ?country sc:name ?countryName .\n",
    "}\n",
    "ORDER BY ?countryName\n",
    "LIMIT 100\n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd133daa",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 7\n",
    "Find the number of sculptures in the Louvre Museum belonging to Renaissance, Baroque, or Romanticism (return a number for each movement) (the result set must be a list of triples movement IRI, label and #sculptures)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "id": "3c41bbd9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q63847952'), ('sculpturesName', '\"Augustus\" (Self-Portrait) [obverse]')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q96238003'), ('sculpturesName', '\"Beauty\" and \"Work\"')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q100368647'), ('sculpturesName', '\"Bärenbrunnen\" von Franz Barwig dem Jüngeren, Dr.-Karl-Landsteiner-Park, Vienna')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q10655867'), ('sculpturesName', '\"Carvings in concrete\"')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q99521237'), ('sculpturesName', '\"Denkmal für eine Wirtschaftsnobelpreis-Trägerin\" von Helmut und Johanna Kandl, Volkertplatz, Wien Leopoldstadt')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q99438396'), ('sculpturesName', '\"Der Ackerbau\", Karlsplatz')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q99438194'), ('sculpturesName', '\"Der letzte Mensch\", Karlsplatz')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q99438386'), ('sculpturesName', '\"Die Treue der österreichischen Nation\", Karlsplatz')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q63863753'), ('sculpturesName', '\"Double Eagle\" Twenty Dollar Gold Piece [obverse]')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q63863755'), ('sculpturesName', '\"Double Eagle\" Twenty Dollar Gold Piece [reverse]')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#lets start to find all the sculptures \n",
    "queryString = \"\"\"\n",
    "SELECT ?sculptures ?sculpturesName\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 wd:Q860861 .\n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?sculptures sc:name ?sculpturesName .\n",
    "}\n",
    "ORDER BY ?sculpturesName \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "id": "8bbb49a5-bc42-4d3d-ad80-29fe46218a95",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6108'), ('name', 'IIIF manifest')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P195'), ('name', 'collection')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "#I'm going to search for the properties of the sculptures to find the properties that says where they are located. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q63847952  ?p ?obj .\n",
    "   FILTER(!isLiteral(?obj)).\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "a7fadecb-188d-4e49-a42c-2d09200e6841",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q36707230'), ('sculpturesName', 'Fountain of Diana')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q3178029'), ('sculpturesName', 'Jeune fille de Mégare')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q681067'), ('sculpturesName', 'Lady of Elche')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q1439502'), ('sculpturesName', 'Napoleon as Mars the Peacemaker')]\n",
      "[('sculptures', 'http://www.wikidata.org/entity/Q3501426'), ('sculpturesName', 'Stela of Pasenhor')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#I find the property location P276, now I modify the previous query to get all the sculptures that are in the louvre museum. \n",
    "queryString = \"\"\"\n",
    "SELECT ?sculptures ?sculpturesName\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 wd:Q860861 .\n",
    "   ?sculptures wdt:P276 wd:Q19675. \n",
    "   \n",
    "   \n",
    "   # get the label\n",
    "   ?sculptures sc:name ?sculpturesName .\n",
    "}\n",
    "ORDER BY ?sculpturesName \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47ad5e87",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "id": "ee0eb35b-102e-4249-8609-7827444ea2a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "#Now We get all the ones for the 3 movements. \n",
    "queryString = \"\"\"\n",
    "SELECT ?movement ?movementsName (COUNT(*) AS ?scul)\n",
    "WHERE {\n",
    "\n",
    "   # bind something\n",
    "   \n",
    "   ?sculptures wdt:P31 wd:Q860861 .\n",
    "   ?sculptures wdt:P276 wd:Q19675. \n",
    "   ?sculptures wdt:P135 ?movement .\n",
    "   \n",
    "   #renaissance  #Baroque   #Romanticism\n",
    "   VALUES ?movement { wd:Q4692    wd:Q37853   wd:Q37068} # # I use values to filter the variable ?movement to get all the ones from the three movements\n",
    "   \n",
    "   # get the label\n",
    "   ?movement sc:name ?movementsName .\n",
    "   \n",
    "}\n",
    "GROUP BY ?movement ?movementsName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a973562c-fad0-4e06-ae90-ac7c5b9f79f9",
   "metadata": {},
   "source": [
    "I don't get any sculpture for anyone of the movements on the louvre museum."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
