{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0fe453bf",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "8174424c",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-01f70b5780-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e2519098",
   "metadata": {},
   "source": [
    "# Sport Workflow Series (Basketball and NBA finals explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the world of basketball. Compare italian teams and US teams, country of citizenship of NBA players, and teams which won NBA finals."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f9177065",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q36159`| Lebron James      | node |\n",
    "| `wd:Q29545`| Kevin Durant      | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fea74e46",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q36159 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Lebron James**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for basketball player.\n",
    "\n",
    "2. Identify the BGP for basketball.\n",
    "\n",
    "3. Identify the BGP for basketball team.\n",
    "\n",
    "4. Return all italian basketball teams born before 1945 (the result set must be a list of triples basketball team IRI, label and year of inception).\n",
    "\n",
    "5. Identify the BGP for NBA finals\n",
    "\n",
    "6. Consider only the basketball teams which Kevin Durant and Lebron James played. Return the number of NBA finals won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team).\n",
    "\n",
    "7. Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, labels and #players)\n",
    "\n",
    "8. Identify the BGP for the NBA Most Valuable Player Award (MVP) (see https://en.wikipedia.org/wiki/NBA_Most_Valuable_Player_Award)\n",
    "\n",
    "9. Consider the players who won the NBA Most Valuable Player Award. Return for these players the number of NBA Most Valuable Player Award won in their career (the result set must be triples of player IRI, label and #victories)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c5aed637",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for basketball player."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "416e7e17-b6d9-4cb7-bda5-383fe6b87a05",
   "metadata": {},
   "source": [
    "To find the BGP for basketball player, I have to:\n",
    " 1. Find the property that links a person to being a basketball player\n",
    " 2. Find the actuall object \"Basket ball player\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "00c26e87",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name'), ('obj', 'http://www.wikidata.org/entity/Q12188082'), ('objname', 'James')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in'), ('obj', 'http://www.wikidata.org/entity/Q241329'), ('objname', '2006 FIBA World Championship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for'), ('obj', 'http://www.wikidata.org/entity/Q680221'), ('objname', 'Laureus World Sports Award for Breakthrough of the Year')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q1501719'), ('objname', 'J. Walter Kennedy Citizenship Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth'), ('obj', 'http://www.wikidata.org/entity/Q163132'), ('objname', 'Akron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence'), ('obj', 'http://www.wikidata.org/entity/Q163132'), ('objname', 'Akron')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for'), ('obj', 'http://www.wikidata.org/entity/Q4896605'), ('objname', 'Best Championship Performance ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q4896605'), ('objname', 'Best Championship Performance ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in'), ('obj', 'http://www.wikidata.org/entity/Q178595'), ('objname', '2007 FIBA Americas Championship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for'), ('obj', 'http://www.wikidata.org/entity/Q4896598'), ('objname', 'Best Breakthrough Athlete ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received'), ('obj', 'http://www.wikidata.org/entity/Q4896598'), ('objname', 'Best Breakthrough Athlete ESPY Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q10798782'), ('objname', 'television actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project'), ('obj', 'http://www.wikidata.org/entity/Q15304953'), ('objname', 'WikiProject African diaspora')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for'), ('obj', 'http://www.wikidata.org/entity/Q1808301'), ('objname', 'Laureus World Sports Award for Sportsman of the Year')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed'), ('obj', 'http://www.wikidata.org/entity/Q1860'), ('objname', 'English')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q28389'), ('objname', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport'), ('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship'), ('obj', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation'), ('obj', 'http://www.wikidata.org/entity/Q3665646'), ('objname', 'basketball player')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class'), ('obj', 'http://www.wikidata.org/entity/Q46343203'), ('objname', \"men's basketball\")]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "\n",
    "# Let's explore the properties of Lebron James to find what makes him a baskketball player\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Let's dive deeper into the objects of the triples\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "71de9af3-b6a5-4de4-9f95-9a7907b299de",
   "metadata": {},
   "source": [
    "Looking at the results above, I can see that the property P106 named \"occupation\" links our player to the object Q3665646 named \"basketball player\". Then I make sure they're human for good mesure. Hence the final query:"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c60c359f",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "235e46ca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q8192401'), ('name', 'Aitor Zárate')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q13708767'), ('name', 'Aristide Landi')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15477486'), ('name', 'Małgorzata Janowicz')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15737093'), ('name', 'Jarrett Durham')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15843419'), ('name', 'Ryan Brooks')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15850750'), ('name', 'Thomas Hering')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15856626'), ('name', 'Ama Degbeon')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15870814'), ('name', 'Josef Klíma')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15879801'), ('name', 'Niels Vorenhout')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15881370'), ('name', 'Roel Aarts')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15889301'), ('name', 'Charlie Westbrook')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q15908865'), ('name', 'Jordan Adams')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q18044481'), ('name', 'Zoran Krstanovic')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q20057565'), ('name', 'Josef Klíma')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q3542640'), ('name', 'Ty Walker')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q4027073'), ('name', 'Darnell Hinson')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q16008261'), ('name', 'Ned Nelson')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q16012731'), ('name', 'Carl Austing')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q16013083'), ('name', 'Ken Rosemond')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q16013805'), ('name', 'Jim Bredar')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketballPlayer ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer sc:name ?name\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "220a13fd",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for basketball."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4b40402f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('basketball', 'http://www.wikidata.org/entity/Q5372'), ('name', 'basketball')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Query to find entities that are subclasses of entities with \"basketball in their name\"\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?game ?nameg\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?game wdt:P279 ?obj ;\n",
    "         sc:name ?nameg .\n",
    "   FILTER regex(?nameg, \"basketball\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# One of the results of the previus is named \"men's college basketball\" and its IRI is Q101003088. Let's explore its parent classes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q101003088 wdt:P279 ?obj .\n",
    "      ?obj   sc:name ?name .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "# One of the results of the previus is named \"college basketball\" and its IRI is Q48890. Let's explore its parent classes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q48890 wdt:P279 ?obj .\n",
    "      ?obj   sc:name ?name .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "# We dound the entity basketball with IRI Q5372. Let's explore it's propeties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q5372 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# We can see that basketball is a subclass of ball game IRI Q877517. let;s find all subclasses of ball game\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketball ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketball wdt:P279 wd:Q877517 .\n",
    "   # get the label\n",
    "   ?basketball sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Now we filter to find basketball\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketball ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketball wdt:P279 wd:Q877517 .\n",
    "   # get the label\n",
    "   ?basketball sc:name ?name.\n",
    "   FILTER regex(?name, \".*basketball.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38de46dd",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "82e35f3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('basketball', 'http://www.wikidata.org/entity/Q5372'), ('name', 'basketball')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketball ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketball wdt:P279 wd:Q877517 .\n",
    "   # get the label\n",
    "   ?basketball sc:name ?name.\n",
    "   FILTER regex(?name, \".*basketball.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c921066c",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for basketball team."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "30ec92f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q8206968'), ('name', 'Hebraica y Macabi')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q5144784'), ('name', \"Colgate Raiders men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7051115'), ('name', \"Norfolk State Spartans men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7397248'), ('name', \"Sacred Heart Pioneers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q15725839'), ('name', 'A.S. Kentavros Neas Kallikrateias')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q107876527'), ('name', \"Iowa Western Reivers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q15927936'), ('name', 'Westchester Knicks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q810271'), ('name', 'BC Zepter Vienna')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q100320348'), ('name', \"East Central Tigers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16201949'), ('name', \"DePaul Blue Demons women's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16969750'), ('name', 'Jackson State Tigers basketball')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16982503'), ('name', 'Grand Rapids Drive')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4025635'), ('name', 'İstanbul Teknik Üniversitesi B.K.')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4705333'), ('name', \"Alabama State Hornets men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q923137'), ('name', 'Wellington Saints')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17022966'), ('name', 'ŽKK Srbobran')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17023856'), ('name', 'Anhui Wenyi')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17064173'), ('name', 'Blackwater Elite')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q5974122'), ('name', 'Levharti Chomutov')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q107876648'), ('name', \"Calvin Knights men's basketball\")]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Looking back at our query to explor a basketball player's properties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Let's look at the occupations\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 wdt:P106 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Now the occupation basketball player's properties\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q3665646 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   ?obj sc:name ?objname.\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# We can see it has a property \"part of\" and it's a part of \"basketball team\" IRI Q13393265. let's find all instances of basketball team\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 .\n",
    "   # get the label\n",
    "   ?team sc:name ?name .\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "600d3565",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "16d3d72e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q8206968'), ('name', 'Hebraica y Macabi')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q5144784'), ('name', \"Colgate Raiders men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7051115'), ('name', \"Norfolk State Spartans men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7397248'), ('name', \"Sacred Heart Pioneers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q15725839'), ('name', 'A.S. Kentavros Neas Kallikrateias')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q107876527'), ('name', \"Iowa Western Reivers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q15927936'), ('name', 'Westchester Knicks')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q810271'), ('name', 'BC Zepter Vienna')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q100320348'), ('name', \"East Central Tigers men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16201949'), ('name', \"DePaul Blue Demons women's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16969750'), ('name', 'Jackson State Tigers basketball')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16982503'), ('name', 'Grand Rapids Drive')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4025635'), ('name', 'İstanbul Teknik Üniversitesi B.K.')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q4705333'), ('name', \"Alabama State Hornets men's basketball\")]\n",
      "[('team', 'http://www.wikidata.org/entity/Q923137'), ('name', 'Wellington Saints')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17022966'), ('name', 'ŽKK Srbobran')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17023856'), ('name', 'Anhui Wenyi')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q17064173'), ('name', 'Blackwater Elite')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q5974122'), ('name', 'Levharti Chomutov')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q107876648'), ('name', \"Calvin Knights men's basketball\")]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 .\n",
    "   # get the label\n",
    "   ?team sc:name ?name .\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5c6a5731",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Return all italian basketball teams born before 1945 (the result set must be a list of triples basketball team IRI, label and year of inception)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "0d713198",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q1139737')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36362')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36500')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36264')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36311')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36572')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3891980')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7127695')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3754192')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q16639152')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q961782')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3972903')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3626684')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3747654')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's look at all the properties of a team\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 ;\n",
    "          ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# We can see a property named country IRI P17. We can filter for italy.\n",
    "# It also has property inception IRI P571, we can use it to filter by date\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P17 wd:Q38 ;\n",
    "          wdt:P571 ?inceptionYear ;\n",
    "          ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName .\n",
    "   FILTER (YEAR(?inceptionYear) < 1945)\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2b0d9577",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "7f06e640",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q3891980'), ('name', 'Nuova Pallacanestro Pavia'), ('yearOfInception', '1943')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1139737'), ('name', 'Fortitudo Pallacanestro Bologna'), ('yearOfInception', '1932')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36362'), ('name', 'Olimpia Milano'), ('yearOfInception', '1936')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36500'), ('name', 'Mens Sana Basket'), ('yearOfInception', '1861')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36264'), ('name', 'Virtus Pallacanestro Bologna'), ('yearOfInception', '1927')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36311'), ('name', 'Pallacanestro Cantù'), ('yearOfInception', '1936')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7127695'), ('name', 'Pallacanestro Pavia'), ('yearOfInception', '1943')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3754192'), ('name', 'Fulgor Omegna'), ('yearOfInception', '1937')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q36572'), ('name', 'Reyer Venezia Mestre'), ('yearOfInception', '1925')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q961782'), ('name', 'Pallacanestro Petrarca Padova'), ('yearOfInception', '1934')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3972903'), ('name', 'Stella Azzurra Roma'), ('yearOfInception', '1938')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3747654'), ('name', 'F.C. Internazionale Milano (basketball)'), ('yearOfInception', '1908')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?name YEAR(?inceptionYear) as ?yearOfInception\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P17 wd:Q38 ;\n",
    "          wdt:P571 ?inceptionYear .\n",
    "   # get the label\n",
    "   ?team sc:name ?name .\n",
    "   FILTER (YEAR(?inceptionYear) < 1945)\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9a5c94e",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Identify the BGP for NBA finals"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "567b88ac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('final', 'http://www.wikidata.org/entity/Q24264147'), ('name', '2016 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q29096468'), ('name', '2017 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4588662'), ('name', '1993 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4598928'), ('name', '2001 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4589592'), ('name', '1994 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4590500'), ('name', '1995 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q2036161'), ('name', '2008 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q170590'), ('name', '2006 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4600307'), ('name', '2002 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q2552745'), ('name', '2007 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4584557'), ('name', '1988 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4587787'), ('name', '1992 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4592651'), ('name', '1997 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q19877916'), ('name', '2015 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4586134'), ('name', '1990 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4604623'), ('name', '2005 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4593827'), ('name', '1998 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4586976'), ('name', '1991 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q1959941'), ('name', '2009 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4591549'), ('name', '1996 NBA Finals')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# This query is to find some NBA finals entities to explore\n",
    "# Its output is the IRI and lable of the subject, predicate, and object respectivly, filtered for objects that have \"NBA finals\" in their lable\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?s ?sName ?p ?pName ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p ?obj .\n",
    "   ?obj sc:name ?objName .\n",
    "   ?s sc:name ?sName .\n",
    "   ?p sc:name ?pName .\n",
    "   FILTER regex(?objName, \".*NBA final.*\", \"i\")\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "#The output of the previous query contains the 2017 NBA Finals IRI Q29096468. Let's explore it's properties\n",
    "# WE can see that the 2017 NBA Final is an instance of NBA Finals IRI Q842375. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q29096468 ?p ?obj .\n",
    "   ?obj sc:name ?objName .\n",
    "   ?p sc:name ?pName .\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# Finding all the instances of NBA Finals is the BGP for NBA finals\n",
    "# The output contains some other finals that we don't want. We need to add a filter\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?final ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?final wdt:P31 wd:Q842375 .\n",
    "   ?final sc:name ?name .\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# Adding the filter for anual NBA finals only\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?final ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?final wdt:P31 wd:Q842375 .\n",
    "   ?final sc:name ?name .\n",
    "   FILTER regex(?name, \".*NBA final.*\", \"i\")\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e5f279a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b8f91456",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('final', 'http://www.wikidata.org/entity/Q24264147'), ('name', '2016 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q29096468'), ('name', '2017 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4588662'), ('name', '1993 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4598928'), ('name', '2001 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4589592'), ('name', '1994 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4590500'), ('name', '1995 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q2036161'), ('name', '2008 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q170590'), ('name', '2006 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4600307'), ('name', '2002 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q2552745'), ('name', '2007 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4584557'), ('name', '1988 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4587787'), ('name', '1992 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4592651'), ('name', '1997 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q19877916'), ('name', '2015 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4586134'), ('name', '1990 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4604623'), ('name', '2005 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4593827'), ('name', '1998 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4586976'), ('name', '1991 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q1959941'), ('name', '2009 NBA Finals')]\n",
      "[('final', 'http://www.wikidata.org/entity/Q4591549'), ('name', '1996 NBA Finals')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?final ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?final wdt:P31 wd:Q842375 .\n",
    "   ?final sc:name ?name .\n",
    "   FILTER regex(?name, \".*NBA final.*\", \"i\")\n",
    "}\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d2615a7f",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Consider only the basketball teams which Kevin Durant and Lebron James played. Return the number of NBA finals won by these teams (the result set must be a list of triples basketball team IRI, label and #victories. Return a number for each basketball team)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "e29728f2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q157376'), ('name', 'Golden State Warriors'), ('victories', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q244847'), ('name', \"United States men's national basketball team\"), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('name', 'Los Angeles Lakers'), ('victories', '6')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q572134'), ('name', 'Brooklyn Nets'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169138'), ('name', 'Miami Heat'), ('victories', '3')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q235326'), ('name', 'Seattle SuperSonics'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q180950'), ('name', 'Oklahoma City Thunder'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q162990'), ('name', 'Cleveland Cavaliers'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7707830'), ('name', \"Texas Longhorns men's basketball\"), ('victories', '0')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "\n",
    "# Let's explore the properties of Lebron James to find what links him a baskketball team\n",
    "# The property \"member of sports team\" IRI P54 seems like what we're looking for. Let's explre it further\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# Exploring the property \"member of sports team\" IRI P54\n",
    "# P54 is the property we're looking for\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 wdt:P54 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "#Now we can look for the basketballl teams where Lebron James and Kevin Durant played\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION\n",
    "   {wd:Q29545 wdt:P54 ?team} .\n",
    "   # get the label\n",
    "   ?team sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# We need to find the property that tells us that a team has won an nba final\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION\n",
    "   {wd:Q29545 wdt:P54 ?team} .\n",
    "   ?team ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# The property \"award received\" IRI P166 from the last query looks promessing, let's explore it. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?obj ?objName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION {wd:Q29545 wdt:P54 ?team} .\n",
    "   ?team wdt:P166 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?objName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# The results are not correct. Which leads me to believe that this property is not gonna give us what we want. \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?name count(?award) as ?victories\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION {wd:Q29545 wdt:P54 ?team} .\n",
    "   optional {?team wdt:P166 ?award .}\n",
    "   # get the label\n",
    "   ?team sc:name ?name.\n",
    "}\n",
    "GROUP BY ?team  ?name\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# Let's explore triples where basketbball teams are the objects. i'll use Cleveland Cavaliers (Q162990) from the first query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p wd:Q162990 .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# We can see the property \"winnir\" IRI P1346 from the last query. let's check the subject of the triple.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?s ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P1346 wd:Q162990 .\n",
    "   # get the label\n",
    "   ?s sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "#It's the 2015–16 NBA season. The property \"winner\" is what we need. Let's find all NBA winners\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P1346 ?team .\n",
    "   # get the label\n",
    "   ?s sc:name ?season.\n",
    "   ?team sc:name ?name.\n",
    "   FILTER regex(?season, \"[0-9] NBA Finals\")\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "#Great! Now we can count the victories of teams where Lebron James and Kevin Durant played\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?name count(?s) as ?victories\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION {wd:Q29545 wdt:P54 ?team} .\n",
    "   OPTIONAL {?s wdt:P1346 ?team. \n",
    "             ?s sc:name ?sName.\n",
    "             FILTER regex(?sName, \"[0-9] NBA Finals\")} .\n",
    "   # get the label\n",
    "   ?team sc:name ?name.\n",
    "}\n",
    "GROUP BY ?team ?name\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f5ee72b4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "96a142b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q157376'), ('name', 'Golden State Warriors'), ('victories', '1')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q244847'), ('name', \"United States men's national basketball team\"), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q121783'), ('name', 'Los Angeles Lakers'), ('victories', '6')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q572134'), ('name', 'Brooklyn Nets'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q169138'), ('name', 'Miami Heat'), ('victories', '3')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q235326'), ('name', 'Seattle SuperSonics'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q180950'), ('name', 'Oklahoma City Thunder'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q162990'), ('name', 'Cleveland Cavaliers'), ('victories', '0')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q7707830'), ('name', \"Texas Longhorns men's basketball\"), ('victories', '0')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?team ?name count(?s) as ?victories\n",
    "WHERE {\n",
    "   # bind something\n",
    "   {wd:Q36159 wdt:P54 ?team} UNION {wd:Q29545 wdt:P54 ?team} .\n",
    "   OPTIONAL {?s wdt:P1346 ?team. \n",
    "             ?s sc:name ?sName.\n",
    "             FILTER regex(?sName, \"[0-9] NBA Finals\")} .\n",
    "   # get the label\n",
    "   ?team sc:name ?name.\n",
    "}\n",
    "GROUP BY ?team ?name\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7f9f626a",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider only NBA (National Basketball Association) basketball teams and all basketball players who played in one of these teams at least once. Also consider the country of citizenship of the players with the related continent. Return for each continent the number of players who played in an NBA basketball teams. (the result set must be triples of continent IRI, labels and #players)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8dedf97b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('continent', 'http://www.wikidata.org/entity/Q18'), ('continentName', 'South America'), ('players', '1405')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q538'), ('continentName', 'Insular Oceania'), ('players', '13853')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q27611'), ('continentName', 'Central America'), ('players', '1')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q49'), ('continentName', 'North America'), ('players', '14669')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q46'), ('continentName', 'Europe'), ('players', '14538')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q5401'), ('continentName', 'Eurasia'), ('players', '505')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q48'), ('continentName', 'Asia'), ('players', '4309')]\n",
      "[('continent', 'http://www.wikidata.org/entity/Q15'), ('continentName', 'Africa'), ('players', '1368')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# let's find teasm that play in the NBA. To find the property that makes the assosiation, \n",
    "#I'll explore the properties of the Los Angeles Lakers Q121783\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q121783 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# The \"league\" (P118) seems promessing. Let's chek it's objects\n",
    "# We find the entity National Basketball Association Q155223\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q121783 wdt:P118 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "# Now we can find NBA teams using the entity National Basketball Association Q155223\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name ?playerName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   # get the label\n",
    "   ?team sc:name ?name .\n",
    "}\n",
    "order by ?name\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# And then we can find the players that played for those teams\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name ?playerName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?team  wdt:P31 wd:Q13393265 ;\n",
    "          wdt:P118 wd:Q155223 .\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 ;\n",
    "                     wdt:P54 ?team .\n",
    "   ?basketballPlayer sc:name ?playerName .\n",
    "   # get the label\n",
    "   ?team sc:name ?name .\n",
    "}\n",
    "order by ?name\n",
    "LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "# Now we need to find exah players nationality. In our previuos tasks we found the propert \"country of citizenship\" IRI P27.\n",
    "# But we need to find the continent of each player\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketballPlayer ?name ?country ?countryName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer wdt:P27 ?country.\n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?country sc:name ?countryName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# I'll explore the properties of a country to find it's continent\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer wdt:P27 ?country.\n",
    "   ?country ?p ?obj .\n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?country sc:name ?countryName.\n",
    "   ?p sc:name ?pName.\n",
    "   ?country sc:name ?countryName.\n",
    "   FILTER regex(?pName, \".*continent.*\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "#Perfect! the country has a \"continent\" property IRI P30. Let's use it to find the continent of each of the players\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?basketballPlayer ?name ?continent ?continentName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer wdt:P27 ?country.\n",
    "   ?country wdt:P30 ?continent .\n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?continent sc:name ?continentName.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "#Now we cancount the players of each continent\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?continent ?continentName count(?basketballPlayer) as ?players\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer wdt:P27 ?country.\n",
    "   ?country wdt:P30 ?continent .\n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?continent sc:name ?continentName.\n",
    "}\n",
    "GROUP BY ?continent ?continentName\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9b325d0",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ffc3cd3b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?continent ?continentName count(?basketballPlayer) as ?players\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 .\n",
    "   ?basketballPlayer wdt:P27 ?country.\n",
    "   ?country wdt:P30 ?continent .\n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?continent sc:name ?continentName.\n",
    "}\n",
    "GROUP BY ?continent ?continentName\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d67d938e",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Identify the BGP for the NBA Most Valuable Player Award (MVP) (see https://en.wikipedia.org/wiki/NBA_Most_Valuable_Player_Award)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "859d416e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q222047'), ('name', 'NBA Most Valuable Player Award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Let's explore the properties of Lebron James to find if he's ever won the award\n",
    "# We have a \"award received\" IRI P166. We can explore it\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Exploring the \"award received\" for Lebron James.\n",
    "#lebron james has won the award and it's IRI is Q222047\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36159 wdt:P166 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# Let's look at what type of award it is\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q222047 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "# let's write the final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q652965 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "   FILTER regex(?name, \"^NBA Most Valuable Player Award\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e61251e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "fb8e4860",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('award', 'http://www.wikidata.org/entity/Q222047'), ('name', 'NBA Most Valuable Player Award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?award ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?award wdt:P31 wd:Q652965 .\n",
    "   # get the label\n",
    "   ?award sc:name ?name.\n",
    "   FILTER regex(?name, \"^NBA Most Valuable Player Award\", \"i\")\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a4ff0a3c",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Consider the players who won the NBA Most Valuable Player Award. Return for these players the number of NBA Most Valuable Player Award won in their career (the result set must be triples of player IRI, label and #victories)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "fd77e60a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q190094'), ('name', 'Allen Iverson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q242185'), ('name', 'Bill Russell'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q363246'), ('name', 'Bill Walton'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q312643'), ('name', 'Bob Cousy'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q553232'), ('name', 'Bob McAdoo'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q368561'), ('name', 'Bob Pettit'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q192707'), ('name', 'Charles Barkley'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q264393'), ('name', 'Dave Cowens'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q211876'), ('name', 'David Robinson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q205326'), ('name', 'Derrick Rose'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q44068'), ('name', 'Dirk Nowitzki'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q8991894'), ('name', 'Giannis Antetokounmpo'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q273256'), ('name', 'Hakeem Olajuwon'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q136678'), ('name', 'James Harden'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q209921'), ('name', 'Julius Erving'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q179051'), ('name', 'Kareem Abdul-Jabbar'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q199896'), ('name', 'Karl Malone'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q29545'), ('name', 'Kevin Durant'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q189240'), ('name', 'Kevin Garnett'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q25369'), ('name', 'Kobe Bryant'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q190152'), ('name', 'Larry Bird'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q36159'), ('name', 'LeBron James'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q134183'), ('name', 'Magic Johnson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q41421'), ('name', 'Michael Jordan'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q316179'), ('name', 'Moses Malone'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q17281073'), ('name', 'Nikola Jokić'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q17717'), ('name', 'Oscar Robertson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q196185'), ('name', 'Russell Westbrook'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q169452'), ('name', \"Shaquille O'Neal\"), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q352159'), ('name', 'Stephen Curry'), ('victories', '1')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#Let's find all the instances of a player winnig the award\n",
    "queryString = \"\"\"\n",
    "SELECT ?basketballPlayer ?name ?award ?awardName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 ;\n",
    "                     wdt:P166 ?award .\n",
    "   ?award wdt:P31 wd:Q652965 . \n",
    "   ?basketballPlayer sc:name ?name .\n",
    "   ?award sc:name ?awardName .\n",
    "   FILTER regex(?awardName, \"^NBA Most Valuable Player Award\", \"i\")\n",
    "}\n",
    "ORDER BY ?name\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "#now we can count the victories\n",
    "queryString = \"\"\"\n",
    "SELECT ?basketballPlayer ?name count(?award) as ?victories\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 ;\n",
    "                     wdt:P166 ?award .\n",
    "   ?award wdt:P31 wd:Q652965 . \n",
    "           ?basketballPlayer sc:name ?name .\n",
    "   ?award sc:name ?awardName .\n",
    "   FILTER regex(?awardName, \"^NBA Most Valuable Player Award\", \"i\")\n",
    "}\n",
    "GROUP BY ?basketballPlayer ?name \n",
    "ORDER BY ?name\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "533d8641",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "a8f65fee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q190094'), ('name', 'Allen Iverson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q242185'), ('name', 'Bill Russell'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q363246'), ('name', 'Bill Walton'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q312643'), ('name', 'Bob Cousy'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q553232'), ('name', 'Bob McAdoo'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q368561'), ('name', 'Bob Pettit'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q192707'), ('name', 'Charles Barkley'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q264393'), ('name', 'Dave Cowens'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q211876'), ('name', 'David Robinson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q205326'), ('name', 'Derrick Rose'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q44068'), ('name', 'Dirk Nowitzki'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q8991894'), ('name', 'Giannis Antetokounmpo'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q273256'), ('name', 'Hakeem Olajuwon'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q136678'), ('name', 'James Harden'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q209921'), ('name', 'Julius Erving'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q179051'), ('name', 'Kareem Abdul-Jabbar'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q199896'), ('name', 'Karl Malone'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q29545'), ('name', 'Kevin Durant'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q189240'), ('name', 'Kevin Garnett'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q25369'), ('name', 'Kobe Bryant'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q190152'), ('name', 'Larry Bird'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q36159'), ('name', 'LeBron James'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q134183'), ('name', 'Magic Johnson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q41421'), ('name', 'Michael Jordan'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q316179'), ('name', 'Moses Malone'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q17281073'), ('name', 'Nikola Jokić'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q17717'), ('name', 'Oscar Robertson'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q196185'), ('name', 'Russell Westbrook'), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q169452'), ('name', \"Shaquille O'Neal\"), ('victories', '1')]\n",
      "[('basketballPlayer', 'http://www.wikidata.org/entity/Q352159'), ('name', 'Stephen Curry'), ('victories', '1')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT ?basketballPlayer ?name count(?award) as ?victories\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?basketballPlayer wdt:P106 wd:Q3665646 ;\n",
    "                     wdt:P31 wd:Q5 ;\n",
    "                     wdt:P166 ?award .\n",
    "   ?award wdt:P31 wd:Q652965 . \n",
    "           ?basketballPlayer sc:name ?name .\n",
    "   ?award sc:name ?awardName .\n",
    "   FILTER regex(?awardName, \"^NBA Most Valuable Player Award\", \"i\")\n",
    "}\n",
    "GROUP BY ?basketballPlayer ?name \n",
    "ORDER BY ?name\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
