{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e4a43dd2",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e8c00b02",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-54f5b7e1cb-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22c618e2",
   "metadata": {},
   "source": [
    "# Movie Workflow Series (\"Production company explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the main companies working on cinema-related content. We want to know which are the main television production companies and the film production companies, which company distributes more film and some consideration about awards."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c2003864",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P106`     | profession   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q36479`    | The Lion King      | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "17479ca2",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q36479 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of The Lion King**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for Netflix\n",
    "\n",
    "3. Identify the BGP for television production company\n",
    "\n",
    "4. Identify the BGP for film production company\n",
    "\n",
    "5. Find the top-5 companies (amongst television production company and film production company) which produced the highest number of crime films (the result set must be a list of triples company IRI, label and #crime film).\n",
    "\n",
    "6. Find the company (amongst television production company and film production company) which distributed more films (of any kind of film genre) that they did not produce (the result set must be a list of triples company IRI, label and #film).\n",
    "\n",
    "7. Find how many company are listed in every stock exchange market (the result set must be a list of triples stock exchange IRI, label and #companies). \n",
    "\n",
    "8. Identify the BGP for Academy Award\n",
    "\n",
    "9. Find the companies (among television and film production companies) that won at least 5 Academy Awards for Best Actress for the movies they produced (the result set must be a list of triples company IRI, label and #awards)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d40606ed",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "fddd8bba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3092'), ('name', 'film crew member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4021'), ('name', 'danskefilm animated film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7679'), ('name', 'Cinépolis KLIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "9ad0331e-a47e-4dde-b6bc-6f541655259e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3593'), ('name', 'AFI Catalog of Feature Films ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7118'), ('name', 'AMPAS collections film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6145'), ('name', 'Academy Awards Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1562'), ('name', 'AllMovie title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2465'), ('name', 'Allcinema film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1265'), ('name', 'AlloCiné film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9586'), ('name', 'Apple TV movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3280'), ('name', 'BAnQ author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4632'), ('name', 'Bechdel Test Movie List ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5384'), ('name', 'Behind The Voice Actors film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4933'), ('name', 'Big Cartoon Database ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1237'), ('name', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2758'), ('name', 'CNC film rating (France)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3402'), ('name', 'CNC film rating (Romania)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4665'), ('name', 'CineMagia title ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3077'), ('name', 'Cineplex Germany film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3203'), ('name', 'Ciné-Ressources film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4276'), ('name', 'Cinémathèque québécoise work identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7679'), ('name', 'Cinépolis KLIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1804'), ('name', 'DNF film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3509'), ('name', 'Dagens Nyheter topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3844'), ('name', 'Deutsche Synchronkartei film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6181'), ('name', 'Disney A to Z ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7595'), ('name', 'Disney+ movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4529'), ('name', 'Douban film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2704'), ('name', 'EIDR content ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2346'), ('name', 'Elonet movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P480'), ('name', 'FilmAffinity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7975'), ('name', 'Filmfront film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2747'), ('name', 'Filmiroda rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6562'), ('name', 'Google Play Movies & TV ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4483'), ('name', 'INDUCKS story ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3212'), ('name', 'ISAN')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3110'), ('name', 'ISzDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5099'), ('name', 'Il mondo dei doppiatori ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2508'), ('name', 'KINENOTE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5311'), ('name', 'Kino-teatr.ua film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2603'), ('name', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8847'), ('name', 'Kinorium movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4282'), ('name', 'LUMIERE film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3107'), ('name', 'LdiF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6127'), ('name', 'Letterboxd film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7212'), ('name', 'LyricsTranslate ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1657'), ('name', 'MPAA film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7299'), ('name', 'MUBI film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1712'), ('name', 'Metacritic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5885'), ('name', 'Microsoft Store product ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8033'), ('name', 'Movie Review Query Engine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1970'), ('name', 'MovieMeter film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5786'), ('name', 'Moviepilot.de film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4619'), ('name', 'National Library of Brazil ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1874'), ('name', 'Netflix ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6900'), ('name', 'NicoNicoPedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3138'), ('name', 'OFDb film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3302'), ('name', 'Open Media Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P905'), ('name', 'PORT film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4515'), ('name', 'Prisma ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3834'), ('name', 'RTC film rating')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1258'), ('name', 'Rotten Tomatoes ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2518'), ('name', 'Scope.dk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3854'), ('name', 'Soundtrack Collector ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2334'), ('name', 'Swedish Film Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2631'), ('name', 'TCM Movie Database film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4947'), ('name', 'TMDb movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3804'), ('name', 'TV Guide show ID (former scheme)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2638'), ('name', 'TV.com ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3808'), ('name', 'The Numbers movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6942'), ('name', 'animator')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3174'), ('name', 'art director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5021'), ('name', 'assessment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2142'), ('name', 'box office')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2769'), ('name', 'budget')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P674'), ('name', 'characters')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4786'), ('name', 'cinematografo film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2130'), ('name', 'cost')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4021'), ('name', 'danskefilm animated film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P750'), ('name', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P437'), ('name', 'distribution format')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2047'), ('name', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1431'), ('name', 'executive producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2755'), ('name', 'exploitation visa number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2079'), ('name', 'fabrication method')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3092'), ('name', 'film crew member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1040'), ('name', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('name', 'followed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P747'), ('name', 'has edition or translation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6398'), ('name', 'iTunes movie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P941'), ('name', 'inspired by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P840'), ('name', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P179'), ('name', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2364'), ('name', 'production code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P272'), ('name', 'production company')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2554'), ('name', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P577'), ('name', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8411'), ('name', 'set in environment')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P406'), ('name', 'soundtrack release')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3275'), ('name', 'storyboard artist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1434'), ('name', 'takes place in fictional universe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P942'), ('name', 'theme music')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1476'), ('name', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2529'), ('name', 'ČSFD film ID')]\n",
      "141\n"
     ]
    }
   ],
   "source": [
    "# Lion King all props\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b1ce8482-efbb-4bf3-90d5-0663790a2b99",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q29168811'), ('oName', 'animated feature film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Lion King instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "c7a4d293-1d96-4d3d-8320-204c3067e5ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P461'), ('name', 'opposite of'), ('obj', 'http://www.wikidata.org/entity/Q17517379'), ('oName', 'animated short film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q202866'), ('oName', 'animated film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q24869'), ('oName', 'feature film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q8254220'), ('oName', 'Category:Animated feature films')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# animated feature film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q29168811 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "39ad52f8-c63a-40fd-a2e0-c59d044412c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P345'), ('oName', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item'), ('obj', 'http://www.wikidata.org/entity/Q134430'), ('oName', 'Snow White and the Seven Dwarfs')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P2047'), ('oName', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q6522809'), ('oName', 'Category:Animated films')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P2079'), ('oName', 'fabrication method')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P921'), ('oName', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q11424'), ('oName', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2079'), ('name', 'fabrication method'), ('obj', 'http://www.wikidata.org/entity/Q11425'), ('oName', 'animation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P577'), ('oName', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P495'), ('oName', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P136'), ('oName', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P840'), ('oName', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P86'), ('oName', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P461'), ('name', 'opposite of'), ('obj', 'http://www.wikidata.org/entity/Q517386'), ('oName', 'live action')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('name', 'model item'), ('obj', 'http://www.wikidata.org/entity/Q15270647'), ('oName', 'Zootopia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P2554'), ('oName', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P57'), ('oName', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P58'), ('oName', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P144'), ('oName', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P3275'), ('oName', 'storyboard artist')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q13583287'), ('oName', 'Template:Infobox animanga/Anime')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P10'), ('oName', 'video')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q13411747'), ('oName', 'Template:Infobox animanga/Video')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P2603'), ('oName', 'Kinopoisk film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P1934'), ('oName', 'Animator.ru film ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('name', 'properties for this type'), ('obj', 'http://www.wikidata.org/entity/P725'), ('oName', 'voice actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4969'), ('name', 'derivative work'), ('obj', 'http://www.wikidata.org/entity/Q18663726'), ('oName', 'Stone Protectors')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q13091155'), ('oName', 'Template:Infobox cartoon film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\"), ('obj', 'http://www.wikidata.org/entity/Q18991727'), ('oName', 'Template:Infobox animanga/Movie')]\n",
      "29\n"
     ]
    }
   ],
   "source": [
    "# animated film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q202866 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "a1988aae-1757-46e2-a59c-1c2e06ca3ccd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of'), ('obj', 'http://www.wikidata.org/entity/Q11424'), ('oName', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality'), ('obj', 'http://www.wikidata.org/entity/Q2199864'), ('oName', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P461'), ('name', 'opposite of'), ('obj', 'http://www.wikidata.org/entity/Q24862'), ('oName', 'short film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5135'), ('name', 'greater than'), ('obj', 'http://www.wikidata.org/entity/Q24862'), ('oName', 'short film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5135'), ('name', 'greater than'), ('obj', 'http://www.wikidata.org/entity/Q24865'), ('oName', 'medium-length film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\"), ('obj', 'http://www.wikidata.org/entity/Q32118748'), ('oName', 'Category:Feature films')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# feature film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q24869 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?name.\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d62cca7b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c993cec2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# BGP for film\n",
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE {\n",
    "   BIND(wd:Q11424 AS ?iri)\n",
    "   ?iri sc:name ?name.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba61d623",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Identify the BGP for Netflix"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "0290a739",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "#props of netflix id of Lion King\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   wd:Q36479 wdt:P1874 ?obj . #obj is netflx id\n",
    "   ?obj ?p ?o.\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "170b3a26-7074-4d43-afae-358163a70dfd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q54958752'), ('name', 'Disney+')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1097348'), ('name', 'InterCom')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q135288'), ('name', 'Microsoft Store')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1323594'), ('name', 'Walt Disney Studios Motion Pictures')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#what distributed Lion King\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   wd:Q36479 wdt:P750 ?obj . #distributed by obj\n",
    "   ?obj  sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19eb40fc",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "87c1c307",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# BGP for Netflix\n",
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE {\n",
    "   BIND(wd:Q907311 AS ?iri)\n",
    "   ?iri sc:name ?name.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40bb359a",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Identify the BGP for television production company"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "c4e90505",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8939'), ('name', 'Google Play developer slug')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P112'), ('name', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1128'), ('name', 'employees')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P127'), ('name', 'owned by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1454'), ('name', 'legal form')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1581'), ('name', 'official blog')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1661'), ('name', 'Alexa rank')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1687'), ('name', 'Wikidata property')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P169'), ('name', 'chief executive officer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1833'), ('name', 'number of registered users/contributors')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1846'), ('name', 'distribution map')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2037'), ('name', 'GitHub username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2088'), ('name', 'Crunchbase organization ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2139'), ('name', 'total revenue')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2283'), ('name', 'uses')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2295'), ('name', 'net profit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2397'), ('name', 'YouTube channel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2403'), ('name', 'total assets')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2427'), ('name', 'GRID ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2572'), ('name', 'hashtag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3362'), ('name', 'operating income')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3418'), ('name', 'Google Play Store app ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P355'), ('name', 'subsidiary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3797'), ('name', 'autonomous system number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3836'), ('name', 'Pinterest username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3861'), ('name', 'App Store app ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P400'), ('name', 'platform')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4013'), ('name', 'Giphy username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P414'), ('name', 'stock exchange')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4264'), ('name', 'LinkedIn company ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4354'), ('name', 'search formatter URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4776'), ('name', 'MAC Address Block Large ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6181'), ('name', 'Disney A to Z ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6760'), ('name', 'Know Your Meme ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6782'), ('name', 'ROR ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6849'), ('name', 'DR topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6900'), ('name', 'NicoNicoPedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7085'), ('name', 'TikTok username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7157'), ('name', 'The Top Tens ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7306'), ('name', 'Downdetector ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P740'), ('name', 'location of formation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7502'), ('name', 'Golden ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7771'), ('name', 'PersonalData.IO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8687'), ('name', 'social media followers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9138'), ('name', 'service status information URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9346'), ('name', 'France24 topic ID (French)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P946'), ('name', 'ISIN')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9618'), ('name', 'AlternativeTo software ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P966'), ('name', 'MusicBrainz label ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3242'), ('name', 'SIC code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5531'), ('name', 'Central Index Key')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6869'), ('name', 'Hoopla publisher ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7997'), ('name', 'GRY-Online company ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2531'), ('name', 'Box Office Mojo studio ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5576'), ('name', 'EDb company ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6954'), ('name', 'online access status')]\n",
      "99\n"
     ]
    }
   ],
   "source": [
    "# Netflix props\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   wd:Q907311 ?p ?o.\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "6429123f-180e-4f57-a4da-5abb8c34537d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q10689397'), ('name', 'television production company')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4830453'), ('name', 'business')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q723685'), ('name', 'video on demand')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q891723'), ('name', 'public company')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15265344'), ('name', 'broadcaster')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q368290'), ('name', 'film distributor')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q841645'), ('name', 'Internet television')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1194970'), ('name', 'dot-com company')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# Netflix instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   wd:Q907311 wdt:P31 ?o.\n",
    "   ?o sc:name ?name.\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b579f588",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "1a53c7c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q10689397'), ('name', 'television production company')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# BGP for television production company\n",
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE {\n",
    "   BIND(wd:Q10689397 AS ?iri)\n",
    "   ?iri sc:name ?name.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "08984669",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "Identify the BGP for film production company"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e3448b9e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "# tv prod company props\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE {\n",
    "   wd:Q10689397 ?p ?o.\n",
    "   ?p sc:name ?name.\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "18b28981-24a5-452c-892a-887de7987919",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q1762059'), ('name', 'film production company')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19364326'), ('name', 'media studio facility')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11396960'), ('name', 'production company')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# tv prod company subclass of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {\n",
    "   wd:Q10689397 wdt:P279 ?o.\n",
    "   ?o sc:name ?name.\n",
    "}\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6b793e1a",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "72ab9729",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1762059'), ('name', 'film production company')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# BGP for film production company\n",
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE {\n",
    "   BIND(wd:Q1762059 AS ?iri)\n",
    "   ?iri sc:name ?name.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4d3fd60c",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Find the top-5 companies (amongst television production company and film production company) which produced the highest number of crime films (the result set must be a list of triples company IRI, label and #crime film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c6df5598",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q191224'), ('oName', 'Walt Disney Pictures')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1047410'), ('oName', 'Walt Disney Animation Studios')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Lion King production company\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 wdt:P272 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "beec83df-a8af-4d1b-97ac-24baf4e27ec7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1072843'), ('oName', 'Don Hahn')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Lion King producer\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 wdt:P162 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "fb0d9509-9b47-4acb-8a57-20c60ea1f326",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('f', 'http://www.wikidata.org/entity/Q8178307'), ('oName', '15 Park Avenue')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q8197668'), ('oName', 'Idiot Love')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q319263'), ('oName', 'Doctor in the House')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q8452990'), ('oName', \"Sunday League - Pepik Hnatek's Final Match\")]\n",
      "[('f', 'http://www.wikidata.org/entity/Q284184'), ('oName', 'Ra.One')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13637926'), ('oName', 'Indra')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13638153'), ('oName', 'Inner Senses')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13645807'), ('oName', 'Madhumasam')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13647258'), ('oName', 'Marupakkam')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13677566'), ('oName', 'Timberjack')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13693967'), ('oName', 'Cross')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15464247'), ('oName', 'What the Fish')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15475237'), ('oName', 'Mediastan')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15490985'), ('oName', 'Jailhouse Heat')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15046558'), ('oName', 'Life After Beth')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15584559'), ('oName', 'Salvation Nell')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15596853'), ('oName', 'Burying the Ex')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q10323448'), ('oName', 'Mamata')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q12360731'), ('oName', 'The Phantom of the Opera')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q13732569'), ('oName', 'Move On')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15721015'), ('oName', 'Mamathe')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15721180'), ('oName', 'Midida Hrudayagalu')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15721250'), ('oName', 'Muriyada Mane')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15721274'), ('oName', 'Mruthyunjaya')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15721789'), ('oName', 'Rudra')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15722883'), ('oName', 'Seethe Alla Savithri')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15723065'), ('oName', 'Swabhimana')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15723163'), ('oName', 'Halli Rambhe Belli Bombe')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15723755'), ('oName', 'Emiti Bi Prema Hue')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724060'), ('oName', 'Chakabhaunri')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724100'), ('oName', 'Chinha Achinha')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724157'), ('oName', 'Jibana Dhara')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724176'), ('oName', 'Jheeati Sita Pari')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724178'), ('oName', 'Jhili Mili')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724242'), ('oName', 'Tu Mo Girlfriend')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724264'), ('oName', 'Dandabalunga')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724322'), ('oName', 'Dosti')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724600'), ('oName', 'Territoriu de bandolerus')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724695'), ('oName', 'Priyatama')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724701'), ('oName', 'Prem Bandhan')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724703'), ('oName', 'Prem weds Priya')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724730'), ('oName', 'Batasi Jhada')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724747'), ('oName', 'Barsa My Darling')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724803'), ('oName', 'Basanti Apa')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724887'), ('oName', 'Bahu Heba Emiti')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15724998'), ('oName', 'Maa O Mamata')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725013'), ('oName', 'Maan Abhiman')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725052'), ('oName', 'Mo Mana Khali Tori Pain')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725072'), ('oName', 'Jor Jar Mulak Tar')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725190'), ('oName', 'Shapath')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725213'), ('oName', 'Sita Rati')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725225'), ('oName', 'Sharddhanjali')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725267'), ('oName', 'Santana')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725300'), ('oName', 'Sakhi Rahila Ae Singha Duara')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725345'), ('oName', 'Sindura Bindu')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725358'), ('oName', 'Suna Bhauja')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725405'), ('oName', 'Hare Krushna Hare Rama')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15725414'), ('oName', 'Haata Dhari Chaaluthaa')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15726151'), ('oName', 'Horseplay')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15728077'), ('oName', \"We're Only Human\")]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15729023'), ('oName', 'Club Sandwich')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15729320'), ('oName', 'El heredero de Casa Pruna')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15729771'), ('oName', 'Stallo: Curse of the Shaman')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15729835'), ('oName', 'Zone Pro Site')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15730627'), ('oName', 'Flamenco Flamenco')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15731589'), ('oName', 'Obhishopto Nighty')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15732538'), ('oName', 'Chapliniana')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15734080'), ('oName', 'Atman')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15735966'), ('oName', 'Dani Daniels: Dare')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15742636'), ('oName', 'In the Sands of Babylon')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15762515'), ('oName', 'Second Origin')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15964719'), ('oName', 'Harakeya Kuri')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q16254066'), ('oName', 'Shabdavedhi')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q16990973'), ('oName', 'Ratha Sapthami')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q17300104'), ('oName', 'Shiva Mecchida Kannappa')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q1758112'), ('oName', \"Ender's Game\")]\n",
      "[('f', 'http://www.wikidata.org/entity/Q18201768'), ('oName', 'Mrugaalaya')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q19573095'), ('oName', 'Mr. Rajkumar')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q19573145'), ('oName', 'Mutthu Ondu Mutthu')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q19599701'), ('oName', 'Sri Shaila Mahathme')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q19600314'), ('oName', 'Vijayanagarada Veeraputhra')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q20724304'), ('oName', 'The Purge: Election Year')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q27963105'), ('oName', 'Mallige Hoove')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q4804524'), ('oName', 'Ashaant')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q4829598'), ('oName', 'Aw Aaakare Aa')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q48671658'), ('oName', 'Love Maadi Nodu')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q6419692'), ('oName', 'Klanta Aparahna')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q7288656'), ('oName', 'Rama Shama Bhama')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q7495873'), ('oName', 'Shhh!')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q8060324'), ('oName', 'Yuga Purusha')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q11727212'), ('oName', 'The Golden Lotus')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15843030'), ('oName', 'Rose Bernd')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15845171'), ('oName', 'The Falcon Out West')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15850483'), ('oName', 'The Fight for Life')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15853884'), ('oName', 'Weit ist der Weg')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15856724'), ('oName', 'Avengers XXX – A Porn Parody')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15857417'), ('oName', 'E.T. XXX – A Dreamzone Parody')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15859580'), ('oName', 'Keller – Teenage Wasteland')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15859668'), ('oName', 'Little Man, What Now?')]\n",
      "[('f', 'http://www.wikidata.org/entity/Q15863744'), ('oName', 'Thegidi')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# instances of film\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?f ?oName\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?f wdt:P31 wd:Q11424.\n",
    "   # get the label\n",
    "   ?f sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "bf10a72f-317b-44fc-b5c9-752cfdedbc17",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P144'), ('name', 'based on'), ('o', 'http://www.wikidata.org/entity/Q1746652'), ('oName', 'Little Man, What Now?')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q91333'), ('oName', 'Jakob Tiedtke')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q90022'), ('oName', 'Blandine Ebinger')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q11424'), ('oName', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre'), ('o', 'http://www.wikidata.org/entity/Q130232'), ('oName', 'drama')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin'), ('o', 'http://www.wikidata.org/entity/Q183'), ('oName', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P364'), ('name', 'original language of film or TV show'), ('o', 'http://www.wikidata.org/entity/Q188'), ('oName', 'German')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P462'), ('name', 'color'), ('o', 'http://www.wikidata.org/entity/Q838368'), ('oName', 'black and white')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q120985'), ('oName', 'Hertha Thiele')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P58'), ('name', 'screenwriter'), ('o', 'http://www.wikidata.org/entity/Q76184'), ('oName', 'Herbert Selpin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1877'), ('name', 'after a work by'), ('o', 'http://www.wikidata.org/entity/Q76539'), ('oName', 'Hans Fallada')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q69236'), ('oName', 'Theo Lingen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P162'), ('name', 'producer'), ('o', 'http://www.wikidata.org/entity/Q1601419'), ('oName', 'Robert Neppach')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q86034'), ('oName', 'Hermann Thimig')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P86'), ('name', 'composer'), ('o', 'http://www.wikidata.org/entity/Q1114648'), ('oName', 'Harald Böhmelt')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q114558'), ('oName', 'Ida Wüst')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P344'), ('name', 'director of photography'), ('o', 'http://www.wikidata.org/entity/Q1382764'), ('oName', 'Ewald Daub')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q90910'), ('oName', 'Viktor de Kowa')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member'), ('o', 'http://www.wikidata.org/entity/Q98363'), ('oName', 'Fritz Kampers')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P57'), ('name', 'director'), ('o', 'http://www.wikidata.org/entity/Q88001'), ('oName', 'Fritz Wendhausen')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# props of random film (Little Man, What Now?)\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?name ?o ?oName\n",
    "WHERE {\n",
    "   wd:Q15859668 ?p ?o.\n",
    "   ?p sc:name ?name.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "232b11d9-e3a1-492e-ae83-230f9192e715",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q201658'), ('oName', 'film genre')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#drama instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "    wd:Q130232 wdt:P31 ?o.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "f104041f-abcb-409c-9c4b-3d5f5ecd86d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q4674071'), ('oName', 'Acid Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108179271'), ('oName', 'Arthouse animation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q223770'), ('oName', 'B movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4836991'), ('oName', 'B western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3461143'), ('oName', 'BDSM film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q31086090'), ('oName', 'Barbarian film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q84041'), ('oName', 'Bavarian porn')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7717463'), ('oName', 'Bible film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q48816645'), ('oName', 'Black film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q93196'), ('oName', 'Bollywood')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16247268'), ('oName', 'Bollywood horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4950139'), ('oName', 'Bourekas film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q849666'), ('oName', 'Brickfilm')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q580013'), ('oName', 'Bruceploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30726555'), ('oName', 'Category:Films set in antiquity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q81552104'), ('oName', 'Chakma cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q82721965'), ('oName', 'Chakwood')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5070847'), ('oName', 'Chanchada')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5104880'), ('oName', 'Chopsocky')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28026639'), ('oName', 'Christmas film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2742446'), ('oName', 'Cinéma pur')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1115187'), ('oName', \"Commedia all'italiana\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2991565'), ('oName', \"Commedia sexy all'italiana\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q60753838'), ('oName', 'Computer screen film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1323308'), ('oName', 'Direct Cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1278107'), ('oName', 'Eastern')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q26268098'), ('oName', 'Eastern')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q759779'), ('oName', 'Enlightenment film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6722594'), ('oName', 'Euro War')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5413472'), ('oName', 'European art cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5449041'), ('oName', 'Film à clef')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11859599'), ('oName', 'Findie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q23044991'), ('oName', 'Finnish horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5461696'), ('oName', 'Florida Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1352102'), ('oName', 'Free Cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18331260'), ('oName', 'French comedy films')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q105320349'), ('oName', 'Gay-related film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2916932'), ('oName', 'Gendai-geki')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973158'), ('oName', 'Genre movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5551875'), ('oName', 'German underground horror')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5578091'), ('oName', 'Gokudō')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5583970'), ('oName', 'Goona-goona epic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25230421'), ('oName', 'Gothic romance film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3778115'), ('oName', 'Gross out')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5622029'), ('oName', 'Guy-cry film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25636204'), ('oName', 'Haredi cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q304538'), ('oName', 'Heimatfilm')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1621121'), ('oName', 'Hitchcockian film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3772578'), ('oName', 'Home movies')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q167776'), ('oName', 'Italian neorealism')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2584671'), ('oName', 'Japanese horror')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q629917'), ('oName', 'Jidaigeki')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28164087'), ('oName', 'Jollywood')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1065444'), ('oName', 'Kaiju')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1502766'), ('oName', 'Kammerspielfilm')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5620056'), ('oName', 'Korean horror')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20442589'), ('oName', 'LGBT-related film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q102141681'), ('oName', 'Lesbian and Gay Film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25975'), ('oName', \"Let's Play\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6696549'), ('oName', 'Lucha film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3028680'), ('oName', 'Masala')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4044177'), ('oName', 'Mexploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11894225'), ('oName', 'Military comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1550219'), ('oName', 'Mo lei tau')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6926334'), ('oName', 'Mouth of Garbage film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1108032'), ('oName', 'Mumblecore')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6943011'), ('oName', 'Muslim social')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q535518'), ('oName', 'Nazi exploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2724311'), ('oName', 'New Queer Cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3344204'), ('oName', 'Northern')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2002987'), ('oName', 'Novo Cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7116678'), ('oName', 'Ozploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7134948'), ('oName', 'Parallel Cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1433443'), ('oName', 'Peplum film genre')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5712461'), ('oName', 'Persian Film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7234396'), ('oName', 'Postmodernist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1456178'), ('oName', 'Prussian film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3677206'), ('oName', 'Quinqui (film genre)')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107278078'), ('oName', 'Realist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q268854'), ('oName', 'Red Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q66425231'), ('oName', 'Redsploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q491158'), ('oName', 'Revisionist Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7379160'), ('oName', 'Rumberas film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18355406'), ('oName', 'Satanic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2263701'), ('oName', 'Sceneggiata')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2145099'), ('oName', 'Sex report film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6142791'), ('oName', 'Shinpa')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3482453'), ('oName', 'Shomin-geki')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q65088741'), ('oName', 'Skate video')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3964495'), ('oName', 'Somaliwood')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7568398'), ('oName', 'South Seas')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4235011'), ('oName', 'Space Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10674355'), ('oName', 'Spanish horror movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2000178'), ('oName', 'Telefoni Bianchi')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q61117528'), ('oName', 'Ukrainian poetic cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q370630'), ('oName', 'Web film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q775169'), ('oName', 'Weird West')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172980'), ('oName', 'Western film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1669985'), ('oName', 'Wiener Film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1451709'), ('oName', \"Women's cinema\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1117103'), ('oName', 'Z movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8066387'), ('oName', 'Zapata Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16824564'), ('oName', 'absolute film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q332564'), ('oName', 'abstract film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2678111'), ('oName', 'action comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q188473'), ('oName', 'action film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q78461348'), ('oName', 'action-adventure film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108357966'), ('oName', 'actual play')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4677832'), ('oName', 'actuality film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3249257'), ('oName', 'adult animation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q319221'), ('oName', 'adventure film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20656352'), ('oName', 'alternate history film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18466840'), ('oName', 'alternative cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q455620'), ('oName', 'amateur film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q56240556'), ('oName', 'amusement ride film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11857634'), ('oName', 'animal fantasy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q17175676'), ('oName', 'animated cartoon')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4765076'), ('oName', 'animated documentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1107'), ('oName', 'anime')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20650540'), ('oName', 'anime film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q336144'), ('oName', 'anthology film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4774498'), ('oName', 'anti-war film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q47009776'), ('oName', 'apocalyptic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1135802'), ('oName', 'art film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4797626'), ('oName', 'arthouse action film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3076696'), ('oName', 'association football film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13209138'), ('oName', 'auteur film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072024'), ('oName', 'autobiographical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4839755'), ('oName', 'backstage musical')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q798555'), ('oName', 'backwoods film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4840473'), ('oName', 'bad girl movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4484381'), ('oName', 'ballet film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108258724'), ('oName', 'bandy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4875794'), ('oName', 'beach party film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q645928'), ('oName', 'biographical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5778924'), ('oName', 'black comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q883179'), ('oName', 'blaxploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4925568'), ('oName', 'blaxploitation horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4930081'), ('oName', 'blue film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q102260466'), ('oName', 'body horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q895583'), ('oName', 'boxing film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18398246'), ('oName', 'bromantic comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4984974'), ('oName', 'buddy cop film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q663106'), ('oName', 'buddy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1480924'), ('oName', 'cabview film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1723850'), ('oName', 'cannibal film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108202399'), ('oName', 'cheerleading films')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2075808'), ('oName', 'chick flick')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4207328'), ('oName', 'child erotica')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2143665'), ('oName', \"children's film\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18466908'), ('oName', 'cinema marginal')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1957385'), ('oName', 'cinematic fairy tale')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1092621'), ('oName', 'cinéma vérité')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107022805'), ('oName', 'circus film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18089617'), ('oName', 'clay animation film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5145881'), ('oName', 'collage film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973149'), ('oName', 'colonial cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q157443'), ('oName', 'comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108466999'), ('oName', 'comedy horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q56296585'), ('oName', 'comedy of error')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2991535'), ('oName', 'comedy of intrigue')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5151497'), ('oName', 'comedy of remarriage')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16950433'), ('oName', 'comedy thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q859369'), ('oName', 'comedy-drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3745400'), ('oName', 'comical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q102429885'), ('oName', 'coming-of-age film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q455315'), ('oName', 'compilation film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5156753'), ('oName', 'composite film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28968258'), ('oName', 'computer-animated film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q430525'), ('oName', 'concert film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2593937'), ('oName', 'conspiracy fiction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2907760'), ('oName', 'corporate video')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q542475'), ('oName', 'costume drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q959790'), ('oName', 'crime film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19367312'), ('oName', 'crime thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1788980'), ('oName', 'crime-comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7888483'), ('oName', 'crush film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15804095'), ('oName', 'culture clash comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072043'), ('oName', 'dance film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q45893900'), ('oName', 'deaf cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25533274'), ('oName', 'detective film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q846544'), ('oName', 'disaster film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q622370'), ('oName', 'docudrama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q472637'), ('oName', 'docufiction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q93204'), ('oName', 'documentary film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q130232'), ('oName', 'drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q106878648'), ('oName', 'dramatization')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18620604'), ('oName', 'dramatization')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20443008'), ('oName', 'dystopian film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1153173'), ('oName', 'educational entertainment')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q596138'), ('oName', 'educational film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q652256'), ('oName', 'epic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q599558'), ('oName', 'erotic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11356864'), ('oName', 'essay film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3059309'), ('oName', 'ethnofiction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1371394'), ('oName', 'ethnographic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3677202'), ('oName', 'eurospy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q790192'), ('oName', 'experimental film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1067324'), ('oName', 'exploitation film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1361932'), ('oName', 'family film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3066315'), ('oName', 'fan edit')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2301591'), ('oName', 'fan film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q95440291'), ('oName', 'fantasy comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q157394'), ('oName', 'fantasy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10280356'), ('oName', 'favela movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5442753'), ('oName', 'female buddy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12912091'), ('oName', 'fiction film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1257444'), ('oName', 'film adaptation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q52207399'), ('oName', 'film based on a novel')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q52207310'), ('oName', 'film based on books')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q52162262'), ('oName', 'film based on literature')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5449011'), ('oName', 'film gris')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q185867'), ('oName', 'film noir')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q29226975'), ('oName', 'film performance')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q31836066'), ('oName', 'film portrait')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q21401869'), ('oName', 'flashback film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q104902646'), ('oName', 'folk horror')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8564978'), ('oName', 'found film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3272147'), ('oName', 'found footage')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11298267'), ('oName', 'gambling film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7444356'), ('oName', 'gangster film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q66948581'), ('oName', 'ghost film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1332055'), ('oName', 'giallo')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1776156'), ('oName', 'girls with guns')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q106117184'), ('oName', 'gongbang')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1538137'), ('oName', 'gore')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5769663'), ('oName', 'gothic horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15055012'), ('oName', 'guerrilla filmmaking')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q496523'), ('oName', 'heist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5739158'), ('oName', 'heritage film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q622310'), ('oName', 'heroic bloodshed')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2331945'), ('oName', 'high school comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5768328'), ('oName', 'hippie exploitation film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7168625'), ('oName', 'historical drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q17013749'), ('oName', 'historical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5897543'), ('oName', 'hood film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5855976'), ('oName', 'horror fantasy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q200092'), ('oName', 'horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072031'), ('oName', 'hyperlink cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108212954'), ('oName', 'ice hockey film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q459290'), ('oName', 'independent film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1029920'), ('oName', 'industrial film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q103888910'), ('oName', 'intersex film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q643684'), ('oName', 'jukebox musical')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12549246'), ('oName', 'kinojurnal')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q477371'), ('oName', 'kitchen sink realism')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q10654943'), ('oName', 'knight film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6432005'), ('oName', 'korean melodrama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072042'), ('oName', 'kung fu film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q643873'), ('oName', 'legal drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25110269'), ('oName', 'live-action/animated film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6729489'), ('oName', 'mafia comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33130924'), ('oName', 'mafia film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q102706436'), ('oName', 'magic realist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1464369'), ('oName', 'making-of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1033891'), ('oName', 'martial arts film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107210978'), ('oName', 'maximalist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6804274'), ('oName', 'meat pie Western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3990887'), ('oName', 'medical thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1919632'), ('oName', 'melodrama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30897819'), ('oName', 'melt movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6821792'), ('oName', 'message picture')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6839362'), ('oName', 'microcinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q638364'), ('oName', 'midnight movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q107210977'), ('oName', 'minimalist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1941707'), ('oName', 'mockbuster')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q459435'), ('oName', 'mockumentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1474387'), ('oName', 'mondo film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1342372'), ('oName', 'monster film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q819652'), ('oName', 'mountain film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20732395'), ('oName', 'mukbang')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1952674'), ('oName', 'mundane science fiction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1548170'), ('oName', 'musical comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q842256'), ('oName', 'musical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6942568'), ('oName', 'musical short')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3868655'), ('oName', 'musicarello')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1200678'), ('oName', 'mystery film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3331891'), ('oName', 'mythopoeia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973196'), ('oName', 'narrative cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1696148'), ('oName', 'natural horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1760864'), ('oName', 'nature documentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2421031'), ('oName', 'neo-noir')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q78528852'), ('oName', 'neo-western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q34848596'), ('oName', 'neon noir')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q735478'), ('oName', 'newsreel')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q24960157'), ('oName', 'non-fiction film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4220915'), ('oName', 'novella film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1377546'), ('oName', 'nunsploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3352071'), ('oName', 'omnibus')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16909344'), ('oName', 'opera film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7097859'), ('oName', 'operetta film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4075563'), ('oName', 'outlaw biker film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7133952'), ('oName', 'paracinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q622548'), ('oName', 'parody film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3442060'), ('oName', 'partisan film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2084909'), ('oName', 'phantom ride')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1194365'), ('oName', 'pink film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2096633'), ('oName', 'pirate film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3392969'), ('oName', 'pocket film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7207520'), ('oName', 'poetry film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2101714'), ('oName', 'police film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7210294'), ('oName', 'political drama')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2254211'), ('oName', 'political fiction')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973201'), ('oName', 'political film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q622291'), ('oName', 'political thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1740789'), ('oName', 'poliziotteschi')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3648909'), ('oName', 'popular-science film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q185529'), ('oName', 'pornographic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1341051'), ('oName', 'post-apocalyptic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q586250'), ('oName', 'prison film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q104880835'), ('oName', 'promotional film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1935609'), ('oName', 'propaganda film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8812380'), ('oName', 'pseudo-documentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q21858363'), ('oName', 'psychedelic film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7256286'), ('oName', 'psycho-biddy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q63214877'), ('oName', 'psychological drama film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2125170'), ('oName', 'race film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2254193'), ('oName', 'rape and revenge film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7301269'), ('oName', 'reality film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q9259727'), ('oName', 'religious film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3990885'), ('oName', 'religious thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3396019'), ('oName', 'remodernist film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q124922'), ('oName', 'reportage')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q628165'), ('oName', 'road movie')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1800833'), ('oName', 'rockumentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1054574'), ('oName', 'romance film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q860626'), ('oName', 'romantic comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12049743'), ('oName', 'romantic horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7362831'), ('oName', 'romantic thriller')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q882006'), ('oName', 'rubble film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q22025254'), ('oName', 'sageuk')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q169672'), ('oName', 'samurai cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3745430'), ('oName', 'satirical film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20656232'), ('oName', 'science fiction action film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20089346'), ('oName', 'science fiction animation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q103925569'), ('oName', 'science fiction anime')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q471839'), ('oName', 'science fiction film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q248583'), ('oName', 'screwball comedy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7449406'), ('oName', 'semidocumentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7751682'), ('oName', 'serial film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2273331'), ('oName', 'serial killer film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2991560'), ('oName', 'sex comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2275499'), ('oName', 'sex film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2292320'), ('oName', 'sexploitation film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q226730'), ('oName', 'silent film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q624771'), ('oName', 'slapstick')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q853630'), ('oName', 'slasher film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7542092'), ('oName', 'slow cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q644437'), ('oName', 'snuff film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16549118'), ('oName', 'social cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q95952108'), ('oName', 'social comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7551149'), ('oName', 'social guidance film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7551315'), ('oName', 'social problem film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q848512'), ('oName', 'sound film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q66914288'), ('oName', 'space adventure film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3492614'), ('oName', 'space fantasy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q64705787'), ('oName', 'spacesuit films')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q212781'), ('oName', 'spaghetti western')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973181'), ('oName', 'speculative fiction film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1186399'), ('oName', 'spin-off')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q909586'), ('oName', 'splatter film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7579035'), ('oName', 'sponsored film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1339864'), ('oName', 'sport film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2297927'), ('oName', 'spy film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20649407'), ('oName', 'stag film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q63860397'), ('oName', 'steampunk film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q457832'), ('oName', 'stoner film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q18089587'), ('oName', 'stop-motion animated film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2973217'), ('oName', 'structural film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1615638'), ('oName', 'submarine film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1535153'), ('oName', 'superhero film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3634883'), ('oName', 'supernatural film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q43911809'), ('oName', 'supernatural horror film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7645884'), ('oName', 'surf film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1190502'), ('oName', 'surrealist cinema')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15898171'), ('oName', 'survival film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11304653'), ('oName', 'suspense film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q222639'), ('oName', 'swashbuckler film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1146335'), ('oName', 'teen film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4453959'), ('oName', 'television ballet\\u200e')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7699576'), ('oName', 'tendency film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2484376'), ('oName', 'thriller film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q104765957'), ('oName', 'time-travel film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q275934'), ('oName', 'tokusatsu')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2445146'), ('oName', 'torture porn')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28968511'), ('oName', 'traditionally animated film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7832972'), ('oName', 'training film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q104097073'), ('oName', 'transgender film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2670855'), ('oName', 'travel documentary')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4461646'), ('oName', 'travelogue')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q22981906'), ('oName', 'treasure hunt film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072039'), ('oName', 'trial film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20002651'), ('oName', 'trick film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7841716'), ('oName', 'trigger film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2007999'), ('oName', 'underground film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2137852'), ('oName', 'vampire film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q24905792'), ('oName', 'vansploitation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q48773471'), ('oName', 'video essay')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2642760'), ('oName', 'vigilante film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q369747'), ('oName', 'war film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5258881'), ('oName', 'werewolf film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q83646243'), ('oName', 'western animation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8030668'), ('oName', \"woman's film\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q583768'), ('oName', 'women in prison film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108202384'), ('oName', \"women's association football film\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q108202392'), ('oName', \"women's sports film\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15858553'), ('oName', 'wuxia film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q731194'), ('oName', 'yakuza film')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1747837'), ('oName', 'zombie comedy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3072049'), ('oName', 'zombie film')]\n",
      "410\n"
     ]
    }
   ],
   "source": [
    "#all instances of film genre\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "     ?o wdt:P31 wd:Q201658.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "ORDER BY ASC(?oName)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "e59b5af4-49d0-486f-a21d-61f2c76e551f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q19361238'), ('oName', 'Wikidata metaclass')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#film genre instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oName\n",
    "WHERE {\n",
    "     wd:Q201658 wdt:P31 ?o.\n",
    "   ?o sc:name ?oName.\n",
    "}\n",
    "ORDER BY ASC(?oName)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "62f5a78c-118a-4542-ba4e-90bdfc5cb6da",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('comp', 'http://www.wikidata.org/entity/Q434841'), ('name', '20th Century Studios'), ('NcrimeFilm', '180')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q126399'), ('name', 'Warner Bros.'), ('NcrimeFilm', '164')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q186941'), ('name', 'Columbia Pictures'), ('NcrimeFilm', '118')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q168383'), ('name', 'Universal Pictures'), ('NcrimeFilm', '113')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q179200'), ('name', 'Metro-Goldwyn-Mayer'), ('NcrimeFilm', '112')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#prova finale\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?comp ?name (COUNT(?film) AS ?NcrimeFilm)\n",
    "WHERE {\n",
    "    ?film wdt:P136 wd:Q959790; #genre crime film\n",
    "        wdt:P272 ?comp.        #produced by comp\n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "ORDER BY DESC(?NcrimeFilm)\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e95a949",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "6c9bbde3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q434841'), ('name', '20th Century Studios'), ('NcrimeFilm', '180')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q126399'), ('name', 'Warner Bros.'), ('NcrimeFilm', '164')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q186941'), ('name', 'Columbia Pictures'), ('NcrimeFilm', '118')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q168383'), ('name', 'Universal Pictures'), ('NcrimeFilm', '113')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q179200'), ('name', 'Metro-Goldwyn-Mayer'), ('NcrimeFilm', '112')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "#top 5 crime film producers\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?iri ?name (COUNT(?film) AS ?NcrimeFilm)\n",
    "WHERE {\n",
    "    ?film wdt:P136 wd:Q959790; #genre crime film\n",
    "        wdt:P272 ?iri.        #produced by comp (iri)\n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?iri wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "}\n",
    "GROUP BY ?iri ?name\n",
    "ORDER BY DESC(?NcrimeFilm)\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "81ad7c6b",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Find the company (amongst television production company and film production company) which distributed more films (of any kind of film genre) that they did not produce (the result set must be a list of triples company IRI, label and #film)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "7d734f25",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix'), ('Nfilm', '26171')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#prova finale\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?comp AS ?iri) ?name (COUNT(?film) AS ?Nfilm)\n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "    ?film wdt:P750 ?comp.                     #distributed by comp\n",
    "    FILTER NOT EXISTS { ?film wdt:P272 ?comp} #not produced by comp\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "ORDER BY DESC(?Nfilm)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b9b467d8",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "575a6545",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix'), ('Nfilm', '26171')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#company with most distributed films not produced by them\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?comp AS ?iri) ?name (COUNT(?film) AS ?Nfilm)\n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "    ?film wdt:P750 ?comp.                     #distributed by comp\n",
    "    FILTER NOT EXISTS { ?film wdt:P272 ?comp} #not produced by comp\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "ORDER BY DESC(?Nfilm)\n",
    "LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cfc62bd8",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Find how many company are listed in every stock exchange market (the result set must be a list of triples stock exchange IRI, label and #companies)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3667f49e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q1526647'), ('name', 'Philippine Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q43335'), ('name', 'Bursa Malaysia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2415561'), ('name', 'Euronext Lisbon')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q891561'), ('name', 'Santiago Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q550050'), ('name', 'Belgrade Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q59551'), ('name', 'Warsaw Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q74662'), ('name', 'Fundsquare Market Infrastructure')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q851259'), ('name', 'Budapest Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q698535'), ('name', 'Wiener Börse')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3349831'), ('name', 'Chittagong Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q66320'), ('name', 'over-the-counter trading')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q491503'), ('name', 'KOSDAQ')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q495372'), ('name', 'Korea Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q661834'), ('name', 'SIX Swiss Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q819468'), ('name', 'Xetra')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1666934'), ('name', 'International Standard Industrial Classification')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q617426'), ('name', 'Bolsa de Madrid')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2306284'), ('name', 'Saint Petersburg Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q627019'), ('name', 'New Zealand Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q842108'), ('name', 'Euronext')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1752646'), ('name', 'Prague Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7386994'), ('name', 'S&P 400')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q151139'), ('name', 'Frankfurt Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q171240'), ('name', 'London Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1930860'), ('name', 'OTC Markets Group')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q217475'), ('name', 'Tokyo Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q490'), ('name', 'Milan')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q627514'), ('name', 'JSE Limited')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q82059'), ('name', 'NASDAQ')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q242345'), ('name', 'S&P 500')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q507306'), ('name', 'NASDAQ-100')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13677'), ('name', 'New York Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13683'), ('name', 'NYSE Euronext')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q496672'), ('name', 'Hong Kong Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q732670'), ('name', 'Australian Securities Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q739514'), ('name', 'Shanghai Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q936563'), ('name', 'Italian Bourse')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1022714'), ('name', 'CAC Small')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1146518'), ('name', 'Euronext Brussels')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2385849'), ('name', 'Euronext Paris')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q478720'), ('name', 'Euronext Amsterdam')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q517750'), ('name', 'Shenzhen Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4202719'), ('name', 'Valencia Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4202960'), ('name', 'Bolsa de Valores de Barcelona')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4890307'), ('name', 'Bilbao Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q891559'), ('name', 'Mexican Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1019983'), ('name', 'Nasdaq Copenhagen')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1973019'), ('name', 'Dubai Financial Market')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4513926'), ('name', 'Montenegro Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1984912'), ('name', 'PFTS Ukraine Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4164626'), ('name', 'Kuwait Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2632892'), ('name', 'Moscow Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q818723'), ('name', 'Toronto Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q140388'), ('name', 'Zagreb Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q144458'), ('name', 'Euronext Dublin')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q548621'), ('name', 'Taiwan Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1188840'), ('name', 'Nagoya Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1320224'), ('name', 'Osaka Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q796297'), ('name', 'B3')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1196314'), ('name', 'stock')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q755341'), ('name', 'Athens Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1019992'), ('name', 'Nasdaq Stockholm')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q751361'), ('name', 'Hong Kong Exchanges and Clearing Limited')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1330208'), ('name', 'Stock Exchange of Thailand')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1344438'), ('name', 'Russian Trading System')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q681683'), ('name', 'Börse München')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1132158'), ('name', 'OMX AB')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1734773'), ('name', 'Kazakhstan Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1515558'), ('name', 'Singapore Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2006583'), ('name', 'Tadawul')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1624698'), ('name', 'Riga Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1421543'), ('name', 'Moscow Interbank Currency Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1805567'), ('name', 'Tehran Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q178513'), ('name', 'Paris Bourse')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4992224'), ('name', 'Palestine Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5598539'), ('name', 'Taipei Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1974408'), ('name', 'Dhaka Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6529599'), ('name', 'Nepal Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12721279'), ('name', 'Australian Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q638740'), ('name', 'National Stock Exchange of India')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2888321'), ('name', 'Cyprus Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1507974'), ('name', 'Tel Aviv Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q909158'), ('name', 'Oslo Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q12048417'), ('name', 'RM-SYSTÉM, česká burza cenných papírů')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1407995'), ('name', 'Borsa Istanbul')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11093491'), ('name', 'Sapporo Securities Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11240145'), ('name', 'Q-Board')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q11340130'), ('name', 'Mothers')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q23308122'), ('name', 'National Equities Exchange and Quotations')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q157852'), ('name', 'Deutsche Börse')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q581755'), ('name', 'Nasdaq Helsinki')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1661737'), ('name', 'Indonesia Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2573852'), ('name', 'Jakarta Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3117577'), ('name', 'TMX Group')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5566927'), ('name', 'Glasgow Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1683760'), ('name', 'JASDAQ Securities Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1648198'), ('name', 'Qatar Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q638398'), ('name', 'Bombay Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q495364'), ('name', 'Korea Stock Exchange')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#all stock exchange markets\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?name\n",
    "WHERE {    \n",
    "    ?comp wdt:P414 ?o.\n",
    "    ?o sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "a8cb98de-f534-40a5-9d7a-ffc839a61ab9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q13677'), ('name', 'New York Stock Exchange'), ('Ncompanies', '5')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q82059'), ('name', 'NASDAQ'), ('Ncompanies', '4')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1661737'), ('name', 'Indonesia Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q496672'), ('name', 'Hong Kong Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q217475'), ('name', 'Tokyo Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q732670'), ('name', 'Australian Securities Exchange'), ('Ncompanies', '1')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q818723'), ('name', 'Toronto Stock Exchange'), ('Ncompanies', '1')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#prova finale\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?sem AS ?iri) ?name (COUNT(?comp) AS ?Ncompanies)\n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        wdt:P414 ?sem. #sem is stock exchange market\n",
    "    ?sem sc:name ?name.\n",
    "}\n",
    "GROUP BY ?sem ?name\n",
    "ORDER BY DESC(?Ncompanies)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "56051578-9aac-40f2-a90f-94316fd555e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1124579'), ('name', 'Condor Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q20724376'), ('name', 'CC&C – Clarke Costelle et Cie')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17086011'), ('name', 'Prometheus Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17088846'), ('name', 'Spring Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17090410'), ('name', 'Tribe Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17090464'), ('name', 'Trump Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17090873'), ('name', 'Mosdeux')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q18155354'), ('name', 'TSG Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q477943'), ('name', 'Bad Hat Harry Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5433853'), ('name', 'Fangoria Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q7548638'), ('name', 'Snowfort Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17201386'), ('name', \"L'Altrofilm\")]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17305142'), ('name', 'Red Wagon Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17343527'), ('name', 'Runteldat Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q28412462'), ('name', 'Yung Hwa Motion Picture Industries')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q22032421'), ('name', 'Dovrefilm')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q16711321'), ('name', 'Cinema Foundation of Russia')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q20870079'), ('name', 'Savage Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q21964532'), ('name', 'Ziegler Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3314282'), ('name', 'Mille et une productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3500954'), ('name', 'Orange studio')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5582469'), ('name', 'Good Clean Fun LLC')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q103981741'), ('name', 'Glukoza Production')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1337744'), ('name', 'GPO Film Unit')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1975431'), ('name', 'Kyrgyzfilm')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q21787624'), ('name', 'Infinity Film & TV Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q21940019'), ('name', 'Nordic Screen Development')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q27646824'), ('name', 'Kaap Holland Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q29836837'), ('name', 'Dombey Street Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q22037643'), ('name', 'Capitol Produksjon')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q22080360'), ('name', 'Friday Film House')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q30589038'), ('name', 'Fremulon')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17300077'), ('name', 'Temple Hill Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q24897318'), ('name', 'Providence Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3523524'), ('name', 'Thelma Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q85983145'), ('name', 'Filmmaker R&K')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2367528'), ('name', 'Superfilm')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q26210002'), ('name', '7Art')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3232650'), ('name', 'Les Films du Kiosque')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q6745872'), ('name', 'Mammoth Screen')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1529957'), ('name', 'Leonine Holding')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1868978'), ('name', 'London Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3149951'), ('name', 'ITC Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5204823'), ('name', 'DEJ Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q676498'), ('name', 'CCC Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q107391544'), ('name', 'Curtleigh Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q12006943'), ('name', 'Tordenfilm')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q12594195'), ('name', 'Lotte Cultureworks')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17063093'), ('name', 'Myung Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17345505'), ('name', 'Jerry Weintraub Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17346576'), ('name', 'Largo Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17417784'), ('name', 'Marc Platt Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q22280492'), ('name', 'Kisi Production')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2756503'), ('name', 'Gaumont-British Picture Corporation')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3005562'), ('name', 'Cruise/Wagner Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q4353408'), ('name', 'EMI Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q490687'), ('name', 'MBC Game')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5018052'), ('name', 'Cake Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5617764'), ('name', 'Gullane Entertainment PLC')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q626185'), ('name', 'SHOWBOX Co., Ltd.')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q7752106'), ('name', 'The Montecito Picture Company')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q7860855'), ('name', 'Type A Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q85971242'), ('name', 'JK Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q90013629'), ('name', 'Claussen & Wöbke Filmproduktion')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q100699785'), ('name', 'Ö-Filmproduktion Löprich & Schlösser')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1111024'), ('name', 'MTV Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5369517'), ('name', 'Embassy Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q615141'), ('name', 'Outlaw Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q624886'), ('name', 'FilmDistrict')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q6414157'), ('name', 'Kino International')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q645478'), ('name', 'Mutant Enemy Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q7276847'), ('name', 'RIVR Media')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q89875316'), ('name', 'Boje Buck Produktion')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1161600'), ('name', 'Mafilm')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17386235'), ('name', 'Neo Art & Logic')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q18331625'), ('name', 'Cerito Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3098606'), ('name', 'Gary Sanchez Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3503770'), ('name', 'Bally Sports Sun')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3999144'), ('name', 'Triumph Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q4985726'), ('name', 'Buffalo Gal Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5376047'), ('name', 'Endemol Shine UK')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q771272'), ('name', 'Worldvision Enterprises')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q78623145'), ('name', 'UGC Images')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q78631420'), ('name', 'Sogecine')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q79395710'), ('name', 'Himenoptero')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q79395789'), ('name', 'Eyescreen')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q8204054'), ('name', 'Argentina Sono Film S.A.C.I.')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1538543'), ('name', 'State Committee for Cinematography')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1550785'), ('name', 'UFA Serial Drama')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17343522'), ('name', 'Robert Simonds Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q17377479'), ('name', 'Edward Small Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2830819'), ('name', 'Films Albatros')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2880386'), ('name', 'RTI Producciones')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2945566'), ('name', 'Greek Film Centre')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3046330'), ('name', 'Eagle-Lion Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3298993'), ('name', 'Seven Arts Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3363246'), ('name', 'Paradis Films')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3980774'), ('name', 'Tandem Productions')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q4341103'), ('name', 'Profit')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q4864505'), ('name', 'Barry Mendel Productions')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#all tv or film prod companies\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?comp ?name \n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;        \n",
    "        sc:name ?name.\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "285fa051-4a1e-4fc3-a016-0a9a479ce61e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('comp', 'http://www.wikidata.org/entity/Q541569'), ('name', 'Orange Sky Golden Harvest')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q500088'), ('name', 'DreamWorks Animation')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q7414'), ('name', 'The Walt Disney Company')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q907311'), ('name', 'Netflix')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q2140077'), ('name', 'Tribune Media')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q5395348'), ('name', 'Eros International')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1654103'), ('name', 'IMAX Corporation')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q604775'), ('name', '4Kids Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3299128'), ('name', 'Rainmaker Entertainment')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q1476080'), ('name', 'Private Media Group')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q56085408'), ('name', 'MD Pictures')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q825291'), ('name', 'Village Roadshow')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q3992245'), ('name', 'Tohokushinsha Film')]\n",
      "[('comp', 'http://www.wikidata.org/entity/Q11079561'), ('name', 'Alibaba Pictures')]\n",
      "14\n"
     ]
    }
   ],
   "source": [
    "#all tv or film prod companies that have stock exchange market\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?comp ?name \n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;        \n",
    "        sc:name ?name.\n",
    "    FILTER EXISTS {?comp wdt:P414 ?o}\n",
    "}\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "54805580-0456-4959-9c01-35a245917524",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Australian Securities Exchange'), ('cName', 'Village Roadshow')]\n",
      "[('name', 'Hong Kong Stock Exchange'), ('cName', 'Orange Sky Golden Harvest')]\n",
      "[('name', 'Hong Kong Stock Exchange'), ('cName', 'Alibaba Pictures')]\n",
      "[('name', 'Indonesia Stock Exchange'), ('cName', 'MD Pictures')]\n",
      "[('name', 'NASDAQ'), ('cName', 'Private Media Group')]\n",
      "[('name', 'NASDAQ'), ('cName', 'DreamWorks Animation')]\n",
      "[('name', 'NASDAQ'), ('cName', 'Netflix')]\n",
      "[('name', 'New York Stock Exchange'), ('cName', 'IMAX Corporation')]\n",
      "[('name', 'New York Stock Exchange'), ('cName', 'Tribune Media')]\n",
      "[('name', 'New York Stock Exchange'), ('cName', 'Eros International')]\n",
      "[('name', 'New York Stock Exchange'), ('cName', '4Kids Entertainment')]\n",
      "[('name', 'New York Stock Exchange'), ('cName', 'The Walt Disney Company')]\n",
      "[('name', 'Tokyo Stock Exchange'), ('cName', 'The Walt Disney Company')]\n",
      "[('name', 'Tokyo Stock Exchange'), ('cName', 'Tohokushinsha Film')]\n",
      "[('name', 'Toronto Stock Exchange'), ('cName', 'Rainmaker Entertainment')]\n",
      "15\n"
     ]
    }
   ],
   "source": [
    "#names of companies per stock exchange market\n",
    "queryString = \"\"\"\n",
    "SELECT ?name ?cName\n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        wdt:P414 ?sem; #sem is stock exchange market\n",
    "        sc:name ?cName.\n",
    "    ?sem sc:name ?name.\n",
    "}\n",
    "GROUP BY ?sem ?name\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78ff020c",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "5206fc1e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q13677'), ('name', 'New York Stock Exchange'), ('Ncompanies', '5')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q82059'), ('name', 'NASDAQ'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q496672'), ('name', 'Hong Kong Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q217475'), ('name', 'Tokyo Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q732670'), ('name', 'Australian Securities Exchange'), ('Ncompanies', '1')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1661737'), ('name', 'Indonesia Stock Exchange'), ('Ncompanies', '1')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q818723'), ('name', 'Toronto Stock Exchange'), ('Ncompanies', '1')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#number of film/tv companies per stock exchange market \n",
    "#I included this final query because it was what i expected to be asked in the task, \n",
    "#the final query satisfying the task for all kind of companies is in the cell below\n",
    "queryString = \"\"\"\n",
    "SELECT (?sem AS ?iri) ?name (COUNT(DISTINCT ?comp) AS ?Ncompanies)\n",
    "WHERE {    \n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        wdt:P414 ?sem. #sem is stock exchange market\n",
    "    ?sem sc:name ?name.\n",
    "}\n",
    "GROUP BY ?sem ?name\n",
    "ORDER BY DESC(?Ncompanies) ASC(?name)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "60fea258-1116-4157-be25-ee8063a99a74",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q13677'), ('name', 'New York Stock Exchange'), ('Ncompanies', '1832')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q496672'), ('name', 'Hong Kong Stock Exchange'), ('Ncompanies', '1799')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q82059'), ('name', 'NASDAQ'), ('Ncompanies', '1755')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1661737'), ('name', 'Indonesia Stock Exchange'), ('Ncompanies', '697')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q171240'), ('name', 'London Stock Exchange'), ('Ncompanies', '604')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q517750'), ('name', 'Shenzhen Stock Exchange'), ('Ncompanies', '493')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q217475'), ('name', 'Tokyo Stock Exchange'), ('Ncompanies', '460')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q495364'), ('name', 'Korea Stock Exchange'), ('Ncompanies', '417')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q818723'), ('name', 'Toronto Stock Exchange'), ('Ncompanies', '394')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1930860'), ('name', 'OTC Markets Group'), ('Ncompanies', '364')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q739514'), ('name', 'Shanghai Stock Exchange'), ('Ncompanies', '356')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q6529599'), ('name', 'Nepal Stock Exchange'), ('Ncompanies', '346')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q59551'), ('name', 'Warsaw Stock Exchange'), ('Ncompanies', '257')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2006583'), ('name', 'Tadawul'), ('Ncompanies', '180')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q796297'), ('name', 'B3'), ('Ncompanies', '156')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q909158'), ('name', 'Oslo Stock Exchange'), ('Ncompanies', '154')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q732670'), ('name', 'Australian Securities Exchange'), ('Ncompanies', '146')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q638740'), ('name', 'National Stock Exchange of India'), ('Ncompanies', '141')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2632892'), ('name', 'Moscow Exchange'), ('Ncompanies', '128')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1019983'), ('name', 'Nasdaq Copenhagen'), ('Ncompanies', '99')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q151139'), ('name', 'Frankfurt Stock Exchange'), ('Ncompanies', '97')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q842108'), ('name', 'Euronext'), ('Ncompanies', '91')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q548621'), ('name', 'Taiwan Stock Exchange'), ('Ncompanies', '84')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q495372'), ('name', 'Korea Exchange'), ('Ncompanies', '61')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q581755'), ('name', 'Nasdaq Helsinki'), ('Ncompanies', '58')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1507974'), ('name', 'Tel Aviv Stock Exchange'), ('Ncompanies', '55')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1805567'), ('name', 'Tehran Stock Exchange'), ('Ncompanies', '50')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1019992'), ('name', 'Nasdaq Stockholm'), ('Ncompanies', '49')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1188840'), ('name', 'Nagoya Stock Exchange'), ('Ncompanies', '41')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2385849'), ('name', 'Euronext Paris'), ('Ncompanies', '40')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q661834'), ('name', 'SIX Swiss Exchange'), ('Ncompanies', '40')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1752646'), ('name', 'Prague Stock Exchange'), ('Ncompanies', '39')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q891561'), ('name', 'Santiago Stock Exchange'), ('Ncompanies', '37')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q638398'), ('name', 'Bombay Stock Exchange'), ('Ncompanies', '35')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q936563'), ('name', 'Italian Bourse'), ('Ncompanies', '34')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q617426'), ('name', 'Bolsa de Madrid'), ('Ncompanies', '32')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q627019'), ('name', 'New Zealand Exchange'), ('Ncompanies', '27')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q627514'), ('name', 'JSE Limited'), ('Ncompanies', '25')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11093491'), ('name', 'Sapporo Securities Exchange'), ('Ncompanies', '23')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q5507703'), ('name', 'Fukuoka Stock Exchange'), ('Ncompanies', '20')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q491503'), ('name', 'KOSDAQ'), ('Ncompanies', '16')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11340130'), ('name', 'Mothers'), ('Ncompanies', '16')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q698535'), ('name', 'Wiener Börse'), ('Ncompanies', '16')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1330208'), ('name', 'Stock Exchange of Thailand'), ('Ncompanies', '14')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q755341'), ('name', 'Athens Exchange'), ('Ncompanies', '13')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1683760'), ('name', 'JASDAQ Securities Exchange'), ('Ncompanies', '13')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1344438'), ('name', 'Russian Trading System'), ('Ncompanies', '13')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1515558'), ('name', 'Singapore Exchange'), ('Ncompanies', '12')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q140388'), ('name', 'Zagreb Stock Exchange'), ('Ncompanies', '12')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q478720'), ('name', 'Euronext Amsterdam'), ('Ncompanies', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1132158'), ('name', 'OMX AB'), ('Ncompanies', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1984912'), ('name', 'PFTS Ukraine Stock Exchange'), ('Ncompanies', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q851259'), ('name', 'Budapest Stock Exchange'), ('Ncompanies', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q144458'), ('name', 'Euronext Dublin'), ('Ncompanies', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q891559'), ('name', 'Mexican Stock Exchange'), ('Ncompanies', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11249728'), ('name', 'Tokyo Pro Market'), ('Ncompanies', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q438511'), ('name', 'Alternative Investment Market'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q51403327'), ('name', 'Binance'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1734773'), ('name', 'Kazakhstan Stock Exchange'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q846626'), ('name', 'NYSE American'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q3642744'), ('name', 'Stock Exchange in Milano'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q5598539'), ('name', 'Taipei Exchange'), ('Ncompanies', '8')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q43335'), ('name', 'Bursa Malaysia'), ('Ncompanies', '7')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2415561'), ('name', 'Euronext Lisbon'), ('Ncompanies', '7')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q74662'), ('name', 'Fundsquare Market Infrastructure'), ('Ncompanies', '7')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1320224'), ('name', 'Osaka Exchange'), ('Ncompanies', '7')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q12048417'), ('name', 'RM-SYSTÉM, česká burza cenných papírů'), ('Ncompanies', '7')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1407995'), ('name', 'Borsa Istanbul'), ('Ncompanies', '6')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q891560'), ('name', 'Buenos Aires Stock Exchange'), ('Ncompanies', '6')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1146518'), ('name', 'Euronext Brussels'), ('Ncompanies', '6')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q819468'), ('name', 'Xetra'), ('Ncompanies', '6')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q20992132'), ('name', 'Yangon Stock Exchange'), ('Ncompanies', '6')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q16972754'), ('name', 'Coinbase'), ('Ncompanies', '5')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q10855618'), ('name', 'NewConnect'), ('Ncompanies', '5')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1526647'), ('name', 'Philippine Stock Exchange'), ('Ncompanies', '5')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q29647473'), ('name', 'Bitfinex'), ('Ncompanies', '4')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1974408'), ('name', 'Dhaka Stock Exchange'), ('Ncompanies', '4')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2382352'), ('name', 'Bermuda Stock Exchange'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q4202960'), ('name', 'Bolsa de Valores de Barcelona'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q74603'), ('name', 'Bratislava Stock Exchange'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1003968'), ('name', 'Bulgarian Stock Exchange'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2633007'), ('name', 'Chicago Stock Exchange'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q157852'), ('name', 'Deutsche Börse'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1433248'), ('name', 'Nasdaq Tallinn'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1391676'), ('name', 'OTC Bulletin Board'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q22907578'), ('name', 'Pakistan Stock Exchange'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q178513'), ('name', 'Paris Bourse'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q11240145'), ('name', 'Q-Board'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q93360933'), ('name', 'Spotlight Stock Market'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2387368'), ('name', 'zero two desnuda'), ('Ncompanies', '3')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q683787'), ('name', 'Armenia Securities Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q12721279'), ('name', 'Australian Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q550050'), ('name', 'Belgrade Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q609159'), ('name', 'Bolsas y Mercados Españoles'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1003245'), ('name', 'Bucharest Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q3349831'), ('name', 'Chittagong Stock Exchange'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q2718247'), ('name', 'Euronext Growth'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q97574837'), ('name', 'GDAX'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q19892740'), ('name', 'Huobi'), ('Ncompanies', '2')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q1977283'), ('name', 'Karachi Stock Exchange'), ('Ncompanies', '2')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "#number of all kind of companies per stock exchange market\n",
    "queryString = \"\"\"\n",
    "SELECT (?sem AS ?iri) ?name (COUNT(DISTINCT ?comp) AS ?Ncompanies)\n",
    "WHERE {    \n",
    "    \n",
    "    ?comp wdt:P414 ?sem. #sem is stock exchange market\n",
    "    ?sem sc:name ?name.\n",
    "}\n",
    "GROUP BY ?sem ?name\n",
    "ORDER BY DESC(?Ncompanies) ASC(?name)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "29ce712c",
   "metadata": {},
   "source": [
    "## Task 8\n",
    "Identify the BGP for Academy Award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "37b12932",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q488651'), ('name', 'Academy Award for Best Original Score')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q823422'), ('name', 'National Film Registry')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Lion King awards\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q36479 wdt:P166 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "baf89e81-b88b-44a3-b6bf-d169482b8904",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q19020'), ('name', 'Academy Awards')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q96474685'), ('name', 'award for best original music')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# AA for Best original score instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q488651 wdt:P31 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "5b419a8b-e0d4-4ce4-a070-6dd64b0badea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('name', 'Academy Award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Actress')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Animated Feature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Cinematography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Costume Design')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Director (Comedy picture)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Documentary Feature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Foreign Language Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Original Dramatic Score')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Original Score')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Original Song')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Picture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Supporting Actor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Supporting Actress')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Writing, Adapted Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pName', 'has part'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('name', 'Academy Awards ceremony')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1027'), ('pName', 'conferred by'), ('name', 'Academy of Motion Picture Arts and Sciences')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2517'), ('pName', 'category for recipients of this award'), ('name', 'Category:Academy Award winners')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\"), ('name', 'Category:Academy Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source'), ('name', 'Disney A to Z')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4622'), ('pName', 'trophy awarded'), ('name', 'Oscar statuette')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pName', \"topic's main template\"), ('name', 'Template:Academy Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pName', \"topic's main template\"), ('name', 'Template:Infobox Academy Awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pName', 'country'), ('name', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pName', 'subclass of'), ('name', 'film award')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of'), ('name', 'group of awards')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pName', 'different from'), ('name', 'Óscar')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# AAs all props\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19020 ?p ?obj .\n",
    "   # get the label\n",
    "   ?p sc:name ?pName.\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "c22687bd-4c68-4899-886f-1e61d9cbec46",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4671334'), ('name', 'Academy Award')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q16913666'), ('name', 'Academy Awards ceremony')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q21475960'), ('name', 'Óscar')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# AAs different from\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19020 wdt:P1889 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d9626853",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "047070b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q4671334'), ('name', 'Academy Award')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# BGP for Academy Award\n",
    "queryString = \"\"\"\n",
    "SELECT *\n",
    "WHERE {\n",
    "   BIND(wd:Q4671334 AS ?iri)\n",
    "   ?iri sc:name ?name.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4b803a83",
   "metadata": {},
   "source": [
    "## Task 9\n",
    "Find the companies (among television and film production companies) that won at least 5 Academy Awards for Best Actress for the movies they produced (the result set must be a list of triples company IRI, label and #awards)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "2ec67f24",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q103916'), ('name', 'Academy Award for Best Actor')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q103618'), ('name', 'Academy Award for Best Actress')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q106800'), ('name', 'Academy Award for Best Animated Feature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q131520'), ('name', 'Academy Award for Best Cinematography')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q277536'), ('name', 'Academy Award for Best Costume Design')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q103360'), ('name', 'Academy Award for Best Director')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3451157'), ('name', 'Academy Award for Best Director (Comedy picture)')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q111332'), ('name', 'Academy Award for Best Documentary Feature')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q105304'), ('name', 'Academy Award for Best Foreign Language Film')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q22235329'), ('name', 'Academy Award for Best Original Dramatic Score')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q488651'), ('name', 'Academy Award for Best Original Score')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q112243'), ('name', 'Academy Award for Best Original Song')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q102427'), ('name', 'Academy Award for Best Picture')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q106291'), ('name', 'Academy Award for Best Supporting Actor')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q106301'), ('name', 'Academy Award for Best Supporting Actress')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q107258'), ('name', 'Academy Award for Best Writing, Adapted Screenplay')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41417'), ('name', 'Academy Award for Best Writing, Original Screenplay')]\n",
      "17\n"
     ]
    }
   ],
   "source": [
    "# AAs all parts\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q19020 wdt:P527 ?obj .\n",
    "   # get the label\n",
    "   ?obj sc:name ?name.\n",
    "}\n",
    "ORDER BY ASC(?name)\n",
    "LIMIT 1000\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "86b65209-9c57-4356-a1d1-ad77098d5218",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q434841'), ('name', '20th Century Studios'), ('Nawards', '14')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q179200'), ('name', 'Metro-Goldwyn-Mayer'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q159846'), ('name', 'Paramount Pictures'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q126399'), ('name', 'Warner Bros.'), ('Nawards', '9')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#prova finale\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?comp AS ?iri) ?name (COUNT(?film) AS ?Nawards)\n",
    "WHERE {\n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "    ?film wdt:P272 ?comp;                       #film produced by comp\n",
    "        wdt:P166 wd:Q103618.                    #     won best actress\n",
    "\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "HAVING(COUNT(?film) > 4)\n",
    "ORDER BY DESC(?Nawards)                        #VALUES PUO'PRENDERE DOPPI SE VALE PER ENTRAMBI \n",
    "LIMIT 100                                      #(sia tv che film in questo caso)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "a973b57c-f042-4075-b888-b2b8370e5f40",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Seventh Heaven')]\n",
      "[('name', 'Walk the Line')]\n",
      "[('name', 'Sunrise: A Song of Two Humans')]\n",
      "[('name', 'The Three Faces of Eve')]\n",
      "[('name', 'Anastasia')]\n",
      "[('name', 'The Prime of Miss Jean Brodie')]\n",
      "[('name', 'The Song of Bernadette')]\n",
      "7\n"
     ]
    }
   ],
   "source": [
    "#all best actress oscar films of 20th Cent.\n",
    "queryString = \"\"\"\n",
    "SELECT ?name \n",
    "WHERE {\n",
    "    ?film wdt:P272 wd:Q434841;                       #film produced by 20th Cent\n",
    "        wdt:P166 wd:Q103618;                         #won best actress\n",
    "        sc:name ?name.                    \n",
    "}\n",
    "\n",
    "ORDER BY DESC(?Nawards)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "2e06a741-691e-4576-ba18-b9f804ce3325",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q179200'), ('name', 'Metro-Goldwyn-Mayer'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q159846'), ('name', 'Paramount Pictures'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q126399'), ('name', 'Warner Bros.'), ('Nawards', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q434841'), ('name', '20th Century Studios'), ('Nawards', '7')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#prova finale 2\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?comp AS ?iri) ?name (COUNT(DISTINCT ?film) AS ?Nawards)\n",
    "WHERE {\n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "    ?film wdt:P272 ?comp;                       #film produced by comp\n",
    "        wdt:P166 wd:Q103618.                    #     won best actress\n",
    "\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "HAVING(COUNT(DISTINCT ?film) > 4)\n",
    "ORDER BY DESC(?Nawards) ASC(?name)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e04a9396",
   "metadata": {
    "tags": []
   },
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "a0500ac5-c27d-42c1-9a81-7c7936b10bee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('iri', 'http://www.wikidata.org/entity/Q179200'), ('name', 'Metro-Goldwyn-Mayer'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q159846'), ('name', 'Paramount Pictures'), ('Nawards', '11')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q126399'), ('name', 'Warner Bros.'), ('Nawards', '9')]\n",
      "[('iri', 'http://www.wikidata.org/entity/Q434841'), ('name', '20th Century Studios'), ('Nawards', '7')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "#number of best actress award winning films produced by each company\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (?comp AS ?iri) ?name (COUNT(DISTINCT ?film) AS ?Nawards)\n",
    "WHERE {\n",
    "    VALUES ?prodComp {wd:Q10689397 wd:Q1762059} #either tv or film (resp.) prod comp\n",
    "    ?comp wdt:P31 ?prodComp;\n",
    "        sc:name ?name.\n",
    "    ?film wdt:P272 ?comp;                       #film produced by comp\n",
    "        wdt:P166 wd:Q103618.                    #     won best actress\n",
    "\n",
    "}\n",
    "GROUP BY ?comp ?name\n",
    "HAVING(COUNT(DISTINCT ?film) > 4)\n",
    "ORDER BY DESC(?Nawards) ASC(?name)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
