{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "349a6ac0",
   "metadata": {
    "tags": []
   },
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "91604e32",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-524a517ea7-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16ab8aa0",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Movie Workflow Series (\"Film Genre and composer explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the results concerning the different film genre over years and the composers for the cinema."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e71a6d2c",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wdt:P3342`     | Significant person       | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q25089`| Woody Allen       | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8a579e9",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q25089 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Woody Allen**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for films\n",
    "\n",
    "2. Identify the BGP for composer\n",
    "\n",
    "3. Identify the BGP for film genre\n",
    "\n",
    "4. Find how many films are been released in the United States of America from 2010-01-01 to 2015-31-12 for each film genre available (the result set must be genre IRI, label and #films).\n",
    "\n",
    "5. Consider the timespan from 2001-01-01 to nowadays. Find the number of films released in this timespan divided by film genre and return only those with more than 50 films released every year (the result set must be genre IRI and label).\n",
    "\n",
    "6. Consider the composers of Western films and their country of citizenship. Count the number of Western Films on which worked a composer grouped by country of citizenship and return the top-10 (the result set must be country IRI, label and #films).. \n",
    "\n",
    "7. Consider the decades from 1961 to 1970, and from 2001 to 2010 and compare the total number of western films released in each one (the result set must be two couples decade and #western films of that decade).\n",
    "\n",
    "8. Consider the decades from 1961 to 1970, and from 2001 to 2010 and select only western films. Then, for each decade, compare the average cast members size per film (the result set must be two couples decade and average cast members size of that decade)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d7d5d5a",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 1\n",
    "Identify the BGP for films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a9c39bc8-fb1d-49a8-85c2-b00ea8ff2421",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P103'), ('pname', 'native language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P106'), ('pname', 'occupation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P108'), ('pname', 'employer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P109'), ('pname', 'signature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1283'), ('pname', 'filmography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1303'), ('pname', 'instrument')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pname', 'named after')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pname', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1412'), ('pname', 'languages spoken, written or signed')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1455'), ('pname', 'list of works')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pname', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pname', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P19'), ('pname', 'place of birth')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P21'), ('pname', 'sex or gender')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P22'), ('pname', 'father')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P25'), ('pname', 'mother')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P26'), ('pname', 'spouse')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P264'), ('pname', 'record label')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname\n",
    "WHERE {\n",
    "   # bind properties of Woody Allen\n",
    "   wd:Q25089 ?p ?obj .\n",
    "FILTER(!isLiteral(?obj)) .\n",
    "   # get the labels \n",
    "   ?p sc:name ?pname.\n",
    "\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "558e3810",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2455835'), ('objname', 'Woody Allen filmography')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Trying to find filmography objects\n",
    "# wd:Q25089 --> 'Woody Allen'\n",
    "# wdth:P1283 --> 'filmography'\n",
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT ?obj ?objname\n",
    "WHERE {\n",
    "   # bind properties\n",
    "   wd:Q25089 wdt:P1283 ?obj .\n",
    "   # get the labels\n",
    "   ?obj sc:name ?objname\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "86a8924f-3743-49e7-8a22-7b3acb043319",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P921'), ('name', 'main subject'), ('o', 'http://www.wikidata.org/entity/Q25089'), ('objname', 'Woody Allen')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P360'), ('name', 'is a list of'), ('o', 'http://www.wikidata.org/entity/Q11424'), ('objname', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q1371849'), ('objname', 'filmography')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# Trying to find Woody Allen filmography properties\n",
    "# Q2455835 --> 'Woody Allen filmography'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name ?o ?objname\n",
    "WHERE {\n",
    "   #bind the properties\n",
    "   wd:Q2455835 ?p ?o . \n",
    "   # get the labels\n",
    "   ?p sc:name ?name . \n",
    "   ?o sc:name ?objname .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b4230c5a-5bfb-499b-8d19-c1ff4af32f58",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('pname', 'studied by'), ('o', 'http://www.wikidata.org/entity/Q1660187'), ('objname', 'film studies')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P345'), ('objname', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1040'), ('objname', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P344'), ('objname', 'director of photography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q17738'), ('objname', 'Star Wars: Episode IV – A New Hope')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q55321'), ('objname', 'Category:Films')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q20937557'), ('objname', 'series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1476'), ('objname', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2047'), ('objname', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P162'), ('objname', 'producer')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# trying to find films properties\n",
    "# Q11424 --> 'film' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?objname\n",
    "WHERE {\n",
    "   wd:Q11424 ?p ?o .\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname .\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "4e161606-b351-4017-932c-91ca6056e3fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/P345'), ('objname', 'IMDb ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1040'), ('objname', 'film editor')]\n",
      "[('o', 'http://www.wikidata.org/entity/P344'), ('objname', 'director of photography')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1476'), ('objname', 'title')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2047'), ('objname', 'duration')]\n",
      "[('o', 'http://www.wikidata.org/entity/P162'), ('objname', 'producer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P921'), ('objname', 'main subject')]\n",
      "[('o', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
      "[('o', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
      "[('o', 'http://www.wikidata.org/entity/P3816'), ('objname', 'film script')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# trying to find films properties\n",
    "# Q11424 --> 'film' \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?objname\n",
    "WHERE {\n",
    "   VALUES ?p {wdt:P1963} #changed brackets\n",
    "   wd:Q11424 ?p ?o .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1f2b4f1",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "048d0e3e-1682-4cab-918e-4ad203ccca77",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/P345'), ('objname', 'IMDb ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1040'), ('objname', 'film editor')]\n",
      "[('o', 'http://www.wikidata.org/entity/P344'), ('objname', 'director of photography')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1476'), ('objname', 'title')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2047'), ('objname', 'duration')]\n",
      "[('o', 'http://www.wikidata.org/entity/P162'), ('objname', 'producer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P921'), ('objname', 'main subject')]\n",
      "[('o', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
      "[('o', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
      "[('o', 'http://www.wikidata.org/entity/P3816'), ('objname', 'film script')]\n",
      "[('o', 'http://www.wikidata.org/entity/P179'), ('objname', 'part of the series')]\n",
      "[('o', 'http://www.wikidata.org/entity/P480'), ('objname', 'FilmAffinity ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/P136'), ('objname', 'genre')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2408'), ('objname', 'set in period')]\n",
      "[('o', 'http://www.wikidata.org/entity/P840'), ('objname', 'narrative location')]\n",
      "[('o', 'http://www.wikidata.org/entity/P86'), ('objname', 'composer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P915'), ('objname', 'filming location')]\n",
      "[('o', 'http://www.wikidata.org/entity/P161'), ('objname', 'cast member')]\n",
      "[('o', 'http://www.wikidata.org/entity/P166'), ('objname', 'award received')]\n",
      "[('o', 'http://www.wikidata.org/entity/P364'), ('objname', 'original language of film or TV show')]\n",
      "[('o', 'http://www.wikidata.org/entity/P750'), ('objname', 'distributed by')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2208'), ('objname', 'average shot length')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2554'), ('objname', 'production designer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P57'), ('objname', 'director')]\n",
      "[('o', 'http://www.wikidata.org/entity/P58'), ('objname', 'screenwriter')]\n",
      "[('o', 'http://www.wikidata.org/entity/P144'), ('objname', 'based on')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1237'), ('objname', 'Box Office Mojo film ID (former scheme)')]\n",
      "[('o', 'http://www.wikidata.org/entity/P1431'), ('objname', 'executive producer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2142'), ('objname', 'box office')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2515'), ('objname', 'costume designer')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2603'), ('objname', 'Kinopoisk film ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2639'), ('objname', 'Filmportal ID')]\n",
      "[('o', 'http://www.wikidata.org/entity/P2755'), ('objname', 'exploitation visa number')]\n",
      "[('o', 'http://www.wikidata.org/entity/P3803'), ('objname', 'original film format')]\n",
      "[('o', 'http://www.wikidata.org/entity/P676'), ('objname', 'lyrics by')]\n",
      "[('o', 'http://www.wikidata.org/entity/P8345'), ('objname', 'media franchise')]\n",
      "36\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?objname\n",
    "WHERE {\n",
    "   VALUES ?p {wdt:P1963} #changed brackets\n",
    "   wd:Q11424 ?p ?o .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b3e2a7d",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 2\n",
    "Identify the BGP for composer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "d6293853",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q22909117'), ('sname', 'Stroke'), ('o', 'http://www.wikidata.org/entity/Q293218'), ('objname', 'Joan Tower')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13657577'), ('sname', 'Heartbeats'), ('o', 'http://www.wikidata.org/entity/Q2682478'), ('objname', 'Tom Kestens')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13693967'), ('sname', 'Cross'), ('o', 'http://www.wikidata.org/entity/Q3866310'), ('objname', 'Paul Wong')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13647258'), ('sname', 'Marupakkam'), ('o', 'http://www.wikidata.org/entity/Q6456674'), ('objname', 'L. Vaidyanathan')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q48671658'), ('sname', 'Love Maadi Nodu'), ('o', 'http://www.wikidata.org/entity/Q6456674'), ('objname', 'L. Vaidyanathan')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15586278'), ('sname', 'Obliehanie Bystrice'), ('o', 'http://www.wikidata.org/entity/Q692171'), ('objname', 'Ján Cikker')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15723755'), ('sname', 'Emiti Bi Prema Hue'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('objname', 'Prasant Padhi')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15725190'), ('sname', 'Shapath'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('objname', 'Prasant Padhi')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q33403843'), ('sname', 'Dele Dhara Katha Sare'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('objname', 'Prasant Padhi')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15724100'), ('sname', 'Chinha Achinha'), ('o', 'http://www.wikidata.org/entity/Q15724804'), ('objname', 'Basudeba Rath')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# P86 --> 'composer'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?o ?objname\n",
    "WHERE {\n",
    "   ?s wdt:P86 ?o ;  \n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?objname \n",
    "   \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ec31d7b",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "dafb3e29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('composition', 'http://www.wikidata.org/entity/Q22909117'), ('composition_name', 'Stroke'), ('o', 'http://www.wikidata.org/entity/Q293218'), ('composername', 'Joan Tower')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q13657577'), ('composition_name', 'Heartbeats'), ('o', 'http://www.wikidata.org/entity/Q2682478'), ('composername', 'Tom Kestens')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q13693967'), ('composition_name', 'Cross'), ('o', 'http://www.wikidata.org/entity/Q3866310'), ('composername', 'Paul Wong')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q13647258'), ('composition_name', 'Marupakkam'), ('o', 'http://www.wikidata.org/entity/Q6456674'), ('composername', 'L. Vaidyanathan')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q48671658'), ('composition_name', 'Love Maadi Nodu'), ('o', 'http://www.wikidata.org/entity/Q6456674'), ('composername', 'L. Vaidyanathan')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15586278'), ('composition_name', 'Obliehanie Bystrice'), ('o', 'http://www.wikidata.org/entity/Q692171'), ('composername', 'Ján Cikker')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15723755'), ('composition_name', 'Emiti Bi Prema Hue'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('composername', 'Prasant Padhi')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725190'), ('composition_name', 'Shapath'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('composername', 'Prasant Padhi')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q33403843'), ('composition_name', 'Dele Dhara Katha Sare'), ('o', 'http://www.wikidata.org/entity/Q15724688'), ('composername', 'Prasant Padhi')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724100'), ('composition_name', 'Chinha Achinha'), ('o', 'http://www.wikidata.org/entity/Q15724804'), ('composername', 'Basudeba Rath')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724803'), ('composition_name', 'Basanti Apa'), ('o', 'http://www.wikidata.org/entity/Q15724981'), ('composername', 'Mushir')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724695'), ('composition_name', 'Priyatama'), ('o', 'http://www.wikidata.org/entity/Q15725199'), ('composername', 'Shantanu Mahapatra')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q6419692'), ('composition_name', 'Klanta Aparahna'), ('o', 'http://www.wikidata.org/entity/Q15725199'), ('composername', 'Shantanu Mahapatra')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724747'), ('composition_name', 'Barsa My Darling'), ('o', 'http://www.wikidata.org/entity/Q15725397'), ('composername', 'Swarup Naik/Nayak')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15731057'), ('composition_name', 'Feral'), ('o', 'http://www.wikidata.org/entity/Q15804467'), ('composername', 'Dan Golden')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q20724304'), ('composition_name', 'The Purge: Election Year'), ('o', 'http://www.wikidata.org/entity/Q18692870'), ('composername', 'Nathan Whitehead')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724176'), ('composition_name', 'Jheeati Sita Pari'), ('o', 'http://www.wikidata.org/entity/Q21468105'), ('composername', 'Saroj Patnaik')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725052'), ('composition_name', 'Mo Mana Khali Tori Pain'), ('o', 'http://www.wikidata.org/entity/Q21468105'), ('composername', 'Saroj Patnaik')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724242'), ('composition_name', 'Tu Mo Girlfriend'), ('o', 'http://www.wikidata.org/entity/Q30004708'), ('composername', 'Malay Mishra')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725300'), ('composition_name', 'Sakhi Rahila Ae Singha Duara'), ('o', 'http://www.wikidata.org/entity/Q30004708'), ('composername', 'Malay Mishra')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724060'), ('composition_name', 'Chakabhaunri'), ('o', 'http://www.wikidata.org/entity/Q4701823'), ('composername', 'Akshaya Mohanty')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15724264'), ('composition_name', 'Dandabalunga'), ('o', 'http://www.wikidata.org/entity/Q4701823'), ('composername', 'Akshaya Mohanty')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725013'), ('composition_name', 'Maan Abhiman'), ('o', 'http://www.wikidata.org/entity/Q4701823'), ('composername', 'Akshaya Mohanty')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725072'), ('composition_name', 'Jor Jar Mulak Tar'), ('o', 'http://www.wikidata.org/entity/Q4701823'), ('composername', 'Akshaya Mohanty')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15725358'), ('composition_name', 'Suna Bhauja'), ('o', 'http://www.wikidata.org/entity/Q4701823'), ('composername', 'Akshaya Mohanty')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q10290000'), ('composition_name', 'Give Me a Reason'), ('o', 'http://www.wikidata.org/entity/Q1647719'), ('composername', 'Caroline Corr')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15929217'), ('composition_name', 'Irresistible'), ('o', 'http://www.wikidata.org/entity/Q1647719'), ('composername', 'Caroline Corr')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15863744'), ('composition_name', 'Thegidi'), ('o', 'http://www.wikidata.org/entity/Q23762471'), ('composername', 'Nivas K. Prasanna')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15927316'), ('composition_name', 'A Summer Rain'), ('o', 'http://www.wikidata.org/entity/Q241801'), ('composername', 'Paulinho da Viola')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15867010'), ('composition_name', 'L’Elpidia, ovvero Li rivali generosi'), ('o', 'http://www.wikidata.org/entity/Q594181'), ('composername', 'Giuseppe Maria Orlandini')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q15929217'), ('composition_name', 'Irresistible'), ('o', 'http://www.wikidata.org/entity/Q946452'), ('composername', 'Jim Corr')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q5979162'), ('composition_name', 'I Think I Love You'), ('o', 'http://www.wikidata.org/entity/Q16013519'), ('composername', 'Tony Romeo')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q16035044'), ('composition_name', 'Le Loup, la Biche et le Chevalier'), ('o', 'http://www.wikidata.org/entity/Q3301277'), ('composername', 'Maurice Pon')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q24665179'), ('composition_name', \"Le travail c'est la santé\"), ('o', 'http://www.wikidata.org/entity/Q3301277'), ('composername', 'Maurice Pon')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q16034999'), ('composition_name', \"If it's love\"), ('o', 'http://www.wikidata.org/entity/Q3343722'), ('composername', 'Norma Ray')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q16185949'), ('composition_name', 'Betlehems stjärna'), ('o', 'http://www.wikidata.org/entity/Q462879'), ('composername', 'Alice Tegnér')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q16202837'), ('composition_name', 'China White'), ('o', 'http://www.wikidata.org/entity/Q6529536'), ('composername', 'Les Gock')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q16202471'), ('composition_name', '1971'), ('o', 'http://www.wikidata.org/entity/Q7184373'), ('composername', 'Philip Sheppard')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q22252143'), ('composition_name', 'The Fear of 13'), ('o', 'http://www.wikidata.org/entity/Q7184373'), ('composername', 'Philip Sheppard')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17061540'), ('composition_name', 'The Model Husband'), ('o', 'http://www.wikidata.org/entity/Q1476942'), ('composername', 'Kurt Wege')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17065988'), ('composition_name', 'Wild Heart'), ('o', 'http://www.wikidata.org/entity/Q15042553'), ('composername', 'The Vamps')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17082647'), ('composition_name', 'Nuestro juramento'), ('o', 'http://www.wikidata.org/entity/Q15429260'), ('composername', 'Benito de Jesús')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17050203'), ('composition_name', 'Kamisama no Karute 2'), ('o', 'http://www.wikidata.org/entity/Q15905383'), ('composername', 'Yuki Hayashi')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q21769859'), ('composition_name', 'Kiznaiver'), ('o', 'http://www.wikidata.org/entity/Q15905383'), ('composername', 'Yuki Hayashi')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17009551'), ('composition_name', 'The Late Show'), ('o', 'http://www.wikidata.org/entity/Q16012634'), ('composername', 'Jay Richard Kennedy')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17060155'), ('composition_name', 'Your Eyes'), ('o', 'http://www.wikidata.org/entity/Q16235448'), ('composername', 'Alex Hope')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17005848'), ('composition_name', 'Fever'), ('o', 'http://www.wikidata.org/entity/Q16439813'), ('composername', 'André Mergenthaler')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17003567'), ('composition_name', \"Everything's Tuesday\"), ('o', 'http://www.wikidata.org/entity/Q18001075'), ('composername', 'Ron Dunbar')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17064272'), ('composition_name', 'Katham Katham'), ('o', 'http://www.wikidata.org/entity/Q21931827'), ('composername', 'Taj Noor')]\n",
      "[('composition', 'http://www.wikidata.org/entity/Q17011524'), ('composition_name', \"La mort d'Abel\"), ('o', 'http://www.wikidata.org/entity/Q336692'), ('composername', 'Rodolphe Kreutzer')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# P86 --> 'composer'\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?composition ?composition_name ?o ?composername\n",
    "WHERE {\n",
    "   ?composition wdt:P86 ?o ;  \n",
    "      sc:name ?composition_name .\n",
    "   ?o sc:name ?composername \n",
    "   \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bc3917c7",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 3\n",
    "Identify the BGP for film genre"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "3f4ed4a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q8204826'), ('sname', 'Harpist of Keros'), ('o', 'http://www.wikidata.org/entity/Q2586345'), ('objname', 'Cycladic art')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8195511'), ('sname', 'Ayinde Barrister'), ('o', 'http://www.wikidata.org/entity/Q3509353'), ('objname', 'fuji music')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15730544'), ('sname', 'Crying for No Reason'), ('o', 'http://www.wikidata.org/entity/Q1987980'), ('objname', 'breakstep')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15732538'), ('sname', 'Chapliniana'), ('o', 'http://www.wikidata.org/entity/Q4484381'), ('objname', 'ballet film')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15731615'), ('sname', 'Scribblenauts Unmasked: A DC Comics Adventure'), ('o', 'http://www.wikidata.org/entity/Q5370763'), ('objname', 'emergent gameplay')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q104891471'), ('sname', 'Ajin'), ('o', 'http://www.wikidata.org/entity/Q61942616'), ('objname', 'supernatural anime and manga')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15732099'), ('sname', 'Ajin'), ('o', 'http://www.wikidata.org/entity/Q61942616'), ('objname', 'supernatural anime and manga')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q15917743'), ('sname', 'Rygar'), ('o', 'http://www.wikidata.org/entity/Q4049849'), ('objname', 'spacesynth')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16202878'), ('sname', 'Amoeba Cleansing Syndrome'), ('o', 'http://www.wikidata.org/entity/Q105334717'), ('objname', 'progressive soul')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16218086'), ('sname', 'Love Steaks'), ('o', 'http://www.wikidata.org/entity/Q1108032'), ('objname', 'Mumblecore')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# P136 --> genre\n",
    "queryString = \"\"\"\n",
    "SELECT ?s ?sname ?o ?objname\n",
    "WHERE {\n",
    "    ?s wdt:P136 ?o ;\n",
    "       sc:name ?sname .\n",
    "    ?o sc:name ?objname\n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "cfbd00af-78bc-4356-ab52-42d3941e83e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q201658'), ('objname', 'film genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1269'), ('pname', 'facet of'), ('o', 'http://www.wikidata.org/entity/Q41425'), ('objname', 'ballet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q11424'), ('objname', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q21934619'), ('objname', 'Category:Ballet films')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('pname', 'said to be the same as'), ('o', 'http://www.wikidata.org/entity/Q4453959'), ('objname', 'television ballet\\u200e')]\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "# Q4484381 --> 'ballet film'\n",
    "# P136 --> genre\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    wd:Q4484381 ?p ?o  .\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "effeeb18-ecaf-44c2-a596-8ecf49f0fc49",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1792379'), ('objname', 'art genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q5817098'), ('objname', 'Category:Film genres')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8225'), ('pname', 'is metaclass for'), ('o', 'http://www.wikidata.org/entity/Q11424'), ('objname', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q590870'), ('objname', 'cinematography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q19361238'), ('objname', 'Wikidata metaclass')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('pname', 'has list'), ('o', 'http://www.wikidata.org/entity/Q6621591'), ('objname', 'list of genres')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# Q201658 --> 'film genre'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    wd:Q201658 ?p ?o  .\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d0a2d27f-fe52-40b6-8c54-a97d0aacd1bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P301'), ('pname', \"category's main topic\"), ('o', 'http://www.wikidata.org/entity/Q201658'), ('objname', 'film genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q4167836'), ('objname', 'Wikimedia category')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Q5817098 --> 'Category:Film genres'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    wd:Q5817098 ?p ?o  .\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d61a7b74",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "3fec9e56",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q1792379'), ('objname', 'art genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q5817098'), ('objname', 'Category:Film genres')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8225'), ('pname', 'is metaclass for'), ('o', 'http://www.wikidata.org/entity/Q11424'), ('objname', 'film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('o', 'http://www.wikidata.org/entity/Q590870'), ('objname', 'cinematography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('o', 'http://www.wikidata.org/entity/Q19361238'), ('objname', 'Wikidata metaclass')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2354'), ('pname', 'has list'), ('o', 'http://www.wikidata.org/entity/Q6621591'), ('objname', 'list of genres')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# Q201658 --> 'film genre'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    wd:Q201658 ?p ?o  .\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "872446ca",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Find how many films are been released in the United States of America from 2010-01-01 to 2015-31-12 for each film genre available (the result set must be genre IRI, label and #films)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "3fdcd7c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('pname', 'studied by'), ('o', 'http://www.wikidata.org/entity/Q1660187'), ('objname', 'film studies')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P345'), ('objname', 'IMDb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1040'), ('objname', 'film editor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P344'), ('objname', 'director of photography')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q17738'), ('objname', 'Star Wars: Episode IV – A New Hope')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q55321'), ('objname', 'Category:Films')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q20937557'), ('objname', 'series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1476'), ('objname', 'title')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2047'), ('objname', 'duration')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P162'), ('objname', 'producer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('o', 'http://www.wikidata.org/entity/Q1458269'), ('objname', 'Category:Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q441606'), ('objname', 'title sequence')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q20820424'), ('objname', 'credit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q192724'), ('objname', 'Iron Man')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P921'), ('objname', 'main subject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q106727050'), ('objname', 'Metropolitan Museum of Art Tagging Vocabulary')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q2345'), ('objname', '12 Angry Men')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('o', 'http://www.wikidata.org/entity/Q2657718'), ('objname', 'Armenian Soviet Encyclopedia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project'), ('o', 'http://www.wikidata.org/entity/Q5460604'), ('objname', 'Wikipedia:Vital articles')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P577'), ('objname', 'publication date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P495'), ('objname', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q795160'), ('objname', 'film frame')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q4502142'), ('objname', 'visual artwork')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P3816'), ('objname', 'film script')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P279'), ('pname', 'subclass of'), ('o', 'http://www.wikidata.org/entity/Q2431196'), ('objname', 'audiovisual work')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P460'), ('pname', 'said to be the same as'), ('o', 'http://www.wikidata.org/entity/Q16144339'), ('objname', 'cinema')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P179'), ('objname', 'part of the series')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P480'), ('objname', 'FilmAffinity ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6186'), ('pname', 'category for eponymous categories'), ('o', 'http://www.wikidata.org/entity/Q8104425'), ('objname', 'Category:Wikipedia categories named after films')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('pname', 'maintained by WikiProject'), ('o', 'http://www.wikidata.org/entity/Q8485793'), ('objname', 'WikiProject Film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2579'), ('pname', 'studied by'), ('o', 'http://www.wikidata.org/entity/Q28793'), ('objname', 'film theory')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P136'), ('objname', 'genre')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2408'), ('objname', 'set in period')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P840'), ('objname', 'narrative location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P86'), ('objname', 'composer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P915'), ('objname', 'filming location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P161'), ('objname', 'cast member')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P166'), ('objname', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P364'), ('objname', 'original language of film or TV show')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P750'), ('objname', 'distributed by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q16672466'), ('objname', 'Wild Tales')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2208'), ('objname', 'average shot length')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P2554'), ('objname', 'production designer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P57'), ('objname', 'director')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P58'), ('objname', 'screenwriter')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P144'), ('objname', 'based on')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pname', \"topic's main template\"), ('o', 'http://www.wikidata.org/entity/Q6171351'), ('objname', 'Template:Infobox film')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5869'), ('pname', 'model item'), ('o', 'http://www.wikidata.org/entity/Q24815'), ('objname', 'Citizen Kane')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('o', 'http://www.wikidata.org/entity/Q622550'), ('objname', 'trailer')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1963'), ('pname', 'properties for this type'), ('o', 'http://www.wikidata.org/entity/P1237'), ('objname', 'Box Office Mojo film ID (former scheme)')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    wd:Q11424 ?p ?o  .\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "36417576-26e7-4b05-bf35-ea9444bc3c82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q6466199'), ('pname', 'Love Child'), ('o', 'http://www.wikidata.org/entity/Q786'), ('objname', 'Dominican Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30314457'), ('pname', 'Nashid al-Amal'), ('o', 'http://www.wikidata.org/entity/Q124943'), ('objname', 'Kingdom of Egypt')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27051825'), ('pname', 'The Desert of the Desert'), ('o', 'http://www.wikidata.org/entity/Q40362'), ('objname', 'Sahrawi Arab Democratic Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17492410'), ('pname', 'For the Best and for the Onion'), ('o', 'http://www.wikidata.org/entity/Q1032'), ('objname', 'Niger')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17059721'), ('pname', 'Mr and Mrs'), ('o', 'http://www.wikidata.org/entity/Q1033'), ('objname', 'Nigeria')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21010846'), ('pname', '93 Days'), ('o', 'http://www.wikidata.org/entity/Q1033'), ('objname', 'Nigeria')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22582567'), ('pname', 'Onye Ozi'), ('o', 'http://www.wikidata.org/entity/Q1033'), ('objname', 'Nigeria')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22905766'), ('pname', \"Suru L'ere\"), ('o', 'http://www.wikidata.org/entity/Q1033'), ('objname', 'Nigeria')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19295155'), ('pname', 'Rags and Silk'), ('o', 'http://www.wikidata.org/entity/Q1206012'), ('objname', 'German Reich')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18109337'), ('pname', 'Abatar'), ('o', 'http://www.wikidata.org/entity/Q129286'), ('objname', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18111770'), ('pname', 'Dhanwan'), ('o', 'http://www.wikidata.org/entity/Q129286'), ('objname', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18112081'), ('pname', 'Dulhan'), ('o', 'http://www.wikidata.org/entity/Q129286'), ('objname', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18127560'), ('pname', 'Lutaru Lalna'), ('o', 'http://www.wikidata.org/entity/Q129286'), ('objname', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q12980699'), ('pname', 'Sanyasi-Samsari'), ('o', 'http://www.wikidata.org/entity/Q129286'), ('objname', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15915250'), ('pname', 'Wang Laowu'), ('o', 'http://www.wikidata.org/entity/Q13426199'), ('objname', 'Republic of China 1912–1949')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17011651'), ('pname', 'Mulan Joins the Army'), ('o', 'http://www.wikidata.org/entity/Q13426199'), ('objname', 'Republic of China 1912–1949')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20724304'), ('pname', 'The Purge: Election Year'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15901144'), ('pname', 'Never on the First Night'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2811356'), ('pname', 'La Maison du Bonheur'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q101245069'), ('pname', 'The Prophetess of Thebes'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14949803'), ('pname', 'Going Away'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028307'), ('pname', 'The Good Shepherdess and the Evil Princess'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028573'), ('pname', 'Istanbul'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16029028'), ('pname', 'A Modern Coed'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16038933'), ('pname', 'Thus Finishes the Night'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6456005'), ('pname', \"L'Épervier\"), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11791941'), ('pname', 'The Tribulations of Balthazar Kober'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17297839'), ('pname', 'Paris Follies'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17492410'), ('pname', 'For the Best and for the Onion'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17512617'), ('pname', 'The Cut'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20002329'), ('pname', 'Once is Enough'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17586651'), ('pname', 'The Look of Silence'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17625921'), ('pname', 'Germaine and Benjamin'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17631638'), ('pname', \"L'Affaire de la rue de Lourcine\"), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17631667'), ('pname', \"L'Apôtre\"), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17632515'), ('pname', 'Ordinary Victories'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17632843'), ('pname', 'The Secret of Sarah Tombelaine'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17635129'), ('pname', 'A Thousand Suns'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17636109'), ('pname', 'Opération Libertad'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17636882'), ('pname', 'Plus fort que la haine'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3186820'), ('pname', 'Diary of a Chambermaid'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10315118'), ('pname', 'Warriors Five'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4142817'), ('pname', 'Goltzius and the Pelican Company'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6507901'), ('pname', 'Le Volcan interdit'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7747044'), ('pname', 'The Liars'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949977'), ('pname', 'Temptation'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20972530'), ('pname', 'The Dune'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20972538'), ('pname', 'Grandir'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20977958'), ('pname', 'Danse des Ouléd-Naïd'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21000942'), ('pname', 'Singende Frauen Women'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21007624'), ('pname', \"Don't Tell Her\"), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21008312'), ('pname', 'Last of the Elephant Men'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21008514'), ('pname', 'Murder in Pacot'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21009226'), ('pname', 'Master Love'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21009233'), ('pname', 'Merci Patron !'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21009469'), ('pname', 'Thermidor'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21055099'), ('pname', 'Antonia'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15990851'), ('pname', 'A Day Will Come'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21645971'), ('pname', 'A Gentleman of the Ring'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646257'), ('pname', 'Countdown to Doomsday'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646608'), ('pname', 'The King of Paris'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646609'), ('pname', 'The King of Paris'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646683'), ('pname', 'The Man at Midnight'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647053'), ('pname', 'A Stroke of 1000 Millions'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647243'), ('pname', 'The Uncle from Peking'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647329'), ('pname', \"You Can't Fool Antoinette\"), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24905318'), ('pname', 'Bach the Detective'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3342187'), ('pname', 'Nitchevo'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21935651'), ('pname', 'Dunkirk'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21953196'), ('pname', 'Ta mère'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22251880'), ('pname', 'Aloys'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23091027'), ('pname', 'A Decent Man'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18433'), ('pname', 'City of Women'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26828586'), ('pname', 'Hieronymus Bosch - The Garden of Dreams'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26834439'), ('pname', 'Hidden Admiration'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27032638'), ('pname', 'Théodora'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27477640'), ('pname', 'M. and Mme Adelman'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24346520'), ('pname', 'In the Forests of Siberia'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30731066'), ('pname', 'Patients'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15087230'), ('pname', 'Ida'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q449449'), ('pname', 'Laura'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q484675'), ('pname', 'Léon: The Professional'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q493892'), ('pname', 'Male Hunt'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q495449'), ('pname', 'Deep in the Woods'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q498109'), ('pname', 'Rush Hour 3'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q499706'), ('pname', 'The Smile'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q505097'), ('pname', 'Chronicle of a Death Foretold'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q759420'), ('pname', 'The Jewel of the Nile'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1199716'), ('pname', 'A Bad Son'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1211174'), ('pname', 'Going Places'), ('o', 'http://www.wikidata.org/entity/Q142'), ('objname', 'France')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q319263'), ('pname', 'Doctor in the House'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15762515'), ('pname', 'Second Origin'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15918213'), ('pname', 'King Lear'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15922298'), ('pname', 'Hector and the Search for Happiness'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16020981'), ('pname', 'The Amazing Partnership'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028315'), ('pname', 'The Bruce Partington Plans'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028374'), ('pname', 'The Dancing Men'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028732'), ('pname', 'The Naval Treaty'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028839'), ('pname', 'Queen and Country'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1624413'), ('pname', 'Hope and Glory'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4878680'), ('pname', 'Becket'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17018701'), ('pname', \"Rangi's Catch\"), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17021296'), ('pname', 'The Antics Roadshow'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17021952'), ('pname', 'Take a Chance'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17033251'), ('pname', 'The Headless Ghost'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17041377'), ('pname', 'We Are Northern Lights'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17061064'), ('pname', 'The Lilac Domino'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17063467'), ('pname', 'Twelve in a Box'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17091500'), ('pname', 'Hearts of Humanity'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18134529'), ('pname', 'X+Y'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3988505'), ('pname', 'The Nine Muses'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q151827'), ('pname', 'Celebration Day'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q46600556'), ('pname', 'Anti-Social'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17586651'), ('pname', 'The Look of Silence'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q267721'), ('pname', 'Grease'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7712287'), ('pname', 'The Act of Killing'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14786561'), ('pname', 'Fury'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18149041'), ('pname', 'Criminal'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18160372'), ('pname', 'Fit-Boy'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19294929'), ('pname', 'Live 1986'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19294930'), ('pname', 'Live at Montreux 1986'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4142817'), ('pname', 'Goltzius and the Pelican Company'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7744713'), ('pname', 'The Kinsman'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949831'), ('pname', 'Blue Smoke'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949950'), ('pname', 'The Rendlesham UFO Incident'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20949977'), ('pname', 'Temptation'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20992329'), ('pname', 'Arthur and Merlin'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647179'), ('pname', 'The Unkindness of Ravens'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21774237'), ('pname', 'AfterDeath'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21935651'), ('pname', 'Dunkirk'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21819857'), ('pname', 'Sing Street'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22252143'), ('pname', 'The Fear of 13'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24659208'), ('pname', \"Decadence and Downfall: The Shah of Iran's Ultimate Party\"), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24660078'), ('pname', \"Attenborough's Life That Glows\"), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23709802'), ('pname', '47 Meters Down'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26829660'), ('pname', 'The Most Dangerous Band in the World'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27039290'), ('pname', \"Billy Connolly's Tracks Across America: Reflections in My Window\"), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q195710'), ('pname', 'Krull'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3522995'), ('pname', 'Third Person'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30668445'), ('pname', 'Hardcore'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q35777951'), ('pname', 'Bond of Fear'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15087230'), ('pname', 'Ida'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2708250'), ('pname', 'Cracks'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q452235'), ('pname', 'The Man Who Could Work Miracles'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q467104'), ('pname', 'The Age of Stupid'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5566556'), ('pname', 'Glamorous Night'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q162255'), ('pname', 'The Terminator'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q492903'), ('pname', 'Ferry to Hong Kong'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q496734'), ('pname', 'Equus'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q498983'), ('pname', 'Young and Innocent'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q501105'), ('pname', 'The 39 Steps'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1033094'), ('pname', 'Candyman: Farewell to the Flesh'), ('o', 'http://www.wikidata.org/entity/Q145'), ('objname', 'United Kingdom')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15909847'), ('pname', 'Deng Xiaoping'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15911606'), ('pname', 'Seer the Movie 3: Heroes Alliance'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15914740'), ('pname', 'Westgate Tango'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16077910'), ('pname', 'Café. Waiting. Love'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2837599'), ('pname', \"All the King's Men\"), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17002139'), ('pname', 'Dragon Blade'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17035206'), ('pname', 'Trap Street'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17055661'), ('pname', 'Yang Guifei'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17340966'), ('pname', 'Old Boys: The Way of the Dragon'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14786561'), ('pname', 'Fury'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17500800'), ('pname', 'Paradise in Service'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18111972'), ('pname', \"Don't Go Breaking My Heart 2\"), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18127486'), ('pname', 'Lock Me Up, Tie Him Down'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18128725'), ('pname', 'Night of Adventure'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18128791'), ('pname', 'A Noble Spirit'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4657765'), ('pname', 'A Lingering Face'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21017012'), ('pname', 'Mr. Black: Green Star'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646054'), ('pname', 'Agreed Not to Separate'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647218'), ('pname', 'Tonight Nobody Goes Home'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22973774'), ('pname', 'Life Risking Romance'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24648382'), ('pname', 'Book of Love'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26268128'), ('pname', 'Never Said Goodbye'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27489020'), ('pname', 'The Old Donkey'), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q485527'), ('pname', \"Sophie's Revenge\"), ('o', 'http://www.wikidata.org/entity/Q148'), ('objname', \"People's Republic of China\")]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15732538'), ('pname', 'Chapliniana'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17582644'), ('pname', \"At the World's Limit\"), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4183371'), ('pname', 'Peril at End House'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4150644'), ('pname', 'The Nightingale'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17562506'), ('pname', 'The New Teacher'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22194355'), ('pname', 'The Step'), ('o', 'http://www.wikidata.org/entity/Q15180'), ('objname', 'Soviet Union')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15927316'), ('pname', 'A Summer Rain'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17053747'), ('pname', 'Good Luck, Sweetheart'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17168799'), ('pname', 'murdered'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17168862'), ('pname', 'A Marvada Carne'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17168949'), ('pname', 'A Princesa Xuxa e os Trapalhões'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17169009'), ('pname', 'Tim Maia'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18110405'), ('pname', 'Berlin to the Samba Beat'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24787997'), ('pname', 'The Violin Teacher'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27039250'), ('pname', 'Looking at the Stars'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27051825'), ('pname', 'The Desert of the Desert'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30907361'), ('pname', 'Dolores'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q456342'), ('pname', 'Massacre in Dinosaur Valley'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q502258'), ('pname', 'Cinderela Baiana'), ('o', 'http://www.wikidata.org/entity/Q155'), ('objname', 'Brazil')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17512617'), ('pname', 'The Cut'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17582651'), ('pname', 'Iron Ivan'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17605759'), ('pname', \"The Postman's White Nights\"), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21635502'), ('pname', 'Angels of Revolution'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21637453'), ('pname', 'First Time'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4198238'), ('pname', 'From Hell to Hell'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26836802'), ('pname', 'Involution'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30891036'), ('pname', 'Bird'), ('o', 'http://www.wikidata.org/entity/Q159'), ('objname', 'Russia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16210675'), ('pname', 'Surfacing'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16211828'), ('pname', 'Vanishing Point'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17478856'), ('pname', 'Antisocial'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17512617'), ('pname', 'The Cut'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17631909'), ('pname', 'Elephant Song'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17632824'), ('pname', 'An Eye for Beauty'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1060517'), ('pname', 'ATM'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20972608'), ('pname', \"Shana: The Wolf's Music\"), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21008312'), ('pname', 'Last of the Elephant Men'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21010861'), ('pname', 'Inertia'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5375873'), ('pname', 'End of the Line'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26823248'), ('pname', 'I Am JFK Jr.'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26832678'), ('pname', \"The Patriarch's Room\"), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26834180'), ('pname', 'Migrant Dreams'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27043373'), ('pname', 'NIAGARA: Thunder of the Waters'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27043404'), ('pname', 'Unarmed Verses'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27062847'), ('pname', 'The Grasslands Project'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30141756'), ('pname', 'Jacob Two-Two Meets the Hooded Fang'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10638831'), ('pname', 'Princes in Exile'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30337268'), ('pname', 'Song of Granite'), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q488595'), ('pname', \"I've Heard the Mermaids Singing\"), ('o', 'http://www.wikidata.org/entity/Q16'), ('objname', 'Canada')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5503570'), ('pname', 'Fridericus Rex – elfter Teil'), ('o', 'http://www.wikidata.org/entity/Q16957'), ('objname', 'German Democratic Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2665150'), ('pname', 'Apartment 1303'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16207026'), ('pname', 'Barefoot Gen'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17006359'), ('pname', 'Maria-sama ga Miteru'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17008339'), ('pname', 'Newlywed Hell'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17010186'), ('pname', 'Hitohada Kujaku'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17036710'), ('pname', 'The Drifting Avenger'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17049051'), ('pname', 'Flesh Market'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17049172'), ('pname', 'Garo Gaiden: Tougen no Fue'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17049470'), ('pname', 'High Kick Angels'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17049475'), ('pname', 'High School Debut'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17050203'), ('pname', 'Kamisama no Karute 2'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17052238'), ('pname', 'My Pretend Girlfriend'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17052913'), ('pname', 'Over Your Dead Body'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17058581'), ('pname', 'Shura'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16834594'), ('pname', 'Ask This of Rikyu'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16943346'), ('pname', 'Mabudachi'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17191560'), ('pname', 'I Will Buy You'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17191583'), ('pname', 'Ani to sono imoto'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17209430'), ('pname', \"Yogiri yo Kon'yamo Arigatō\"), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17211082'), ('pname', 'Yakuza Apocalypse'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17212079'), ('pname', 'Mosquito on the Tenth Floor'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17212358'), ('pname', 'Rashōmon'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17212643'), ('pname', 'La La La at Rock Bottom'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17214581'), ('pname', \"Lupin the IIIrd: Daisuke Jigen's Gravestone\"), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17220010'), ('pname', 'Lady Chatterley In Tokyo'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17224103'), ('pname', 'Our Neighbour, Miss Yae'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17228200'), ('pname', 'Jubilation Street'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18111309'), ('pname', 'Climbing to Spring'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27934724'), ('pname', 'Somebody'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3548172'), ('pname', 'Horse'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4701990'), ('pname', 'Akuto'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7676476'), ('pname', 'Taitei no Ken'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7971495'), ('pname', 'The Eagle and the Hawk'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17479251'), ('pname', 'Takumi-kun Series 4: Pure'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17635000'), ('pname', 'Kono Danshi, Uchū-jin to Tatakaemasu'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1309556'), ('pname', 'Doraemon: Nobita and the Galaxy Super-express'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18111865'), ('pname', 'Digital Devil Story: Megami Tensei'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18127139'), ('pname', 'Last Cabaret'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q50821735'), ('pname', 'Rainbow Days'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15912831'), ('pname', 'The Notorious Concubines'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10921850'), ('pname', 'Doraemon Comes Back'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21001643'), ('pname', 'Beyblade: Sol Blaze, the Scorching Hot Invader'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21019907'), ('pname', 'Yojōhan monogatari: Shōfu shino'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646939'), ('pname', 'Roommate'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647221'), ('pname', 'Tough Nights of Club Indigo'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647328'), ('pname', 'Yoru no kamome'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1044391'), ('pname', 'Yu-Gi-Oh!'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q44270509'), ('pname', 'Helter Skelter'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22905705'), ('pname', 'Joshikō'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q100988292'), ('pname', 'What a Wonderful Family! 2'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23309021'), ('pname', 'What a Wonderful Family!'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24211044'), ('pname', 'Accel World: Infinite Burst'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4942936'), ('pname', 'Book Girl'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q500254'), ('pname', 'P. P. Rider'), ('o', 'http://www.wikidata.org/entity/Q17'), ('objname', 'Japan')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3203816'), ('pname', 'The Man with a Cross'), ('o', 'http://www.wikidata.org/entity/Q172579'), ('objname', 'Kingdom of Italy')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646034'), ('pname', \"After Casanova's Fashion\"), ('o', 'http://www.wikidata.org/entity/Q172579'), ('objname', 'Kingdom of Italy')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13732569'), ('pname', 'Move On'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15853884'), ('pname', 'Weit ist der Weg'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15859580'), ('pname', 'Keller – Teenage Wasteland'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15859668'), ('pname', 'Little Man, What Now?'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15891098'), ('pname', 'Bibi und Tina'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15922298'), ('pname', 'Hector and the Search for Happiness'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18668230'), ('pname', 'Bibi & Tina 2'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16061145'), ('pname', 'Charlie Mariano – Last Visits'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16061437'), ('pname', 'The Village Under the Sky'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16218086'), ('pname', 'Love Steaks'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17003687'), ('pname', 'Express Train of Love'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17006808'), ('pname', 'The Girl with a Patron'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17009558'), ('pname', 'Her Dark Secret'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17009741'), ('pname', 'Der Herzensphotograph'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17018393'), ('pname', \"Kohlhiesel's Daughters\"), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17031051'), ('pname', 'The White God'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17034538'), ('pname', 'We Belong to the Imperial-Royal Infantry Regiment'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17039536'), ('pname', 'Woman at the Wheel'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17057068'), ('pname', 'Rebel Liesel'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17060588'), ('pname', 'The Girl at the Reception'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17060595'), ('pname', 'The Girl from Barnhelm'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17060612'), ('pname', 'The Girl Irene'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17061341'), ('pname', 'The Man Without Sleep'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17061540'), ('pname', 'The Model Husband'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17065657'), ('pname', 'Why Get a Divorce?'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17065708'), ('pname', 'People and Masks Part 2'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17065721'), ('pname', 'Wibbel the Tailor'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18170774'), ('pname', 'People and Masks'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17321105'), ('pname', 'Happiness Lies on the Street'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17321219'), ('pname', 'The Spanish Fly'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17347415'), ('pname', 'Count Festenberg'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17478908'), ('pname', 'Fanny Elssler'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17478988'), ('pname', 'Kri-Kri, the Duchess of Tarabac'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17479171'), ('pname', 'The Pink Slippers'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17479205'), ('pname', 'The Cavern'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17479283'), ('pname', \"Napoleon's Daughter\"), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17511111'), ('pname', 'All Because of the Dog'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17511491'), ('pname', 'Count Woronzeff'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17512617'), ('pname', 'The Cut'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17586651'), ('pname', 'The Look of Silence'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17625720'), ('pname', 'Adventures Inc.'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5515930'), ('pname', 'Gabriela'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11679791'), ('pname', 'Downhill City'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19295155'), ('pname', 'Rags and Silk'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19310626'), ('pname', 'Blind Justice'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19311582'), ('pname', 'Dark Clouds Over the Dachstein'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19311812'), ('pname', 'We Are Young. We Are Strong.'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19312162'), ('pname', 'Holiday in Tyrol'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2515642'), ('pname', 'Hounded'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3880002'), ('pname', 'A Night of Horror'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7930316'), ('pname', 'Villa Falconieri'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q19832621'), ('pname', 'Ein Hells Angels unter Brüdern'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20817143'), ('pname', 'Rendezvous at Erasmus'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21000647'), ('pname', 'Clowns'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21000942'), ('pname', 'Singende Frauen Women'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1199354'), ('pname', 'The Last Pedestrian'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15990851'), ('pname', 'A Day Will Come'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21035657'), ('pname', 'Spoiling the Game'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21643360'), ('pname', 'The Spiderwebhouse'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646257'), ('pname', 'Countdown to Doomsday'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646262'), ('pname', 'The Country Schoolmaster'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646388'), ('pname', 'Express 13'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646608'), ('pname', 'The King of Paris'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646609'), ('pname', 'The King of Paris'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646625'), ('pname', 'La Paloma'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646714'), ('pname', \"Midsummer Night's Fire\"), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646833'), ('pname', 'Pappi'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646839'), ('pname', 'Peace of Mind'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646925'), ('pname', 'Reckless Youth'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646978'), ('pname', 'The Secret of Johann Orth'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647206'), ('pname', 'Three Days of Love'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647388'), ('pname', 'Voices of Violence'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3818573'), ('pname', 'Savoy Hotel 217'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21932272'), ('pname', 'Family Business'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q6691437'), ('pname', 'Love Thy Neighbour'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22569863'), ('pname', 'Deckname Pirat'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22921060'), ('pname', 'Woman Driving, Man Sleeping'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22967835'), ('pname', 'The Anti-Detective'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22968851'), ('pname', \"Today's Children\"), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22969026'), ('pname', 'Comrades'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22969514'), ('pname', 'Fair Game'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22969625'), ('pname', 'The Girl Without a Conscience'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22973665'), ('pname', 'Linden Lady on the Rhine'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22975804'), ('pname', 'Miss Madame'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22976111'), ('pname', 'No Day Without You'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q23302089'), ('pname', 'Nightsession'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24203134'), ('pname', 'Ingeborg'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24237526'), ('pname', 'Zen For Nothing'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26265464'), ('pname', 'Scarred Hearts'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26269690'), ('pname', 'Ferien'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26836802'), ('pname', 'Involution'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27042413'), ('pname', 'Der Ost-Komplex'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27050153'), ('pname', 'Sign Space'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27076294'), ('pname', 'The Closed Chain'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q3522995'), ('pname', 'Third Person'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q29155790'), ('pname', 'And then catch yourself from falling'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q5503570'), ('pname', 'Fridericus Rex – elfter Teil'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30668183'), ('pname', 'Big City Secret'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30668448'), ('pname', 'Must We Get Divorced?'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q14949930'), ('pname', 'Spring Awakening'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21869503'), ('pname', 'Kubinke the Barber'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22000755'), ('pname', 'The Marriage of Figaro'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30898459'), ('pname', 'Sunken Worlds'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30901011'), ('pname', 'Only One Night'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30901170'), ('pname', 'Bigamie'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16467315'), ('pname', 'Kampf um Rom II - Der Verrat'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26912299'), ('pname', 'Kampf um Rom'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27832313'), ('pname', 'Dream City'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q442459'), ('pname', 'Kampf um Rom I'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q443733'), ('pname', 'The Woman of My Dreams'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q445122'), ('pname', 'Adam Resurrected'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q459057'), ('pname', 'Monster'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4821584'), ('pname', 'Augustus the Strong'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7757996'), ('pname', 'The Practice of Love'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q488316'), ('pname', 'Anatomy'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q491338'), ('pname', 'Different from You and Me'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q498109'), ('pname', 'Rush Hour 3'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q505790'), ('pname', 'Mission: Impossible 2'), ('o', 'http://www.wikidata.org/entity/Q183'), ('objname', 'Germany')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30337268'), ('pname', 'Song of Granite'), ('o', 'http://www.wikidata.org/entity/Q189'), ('objname', 'Iceland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q490588'), ('pname', 'The Bothersome Man'), ('o', 'http://www.wikidata.org/entity/Q189'), ('objname', 'Iceland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15729771'), ('pname', 'Stallo: Curse of the Shaman'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17504869'), ('pname', 'Høysommer'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17504872'), ('pname', 'Selkvinnen'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17504885'), ('pname', 'Strengt hemmelig'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17504906'), ('pname', 'Play'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17505960'), ('pname', 'Two Lives'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17586651'), ('pname', 'The Look of Silence'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7712287'), ('pname', 'The Act of Killing'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21008514'), ('pname', 'Murder in Pacot'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24659713'), ('pname', 'Magnus - The Mozart of Chess'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q490588'), ('pname', 'The Bothersome Man'), ('o', 'http://www.wikidata.org/entity/Q20'), ('objname', 'Norway')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22905709'), ('pname', \"Kings' Shift\"), ('o', 'http://www.wikidata.org/entity/Q211'), ('objname', 'Latvia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8452990'), ('pname', \"Sunday League - Pepik Hnatek's Final Match\"), ('o', 'http://www.wikidata.org/entity/Q213'), ('objname', 'Czech Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15906152'), ('pname', 'Tender Waves'), ('o', 'http://www.wikidata.org/entity/Q213'), ('objname', 'Czech Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17444481'), ('pname', 'Život je život'), ('o', 'http://www.wikidata.org/entity/Q213'), ('objname', 'Czech Republic')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20988424'), ('pname', 'The Tree'), ('o', 'http://www.wikidata.org/entity/Q215'), ('objname', 'Slovenia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646400'), ('pname', 'Felix'), ('o', 'http://www.wikidata.org/entity/Q215'), ('objname', 'Slovenia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26226434'), ('pname', 'Ruins'), ('o', 'http://www.wikidata.org/entity/Q215'), ('objname', 'Slovenia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26251104'), ('pname', 'Stereotype'), ('o', 'http://www.wikidata.org/entity/Q215'), ('objname', 'Slovenia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26265464'), ('pname', 'Scarred Hearts'), ('o', 'http://www.wikidata.org/entity/Q218'), ('objname', 'Romania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30124357'), ('pname', 'Brâncuși'), ('o', 'http://www.wikidata.org/entity/Q218'), ('objname', 'Romania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q442459'), ('pname', 'Kampf um Rom I'), ('o', 'http://www.wikidata.org/entity/Q218'), ('objname', 'Romania')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21648900'), ('pname', 'Buferna zona'), ('o', 'http://www.wikidata.org/entity/Q219'), ('objname', 'Bulgaria')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4142817'), ('pname', 'Goltzius and the Pelican Company'), ('o', 'http://www.wikidata.org/entity/Q224'), ('objname', 'Croatia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21009990'), ('pname', 'You Carry Me'), ('o', 'http://www.wikidata.org/entity/Q224'), ('objname', 'Croatia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17052006'), ('pname', 'Jalanan'), ('o', 'http://www.wikidata.org/entity/Q252'), ('objname', 'Indonesia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17586651'), ('pname', 'The Look of Silence'), ('o', 'http://www.wikidata.org/entity/Q252'), ('objname', 'Indonesia')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15919861'), ('pname', 'Road to your Heart'), ('o', 'http://www.wikidata.org/entity/Q258'), ('objname', 'South Africa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15922298'), ('pname', 'Hector and the Search for Happiness'), ('o', 'http://www.wikidata.org/entity/Q258'), ('objname', 'South Africa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17325516'), ('pname', 'Of Good Report'), ('o', 'http://www.wikidata.org/entity/Q258'), ('objname', 'South Africa')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21819857'), ('pname', 'Sing Street'), ('o', 'http://www.wikidata.org/entity/Q27'), ('objname', 'Ireland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q30337268'), ('pname', 'Song of Granite'), ('o', 'http://www.wikidata.org/entity/Q27'), ('objname', 'Ireland')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646196'), ('pname', 'Brats'), ('o', 'http://www.wikidata.org/entity/Q28'), ('objname', 'Hungary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27477697'), ('pname', 'The Exam'), ('o', 'http://www.wikidata.org/entity/Q28'), ('objname', 'Hungary')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q8197668'), ('pname', 'Idiot Love'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15724600'), ('pname', 'Territoriu de bandolerus'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15729320'), ('pname', 'El heredero de Casa Pruna'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15730627'), ('pname', 'Flamenco Flamenco'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15762515'), ('pname', 'Second Origin'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17295012'), ('pname', 'Barcelona 1714'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4747613'), ('pname', 'Amor a la española'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q18611999'), ('pname', 'Werther'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646366'), ('pname', 'El caso Almería'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646486'), ('pname', 'Heroes del Aire'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21646506'), ('pname', 'La ilustre fregona'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647044'), ('pname', 'Stop at Tenerife'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q21647234'), ('pname', 'Tuset Street'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20899498'), ('pname', 'Ma Ma'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q22039133'), ('pname', 'The Propaganda Game'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q24207223'), ('pname', 'Los Encantados'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26420238'), ('pname', 'Fire in the Blood'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q26828586'), ('pname', 'Hieronymus Bosch - The Garden of Dreams'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2593280'), ('pname', 'El perro'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27039155'), ('pname', 'Torres Quevedo: Vol. 2'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q27042710'), ('pname', 'Earth Sutra'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q29167613'), ('pname', 'A Glass of Whiskey'), ('o', 'http://www.wikidata.org/entity/Q29'), ('objname', 'Spain')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q13677566'), ('pname', 'Timberjack'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15490985'), ('pname', 'Jailhouse Heat'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15046558'), ('pname', 'Life After Beth'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15584559'), ('pname', 'Salvation Nell'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15596853'), ('pname', 'Burying the Ex'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15728077'), ('pname', \"We're Only Human\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15735966'), ('pname', 'Dani Daniels: Dare'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1758112'), ('pname', \"Ender's Game\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20724304'), ('pname', 'The Purge: Election Year'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15845171'), ('pname', 'The Falcon Out West'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15850483'), ('pname', 'The Fight for Life'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15856724'), ('pname', 'Avengers XXX – A Porn Parody'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15857417'), ('pname', 'E.T. XXX – A Dreamzone Parody'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15867624'), ('pname', 'Real Housewives of the San Fernando Valley – A XXX Parody'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15882802'), ('pname', 'The Storm'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15882932'), ('pname', 'Titanoboa: Monster Snake'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15913592'), ('pname', 'Little Accidents'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15914474'), ('pname', 'The Mark'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15916442'), ('pname', 'Yes, My Darling Daughter'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15957681'), ('pname', \"Timothy Dobbs, That's Me\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1755064'), ('pname', \"Sharky's Machine\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2631932'), ('pname', 'Henry Fool'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q2665150'), ('pname', 'Apartment 1303'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q4101763'), ('pname', 'Under Still Waters'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q10601548'), ('pname', \"Nobody's Darling\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q11510316'), ('pname', 'Love Under Fire'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16020825'), ('pname', 'A Military Judas'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16021003'), ('pname', 'An Indian Martyr'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028292'), ('pname', 'The Battle of the Red Men'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028316'), ('pname', 'The Bugle Call'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028381'), ('pname', 'The Death Mask'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028406'), ('pname', 'Dog vs. Dog'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028471'), ('pname', 'From Now On'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028475'), ('pname', 'Fruits of Passion'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028483'), ('pname', 'The Garrison Triangle'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028674'), ('pname', 'The Swordsman'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028767'), ('pname', 'The Other Girl'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028835'), ('pname', \"The Prospector's Daughter\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028836'), ('pname', 'The Protection of the Cross'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028858'), ('pname', 'The Reformed Outlaw'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16028952'), ('pname', 'Stacked Cards'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16029045'), ('pname', 'The Foolish Virgin'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16038841'), ('pname', 'A Self-Made Hero'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "500\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "# P31 --> 'instance of'\n",
    "# P495 --> 'country of origin'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P495 ?o.\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname \n",
    "}\n",
    "LIMIT 500\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "eaf261bc-3625-4b34-8292-f5f1041a7b88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q13677566'), ('pname', 'Timberjack'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15490985'), ('pname', 'Jailhouse Heat'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15046558'), ('pname', 'Life After Beth'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15584559'), ('pname', 'Salvation Nell'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15596853'), ('pname', 'Burying the Ex'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15728077'), ('pname', \"We're Only Human\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15735966'), ('pname', 'Dani Daniels: Dare'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q1758112'), ('pname', \"Ender's Game\"), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q20724304'), ('pname', 'The Purge: Election Year'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q15845171'), ('pname', 'The Falcon Out West'), ('o', 'http://www.wikidata.org/entity/Q30'), ('objname', 'United States of America')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "# P31 --> 'instance of'\n",
    "# P495 --> 'country of origin'\n",
    "# Q30 -->'United States of America'\n",
    "#Restricting data to USA only\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?o ?objname \n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P495 ?o.\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname. \n",
    "   filter(?o = wd:Q30)\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "8d0e559b-b115-484e-a1c5-500e1c6d0b5e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '16108'), ('gen', 'http://www.wikidata.org/entity/Q130232'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '4913'), ('gen', 'http://www.wikidata.org/entity/Q93204'), ('GenName', 'documentary film')]\n",
      "[('NumOfFilms', '115'), ('gen', 'http://www.wikidata.org/entity/Q3272147'), ('GenName', 'found footage')]\n",
      "[('NumOfFilms', '647'), ('gen', 'http://www.wikidata.org/entity/Q224700'), ('GenName', 'comedy horror')]\n",
      "[('NumOfFilms', '121'), ('gen', 'http://www.wikidata.org/entity/Q909586'), ('GenName', 'splatter film')]\n",
      "[('NumOfFilms', '6'), ('gen', 'http://www.wikidata.org/entity/Q222926'), ('GenName', 'comedy of manners')]\n",
      "[('NumOfFilms', '2'), ('gen', 'http://www.wikidata.org/entity/Q858784'), ('GenName', 'mecha')]\n",
      "[('NumOfFilms', '7'), ('gen', 'http://www.wikidata.org/entity/Q1257444'), ('GenName', 'film adaptation')]\n",
      "[('NumOfFilms', '7'), ('gen', 'http://www.wikidata.org/entity/Q24862'), ('GenName', 'short film')]\n",
      "[('NumOfFilms', '22'), ('gen', 'http://www.wikidata.org/entity/Q652256'), ('GenName', 'epic film')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# Q11424 --> 'film'\n",
    "# P31 --> 'instance of'\n",
    "# P495 --> 'country of origin'\n",
    "# Q30 -->'United States of America'\n",
    "# P136 --> 'genre'\n",
    "#Grouping data wrt genre\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?gen ?GenName\n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P495 ?o;\n",
    "    wdt:P136 ?gen.\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname. \n",
    "   ?gen sc:name ?GenName.\n",
    "   filter(?o = wd:Q30)\n",
    "}\n",
    "GROUP BY ?gen ?GenName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "f08a28df-b037-458b-8a76-2dce695e9853",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1962'), ('gen', 'http://www.wikidata.org/entity/Q130232'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '1077'), ('gen', 'http://www.wikidata.org/entity/Q93204'), ('GenName', 'documentary film')]\n",
      "[('NumOfFilms', '135'), ('gen', 'http://www.wikidata.org/entity/Q224700'), ('GenName', 'comedy horror')]\n",
      "[('NumOfFilms', '6'), ('gen', 'http://www.wikidata.org/entity/Q21010853'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '5'), ('gen', 'http://www.wikidata.org/entity/Q3072042'), ('GenName', 'kung fu film')]\n",
      "[('NumOfFilms', '24'), ('gen', 'http://www.wikidata.org/entity/Q909586'), ('GenName', 'splatter film')]\n",
      "[('NumOfFilms', '105'), ('gen', 'http://www.wikidata.org/entity/Q3272147'), ('GenName', 'found footage')]\n",
      "[('NumOfFilms', '11'), ('gen', 'http://www.wikidata.org/entity/Q8812380'), ('GenName', 'pseudo-documentary')]\n",
      "[('NumOfFilms', '1'), ('gen', 'http://www.wikidata.org/entity/Q9503'), ('GenName', 'suspense')]\n",
      "[('NumOfFilms', '1'), ('gen', 'http://www.wikidata.org/entity/Q174526'), ('GenName', 'cyberpunk')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Restricting released period\n",
    "# P577 --> 'publication date'\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?gen ?GenName\n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P495 ?o;\n",
    "    wdt:P136 ?gen;\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname. \n",
    "   ?gen sc:name ?GenName.\n",
    "   filter(?o = wd:Q30)\n",
    "   FILTER(?Pdate > \"2010\"^^xsd:gYear && ?Pdate < \"2015\"^^xsd:gYear)\n",
    "}\n",
    "GROUP BY ?gen ?GenName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7b169573",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "f9dcb3f0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1962'), ('gen', 'http://www.wikidata.org/entity/Q130232'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '1077'), ('gen', 'http://www.wikidata.org/entity/Q93204'), ('GenName', 'documentary film')]\n",
      "[('NumOfFilms', '135'), ('gen', 'http://www.wikidata.org/entity/Q224700'), ('GenName', 'comedy horror')]\n",
      "[('NumOfFilms', '6'), ('gen', 'http://www.wikidata.org/entity/Q21010853'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '5'), ('gen', 'http://www.wikidata.org/entity/Q3072042'), ('GenName', 'kung fu film')]\n",
      "[('NumOfFilms', '24'), ('gen', 'http://www.wikidata.org/entity/Q909586'), ('GenName', 'splatter film')]\n",
      "[('NumOfFilms', '105'), ('gen', 'http://www.wikidata.org/entity/Q3272147'), ('GenName', 'found footage')]\n",
      "[('NumOfFilms', '11'), ('gen', 'http://www.wikidata.org/entity/Q8812380'), ('GenName', 'pseudo-documentary')]\n",
      "[('NumOfFilms', '1'), ('gen', 'http://www.wikidata.org/entity/Q9503'), ('GenName', 'suspense')]\n",
      "[('NumOfFilms', '1'), ('gen', 'http://www.wikidata.org/entity/Q174526'), ('GenName', 'cyberpunk')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query \n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?gen ?GenName\n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P495 ?o;\n",
    "    wdt:P136 ?gen;\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?pname .\n",
    "   ?o sc:name ?objname. \n",
    "   ?gen sc:name ?GenName.\n",
    "   filter(?o = wd:Q30)\n",
    "   FILTER(?Pdate > \"2010\"^^xsd:gYear && ?Pdate < \"2015\"^^xsd:gYear)\n",
    "}\n",
    "GROUP BY ?gen ?GenName\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "44032e0a",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 5\n",
    "Consider the timespan from 2001-01-01 to nowadays. Find the number of films released in this timespan divided by film genre and return only those with more than 50 films released every year (the result set must be genre IRI and label)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "id": "16843630",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '116'), ('gen', 'http://www.wikidata.org/entity/Q21010853'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '29110'), ('gen', 'http://www.wikidata.org/entity/Q130232'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '18932'), ('gen', 'http://www.wikidata.org/entity/Q93204'), ('GenName', 'documentary film')]\n",
      "[('NumOfFilms', '704'), ('gen', 'http://www.wikidata.org/entity/Q224700'), ('GenName', 'comedy horror')]\n",
      "[('NumOfFilms', '228'), ('gen', 'http://www.wikidata.org/entity/Q3272147'), ('GenName', 'found footage')]\n",
      "[('NumOfFilms', '67'), ('gen', 'http://www.wikidata.org/entity/Q1760864'), ('GenName', 'nature documentary')]\n",
      "[('NumOfFilms', '121'), ('gen', 'http://www.wikidata.org/entity/Q1257444'), ('GenName', 'film adaptation')]\n",
      "[('NumOfFilms', '202'), ('gen', 'http://www.wikidata.org/entity/Q909586'), ('GenName', 'splatter film')]\n",
      "[('NumOfFilms', '276'), ('gen', 'http://www.wikidata.org/entity/Q1341051'), ('GenName', 'post-apocalyptic film')]\n",
      "[('NumOfFilms', '2885'), ('gen', 'http://www.wikidata.org/entity/Q959790'), ('GenName', 'crime film')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#Grouping data wrt genre\n",
    "queryString = \"\"\"\n",
    "SELECT distinct (COUNT(?p) as ?NumOfFilms) ?gen ?GenName\n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P136 ?gen;\n",
    "    wdt:P577 ?Pdate.\n",
    "\n",
    "   ?gen sc:name ?GenName.\n",
    "   \n",
    "   FILTER(?Pdate > \"2001-01-01\"^^xsd:dateTime)\n",
    "}\n",
    "GROUP BY ?gen ?GenName\n",
    "having(Count(?p) > 50)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da585703",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "id": "99dc0daf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '116'), ('gen', 'http://www.wikidata.org/entity/Q21010853'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '29110'), ('gen', 'http://www.wikidata.org/entity/Q130232'), ('GenName', 'drama')]\n",
      "[('NumOfFilms', '18932'), ('gen', 'http://www.wikidata.org/entity/Q93204'), ('GenName', 'documentary film')]\n",
      "[('NumOfFilms', '704'), ('gen', 'http://www.wikidata.org/entity/Q224700'), ('GenName', 'comedy horror')]\n",
      "[('NumOfFilms', '228'), ('gen', 'http://www.wikidata.org/entity/Q3272147'), ('GenName', 'found footage')]\n",
      "[('NumOfFilms', '67'), ('gen', 'http://www.wikidata.org/entity/Q1760864'), ('GenName', 'nature documentary')]\n",
      "[('NumOfFilms', '121'), ('gen', 'http://www.wikidata.org/entity/Q1257444'), ('GenName', 'film adaptation')]\n",
      "[('NumOfFilms', '202'), ('gen', 'http://www.wikidata.org/entity/Q909586'), ('GenName', 'splatter film')]\n",
      "[('NumOfFilms', '276'), ('gen', 'http://www.wikidata.org/entity/Q1341051'), ('GenName', 'post-apocalyptic film')]\n",
      "[('NumOfFilms', '2885'), ('gen', 'http://www.wikidata.org/entity/Q959790'), ('GenName', 'crime film')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#Grouping data wrt genre\n",
    "queryString = \"\"\"\n",
    "SELECT distinct (COUNT(?p) as ?NumOfFilms) ?gen ?GenName\n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P136 ?gen;\n",
    "    wdt:P577 ?Pdate.\n",
    "\n",
    "   ?gen sc:name ?GenName.\n",
    "   \n",
    "   FILTER(?Pdate > \"2001-01-01\"^^xsd:dateTime)\n",
    "}\n",
    "GROUP BY ?gen ?GenName\n",
    "having(Count(?p) > 50)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6dffb77b",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "Consider the composers of Western films and their country of citizenship. Count the number of Western Films on which worked a composer grouped by country of citizenship and return the top-10 (the result set must be country IRI, label and #films).."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "dbc08f51",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/entity/Q15882802'), ('pname', 'The Storm'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q16200305'), ('pname', 'Fangs of the Arctic'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17011616'), ('pname', 'Mr. Texas'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17036710'), ('pname', 'The Drifting Avenger'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17052173'), ('pname', 'The Desert of the Lost'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17053125'), ('pname', 'Between Dangers'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q7569044'), ('pname', 'South of Santa Fe'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17184091'), ('pname', 'With Buffalo Bill on the U. P. Trail'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17190227'), ('pname', 'Easy Going'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "[('p', 'http://www.wikidata.org/entity/Q17639337'), ('pname', 'Skedaddle Gold'), ('gen', 'http://www.wikidata.org/entity/Q172980'), ('genre', 'Western film')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?gen ?genre \n",
    "WHERE {\n",
    "   ?p wdt:P31 wd:Q11424;\n",
    "    wdt:P136 ?gen.\n",
    "    ?p sc:name ?pname .\n",
    "   ?gen sc:name ?genre .\n",
    "   \n",
    "   Filter(Regex(?genre , \"[Ww]estern film\"))\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "id": "f95be0a5-7b4e-4200-8d02-31cb3c5eb62b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q1305262'), ('sname', 'Custer of the West'), ('composer_name', 'Bernardo Segall'), ('citizenship', 'Brazilians')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q949228'), ('sname', 'Sholay'), ('composer_name', 'Rahul Dev Burman'), ('citizenship', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q6402614'), ('sname', 'Khote Sikkay'), ('composer_name', 'Rahul Dev Burman'), ('citizenship', 'British India')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q3024718'), ('sname', 'The Wise Guys'), ('composer_name', 'François de Roubaix'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q829365'), ('sname', \"Don't Touch the White Woman!\"), ('composer_name', 'Philippe Sarde'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q7770309'), ('sname', 'The Triumphs of a Man Called Horse'), ('composer_name', 'Georges Garvarentz'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q1569275'), ('sname', 'The Legend of Frenchie King'), ('composer_name', 'Francis Lai'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q1305391'), ('sname', 'Another Man, Another Chance'), ('composer_name', 'Francis Lai'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q477782'), ('sname', 'El Topo'), ('composer_name', 'Alejandro Jodorowsky'), ('citizenship', 'France')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P136'), ('pname', 'genre'), ('s', 'http://www.wikidata.org/entity/Q1500885'), ('sname', 'Posse'), ('composer_name', 'Maurice Jarre'), ('citizenship', 'France')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "# Q172980 --> 'Western film'\n",
    "# P86 --> 'composer' From the above query.\n",
    "# P27 --> 'nationality' from the given data.\n",
    "queryString = \"\"\"\n",
    "SELECT ?p ?pname ?s ?sname ?composer_name ?citizenship\n",
    "WHERE {\n",
    "   ?s ?p wd:Q172980;\n",
    "   wdt:P86 ?cname.\n",
    "   ?cname wdt:P27 ?coun.\n",
    "    \n",
    "    ?s sc:name ?sname .\n",
    "   ?p sc:name ?pname .\n",
    "   ?cname sc:name ?composer_name.\n",
    "   ?coun sc:name ?citizenship.\n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "id": "55bdb3c3-9d22-4f18-bfcd-9c06a76db495",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '82'), ('composer_name', 'Paul Sawtell'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '37'), ('composer_name', 'Cy Feuer'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '33'), ('composer_name', 'Raoul Kraushaar'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '30'), ('composer_name', 'Max Steiner'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '30'), ('composer_name', 'Max Steiner'), ('citizenship', 'Austria-Hungary')]\n",
      "[('NumOfFilms', '25'), ('composer_name', 'Paul Dunlap'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '24'), ('composer_name', 'Victor Young'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '23'), ('composer_name', 'John Leipold'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '23'), ('composer_name', 'Roy Webb'), ('citizenship', 'United States of America')]\n",
      "[('NumOfFilms', '22'), ('composer_name', 'David Buttolph'), ('citizenship', 'United States of America')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# Q11424 --> 'film'\n",
    "# Q172980 --> 'Western film'\n",
    "# P86 --> 'composer' From the above query.\n",
    "# P27 --> 'nationality' from the given data.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT (COUNT(?s) as ?NumOfFilms) ?composer_name ?citizenship\n",
    "WHERE {\n",
    "   ?s ?p wd:Q172980;\n",
    "   wdt:P86 ?cname.\n",
    "   ?cname wdt:P27 ?coun.\n",
    "    \n",
    "    ?s sc:name ?film_name .\n",
    "   ?cname sc:name ?composer_name.\n",
    "   ?coun sc:name ?citizenship.\n",
    "}\n",
    "Group by ?citizenship ?composer_name\n",
    "Order by desc(?NumOfFilms)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43ba3d6d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "b7b98a26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Paul Sawtell'), ('citizenship', 'United States of America'), ('NumOfFilms', '82')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Cy Feuer'), ('citizenship', 'United States of America'), ('NumOfFilms', '37')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Raoul Kraushaar'), ('citizenship', 'United States of America'), ('NumOfFilms', '33')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q28513'), ('composer_name', 'Max Steiner'), ('citizenship', 'Austria-Hungary'), ('NumOfFilms', '30')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Max Steiner'), ('citizenship', 'United States of America'), ('NumOfFilms', '30')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Paul Dunlap'), ('citizenship', 'United States of America'), ('NumOfFilms', '25')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Victor Young'), ('citizenship', 'United States of America'), ('NumOfFilms', '24')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'John Leipold'), ('citizenship', 'United States of America'), ('NumOfFilms', '23')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'Roy Webb'), ('citizenship', 'United States of America'), ('NumOfFilms', '23')]\n",
      "[('coun', 'http://www.wikidata.org/entity/Q30'), ('composer_name', 'David Buttolph'), ('citizenship', 'United States of America'), ('NumOfFilms', '22')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?coun ?composer_name  ?citizenship (COUNT(?s) as ?NumOfFilms) \n",
    "WHERE {\n",
    "   ?s ?p wd:Q172980;\n",
    "   wdt:P86 ?cname.\n",
    "   ?cname wdt:P27 ?coun.\n",
    "    \n",
    "    ?s sc:name ?film_name .\n",
    "   ?cname sc:name ?composer_name.\n",
    "   ?coun sc:name ?citizenship.\n",
    "}\n",
    "Group by ?citizenship ?composer_name ?coun\n",
    "Order by desc(?NumOfFilms)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "698814e2",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 7\n",
    "Consider the decades from 1961 to 1970, and from 2001 to 2010 and compare the total number of western films released in each one (the result set must be two couples decade and #western films of that decade)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2a19d37a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1'), ('pname', 'Tell Them Willie Boy Is Here')]\n",
      "[('NumOfFilms', '1'), ('pname', 'The Desperado Trail')]\n",
      "[('NumOfFilms', '1'), ('pname', 'Shalako')]\n",
      "[('NumOfFilms', '1'), ('pname', 'Return of the Gunfighter')]\n",
      "[('NumOfFilms', '1'), ('pname', 'Town Tamer')]\n",
      "[('NumOfFilms', '2'), ('pname', 'Kid Rodelo')]\n",
      "[('NumOfFilms', '1'), ('pname', 'Outlaw of Red River')]\n",
      "[('NumOfFilms', '1'), ('pname', 'Day of the Evil Gun')]\n",
      "[('NumOfFilms', '3'), ('pname', 'A Fistful of Dollars')]\n",
      "[('NumOfFilms', '1'), ('pname', 'McLintock!')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#Grouping data wrt genre\n",
    "# Q172980 --> 'Western film'\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?pname \n",
    "WHERE {\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?pname .\n",
    "   #?Pdate sc:name ?objname. \n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "}\n",
    "GROUP BY ?pname \n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "8fe54b70-4d48-44cb-a7ae-bf13cd3fb432",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1'), ('film_name', 'Gun Fight'), ('Pdate', '1961-05-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'A Taste of Death'), ('Pdate', '1968-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Red Tomahawk'), ('Pdate', '1967-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Outlaw of Red River'), ('Pdate', '1965-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Scalphunters'), ('Pdate', '1968-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Cry Blood, Apache'), ('Pdate', '1970-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'A Fistful of Dollars'), ('Pdate', '1964-10-20T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Way West'), ('Pdate', '1967-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Magnificent Seven'), ('Pdate', '1961-05-03T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Bullet for a Badman'), ('Pdate', '1964-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Elusive Avengers'), ('Pdate', '1966-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Arizona Bushwhackers'), ('Pdate', '1968-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Annie Get Your Gun'), ('Pdate', '1967-03-19T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Heaven with a Gun'), ('Pdate', '1969-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Chingachgook, die große Schlange'), ('Pdate', '1967-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Dirty Dingus Magee'), ('Pdate', '1970-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Good Guys and the Bad Guys'), ('Pdate', '1969-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Major Dundee'), ('Pdate', '1964-01-01T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Butch Cassidy and the Sundance Kid'), ('Pdate', '1969-09-23T00:00:00Z')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Serenity'), ('Pdate', '2005-11-24T00:00:00Z')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#Grouping data wrt genre\n",
    "# Q172980 --> 'Western film'\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?film_name  ?Pdate\n",
    "WHERE {{\n",
    " ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "   #?Pdate sc:name ?objname. \n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "   }\n",
    "   UNION\n",
    "{\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "   \n",
    "   FILTER(?Pdate > \"2001\"^^xsd:gYear && ?Pdate < \"2010\"^^xsd:gYear)\n",
    "   }\n",
    "}\n",
    "GROUP BY ?film_name ?Pdate\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "903dc41e-747a-4b48-81a1-0d48d52828b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Drifting Avenger'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Kid Rodelo'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Way West'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Sartana Does Not Forgive'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Nebraska-Jim'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Fastest Guitar Alive'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Welcome to Hard Times'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Wild Westerners'), ('releaseyear', '1962')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Gunfight at Comanche Creek'), ('releaseyear', '1963')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Young Billy Young'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Challenge of the McKennas'), ('releaseyear', '1970')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Death is serving'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Dakota Joe'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Lonesome Cowboys'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Das Vermächtnis des Inka'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Son of a Gunfighter'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Ride the High Country'), ('releaseyear', '1962')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Invitation to a Gunfighter'), ('releaseyear', '1964')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Der Schatz der Azteken'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Great Bank Robbery'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Five Bloody Graves'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '2'), ('film_name', 'Serenity'), ('releaseyear', '2005')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Gunless'), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Lucky Country'), ('releaseyear', '2009')]\n",
      "[('NumOfFilms', '1'), ('film_name', '6 Guns'), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Good, the Bad, the Weird'), ('releaseyear', '2009')]\n",
      "[('NumOfFilms', '1'), ('film_name', '800 Bullets'), ('releaseyear', '2002')]\n",
      "[('NumOfFilms', '1'), ('film_name', \"Meek's Cutoff\"), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Stay Away, Joe'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Taggart'), ('releaseyear', '1964')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "#Grouping data wrt genre\n",
    "# Q172980 --> 'Western film'\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?film_name  ?releaseyear\n",
    "WHERE {{\n",
    " ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "   #?Pdate sc:name ?objname. \n",
    "   bind(STRBEFORE(str(?Pdate),'-' )as ?releaseyear).\n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "   }\n",
    "   UNION\n",
    "{\n",
    "   ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "    bind(STRBEFORE(str(?Pdate),'-' )as ?releaseyear).\n",
    "   \n",
    "   FILTER(?Pdate > \"2001\"^^xsd:gYear && ?Pdate < \"2010\"^^xsd:gYear)\n",
    "   }\n",
    "}\n",
    "GROUP BY ?film_name ?releaseyear\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3511c749",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "eca569fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Drifting Avenger'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Kid Rodelo'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Way West'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Sartana Does Not Forgive'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Nebraska-Jim'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Fastest Guitar Alive'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Welcome to Hard Times'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Wild Westerners'), ('releaseyear', '1962')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Gunfight at Comanche Creek'), ('releaseyear', '1963')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Young Billy Young'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Challenge of the McKennas'), ('releaseyear', '1970')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Death is serving'), ('releaseyear', '1966')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Dakota Joe'), ('releaseyear', '1967')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Lonesome Cowboys'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Das Vermächtnis des Inka'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Son of a Gunfighter'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Ride the High Country'), ('releaseyear', '1962')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Invitation to a Gunfighter'), ('releaseyear', '1964')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Der Schatz der Azteken'), ('releaseyear', '1965')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Great Bank Robbery'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Five Bloody Graves'), ('releaseyear', '1969')]\n",
      "[('NumOfFilms', '2'), ('film_name', 'Serenity'), ('releaseyear', '2005')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Gunless'), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Lucky Country'), ('releaseyear', '2009')]\n",
      "[('NumOfFilms', '1'), ('film_name', '6 Guns'), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'The Good, the Bad, the Weird'), ('releaseyear', '2009')]\n",
      "[('NumOfFilms', '1'), ('film_name', '800 Bullets'), ('releaseyear', '2002')]\n",
      "[('NumOfFilms', '1'), ('film_name', \"Meek's Cutoff\"), ('releaseyear', '2010')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Stay Away, Joe'), ('releaseyear', '1968')]\n",
      "[('NumOfFilms', '1'), ('film_name', 'Taggart'), ('releaseyear', '1964')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT (COUNT(?p) as ?NumOfFilms) ?film_name  ?releaseyear\n",
    "WHERE {{\n",
    " ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "   #?Pdate sc:name ?objname. \n",
    "   bind(STRBEFORE(str(?Pdate),'-' )as ?releaseyear).\n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "   }\n",
    "   UNION\n",
    "{\n",
    "   ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate.\n",
    "    ?p sc:name ?film_name .\n",
    "    bind(STRBEFORE(str(?Pdate),'-' )as ?releaseyear).\n",
    "   \n",
    "   FILTER(?Pdate > \"2001\"^^xsd:gYear && ?Pdate < \"2010\"^^xsd:gYear)\n",
    "   }\n",
    "}\n",
    "GROUP BY ?film_name ?releaseyear\n",
    "\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "69540402",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 8\n",
    "Consider the decades from 1961 to 1970, and from 2001 to 2010 and select only western films. Then, for each decade, compare the average cast members size per film (the result set must be two couples decade and average cast members size of that decade)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "db38d869",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('avg_per_film', '13.482758620689655')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#Grouping data wrt genre\n",
    "# Q172980 --> 'Western film'\n",
    "# P161 --> 'cast member' (from task 4)\n",
    "queryString = \"\"\"\n",
    "SELECT (AVG(?average_cast_member) as ?avg_per_film) \n",
    "WHERE {\n",
    "    SELECT (Count(?cmember) AS ?average_cast_member) ?pname \n",
    "    WHERE {{\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate;\n",
    "    wdt:P161 ?cmember.\n",
    "    \n",
    "    ?p sc:name ?pname .\n",
    "    ?cmember sc:name ?cast_member.\n",
    "   #?Pdate sc:name ?objname. \n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "   }\n",
    "    UNION\n",
    "{\n",
    "   ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate;\n",
    "    wdt:P161 ?cmember.\n",
    "    \n",
    "    ?p sc:name ?pname .\n",
    "    ?cmember sc:name ?cast_member.\n",
    "   #?Pdate sc:name ?objname.    \n",
    "   \n",
    "   FILTER(?Pdate > \"2001\"^^xsd:gYear && ?Pdate < \"2010\"^^xsd:gYear)\n",
    "   }\n",
    "   }\n",
    "  \n",
    "   \n",
    "    GROUP BY ?pname\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da28d6c1",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "14a171ee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('avg_per_film', '13.482758620689655')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT (AVG(?average_cast_member) as ?avg_per_film) \n",
    "WHERE {\n",
    "    SELECT (Count(?cmember) AS ?average_cast_member) ?pname \n",
    "    WHERE {{\n",
    "    ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate;\n",
    "    wdt:P161 ?cmember.\n",
    "    \n",
    "    ?p sc:name ?pname .\n",
    "    ?cmember sc:name ?cast_member.\n",
    "   #?Pdate sc:name ?objname. \n",
    "   \n",
    "   FILTER(?Pdate > \"1961\"^^xsd:gYear && ?Pdate < \"1970\"^^xsd:gYear)\n",
    "   }\n",
    "    UNION\n",
    "{\n",
    "   ?p wdt:P31 wd:Q11424;\n",
    "     wdt:P136 wd:Q172980; #those film who's genre is western film\n",
    "    wdt:P577 ?Pdate;\n",
    "    wdt:P161 ?cmember.\n",
    "    \n",
    "    ?p sc:name ?pname .\n",
    "    ?cmember sc:name ?cast_member.\n",
    "   #?Pdate sc:name ?objname.    \n",
    "   \n",
    "   FILTER(?Pdate > \"2001\"^^xsd:gYear && ?Pdate < \"2010\"^^xsd:gYear)\n",
    "   }\n",
    "   }\n",
    "  \n",
    "   \n",
    "    GROUP BY ?pname\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "619597e0-9f93-465a-b4a0-472621ff39bb",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
