{"macro_topic": "Sport", "topic": "Sport Workflow Series (\"Olympic Games explorative search\")", "worker": "2022_21", "goals": {"1": "Identify the BGP for Olympic Games", "2": "Return all the editions of the Summer Olympic Games (do not consider future Olympic Games) with the country where they were played (the result set must be a list of elements with edition IRI and label, and country IRI and label).", "3": "Find the countries which held more than 2 Olympic Games (both Summer and Winter Games, do not consider future Olympic Games) (the result set must be a list of triples country IRI, label and #edition held).", "4": "Consider the 2008 Summer Olympic Games. Identify all the sports played in this edition (the result set must be a list of couples sport IRI and label).", "5": "Consider the 2008 Summer Olympic Games. For each sport return the number of different disciplines (the result set must be a list of triples sport IRI, label and #disciplines).", "6": "Consider the 2008 Summer Olympic Games. Find the top-10 people who won more gold medals (the result set must be a list of triples athlete IRI, label and #gold medal).", "7": "Find athletes who won at least one gold medal in 4 different editions of the Summer Olympic Games (the result set must be a list of triples athlete IRI, label and #edition).", "8": "Consider all the edition of the Summer Olympic Games. For each sport return the athlete who won more gold medal (the result set must be a list of elements with sport IRI and label, athlete IRI and label, and #gold medal)."}, "name": "c6e6b77dd7", "search_workflow": {"1": [{"narrative": "query example", "query": "SELECT DISTINCT ?p ?name WHERE { wd:Q1189 ?p ?obj . ?p sc:name ?name. } LIMIT 20", "output": [], "parseError": null, "keywords": {"SELECT": 1, "ASK": 0, "DESCRIBE": 0, "CONSTRUCT": 0, "NESTED QUERY": 0, "DISTINCT": 1, "LIMIT": 1, "OFFSET": 0, "ORDER BY": 0, "FILTER": 0, "REGEX": 0, "AND": 0, "UNION": 0, "OPTIONAL": 0, "GRAPH": 0, "EXISTS": 0, "NOT EXISTS": 0, "MINUS": 0, "COUNT": 0, "MAX": 0, "MIN": 0, "AVG": 0, "SUM": 0, "GROUP BY": 0, "HAVING": 0, "GROUP_CONCAT": 0}, "index": 0, "recall": 0.0, "precision": 0.0, "accuracy": 0.0, "fscore": 0.0}]}}