{"macro_topic": "Movie", "topic": "Movie Workflow Series (\"Film Genre and composer explorative search\")", "worker": "2022_21", "goals": {"1": "Identify the BGP for films", "2": "Identify the BGP for composer", "3": "Identify the BGP for film genre", "4": "Find how many films are been released in the United States of America from 2010-01-01 to 2015-31-12 for each film genre available (the result set must be genre IRI, label and #films).", "5": "Consider the timespan from 2001-01-01 to nowadays. Find the number of films released in this timespan divided by film genre and return only those with more than 50 films released every year (the result set must be genre IRI and label).", "6": "Consider the composers of Western films and their country of citizenship. Count the number of Western Films on which worked a composer grouped by country of citizenship and return the top-10 (the result set must be country IRI, label and #films)..", "7": "Consider the decades from 1961 to 1970, and from 2001 to 2010 and compare the total number of western films released in each one (the result set must be two couples decade and #western films of that decade).", "8": "Consider the decades from 1961 to 1970, and from 2001 to 2010 and select only western films. Then, for each decade, compare the average cast members size per film (the result set must be two couples decade and average cast members size of that decade)."}, "name": "f6a7cbb21e", "search_workflow": {"1": [{"narrative": "query example", "query": "SELECT DISTINCT ?p ?name WHERE { wd:Q25089 ?p ?obj . ?p sc:name ?name. } LIMIT 20", "output": [], "parseError": null, "keywords": {"SELECT": 1, "ASK": 0, "DESCRIBE": 0, "CONSTRUCT": 0, "NESTED QUERY": 0, "DISTINCT": 1, "LIMIT": 1, "OFFSET": 0, "ORDER BY": 0, "FILTER": 0, "REGEX": 0, "AND": 0, "UNION": 0, "OPTIONAL": 0, "GRAPH": 0, "EXISTS": 0, "NOT EXISTS": 0, "MINUS": 0, "COUNT": 0, "MAX": 0, "MIN": 0, "AVG": 0, "SUM": 0, "GROUP BY": 0, "HAVING": 0, "GROUP_CONCAT": 0}, "index": 0, "recall": 0.0, "precision": 0.0, "accuracy": 0.0, "fscore": 0.0}]}}