{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "import sys\n",
    "import os\n",
    "import json\n",
    "import pandas as pd\n",
    "sys.path.insert(1, '/locale/data/jupyter/prando/notebook/sparqlthesis/')\n",
    "import modules.evaluation as evaluation\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-history5-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Euro explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the Euro currency, which are the countries that currently use the Euro and which were their currencies before the Euro. Take a look also to other currencies and find which are the most used."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q38`| Italy   | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q38 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Italy**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for currency\n",
    "\n",
    "2. Return the countries which currently use Euro\n",
    "\n",
    "3. Return the countries belonging to the European Union, with a currency different from the Euro (return also their currency).\n",
    "\n",
    "4. For each country that now uses Euro return which was the currencies used before\n",
    "\n",
    "5. Return all types of dollar in the world (US Dollar, Australian Dollar, ecc...)\n",
    "\n",
    "6. Return the currencies used in at least 2 different countries (return also the number of countries using each currency).\n",
    "\n",
    "7. Consider the currencies obtained in task 6, for each currency return the number of people using that currency (hint: consider the maximum popolation available for each country)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "32f9e449",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n"
     ]
    }
   ],
   "source": [
    "## startup the evaluation\n",
    "# setup the file and create the empty json\n",
    "ipname = \"h5.ipynb\"\n",
    "pt = os.getcwd()+os.sep+ipname\n",
    "evaluation.setup(pt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "130c4e78-ec70-48c2-aba0-5bb0d0f63286",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c68d0b6f-22f1-421a-be6c-f91b97c874be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8061'), ('name', 'AGROVOC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5198'), ('name', 'ASC Leiden Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6150'), ('name', 'Academy Awards Database nominee ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8895'), ('name', 'All the Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7870'), ('name', 'Analysis & Policy Observatory term ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8785'), ('name', 'AniDB tag ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9629'), ('name', 'Armeniapedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6200'), ('name', 'BBC News topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9037'), ('name', 'BHCL UUID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7832'), ('name', 'Basque Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5180'), ('name', 'CIVICUS Monitor country entry')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9368'), ('name', 'CNA topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9123'), ('name', 'Catalan Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P998'), ('name', 'Curlie ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6849'), ('name', 'DR topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3509'), ('name', 'Dagens Nyheter topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1036'), ('name', 'Dewey Decimal Classification')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4589'), ('name', 'Dreadnought Project page')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4672'), ('name', 'EMLO location ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8935'), ('name', 'Encyclopedia of the History of Ukraine ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8472'), ('name', 'Encyclopedie berbere keyword ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5437'), ('name', 'EuroVoc ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P901'), ('name', 'FIPS 10-4 (countries and regions)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4073'), ('name', 'Fandom wiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4427'), ('name', 'GACS ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3067'), ('name', 'GS1 country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5400'), ('name', 'GeoNLP ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1566'), ('name', 'GeoNames ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1667'), ('name', 'Getty Thesaurus of Geographic Names ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5247'), ('name', 'Giant Bomb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1842'), ('name', 'Global Anabaptist Mennonite Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7295'), ('name', 'Gregorian calendar start date')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8406'), ('name', 'Grove Art Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5843'), ('name', 'Gynopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1081'), ('name', 'Human Development Index')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5250'), ('name', 'IAB code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3422'), ('name', 'INSEE countries and foreign territories code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P984'), ('name', 'IOC country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P898'), ('name', 'IPA transcription')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3097'), ('name', 'ISBN identifier group')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P297'), ('name', 'ISO 3166-1 alpha-2 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P298'), ('name', 'ISO 3166-1 alpha-3 code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P299'), ('name', 'ISO 3166-1 numeric code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3024'), ('name', 'ITU letter code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3743'), ('name', 'ITU/ISO/IEC object identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('name', 'Interlingual Index ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5698'), ('name', 'Invasive Species Compendium Datasheet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6413'), ('name', 'JORFSearch organization ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1438'), ('name', 'Jewish Encyclopedia ID (Russian)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7960'), ('name', 'Joconde discovery ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7850'), ('name', 'Joconde location ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3612'), ('name', 'Le Monde diplomatique subject ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7208'), ('name', 'Liber Liber author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4801'), ('name', 'LoC and MARC vocabularies ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7322'), ('name', 'Marine Regions Geographic IDentifier (MRGID)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P486'), ('name', 'MeSH descriptor ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P982'), ('name', 'MusicBrainz area ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2004'), ('name', 'NALT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P605'), ('name', 'NUTS code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2950'), ('name', 'Nomisma ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3479'), ('name', 'Omni topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P402'), ('name', 'OpenStreetMap relation ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6592'), ('name', 'OpenStreetMap zoom level')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5002'), ('name', 'Orthodox Encyclopedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5739'), ('name', 'Pontificia Università della Santa Croce ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9223'), ('name', 'Provenio UUID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8519'), ('name', 'RKD thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8974'), ('name', 'SAPA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3987'), ('name', 'SHARE Catalogue author ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3911'), ('name', 'STW Thesaurus for Economics ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9757'), ('name', 'Schoenberg Database of Manuscripts place ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9122'), ('name', 'SportsLogos.net team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3175'), ('name', 'Statoids ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7314'), ('name', 'TDV İslam Ansiklopedisi ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6839'), ('name', 'TV Tropes identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5456'), ('name', 'TasteAtlas ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7157'), ('name', 'The Top Tens ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6404'), ('name', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1225'), ('name', 'U.S. National Archives Identifier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2981'), ('name', 'UIC alphabetical country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2982'), ('name', 'UIC numerical country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P487'), ('name', 'Unicode character')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2855'), ('name', 'VAT-rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3068'), ('name', 'WIPO ST.3')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6766'), ('name', \"Who's on First ID\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5125'), ('name', 'Wikimedia outline')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8814'), ('name', 'WordNet 3.1 Synset ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7012'), ('name', 'World Encyclopedia of Puppetry Arts ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6293'), ('name', 'YSA ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2997'), ('name', 'age of majority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P85'), ('name', 'anthem')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5573'), ('name', 'archINFORM location ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2046'), ('name', 'area')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('name', 'basic form of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('name', 'capital')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1740'), ('name', 'category for films shot at this location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('name', 'category for maps')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('name', 'category for people who died here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('name', 'category for people born here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('name', 'category of associated people')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1791'), ('name', 'category of people buried here')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('name', 'coat of arms')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P94'), ('name', 'coat of arms image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3271'), ('name', 'compulsory education (maximum age)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3270'), ('name', 'compulsory education (minimum age)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P474'), ('name', 'country calling code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2596'), ('name', 'culture')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9241'), ('name', 'demographics of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1549'), ('name', 'demonym')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('name', 'diplomatic relation')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1622'), ('name', 'driving side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('name', 'economy of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8826'), ('name', 'edition humboldt digital ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2853'), ('name', 'electrical plug type')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2852'), ('name', 'emergency telephone number')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('name', 'executive body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('name', 'flag')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2633'), ('name', 'geography of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3896'), ('name', 'geoshape')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6'), ('name', 'head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P35'), ('name', 'head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P209'), ('name', 'highest judicial authority')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P610'), ('name', 'highest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8217'), ('name', 'iDAI.gazetteer ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7471'), ('name', 'iNaturalist place ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('name', 'language used')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('name', 'legislative body')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P395'), ('name', 'licence plate code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2250'), ('name', 'life expectancy')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('name', 'located in or next to body of water')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('name', 'located in time zone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('name', 'located in/on physical feature')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1589'), ('name', 'lowest point')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P92'), ('name', 'main regulatory text')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2884'), ('name', 'mains voltage')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2979'), ('name', 'maritime identification digits')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3000'), ('name', 'marriageable age')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3529'), ('name', 'median income')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7422'), ('name', 'minimum temperature record')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2258'), ('name', 'mobile country code')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1451'), ('name', 'motto text')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1120'), ('name', 'number of deaths')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2573'), ('name', 'number of out-of-school children')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('name', 'office held by head of state')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8402'), ('name', 'open data portal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P417'), ('name', 'patron saint')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('name', 'population')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P832'), ('name', 'public holiday')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5658'), ('name', 'railway traffic side')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1419'), ('name', 'shape')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('name', 'shares border with')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3984'), ('name', 'subreddit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P78'), ('name', 'top-level Internet domain')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4841'), ('name', 'total fertility rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1198'), ('name', 'unemployment rate')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2436'), ('name', 'voltage')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8432'), ('name', 'Österreichisches Musiklexikon Online ID')]\n",
      "230\n"
     ]
    }
   ],
   "source": [
    "# find properties of Italy\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?name\n",
    "WHERE { \n",
    "    wd:Q38 ?p ?obj.\n",
    "    ?p sc:name ?name.\n",
    "} \n",
    "order by ?name\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0e38b014-cbb4-4c33-87bb-024474786571",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# use the property currency\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    wd:Q38 wdt:P38 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0a979c6e-06e4-4920-b297-0520d7f8e4ae",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q8142'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28795800'), ('name', 'decimal currency')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# instance of\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    wd:Q4916 wdt:P31 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "2769ee9b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow1_1.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 1 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q8142\"\n",
    "og_name = \"currency\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"1\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d985053-3067-4440-9eef-ed9330efac73",
   "metadata": {},
   "source": [
    "`wd:Q8142` is the class of currency"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0f3f0f4c-8efb-46e6-90e5-9b247990af3a",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e3410486-072a-4426-a0c8-479c68375759",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1001'), ('name', 'applies to jurisdiction')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1282'), ('name', 'OpenStreetMap tag or key')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1482'), ('name', 'Stack Exchange tag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1813'), ('name', 'short name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1993'), ('name', 'TeX string')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2284'), ('name', 'price')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2347'), ('name', 'YSO ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2442'), ('name', 'conversion to standard unit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2968'), ('name', 'QUDT unit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3328'), ('name', 'wurvoc.org measure ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3347'), ('name', 'PermID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3911'), ('name', 'STW Thesaurus for Economics ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P487'), ('name', 'Unicode character')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P489'), ('name', 'currency symbol description')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P498'), ('name', 'ISO 4217 code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P508'), ('name', 'BNCF Thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5437'), ('name', 'EuroVoc ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P562'), ('name', 'central bank/issuer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6404'), ('name', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7007'), ('name', 'Wolfram Language unit code')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7033'), ('name', 'Australian Educational Vocabulary ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7749'), ('name', 'Nomenclature for Museum Cataloging')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7996'), ('name', 'EH.Net Encyclopedia of Economic and Business History ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8769'), ('name', 'Ontology of units of Measure 2.0 unit ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9318'), ('name', 'Ávvir topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P998'), ('name', 'Curlie ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9059'), ('name', 'subdivision of this unit')]\n",
      "66\n"
     ]
    }
   ],
   "source": [
    "# properties of euro\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    wd:Q4916 ?prop ?obj.\n",
    "    ?prop sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "7b80d746-da7f-49b1-9973-437714152900",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q235'), ('name', 'Monaco')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q237'), ('name', 'Vatican City')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q238'), ('name', 'San Marino')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q27'), ('name', 'Ireland')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q41'), ('name', 'Greece')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q55'), ('name', 'Netherlands')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# use country\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    wd:Q4916 wdt:P17 ?obj.\n",
    "    ?obj sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "06968c6e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow1_1.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "obj = [{\"uri\":r[0][1],\"name\":r[1][1]} for r in x]\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"2\", evaluation.TYPE_SET ,\"uri\", obj)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "56ef94f7-f1a2-48a5-8d14-1fcc94c27ec7",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "b7b000bd-cd69-451d-aff2-6c6795f7d052",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q1065'), ('name', 'United Nations')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q13116'), ('name', 'Benelux')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q215669'), ('name', 'Allies of the First World War')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27293'), ('name', 'Western Asia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27468'), ('name', 'Eastern Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27496'), ('name', 'Western Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27509'), ('name', 'Central Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q29999'), ('name', 'Kingdom of the Netherlands')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q39731'), ('name', 'Baltic states')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q458'), ('name', 'European Union')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q476033'), ('name', 'Low Countries')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q50807777'), ('name', 'Southwestern Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q7204'), ('name', 'Middle East')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q234963'), ('name', 'Catalan Countries')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27479'), ('name', 'Northern Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q52062'), ('name', 'Nordic countries')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q263686'), ('name', 'Southeast Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q604496'), ('name', 'Fennoscandia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1849394'), ('name', 'Pyrenees–Mediterranean Euroregion')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# use the property has part to object of euro-country-obj\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "    wd:Q4916 wdt:P17 ?obj.\n",
    "    ?obj wdt:P361 ?x.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "8cd75caf-a483-40f8-9c3e-04c2bcccb4ca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1051'), ('name', 'PSH ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1081'), ('name', 'Human Development Index')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1082'), ('name', 'population')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P112'), ('name', 'founded by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1125'), ('name', 'Gini coefficient')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1245'), ('name', 'OmegaWiki Defined Meaning')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1315'), ('name', 'NLA Trove ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1365'), ('name', 'replaces')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1448'), ('name', 'official name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1451'), ('name', 'motto text')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1482'), ('name', 'Stack Exchange tag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P150'), ('name', 'contains administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1546'), ('name', 'motto')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1549'), ('name', 'demonym')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1622'), ('name', 'driving side')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P163'), ('name', 'flag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1807'), ('name', 'Great Aragonese Encyclopedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1813'), ('name', 'short name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1938'), ('name', 'Project Gutenberg author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P194'), ('name', 'legislative body')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2046'), ('name', 'area')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P208'), ('name', 'executive body')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P209'), ('name', 'highest judicial authority')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2184'), ('name', 'history of topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2427'), ('name', 'GRID ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2633'), ('name', 'geography of topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2852'), ('name', 'emergency telephone number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2884'), ('name', 'mains voltage')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3153'), ('name', 'Crossref funder ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3188'), ('name', 'Nobel prize ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3509'), ('name', 'Dagens Nyheter topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P355'), ('name', 'subsidiary')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3569'), ('name', 'Cultureel Woordenboek ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P36'), ('name', 'capital')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3612'), ('name', 'Le Monde diplomatique subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P37'), ('name', 'official language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3762'), ('name', 'openMLOL author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3827'), ('name', 'JSTOR topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3847'), ('name', 'Open Library subject ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3916'), ('name', 'UNESCO Thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3987'), ('name', 'SHARE Catalogue author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P402'), ('name', 'OpenStreetMap relation ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P409'), ('name', 'Libraries Australia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P421'), ('name', 'located in time zone')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4223'), ('name', \"Treccani's Enciclopedia Italiana ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4293'), ('name', 'PM20 folder ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4427'), ('name', 'GACS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4527'), ('name', 'UK Parliament thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P457'), ('name', 'foundational text')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4613'), ('name', 'Encyclopedia of Modern Ukraine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P47'), ('name', 'shares border with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4725'), ('name', 'C-SPAN organization ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P486'), ('name', 'MeSH descriptor ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P487'), ('name', 'Unicode character')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5125'), ('name', 'Wikimedia outline')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5167'), ('name', 'vehicles per thousand people')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5198'), ('name', 'ASC Leiden Thesaurus ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5266'), ('name', 'Finnish national bibliography corporate name ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P530'), ('name', 'diplomatic relation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P571'), ('name', 'inception')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5905'), ('name', 'Comic Vine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6200'), ('name', 'BBC News topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6328'), ('name', 'Politika topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6366'), ('name', 'Microsoft Academic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6385'), ('name', 'Krugosvet article')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6404'), ('name', \"Treccani's Dizionario di Storia ID\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P648'), ('name', 'Open Library ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6782'), ('name', 'ROR ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7208'), ('name', 'Liber Liber author ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P78'), ('name', 'top-level Internet domain')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7867'), ('name', 'category for maps')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7870'), ('name', 'Analysis & Policy Observatory term ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7982'), ('name', 'Hrvatska enciklopedija ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8024'), ('name', 'Nobel Laureate API ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8309'), ('name', 'Yle topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P832'), ('name', 'public holiday')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8402'), ('name', 'open data portal')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8408'), ('name', 'KBpedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P85'), ('name', 'anthem')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8744'), ('name', 'economy of topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8935'), ('name', 'Encyclopedia of the History of Ukraine ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P902'), ('name', 'HDS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9037'), ('name', 'BHCL UUID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9241'), ('name', 'demographics of topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9272'), ('name', 'DeCS ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9287'), ('name', 'Cyprus Bibliography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9349'), ('name', 'France24 topic ID (Arabic)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9368'), ('name', 'CNA topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9482'), ('name', 'Catalogue of the General State Archives ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9545'), ('name', 'Encyclopedia of China Online Database ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9629'), ('name', 'Armeniapedia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P998'), ('name', 'Curlie ID')]\n",
      "153\n"
     ]
    }
   ],
   "source": [
    "# property of European Union\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "    wd:Q458 ?prop ?x.\n",
    "    #FILTER(?curr != wd:Q4916).\n",
    "    #FILTER NOT EXISTS{wd:Q4916 wdt:P17 ?obj.}\n",
    "    ?prop sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "6b7850b7-eea8-43d1-88be-e1db87da60dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q142'), ('name', 'France')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191'), ('name', 'Estonia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q215'), ('name', 'Slovenia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q28'), ('name', 'Hungary')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q31'), ('name', 'Belgium')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q32'), ('name', 'Luxembourg')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q34'), ('name', 'Sweden')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q35'), ('name', 'Denmark')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q36'), ('name', 'Poland')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q37'), ('name', 'Lithuania')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q41'), ('name', 'Greece')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q55'), ('name', 'Netherlands')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q22890'), ('name', 'Ireland')]\n",
      "27\n"
     ]
    }
   ],
   "source": [
    "# looking for the part of the EU\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "    wd:Q458 wdt:P527 ?x.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "b189bd7e-fde9-47fa-9e69-af950d9ffc38",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic'), ('curr', 'http://www.wikidata.org/entity/Q131016'), ('cName', 'Czech koruna')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania'), ('curr', 'http://www.wikidata.org/entity/Q131645'), ('cName', 'Romanian leu')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria'), ('curr', 'http://www.wikidata.org/entity/Q172540'), ('cName', 'Bulgarian lev')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia'), ('curr', 'http://www.wikidata.org/entity/Q26360'), ('cName', 'Croatian kuna')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q28'), ('name', 'Hungary'), ('curr', 'http://www.wikidata.org/entity/Q47190'), ('cName', 'forint')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q34'), ('name', 'Sweden'), ('curr', 'http://www.wikidata.org/entity/Q122922'), ('cName', 'Swedish krona')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q35'), ('name', 'Denmark'), ('curr', 'http://www.wikidata.org/entity/Q25417'), ('cName', 'Danish krone')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q36'), ('name', 'Poland'), ('curr', 'http://www.wikidata.org/entity/Q123213'), ('cName', 'złoty')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# find countries which belong to EU but they don't uses Euro as currency\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name ?curr ?cName\n",
    "WHERE { \n",
    "    wd:Q458 wdt:P527 ?x.\n",
    "    ?x wdt:P38 ?curr.\n",
    "    FILTER(?curr != wd:Q4916).\n",
    "    ?x sc:name ?name.\n",
    "    ?curr sc:name ?cName.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "e199badd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow1_1.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "# URI associated to another URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    c_uri = i[2][1]\n",
    "    c_name = i[3][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = [\"uri\",\"name\"]\n",
    "    obj[\"uri\"]= c_uri\n",
    "    obj[\"name\"]= c_name\n",
    "    objs.append(obj)\n",
    "\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"3\", evaluation.TYPE_REFERRED ,[\"uri\",\"name\"], objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8aecfc28-4014-469d-8369-7b78279e407d",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0c233603-a5f1-4023-a0a6-885ffaa7d04b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q270642'), ('name', 'Irish pound')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q788472'), ('name', 'Dutch guilder')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1546443'), ('name', 'Greek drachma')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q203354'), ('name', 'Finnish markka')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q204992'), ('name', 'Italian lira')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q468474'), ('name', 'Portuguese escudo')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q189097'), ('name', 'peseta')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q174467'), ('name', 'Maltese lira')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q133011'), ('name', 'Latvian lats')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q183354'), ('name', 'Vatican lira')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q129983'), ('name', 'Estonian kroon')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25627'), ('name', 'Lithuanian litas')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q193716'), ('name', 'Cypriot pound')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q221828'), ('name', 'European Currency Unit')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q213940'), ('name', 'Luxembourg franc')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q178874'), ('name', 'Slovak koruna')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208730'), ('name', 'Austrian schilling')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q232415'), ('name', 'Belgian franc')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1047040'), ('name', 'Monegasque franc')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1063029'), ('name', 'Sammarinese lira')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208133'), ('name', 'Slovenian tolar')]\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "# from one of the first query use P1365 replaces\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "    wd:Q4916 wdt:P1365 ?x.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a2563c1c-80c7-4c42-8d8b-2501a3438905",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q27'), ('cName', 'Ireland'), ('x', 'http://www.wikidata.org/entity/Q270642'), ('name', 'Irish pound')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29999'), ('cName', 'Kingdom of the Netherlands'), ('x', 'http://www.wikidata.org/entity/Q788472'), ('name', 'Dutch guilder')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q41'), ('cName', 'Greece'), ('x', 'http://www.wikidata.org/entity/Q1546443'), ('name', 'Greek drachma')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('cName', 'Finland'), ('x', 'http://www.wikidata.org/entity/Q203354'), ('name', 'Finnish markka')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('cName', 'Italy'), ('x', 'http://www.wikidata.org/entity/Q204992'), ('name', 'Italian lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('cName', 'Portugal'), ('x', 'http://www.wikidata.org/entity/Q468474'), ('name', 'Portuguese escudo')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('cName', 'Monaco'), ('x', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('cName', 'France'), ('x', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('cName', 'Andorra'), ('x', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('cName', 'Andorra'), ('x', 'http://www.wikidata.org/entity/Q189097'), ('name', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('cName', 'Spain'), ('x', 'http://www.wikidata.org/entity/Q189097'), ('name', 'peseta')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('cName', 'Germany'), ('x', 'http://www.wikidata.org/entity/Q16068'), ('name', 'Deutsche Mark')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('cName', 'Malta'), ('x', 'http://www.wikidata.org/entity/Q174467'), ('name', 'Maltese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('cName', 'Latvia'), ('x', 'http://www.wikidata.org/entity/Q133011'), ('name', 'Latvian lats')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q237'), ('cName', 'Vatican City'), ('x', 'http://www.wikidata.org/entity/Q183354'), ('name', 'Vatican lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q191'), ('cName', 'Estonia'), ('x', 'http://www.wikidata.org/entity/Q129983'), ('name', 'Estonian kroon')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q37'), ('cName', 'Lithuania'), ('x', 'http://www.wikidata.org/entity/Q25627'), ('name', 'Lithuanian litas')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('cName', 'Cyprus'), ('x', 'http://www.wikidata.org/entity/Q193716'), ('name', 'Cypriot pound')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q32'), ('cName', 'Luxembourg'), ('x', 'http://www.wikidata.org/entity/Q213940'), ('name', 'Luxembourg franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('cName', 'Slovakia'), ('x', 'http://www.wikidata.org/entity/Q178874'), ('name', 'Slovak koruna')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('cName', 'Austria'), ('x', 'http://www.wikidata.org/entity/Q208730'), ('name', 'Austrian schilling')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q31'), ('cName', 'Belgium'), ('x', 'http://www.wikidata.org/entity/Q232415'), ('name', 'Belgian franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q235'), ('cName', 'Monaco'), ('x', 'http://www.wikidata.org/entity/Q1047040'), ('name', 'Monegasque franc')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q238'), ('cName', 'San Marino'), ('x', 'http://www.wikidata.org/entity/Q1063029'), ('name', 'Sammarinese lira')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q215'), ('cName', 'Slovenia'), ('x', 'http://www.wikidata.org/entity/Q208133'), ('name', 'Slovenian tolar')]\n",
      "25\n"
     ]
    }
   ],
   "source": [
    "# from one of the first query use P1365 replaces\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?cName ?x ?name \n",
    "WHERE { \n",
    "    wd:Q4916 wdt:P1365 ?x.\n",
    "    ?country wdt:P38 wd:Q4916.\n",
    "    ?x wdt:P17 ?country.\n",
    "    ?x sc:name ?name.\n",
    "    ?country sc:name ?cName.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "f0af39af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow1_1.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "# URI associated to another URI\n",
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    c_uri = i[2][1]\n",
    "    c_name = i[3][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = [\"uri\",\"name\"]\n",
    "    obj[\"uri\"]= c_uri\n",
    "    obj[\"name\"]= c_name\n",
    "    objs.append(obj)\n",
    "\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"4\", evaluation.TYPE_REFERRED ,[\"uri\",\"name\"], objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5f590f9-44f4-4284-96a5-cf27eaf8aa56",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "d87f0f5f-5230-46ed-b058-e5243e485cd5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q242890'), ('name', 'Trinidad and Tobago dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q942092'), ('name', 'British West Indies dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1104069'), ('name', 'Canadian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4597'), ('name', 'Solomon Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2411666'), ('name', 'Newfoundland dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q209792'), ('name', 'Jamaican dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15039722'), ('name', 'spanish dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q31015'), ('name', 'Hong Kong dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q261447'), ('name', 'Straits dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4592'), ('name', 'Fijian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1323382'), ('name', 'New Brunswick dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2407759'), ('name', 'Malaya and British Borneo dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2414453'), ('name', 'Sarawak dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q242988'), ('name', 'Liberian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712663'), ('name', 'Antigua dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712665'), ('name', 'Nevisian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q194351'), ('name', 'Barbadian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1934986'), ('name', 'Nova Scotian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2344772'), ('name', 'Malayan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1049963'), ('name', 'Kiribati dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q275112'), ('name', 'Belize dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4406'), ('name', 'Tuvaluan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q210478'), ('name', 'Bermudian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q213005'), ('name', 'Guyanese dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q16080864'), ('name', 'Province of Canada dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q686163'), ('name', 'Confederate States dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q718954'), ('name', 'Old Taiwan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q202036'), ('name', 'Surinamese dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q202462'), ('name', 'Namibian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712664'), ('name', 'Grenadan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712666'), ('name', 'Saint Kitts dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712669'), ('name', 'Saint Lucia dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q206319'), ('name', 'Brunei dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2296365'), ('name', 'British North Borneo dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q726666'), ('name', 'Mongolian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712661'), ('name', 'Prince Edward Island dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208526'), ('name', 'New Taiwan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2328868'), ('name', 'Hawaiian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q190951'), ('name', 'Singapore dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4165057'), ('name', 'Niue dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4165058'), ('name', 'Pitcairn Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q507737'), ('name', 'Cook Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712668'), ('name', 'Saint Vincent dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q319885'), ('name', 'Cayman Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q194339'), ('name', 'Bahamian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1607372'), ('name', 'Kiautschou dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712671'), ('name', 'Tobagan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1647239'), ('name', 'Sumatran dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712660'), ('name', 'British Columbia dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712672'), ('name', 'Trinidadian dollar')]\n",
      "54\n"
     ]
    }
   ],
   "source": [
    "# find dollars\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name \n",
    "WHERE { \n",
    "    ?x wdt:P31 wd:Q8142.\n",
    "    #?country wdt:P38 ?x.\n",
    "    ?x sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"dollar\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "632a96e5-d38a-451b-9c1b-ab804d0801b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('y', 'http://www.wikidata.org/entity/Q14083'), ('n', 'dollar')]\n",
      "[('y', 'http://www.wikidata.org/entity/Q8142'), ('n', 'currency')]\n",
      "[('y', 'http://www.wikidata.org/entity/Q28795800'), ('n', 'decimal currency')]\n",
      "[('y', 'http://www.wikidata.org/entity/Q25530138'), ('n', 'yuan')]\n",
      "[('y', 'http://www.wikidata.org/entity/Q1643989'), ('n', 'legal tender')]\n",
      "[('y', 'http://www.wikidata.org/entity/Q756202'), ('n', 'reserve currency')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# find some dollar classes\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?y ?n \n",
    "WHERE { \n",
    "    ?x wdt:P31 wd:Q8142.\n",
    "    ?x wdt:P31 ?y.\n",
    "    ?x sc:name ?name.\n",
    "    FILTER(REGEX(?name,\"dollar\")).\n",
    "    ?y sc:name ?n.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "cf9836a9-948f-4b79-ab57-d1ac903a779c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q242890'), ('name', 'Trinidad and Tobago dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q942092'), ('name', 'British West Indies dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1104069'), ('name', 'Canadian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4597'), ('name', 'Solomon Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2411666'), ('name', 'Newfoundland dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q209792'), ('name', 'Jamaican dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q392858'), ('name', 'Rhodesian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q31015'), ('name', 'Hong Kong dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4592'), ('name', 'Fijian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4817670'), ('name', 'Coins and postage stamps of Sealand')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1323382'), ('name', 'New Brunswick dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q242988'), ('name', 'Liberian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q19831166'), ('name', 'Conch Dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q194351'), ('name', 'Barbadian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1934986'), ('name', 'Nova Scotian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2344772'), ('name', 'Malayan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1049963'), ('name', 'Kiribati dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q275112'), ('name', 'Belize dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4406'), ('name', 'Tuvaluan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q210478'), ('name', 'Bermudian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q182803'), ('name', 'Zimbabwean dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q213005'), ('name', 'Guyanese dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q16080864'), ('name', 'Province of Canada dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q686163'), ('name', 'Confederate States dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q718954'), ('name', 'Old Taiwan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q202036'), ('name', 'Surinamese dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q202462'), ('name', 'Namibian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q206319'), ('name', 'Brunei dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3712661'), ('name', 'Prince Edward Island dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208526'), ('name', 'New Taiwan dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2328868'), ('name', 'Hawaiian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q190951'), ('name', 'Singapore dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q507737'), ('name', 'Cook Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q319885'), ('name', 'Cayman Islands dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q194339'), ('name', 'Bahamian dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1607372'), ('name', 'Kiautschou dollar')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q65067684'), ('name', 'RTGS Dollar')]\n",
      "41\n"
     ]
    }
   ],
   "source": [
    "# list instances of dollar\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name \n",
    "WHERE { \n",
    "    ?x wdt:P31 wd:Q14083.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "112d153b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 1_1\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow1_1.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "obj = [{\"uri\":r[0][1],\"name\":r[1][1]} for r in x]\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"5\", evaluation.TYPE_SET ,\"uri\", obj)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47d97981-ced5-4812-a75f-4c4b405669b4",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "477c51d5-c12f-406a-acbc-688a33ba5ac4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro'), ('count', '25')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar'), ('count', '12')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q861690'), ('name', 'West African CFA franc'), ('count', '8')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar'), ('count', '6')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q847739'), ('name', 'Central African CFA franc'), ('count', '6')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199462'), ('name', 'Egyptian pound'), ('count', '4')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar'), ('count', '4')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25224'), ('name', 'pound sterling'), ('count', '3')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q181907'), ('name', 'South African rand'), ('count', '3')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25417'), ('name', 'Danish krone'), ('count', '3')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199471'), ('name', 'Afghan afghani'), ('count', '3')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar'), ('count', '3')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25344'), ('name', 'Swiss franc'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q130498'), ('name', 'Armenian dram'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8146'), ('name', 'Japanese yen'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q41044'), ('name', 'Russian ruble'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q206243'), ('name', 'birr'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191830'), ('name', 'dinar'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q172872'), ('name', 'Turkish lira'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q184172'), ('name', 'French franc'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191068'), ('name', 'Faroese króna'), ('count', '2')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q188608'), ('name', 'Iranian rial'), ('count', '2')]\n",
      "22\n"
     ]
    }
   ],
   "source": [
    "# find currencies used in more than one countries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name (COUNT(DISTINCT ?country) AS ?count)\n",
    "WHERE { \n",
    "    ?x wdt:P31 wd:Q8142.\n",
    "    ?country wdt:P38 ?x;\n",
    "        wdt:P31/wdt:P279* wd:Q6256.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "GROUP BY ?x ?name\n",
    "HAVING (COUNT(DISTINCT ?country)>1)\n",
    "ORDER BY DESC (?count)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3bfb2b70-b373-479a-a577-f6c0b304d6f4",
   "metadata": {},
   "source": [
    "## Task 7"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "9fb2104b-3158-4865-8210-db081a9d7dda",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q25224'), ('name', 'pound sterling'), ('count', '6106448730')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro'), ('count', '1613516682')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar'), ('count', '1553254316')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8146'), ('name', 'Japanese yen'), ('count', '954147390')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199462'), ('name', 'Egyptian pound'), ('count', '947988270')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q206243'), ('name', 'birr'), ('count', '629744628')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q861690'), ('name', 'West African CFA franc'), ('count', '599518780')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199471'), ('name', 'Afghan afghani'), ('count', '358234802')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q188608'), ('name', 'Iranian rial'), ('count', '319864920')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q181907'), ('name', 'South African rand'), ('count', '262024610')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q847739'), ('name', 'Central African CFA franc'), ('count', '240614272')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar'), ('count', '147961876')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25417'), ('name', 'Danish krone'), ('count', '94084876')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar'), ('count', '40974584')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191068'), ('name', 'Faroese króna'), ('count', '35690230')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25344'), ('name', 'Swiss franc'), ('count', '34015756')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar'), ('count', '4874934')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191830'), ('name', 'dinar')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "# from the first query I remember the property population P1082\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name (SUM(?maxP) AS ?count)\n",
    "WHERE { \n",
    "    ## sub query\n",
    "    {\n",
    "        SELECT ?country MAX(?population) AS ?maxP WHERE{\n",
    "            ?country wdt:P38 ?x;\n",
    "                wdt:P31/wdt:P279* wd:Q6256.\n",
    "            OPTIONAL{?country wdt:P1082 ?population.}\n",
    "        }\n",
    "        GROUP BY ?country\n",
    "    }\n",
    "    ?x wdt:P31 wd:Q8142.\n",
    "    ?country wdt:P38 ?x;\n",
    "        wdt:P31/wdt:P279* wd:Q6256.\n",
    "    OPTIONAL{\n",
    "        ?country wdt:P1082 ?population.\n",
    "        FILTER(?population = ?maxP).\n",
    "    }\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "GROUP BY ?x ?name\n",
    "HAVING (COUNT(DISTINCT ?country)>1)\n",
    "ORDER BY DESC (?count)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "96daa079-a2c2-4240-919a-0b66d40781cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q25224'), ('name', 'pound sterling'), ('count', '6106448730')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4916'), ('name', 'euro'), ('count', '1652751098')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4917'), ('name', 'United States dollar'), ('count', '1553365694')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199462'), ('name', 'Egyptian pound'), ('count', '973490270')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8146'), ('name', 'Japanese yen'), ('count', '954147390')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q172872'), ('name', 'Turkish lira'), ('count', '836770872')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q861690'), ('name', 'West African CFA franc'), ('count', '606963912')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q199471'), ('name', 'Afghan afghani'), ('count', '358234802')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q41044'), ('name', 'Russian ruble'), ('count', '293715808')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q181907'), ('name', 'South African rand'), ('count', '262024610')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q847739'), ('name', 'Central African CFA franc'), ('count', '244664546')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q259502'), ('name', 'Australian dollar'), ('count', '147961876')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25417'), ('name', 'Danish krone'), ('count', '94084876')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1472704'), ('name', 'New Zealand dollar'), ('count', '40974584')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q191068'), ('name', 'Faroese króna'), ('count', '35690230')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25344'), ('name', 'Swiss franc'), ('count', '34015756')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q130498'), ('name', 'Armenian dram'), ('count', '6154100')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26365'), ('name', 'Eastern Caribbean dollar'), ('count', '4874934')]\n",
      "18\n"
     ]
    }
   ],
   "source": [
    "# from the first query I remember the property population P1082\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name (SUM(?population) AS ?count)\n",
    "WHERE { \n",
    "    ?x wdt:P31 wd:Q8142.\n",
    "    ?country wdt:P38 ?x;\n",
    "        wdt:P31/wdt:P279* wd:Q6256;\n",
    "        wdt:P1082 ?population.\n",
    "    ?x sc:name ?name.\n",
    "}\n",
    "GROUP BY ?x ?name\n",
    "HAVING (COUNT(DISTINCT ?country)>1)\n",
    "ORDER BY DESC (?count)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "40278609-4941-4412-8e6b-49f572f86f97",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
