{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "import sys\n",
    "import os\n",
    "import json\n",
    "import pandas as pd\n",
    "sys.path.insert(1, '/locale/data/jupyter/prando/notebook/sparqlthesis/')\n",
    "import modules.evaluation as evaluation\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-sport3-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://gracevirtuoso.dei.unipd.it/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Sport Workflow Series (\"Association Football Players explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the association football players and find the main BGPs related to this sport. Compare players per countries, awards of the players and participation in the FIFA World Cup.\n",
    "\n",
    "**Important consideration: in wikidata, we are talking of ASSOCIATION FOOTBALL**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | profession    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q11571`| Cristiano Ronaldo       | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q11571 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Cristiano Ronaldo**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for association football player\n",
    "\n",
    "2. Identify the BGP for association football club\n",
    "\n",
    "3. Identify the BGP for association football league\n",
    "\n",
    "4. Return for each european country the number of association football leagues (the result set must be a list of triples country IRI, label and #leagues).\n",
    "\n",
    "5. Identify the BGP for the ballon d'Or award\n",
    "\n",
    "6. Return the countries which have at least two different players of their nationality (consider the country of citizenship) who won the ballon d'Or (the result set must be a list of triples country IRI, label and #different players).\n",
    "\n",
    "7. Identify the BGP of the FIFA World Cup\n",
    "\n",
    "8. Who are the players who partecipated in more than 4 world's cup editions? (the result set must be a list of triples player IRI, label and #participations).\n",
    "\n",
    "9. Consider the countries that won the FIFA World Cup at least twice. Find the players of those countries won the ballon d'Or (the result set must be a list of couples player IRI and label).\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "1d867695",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n"
     ]
    }
   ],
   "source": [
    "## startup the evaluation\n",
    "# setup the file and create the empty json\n",
    "ipname = \"s3.ipynb\"\n",
    "pt = os.getcwd()+os.sep+ipname\n",
    "evaluation.setup(pt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4be4a371-a6c0-4616-92b6-5fd6f8c1c24f",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 1 \n",
    "Identify the BGP for football player"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "06c2b5e5-bc7b-404a-8fc7-31d6ca118da5",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1005'), ('name', 'Portuguese National Library ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1006'), ('name', 'Nationale Thesaurus voor Auteurs ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1015'), ('name', 'NORAF ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1038'), ('name', 'relative')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1050'), ('name', 'medical condition')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P118'), ('name', 'league')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1263'), ('name', 'NNDB people ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1266'), ('name', 'AlloCiné person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1273'), ('name', 'CANTIC ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1280'), ('name', 'CONOR.SI ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1284'), ('name', 'Munzinger person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1285'), ('name', 'Munzinger Sport number')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1296'), ('name', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1350'), ('name', 'number of matches played/races/starts')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1399'), ('name', 'convicted of')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1417'), ('name', 'Encyclopædia Britannica Online ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1447'), ('name', 'Sports-Reference.com Olympic athlete ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1469'), ('name', 'FIFA player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1618'), ('name', 'sport number')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1695'), ('name', 'NLP ID (unique)')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1741'), ('name', 'GTAA ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P1971'), ('name', 'number of children')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2002'), ('name', 'Twitter username')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2003'), ('name', 'Instagram username')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2020'), ('name', 'WorldFootball.net player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2031'), ('name', 'work period (start)')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2048'), ('name', 'height')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2067'), ('name', 'mass')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P213'), ('name', 'ISNI')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2163'), ('name', 'FAST ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2193'), ('name', 'Soccerbase player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2276'), ('name', 'UEFA player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2446'), ('name', 'Transfermarkt player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2574'), ('name', 'National-Football-Teams.com player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2600'), ('name', 'Geni.com profile ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2605'), ('name', 'ČSFD person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3043'), ('name', 'Scoresway soccer person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3047'), ('name', 'PlaymakerStats.com player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3221'), ('name', 'New York Times topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3222'), ('name', 'NE.se ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3365'), ('name', 'Treccani ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3388'), ('name', 'LittleSis people ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3427'), ('name', 'AS.com athlete ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P349'), ('name', 'National Diet Library ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3509'), ('name', 'Dagens Nyheter topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3537'), ('name', 'FootballDatabase.eu player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3553'), ('name', 'Zhihu topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3630'), ('name', 'Babelio author ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3655'), ('name', 'BDFutbol player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3665'), ('name', \"L'Équipe football player ID\")]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3681'), ('name', 'ESPNFC.com player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3726'), ('name', 'EU-Football.info player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P413'), ('name', 'position played on team / speciality')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P4342'), ('name', 'Store norske leksikon ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P4985'), ('name', 'TMDb person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5019'), ('name', 'Brockhaus Enzyklopädie online ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5034'), ('name', 'National Library of Korea ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5247'), ('name', 'Giant Bomb ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5284'), ('name', 'Douban movie celebrity ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5361'), ('name', 'BNB person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5421'), ('name', 'Trading Card Database person ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5587'), ('name', 'Libris-URI')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5617'), ('name', 'Evene ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5740'), ('name', 'So Foot ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P5750'), ('name', 'FBref.com player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6058'), ('name', 'Larousse ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6188'), ('name', 'BDFA player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6327'), ('name', 'Goodreads character ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6509'), ('name', 'total goals in career')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6517'), ('name', 'WhoSampled artist ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6573'), ('name', 'Klexikon article ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6615'), ('name', 'Kicker.de player ID (former scheme)')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6849'), ('name', 'DR topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P6868'), ('name', 'Hoopla artist ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7293'), ('name', 'PLWABN ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P742'), ('name', 'pseudonym')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7666'), ('name', 'Visuotinė lietuvių enciklopedija ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7827'), ('name', 'Spanish Vikidia ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8286'), ('name', 'Olympedia people ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8349'), ('name', 'Proleksis enciklopedija ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8672'), ('name', 'Twitter topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8687'), ('name', 'social media followers')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8912'), ('name', 'Kicker.de player ID (actual scheme)')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P898'), ('name', 'IPA transcription')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P906'), ('name', 'SELIBR ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P9368'), ('name', 'CNA topic ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P949'), ('name', 'National Library of Israel ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P950'), ('name', 'Biblioteca Nacional de España ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P9743'), ('name', 'Podchaser creator ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P9807'), ('name', 'SNK ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P2458'), ('name', 'Mackolik.com player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3579'), ('name', 'Sina Weibo user ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8780'), ('name', 'Portuguese Football Federation ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P3046'), ('name', 'ForaDeJogo player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P7036'), ('name', 'TuttoCalciatori.net player ID')]\n",
      "[('pr', 'http://www.wikidata.org/prop/direct/P8006'), ('name', 'footedness')]\n",
      "143\n"
     ]
    }
   ],
   "source": [
    "# starting from Cristiano Ronaldo I look at his properties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?pr ?name\n",
    "WHERE { \n",
    "    wd:Q11571 ?pr ?obj.\n",
    "    ?pr <http://schema.org/name> ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "dc3656bb-057e-4135-9c94-7472f564cb52",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q937857'), ('name', 'association football player')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# starting from Cristiano Ronaldo I look at his occupations\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "    wd:Q11571 wdt:P106 ?obj.\n",
    "    ?obj <http://schema.org/name> ?name .\n",
    "} \n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "712a58b2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 1 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q937857\"\n",
    "og_name = \"association football player\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"1\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6a19292f-ec50-4a61-8150-d7d397ad1b38",
   "metadata": {},
   "source": [
    "`wd:Q937857` is the node of the association football player in wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2e596872-c846-4324-bba4-fbf18b4862a3",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 2\n",
    "Identify the BGP for football club"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "a407cae6-7ffd-4070-95b0-e44806d9198a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('team', 'http://www.wikidata.org/entity/Q3590758'), ('name', 'Portugal Olympic football team')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1422'), ('name', 'Juventus F.C.')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q18656'), ('name', 'Manchester United F.C.')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q8682'), ('name', 'Real Madrid CF')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1630430'), ('name', 'Portugal national under-21 football team')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q267245'), ('name', 'Portugal national association football team')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q75729'), ('name', 'Sporting CP')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q1772776'), ('name', 'Portugal national under-20 football team')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q3590754'), ('name', 'Portugal national under-17 football team')]\n",
      "[('team', 'http://www.wikidata.org/entity/Q21079208'), ('name', 'Portugal national under-15 football team')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# in the first query I found P54 that is member of sports team. Use it and explore\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?team ?name\n",
    "WHERE { \n",
    "    wd:Q11571 wdt:P54 ?team .\n",
    "    ?team <http://schema.org/name> ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x= run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "920a7953-a658-4eb1-ae23-83e1b1cb5dd6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q23759293'), ('name', 'national Olympic football team')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15944511'), ('name', 'association football team')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q476028'), ('name', 'association football club')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q4830453'), ('name', 'business')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q891723'), ('name', 'public company')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q6979593'), ('name', 'national association football team')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q847017'), ('name', 'sports club')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q23847779'), ('name', 'national under-23 association football team')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q23904673'), ('name', 'national under-15 association football team')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# look for the istance of the results found above\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "    wd:Q11571 wdt:P54 ?team .\n",
    "    ?team wdt:P31 ?inst.  \n",
    "    ?inst <http://schema.org/name> ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x= run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d8a136f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 2 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q476028\"\n",
    "og_name = \"association football club\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"2\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0c52bdff-0bf0-4db0-adb3-e1a4a2190c19",
   "metadata": {},
   "source": [
    "`wd:Q476028` is the node of the association football club in wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8b06e178-c189-4043-ae8b-0b8d5b0947fb",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 3 \n",
    "Identify the BGP for football league"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "b6bb90d6-e900-4920-8789-e4309a0d8ce5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1015'), ('pName', 'NORAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P112'), ('pName', 'founded by')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P115'), ('pName', 'home venue')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P118'), ('pName', 'league')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1273'), ('pName', 'CANTIC ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('pName', 'Gran Enciclopèdia Catalana ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pName', 'described by source')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1411'), ('pName', 'nominated for')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('pName', 'Encyclopædia Britannica Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1424'), ('pName', \"topic's main template\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P159'), ('pName', 'headquarters location')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P166'), ('pName', 'award received')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pName', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pName', 'image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pName', 'owner of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2002'), ('pName', 'Twitter username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2003'), ('pName', 'Instagram username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2013'), ('pName', 'Facebook ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2124'), ('pName', 'member count')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P213'), ('pName', 'ISNI')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('pName', 'VIAF ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('pName', 'GND ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2388'), ('pName', 'office held by head of the organization')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('pName', 'Library of Congress authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2522'), ('pName', 'victory')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2581'), ('pName', 'BabelNet ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('pName', 'Bibliothèque nationale de France ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('pName', 'IdRef ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P286'), ('pName', 'head coach')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('pName', 'Great Russian Encyclopedia Online ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pName', 'instance of')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('pName', 'Quora topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('pName', 'National Diet Library ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3509'), ('pName', 'Dagens Nyheter topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3553'), ('pName', 'Zhihu topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('pName', 'Commons category')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3984'), ('pName', 'subreddit')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4342'), ('pName', 'Store norske leksikon ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P465'), ('pName', 'sRGB color hex triplet')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P488'), ('pName', 'chairperson')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5247'), ('pName', 'Giant Bomb ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('pName', 'inception')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5995'), ('pName', 'kit supplier')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6112'), ('pName', 'category for members of a team')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6131'), ('pName', 'Soccerway team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6364'), ('pName', 'official color(s)')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P641'), ('pName', 'sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('pName', 'Freebase ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('pName', 'NKCR AUT ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7085'), ('pName', 'TikTok username')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7212'), ('pName', 'LyricsTranslate ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7223'), ('pName', 'Transfermarkt team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7280'), ('pName', 'PlaymakerStats.com team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7287'), ('pName', 'WorldFootball.net team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7488'), ('pName', 'BDFutbol team ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('pName', 'French Vikidia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7854'), ('pName', 'EU-Football.info club ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('pName', 'WorldCat Identities ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('pName', 'KBpedia ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('pName', 'official website')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P859'), ('pName', 'sponsor')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8642'), ('pName', 'FBref.com squad ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8672'), ('pName', 'Twitter topic ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pName', \"topic's main category\")]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P9322'), ('pName', 'SVKKL authority ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P94'), ('pName', 'coat of arms image')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P949'), ('pName', 'National Library of Israel ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P950'), ('pName', 'Biblioteca Nacional de España ID')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3828'), ('pName', 'wears')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7351'), ('pName', 'FootballDatabase.eu team ID')]\n",
      "70\n"
     ]
    }
   ],
   "source": [
    "# In the query above I found Real Madrid, wd:Q8682 look at its properties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pName\n",
    "WHERE { \n",
    "\n",
    "wd:Q8682 ?p ?obj.\n",
    "\n",
    "?p <http://schema.org/name> ?pName .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "69f31301-fb22-43ae-a990-d9e508d2207d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('league', 'http://www.wikidata.org/entity/Q324867'), ('name', 'La Liga')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Found property league (wdt:P118). Let's see the result\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?league ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q8682 wdt:P118 ?league.\n",
    "\n",
    "?league <http://schema.org/name> ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "3d55616d-e26a-4bb7-9f78-0b0fbdd5fd14",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15991290'), ('name', 'professional sports league')]\n",
      "[('inst', 'http://www.wikidata.org/entity/Q15991303'), ('name', 'association football league')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# Real Madrid plays in La Liga. Find the instance.\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?inst ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q8682 wdt:P118 ?league.\n",
    "?league wdt:P31 ?inst.\n",
    "\n",
    "?inst <http://schema.org/name> ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d00108d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 3 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q15991303\"\n",
    "og_name = \"association football league\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"3\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5120159-d1c8-4fc6-bf09-f05a2881dd74",
   "metadata": {},
   "source": [
    "`wd:Q15991303` is the node of the association football league in wikidata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25bd0dfa-f0c1-4d31-9c83-4672b40c4b7b",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 4\n",
    "Find how many association football leagues each country have in Europe"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2355381-9adb-4440-a465-191c6de59e5b",
   "metadata": {},
   "source": [
    "First of all we have to identify countries of Europe. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "986900bc-46c0-4d80-9791-7322ca908c98",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('nation', 'http://www.wikidata.org/entity/Q13417403'), ('name', '.الجزائر')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q889'), ('name', 'Afghanistan')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q170366'), ('name', 'Ahwaz')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q137014'), ('name', 'AlSaudiah')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q222'), ('name', 'Albania')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q1242155'), ('name', 'Albanians in Kosovo')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q262'), ('name', 'Algeria')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q218272'), ('name', 'Algeria')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q2415901'), ('name', 'Allied-occupied Germany')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q16641'), ('name', 'American Samoa')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q916'), ('name', 'Angola')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q25228'), ('name', 'Anguilla')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q781'), ('name', 'Antigua and Barbuda')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q414'), ('name', 'Argentina')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q399'), ('name', 'Armenia')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q132856'), ('name', 'Armenian Soviet Socialist Republic')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q21203'), ('name', 'Aruba')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q408'), ('name', 'Australia')]\n",
      "[('nation', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# bind the football player and look at his nationality\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?nation ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        wdt:P27 ?nation.\n",
    "\n",
    "?nation sc:name ?name .\n",
    "}\n",
    "ORDER BY (?name)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "1fca6ffc-c9af-46f3-b788-228d03b2363a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q1489259'), ('name', 'superpower')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1323642'), ('name', 'transcontinental country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q99541706'), ('name', 'historical unrecognized state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q112099'), ('name', 'island nation')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q123480'), ('name', 'landlocked country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1520223'), ('name', 'constitutional republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q179164'), ('name', 'unitary state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q20181813'), ('name', 'colonial power')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3024240'), ('name', 'historical country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3624078'), ('name', 'sovereign state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q41614'), ('name', 'constitutional monarchy')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4209223'), ('name', 'Rechtsstaat')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q43702'), ('name', 'federation')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q512187'), ('name', 'federal republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q515'), ('name', 'city')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q51576574'), ('name', 'Mediterranean country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5255892'), ('name', 'democratic republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q619610'), ('name', 'social state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q6256'), ('name', 'country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q6266'), ('name', 'nation')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q63791824'), ('name', 'country bordering the Baltic Sea')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q7270'), ('name', 'republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q859563'), ('name', 'secular state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q417175'), ('name', 'kingdom')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q779415'), ('name', 'special administrative region of China')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q13107770'), ('name', 'archipelagic state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q202686'), ('name', 'Commonwealth realm')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q672729'), ('name', 'Islamic republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3275668'), ('name', 'national power')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q118365'), ('name', 'dictatorship of the proletariat')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2301091'), ('name', 'socialism with Chinese characteristics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q465613'), ('name', \"people's republic\")]\n",
      "[('x', 'http://www.wikidata.org/entity/Q842112'), ('name', 'socialist state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q7275'), ('name', 'state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q339834'), ('name', 'regional power')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q66724388'), ('name', 'autonomous country within the Kingdom of Denmark')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q49892'), ('name', 'presidential régime')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1951661'), ('name', 'member states of the Association of Southeast Asian Nations')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q223832'), ('name', 'dominion of the British Empire')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1549591'), ('name', 'big city')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1637706'), ('name', 'million city')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2221906'), ('name', 'geographic location')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2264924'), ('name', 'port settlement')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4198907'), ('name', 'parliamentary republic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5119'), ('name', 'capital')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q902814'), ('name', 'border town')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q133156'), ('name', 'colony')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q133442'), ('name', 'city-state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q918240'), ('name', 'territorial evolution of the British Empire')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1309121'), ('name', 'hermit kingdom')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q12759805'), ('name', 'sultanate')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q192611'), ('name', 'electoral district')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15634554'), ('name', 'state with limited recognition')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1048835'), ('name', 'political territorial entity')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1352230'), ('name', 'territory of the United States')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q41710'), ('name', 'ethnic group')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q462778'), ('name', 'insular area')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q783733'), ('name', 'unincorporated territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q82794'), ('name', 'geographic region')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q849866'), ('name', 'communist state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3244203'), ('name', 'monarchy of Antigua and Barbuda')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q23442'), ('name', 'island')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q33837'), ('name', 'archipelago')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1088391'), ('name', 'rump state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3336843'), ('name', 'nation within the UK')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q56061'), ('name', 'administrative territorial entity')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1402592'), ('name', 'island group')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q46395'), ('name', 'British Overseas Territories')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q189898'), ('name', 'emirate')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q11424'), ('name', 'film')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q11514315'), ('name', 'historical period')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q843214'), ('name', 'internationalized country code top-level domain')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3502482'), ('name', 'cultural region')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q7252696'), ('name', 'Provincial deputation in Spanish America')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q171441'), ('name', 'enclave')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3032103'), ('name', 'districts of Colombia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2555896'), ('name', 'municipality of Colombia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1250464'), ('name', 'realm')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1530705'), ('name', 'village development committee of Nepal')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q164142'), ('name', 'protectorate')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q19953632'), ('name', 'former administrative territorial entity')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q231002'), ('name', 'nationality')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1840161'), ('name', 'commune of Chile')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q25412763'), ('name', 'city in Chile')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q164950'), ('name', 'dynasty')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q17524420'), ('name', 'aspect of history')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q719487'), ('name', 'French overseas collectivity')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q325261'), ('name', 'satellite state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1620908'), ('name', 'historical region')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q2577883'), ('name', 'occupied territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5284036'), ('name', 'divided region')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q10864048'), ('name', 'first-level administrative country subdivision')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208500'), ('name', 'principality')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15239622'), ('name', 'disputed territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15304003'), ('name', 'country of the Kingdom of the Netherlands')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q42138'), ('name', 'citizenship')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q214339'), ('name', 'role')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1138279'), ('name', 'associated state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5164076'), ('name', 'constituent state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3455524'), ('name', 'administrative region')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q161243'), ('name', 'dependent territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q173387'), ('name', 'grave')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q532'), ('name', 'village')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q839954'), ('name', 'archaeological site')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q47488809'), ('name', 'country for sports')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3957'), ('name', 'town')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1115575'), ('name', 'civil parish')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1351282'), ('name', 'crown colony')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15379753'), ('name', 'British Dependent Territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3305213'), ('name', 'painting')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q11879590'), ('name', 'female given name')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q4167410'), ('name', 'Wikimedia disambiguation page')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q12959600'), ('name', 'Constituent republics and provinces of Yugoslavia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5770918'), ('name', 'city of Argentina')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3257686'), ('name', 'locality')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q34049'), ('name', 'Semitic')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q436240'), ('name', 'ancient language')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q45762'), ('name', 'dead language')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q6979593'), ('name', 'national association football team')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1145276'), ('name', 'fictional country')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q56557504'), ('name', 'city of Iran')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q50330360'), ('name', 'second largest city')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q501094'), ('name', 'state of Venezuela')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q33829'), ('name', 'human population')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q59281'), ('name', 'provisional government')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q327333'), ('name', 'government agency')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q13442814'), ('name', 'scholarly article')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q844911'), ('name', 'superior planet')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1093829'), ('name', 'city of the United States')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q115291'), ('name', 'province of Cuba')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1288568'), ('name', 'modern language')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q33742'), ('name', 'natural language')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q34770'), ('name', 'language')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q107390'), ('name', 'federated state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1151405'), ('name', 'client state')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q26934845'), ('name', 'integral overseas territory')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3648563'), ('name', 'public body of the Netherlands')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q843752'), ('name', 'administrative territorial entity of Bosnia and Herzegovina')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q236036'), ('name', 'republic of the Soviet Union')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q15284'), ('name', 'municipality')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q200250'), ('name', 'metropolis')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q208511'), ('name', 'global city')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q3409032'), ('name', 'unisex given name')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q48349'), ('name', 'empire')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1211369'), ('name', 'the empire on which the sun never sets')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q33384'), ('name', 'dialect')]\n",
      "146\n"
     ]
    }
   ],
   "source": [
    "# look at properties of the nationalities\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        wdt:P27 ?nation.\n",
    "?nation wdt:P31 ?x.\n",
    "\n",
    "?x sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "98e8d6d2-1d4d-4105-9817-6f6f86a76240",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P30'), ('name', 'continent')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# Q6256 is the class of countries\n",
    "# look at properties to find the properties continent\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?nation wdt:P31 wd:Q6256;\n",
    "        ?prop ?x.\n",
    "\n",
    "?prop sc:name ?name .\n",
    "FILTER(REGEX(?name,\"ontin\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "250bb1ed-4ed1-47c4-a3bf-7f81e6532260",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q15'), ('name', 'Africa')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q18'), ('name', 'South America')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q46'), ('name', 'Europe')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q48'), ('name', 'Asia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q49'), ('name', 'North America')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q538'), ('name', 'Insular Oceania')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q5401'), ('name', 'Eurasia')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q27611'), ('name', 'Central America')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# Q6256 is the class of countries\n",
    "# P30 is the properties continent: list them and find Europe\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "\n",
    "?nation wdt:P31 wd:Q6256;\n",
    "        wdt:P30 ?x.\n",
    "\n",
    "?x sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "92d4a43a-6974-422f-a1cc-62c79ad6d5cd",
   "metadata": {},
   "source": [
    "`wd:Q46` is the Europe node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "af78cbd1-4239-4d3e-a31f-aae4c2a2ccc5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2541'), ('name', 'operating area')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# look at properties of intances of football league to find something related with countries\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "?league wdt:P31 wd:Q15991303;\n",
    "        ?prop ?country.\n",
    "?country wdt:P31 wd:Q6256.\n",
    "\n",
    "?prop sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "aaca9f63-63fc-42ec-b0e0-aed43e020470",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q222'), ('name', 'Albania'), ('leagues', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q228'), ('name', 'Andorra'), ('leagues', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q40'), ('name', 'Austria'), ('leagues', '12')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q184'), ('name', 'Belarus'), ('leagues', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q219'), ('name', 'Bulgaria'), ('leagues', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q224'), ('name', 'Croatia'), ('leagues', '5')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q229'), ('name', 'Cyprus'), ('leagues', '13')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic'), ('leagues', '199')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('name', 'Denmark'), ('leagues', '8')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q33'), ('name', 'Finland'), ('leagues', '14')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('leagues', '12')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q41'), ('name', 'Greece'), ('leagues', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q28'), ('name', 'Hungary'), ('leagues', '5')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q27'), ('name', 'Ireland'), ('leagues', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy'), ('leagues', '16')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q232'), ('name', 'Kazakhstan'), ('leagues', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q211'), ('name', 'Latvia'), ('leagues', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q347'), ('name', 'Liechtenstein'), ('leagues', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q233'), ('name', 'Malta'), ('leagues', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q236'), ('name', 'Montenegro'), ('leagues', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q55'), ('name', 'Netherlands'), ('leagues', '22')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q20'), ('name', 'Norway'), ('leagues', '72')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q36'), ('name', 'Poland'), ('leagues', '15')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal'), ('leagues', '6')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q218'), ('name', 'Romania'), ('leagues', '62')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q214'), ('name', 'Slovakia'), ('leagues', '5')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('name', 'Sweden'), ('leagues', '9')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q39'), ('name', 'Switzerland'), ('leagues', '7')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q43'), ('name', 'Turkey'), ('leagues', '6')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom'), ('leagues', '91')]\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# using all the informations found above I can find how many leagues each country have\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?country ?name COUNT(DISTINCT ?league) AS ?leagues\n",
    "WHERE { \n",
    "#leagues\n",
    "?league wdt:P31 wd:Q15991303;\n",
    "        wdt:P17 ?country.\n",
    "# europe countries\n",
    "?country wdt:P31 wd:Q6256;\n",
    "        wdt:P30 wd:Q46.\n",
    "\n",
    "?country sc:name ?name .\n",
    "}\n",
    "GROUP BY ?country ?name\n",
    "ORDER BY ?name\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7f74e7e7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    leagues = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= leagues\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"4\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db8b76d6-9094-45f7-8fba-9feb5ce2ad81",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 5\n",
    "Find BGP for the ballon d'Or award"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "f00040a8-414b-4319-9f90-dcada7b6ff64",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P118'), ('name', 'league')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P413'), ('name', 'position played on team / speciality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P509'), ('name', 'cause of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6087'), ('name', 'coach of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6553'), ('name', 'personal pronoun')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1950'), ('name', 'second family name in Spanish name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2416'), ('name', 'sports discipline competed in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6978'), ('name', 'Scandinavian middle family name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P552'), ('name', 'handedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P937'), ('name', 'work location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P91'), ('name', 'sexual orientation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1884'), ('name', 'hair color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P241'), ('name', 'military branch')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P410'), ('name', 'military rank')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1830'), ('name', 'owner of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P102'), ('name', 'member of political party')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5056'), ('name', 'patronym or matronym for this person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1038'), ('name', 'relative')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1442'), ('name', 'image of grave')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1340'), ('name', 'eye color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P184'), ('name', 'doctoral advisor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P185'), ('name', 'doctoral student')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3602'), ('name', 'candidacy in election')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9139'), ('name', 'first family name in Portuguese name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8017'), ('name', 'generational suffix')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1050'), ('name', 'medical condition')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2868'), ('name', 'subject has role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P412'), ('name', 'voice type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P647'), ('name', 'drafted by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6886'), ('name', 'writing language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1399'), ('name', 'convicted of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6758'), ('name', 'supported sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5389'), ('name', 'permanent resident of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P358'), ('name', 'discography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1347'), ('name', 'military casualty classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P512'), ('name', 'academic degree')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P945'), ('name', 'allegiance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P53'), ('name', 'family')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7084'), ('name', 'related category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P10'), ('name', 'video')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1853'), ('name', 'blood type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1875'), ('name', 'represented by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1576'), ('name', 'lifestyle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2632'), ('name', 'place of detention')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6275'), ('name', 'copyright representative')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1327'), ('name', 'partner in business or sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1801'), ('name', 'commemorative plaque image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P423'), ('name', 'shooting handedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P990'), ('name', \"audio recording of the subject's spoken voice\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P741'), ('name', 'playing hand')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6802'), ('name', 'related image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2962'), ('name', 'title of chess person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1026'), ('name', 'academic thesis')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1142'), ('name', 'political ideology')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1416'), ('name', 'affiliation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P286'), ('name', 'head coach')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1000'), ('name', 'record held')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2522'), ('name', 'victory')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P511'), ('name', 'honorific prefix')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2545'), ('name', 'bowling style')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P248'), ('name', 'stated in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8006'), ('name', 'footedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1593'), ('name', 'defender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1065'), ('name', 'archive URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P97'), ('name', 'noble title')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P66'), ('name', 'ancestral home')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P127'), ('name', 'owned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1454'), ('name', 'legal form')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P740'), ('name', 'location of formation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P749'), ('name', 'parent organization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1766'), ('name', 'place name sign')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P803'), ('name', 'professorship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1268'), ('name', 'represents')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6291'), ('name', 'advertises')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2541'), ('name', 'operating area')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P94'), ('name', 'coat of arms image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P112'), ('name', 'founded by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2789'), ('name', 'connects with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P811'), ('name', 'academic minor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7779'), ('name', 'member of military unit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9493'), ('name', 'artist files at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5800'), ('name', 'narrative role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8839'), ('name', 'hairstyle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P115'), ('name', 'home venue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P831'), ('name', 'parent club')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4913'), ('name', 'dialect of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1652'), ('name', 'referee')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6872'), ('name', 'has written for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1455'), ('name', 'list of works')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3150'), ('name', 'birthday')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1321'), ('name', 'place of origin (Switzerland)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3448'), ('name', 'stepparent')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P450'), ('name', 'astronaut mission')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1080'), ('name', 'from narrative universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P488'), ('name', 'chairperson')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7937'), ('name', 'form of creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1596'), ('name', 'penalty')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1415'), ('name', 'Oxford Dictionary of National Biography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1754'), ('name', 'category related to list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P360'), ('name', 'is a list of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3919'), ('name', 'contributed to creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3828'), ('name', 'wears')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7047'), ('name', 'enemy of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9071'), ('name', 'character type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2546'), ('name', 'sidekick of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2650'), ('name', 'interested in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1595'), ('name', 'charge')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P553'), ('name', 'website account on')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6500'), ('name', 'non-free artwork image URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1037'), ('name', 'director / manager')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5715'), ('name', 'Academia.edu profile URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P708'), ('name', 'diocese')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2699'), ('name', 'URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P611'), ('name', 'religious order')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2318'), ('name', 'debut participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P968'), ('name', 'email address')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1387'), ('name', 'political alignment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P520'), ('name', 'armament')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P629'), ('name', 'edition or translation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1581'), ('name', 'official blog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8852'), ('name', 'facial hair')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3320'), ('name', 'board member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4765'), ('name', 'Commons compatible image available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P812'), ('name', 'academic major')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7014'), ('name', 'terms of service URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P158'), ('name', 'seal image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1363'), ('name', 'points/goal scored by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P531'), ('name', 'diplomatic mission sent')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4656'), ('name', 'Wikimedia import URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1449'), ('name', 'nickname')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8413'), ('name', 'academic appointment')]\n",
      "225\n"
     ]
    }
   ],
   "source": [
    "# football players properties\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        ?prop ?obj.\n",
    "FILTER(!isLiteral(?obj)).\n",
    "?prop sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "f7181075-79b5-438d-830f-7f5dc8a50132",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1998642'), ('name', 'Belgian professional football awards')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1478322'), ('name', 'Footballer of the month')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q311830'), ('name', 'Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1323117'), ('name', 'English Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4835326'), ('name', 'BC Sports Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11901935'), ('name', \"Finnish FA's Women's Footballer of the Year\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q17355204'), ('name', 'World Cup Golden Ball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q166177'), ('name', \"Ballon d'Or\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q373232'), ('name', 'UEFA Club Football Awards')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1187699'), ('name', 'UEFA Club Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1478325'), ('name', 'Female football player of the year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q570775'), ('name', 'Football Manager of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q259724'), ('name', 'South American Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q44724678'), ('name', 'Italian Football Hall of Fame - Italian manager')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1571341'), ('name', 'Hall of Fame des deutschen Sports')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q11854915'), ('name', 'Captain’s Ball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5475811'), ('name', 'Hall of Fame of Finnish football')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q387787'), ('name', 'African Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18128982'), ('name', 'Ontario Sports Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q223277'), ('name', 'CNID Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q5465844'), ('name', 'Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q39692'), ('name', 'Dutch Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q786180'), ('name', 'Croatian Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28147490'), ('name', 'Idrettsgallaens hederspris')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q52454'), ('name', 'International Tennis Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1847685'), ('name', 'Italian Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q102314683'), ('name', 'The Best FIFA Football Awards 2020')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1330014'), ('name', \"Canada's Sports Hall of Fame\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q40561301'), ('name', 'GAA GPA Gaelic Football All Star')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6051714'), ('name', 'International Latin Music Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q18388574'), ('name', 'Latin Songwriters Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2291862'), ('name', \"FIFA Ballon d'Or\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q645468'), ('name', 'Footballer of the Year of Argentina')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1750244'), ('name', 'FWA Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4689965'), ('name', 'African Women Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q795534'), ('name', 'BBC African Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1475378'), ('name', 'Liechtensteiner Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2515075'), ('name', 'Vereinigung der Vertragsfussballspieler')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q64335'), ('name', 'Slovenian Hockey Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q58818'), ('name', 'IIHF Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1645316'), ('name', 'Mall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q59411480'), ('name', \"Ballon d'Or Féminin\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q24298904'), ('name', \"BBC Women's Footballer of the Year\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3517653'), ('name', 'Canadian Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q28803810'), ('name', 'Hall of Fame of the Plzeň Region')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q573142'), ('name', 'Romanian Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2288534'), ('name', \"Ballon d'Or 1960\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q778412'), ('name', 'Pro Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7541796'), ('name', 'Slovenian Athletes Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4434048'), ('name', 'Belgian Youth Football Player of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q786219'), ('name', 'Latvian Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q14524649'), ('name', 'Adidas Golden Ball')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q103843004'), ('name', \"Finnish Sports Journalists' Footballer of the Year\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q10891649'), ('name', \"Finnish FA's Men's Footballer of the Year\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q80650331'), ('name', 'The Guardian Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2292330'), ('name', \"Ballon d'Or 1963\")]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q62596820'), ('name', 'Canadian Lacrosse Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q786176'), ('name', 'Bulgarian Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1315609'), ('name', 'Trophées UNFP du football')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q139661'), ('name', 'Czech Ice Hockey Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q62566529'), ('name', 'Kladno Hockey Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2543976'), ('name', 'SFWA Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q844499'), ('name', 'Scottish Football Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4729679'), ('name', 'All Stars Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1032340'), ('name', 'Canada Soccer Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q1136687'), ('name', 'Hockey Hall of Fame')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3779733'), ('name', 'Norwegian Football Association Gold Watch')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q7879960'), ('name', 'Ulster Footballer of the Year')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q2069058'), ('name', 'Swiss Footballer of the Year')]\n",
      "69\n"
     ]
    }
   ],
   "source": [
    "# see the object of the properties awards received\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        wdt:P166 ?obj.\n",
    "?obj sc:name ?name .\n",
    "FILTER(REGEX(?name,\"all\")).\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "709c376d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 3 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q166177\"\n",
    "og_name = \"Ballon d'Or\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"5\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85e73b54-3c72-4c0b-a222-915996aae193",
   "metadata": {},
   "source": [
    "`wd:Q166177` is the Ballon d'Or"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d4575f0e-aa58-423a-97cd-df8de574c2f0",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 6\n",
    "Find the countries who have at least two players of their nationality who won a ballon d'Or"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "c8e9a12a-0d5a-44da-9f95-3dc4f78f87f0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('name', 'United Kingdom'), ('won', '6')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('name', 'Italy'), ('won', '6')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('name', 'Germany'), ('won', '5')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('name', 'Spain'), ('won', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q155'), ('name', 'Brazil'), ('won', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('name', 'France'), ('won', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q212'), ('name', 'Ukraine'), ('won', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q45'), ('name', 'Portugal'), ('won', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q414'), ('name', 'Argentina'), ('won', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q15180'), ('name', 'Soviet Union'), ('won', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29999'), ('name', 'Kingdom of the Netherlands'), ('won', '3')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q213'), ('name', 'Czech Republic'), ('won', '2')]\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "# find countries with more players who won the ballon d'Or\n",
    "queryString = \"\"\"\n",
    "SELECT ?country ?name count(*) AS ?won\n",
    "WHERE { \n",
    "\n",
    "?people wdt:P27 ?country;\n",
    "        wdt:P106 wd:Q937857;\n",
    "        wdt:P166 wd:Q166177.\n",
    "\n",
    "?country sc:name ?name\n",
    "}\n",
    "GROUP BY ?country ?name\n",
    "HAVING (count(*) > 1)\n",
    "ORDER BY DESC (?won)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b3a332fb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    victories = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= victories\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"6\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bab5028f-acc9-43a3-bb27-576ef4b6b0f4",
   "metadata": {
    "jp-MarkdownHeadingCollapsed": true,
    "tags": []
   },
   "source": [
    "## Task 7\n",
    "Identify the BGP of the FIFA World Cup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "d5866674-c12b-4109-a5d6-14eb5b81c2e0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P103'), ('name', 'native language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P106'), ('name', 'occupation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P108'), ('name', 'employer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P118'), ('name', 'league')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1343'), ('name', 'described by source')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1344'), ('name', 'participant in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P140'), ('name', 'religion')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1412'), ('name', 'languages spoken, written or signed')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P166'), ('name', 'award received')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1889'), ('name', 'different from')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P19'), ('name', 'place of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P20'), ('name', 'place of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P21'), ('name', 'sex or gender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P22'), ('name', 'father')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P26'), ('name', 'spouse')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P27'), ('name', 'country of citizenship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3373'), ('name', 'sibling')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P413'), ('name', 'position played on team / speciality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P451'), ('name', 'unmarried partner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P463'), ('name', 'member of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P509'), ('name', 'cause of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P54'), ('name', 'member of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P551'), ('name', 'residence')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P570'), ('name', 'date of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6087'), ('name', 'coach of sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P69'), ('name', 'educated at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P734'), ('name', 'family name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P735'), ('name', 'given name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1196'), ('name', 'manner of death')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P172'), ('name', 'ethnic group')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P40'), ('name', 'child')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6553'), ('name', 'personal pronoun')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1950'), ('name', 'second family name in Spanish name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P973'), ('name', 'described at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2416'), ('name', 'sports discipline competed in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6978'), ('name', 'Scandinavian middle family name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P119'), ('name', 'place of burial')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P109'), ('name', 'signature')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1303'), ('name', 'instrument')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P25'), ('name', 'mother')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P552'), ('name', 'handedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P937'), ('name', 'work location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P91'), ('name', 'sexual orientation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P101'), ('name', 'field of work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1884'), ('name', 'hair color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P39'), ('name', 'position held')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P136'), ('name', 'genre')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P241'), ('name', 'military branch')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P410'), ('name', 'military rank')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P607'), ('name', 'conflict')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1830'), ('name', 'owner of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P102'), ('name', 'member of political party')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P485'), ('name', 'archives at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6379'), ('name', 'has works in the collection')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7763'), ('name', 'copyright status as a creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5056'), ('name', 'patronym or matronym for this person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1038'), ('name', 'relative')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1442'), ('name', 'image of grave')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1340'), ('name', 'eye color')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P184'), ('name', 'doctoral advisor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P185'), ('name', 'doctoral student')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3602'), ('name', 'candidacy in election')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5008'), ('name', 'on focus list of Wikimedia project')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9139'), ('name', 'first family name in Portuguese name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8017'), ('name', 'generational suffix')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1050'), ('name', 'medical condition')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2868'), ('name', 'subject has role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P412'), ('name', 'voice type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P361'), ('name', 'part of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P647'), ('name', 'drafted by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P569'), ('name', 'date of birth')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1411'), ('name', 'nominated for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6886'), ('name', 'writing language')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1399'), ('name', 'convicted of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6758'), ('name', 'supported sports team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5389'), ('name', 'permanent resident of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P264'), ('name', 'record label')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P358'), ('name', 'discography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P800'), ('name', 'notable work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1347'), ('name', 'military casualty classification')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P512'), ('name', 'academic degree')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P945'), ('name', 'allegiance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1283'), ('name', 'filmography')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2959'), ('name', 'permanent duplicated item')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P53'), ('name', 'family')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P737'), ('name', 'influenced by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7084'), ('name', 'related category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P10'), ('name', 'video')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1853'), ('name', 'blood type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1875'), ('name', 'represented by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1576'), ('name', 'lifestyle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2632'), ('name', 'place of detention')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P989'), ('name', 'spoken text audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6275'), ('name', 'copyright representative')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1327'), ('name', 'partner in business or sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P138'), ('name', 'named after')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1801'), ('name', 'commemorative plaque image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1066'), ('name', 'student of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P423'), ('name', 'shooting handedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2888'), ('name', 'exact match')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P990'), ('name', \"audio recording of the subject's spoken voice\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P466'), ('name', 'occupant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P741'), ('name', 'playing hand')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6802'), ('name', 'related image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2962'), ('name', 'title of chess person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P802'), ('name', 'student')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1026'), ('name', 'academic thesis')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1142'), ('name', 'political ideology')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1416'), ('name', 'affiliation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P286'), ('name', 'head coach')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3342'), ('name', 'significant person')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6104'), ('name', 'maintained by WikiProject')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1000'), ('name', 'record held')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2522'), ('name', 'victory')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P511'), ('name', 'honorific prefix')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1441'), ('name', 'present in work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P460'), ('name', 'said to be the same as')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2545'), ('name', 'bowling style')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P248'), ('name', 'stated in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8006'), ('name', 'footedness')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P407'), ('name', 'language of work or name')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1593'), ('name', 'defender')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P135'), ('name', 'movement')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1065'), ('name', 'archive URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P97'), ('name', 'noble title')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P66'), ('name', 'ancestral home')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1056'), ('name', 'product or material produced')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P127'), ('name', 'owned by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1454'), ('name', 'legal form')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P159'), ('name', 'headquarters location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P452'), ('name', 'industry')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P740'), ('name', 'location of formation')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P749'), ('name', 'parent organization')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1766'), ('name', 'place name sign')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P803'), ('name', 'professorship')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1268'), ('name', 'represents')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6291'), ('name', 'advertises')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2541'), ('name', 'operating area')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P279'), ('name', 'subclass of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P495'), ('name', 'country of origin')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P157'), ('name', 'killed by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P175'), ('name', 'performer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P94'), ('name', 'coat of arms image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P112'), ('name', 'founded by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2789'), ('name', 'connects with')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P811'), ('name', 'academic minor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7779'), ('name', 'member of military unit')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9493'), ('name', 'artist files at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5800'), ('name', 'narrative role')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8839'), ('name', 'hairstyle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P725'), ('name', 'voice actor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P115'), ('name', 'home venue')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P831'), ('name', 'parent club')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4913'), ('name', 'dialect of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1652'), ('name', 'referee')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6872'), ('name', 'has written for')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1455'), ('name', 'list of works')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3150'), ('name', 'birthday')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1321'), ('name', 'place of origin (Switzerland)')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3448'), ('name', 'stepparent')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1313'), ('name', 'office held by head of government')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P450'), ('name', 'astronaut mission')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1080'), ('name', 'from narrative universe')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P488'), ('name', 'chairperson')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1552'), ('name', 'has quality')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7937'), ('name', 'form of creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1596'), ('name', 'penalty')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1415'), ('name', 'Oxford Dictionary of National Biography ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2354'), ('name', 'has list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1754'), ('name', 'category related to list')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P360'), ('name', 'is a list of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3919'), ('name', 'contributed to creative work')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3828'), ('name', 'wears')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7047'), ('name', 'enemy of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8345'), ('name', 'media franchise')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9071'), ('name', 'character type')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1325'), ('name', 'external data available at')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P170'), ('name', 'creator')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2546'), ('name', 'sidekick of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2650'), ('name', 'interested in')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1595'), ('name', 'charge')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P553'), ('name', 'website account on')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6500'), ('name', 'non-free artwork image URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1037'), ('name', 'director / manager')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5715'), ('name', 'Academia.edu profile URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P708'), ('name', 'diocese')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2699'), ('name', 'URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P611'), ('name', 'religious order')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2318'), ('name', 'debut participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P968'), ('name', 'email address')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1387'), ('name', 'political alignment')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P520'), ('name', 'armament')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P629'), ('name', 'edition or translation of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P41'), ('name', 'flag image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1581'), ('name', 'official blog')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8852'), ('name', 'facial hair')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3320'), ('name', 'board member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4765'), ('name', 'Commons compatible image available at URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P812'), ('name', 'academic major')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2348'), ('name', 'time period')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7014'), ('name', 'terms of service URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2369'), ('name', 'Soccerway player ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P158'), ('name', 'seal image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1363'), ('name', 'points/goal scored by')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P531'), ('name', 'diplomatic mission sent')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P161'), ('name', 'cast member')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4656'), ('name', 'Wikimedia import URL')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1449'), ('name', 'nickname')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8413'), ('name', 'academic appointment')]\n",
      "225\n"
     ]
    }
   ],
   "source": [
    "# print properties of the players that are not literals\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        ?prop ?x.\n",
    "FILTER(!isLiteral(?x)).\n",
    "?prop sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "324a38f4-7695-4f07-bf78-490d2e7dfeba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q104439579'), ('name', '2020 Belarusian Premier League relegation play-offs')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q77927099'), ('name', '2020 Belarusian Premier League')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q11831154'), ('name', '2019 Africa Cup of Nations')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q11865693'), ('name', 'football at the 2016 Summer Olympics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8150'), ('name', '1936 Summer Olympics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q48432'), ('name', '1930 FIFA World Cup')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q18479838'), ('name', \"football at the 2016 Summer Olympics – women's tournament\")]\n",
      "[('x', 'http://www.wikidata.org/entity/Q62589205'), ('name', \"football at the 2020 Summer Olympics – women's tournament\")]\n",
      "[('x', 'http://www.wikidata.org/entity/Q102920'), ('name', 'UEFA Euro 2004')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q1185431'), ('name', '2015 Pan American Games')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q176883'), ('name', '2010 FIFA World Cup')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q189571'), ('name', 'UEFA Euro 2016')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q22669'), ('name', 'UEFA Euro 2012')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q37285'), ('name', '2006 FIFA World Cup')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q47735'), ('name', '2002 FIFA World Cup')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q79859'), ('name', '2014 FIFA World Cup')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8438'), ('name', '1972 Summer Olympics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8488'), ('name', '1992 Summer Olympics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8531'), ('name', '1996 Summer Olympics')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q8567'), ('name', '2008 Summer Olympics')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# print objects of the properties related with partecipant in (P1344)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        wdt:P1344 ?x.\n",
    "?x sc:name ?name .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "217a9f31-2b14-4d23-a3ff-a896557965ac",
   "metadata": {},
   "source": [
    "I found a lot of objects that seems to be part of a super class or something else. Starting point: `wd:Q37285`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "be5f5db8-b84a-4f7e-8b03-9162b54aa764",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1132'), ('name', 'number of participants')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1350'), ('name', 'number of matches played/races/starts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1546'), ('name', 'motto')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3450'), ('name', 'sports season of league or competition')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P393'), ('name', 'edition number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3967'), ('name', 'final event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P454'), ('name', 'Structurae structure ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P585'), ('name', 'point in time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P664'), ('name', 'organizer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7140'), ('name', 'München Wiki article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P822'), ('name', 'mascot')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1110'), ('name', 'attendance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1351'), ('name', 'number of points/goals/set scored')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1923'), ('name', 'participating team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3279'), ('name', 'statistical leader')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5162'), ('name', 'OnsOranje tournament ID')]\n",
      "43\n"
     ]
    }
   ],
   "source": [
    "# print objects of the properties related with partecipant in (P1344)\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q37285 ?prop ?x.\n",
    "?prop sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "8cb16c2d-9833-4541-9203-0f80ba604a04",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q19317'), ('name', 'FIFA World Cup')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# use the property sports league or competition\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?name\n",
    "WHERE { \n",
    "\n",
    "wd:Q37285 wdt:P3450 ?x.\n",
    "?x sc:name ?name .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "9db304ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "### insert the result of TASK 3 in the file\n",
    "og_uri = \"http://www.wikidata.org/entity/Q19317\"\n",
    "og_name = \"FIFA World Cup\"\n",
    "obj = {\"uri\":og_uri,\"name\":og_name}\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"7\", evaluation.TYPE_SINGLE ,\"uri\", [obj] ,\"all\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cce377e2-3f77-49ef-950f-9ab6b022ce26",
   "metadata": {},
   "source": [
    "`wd:Q19317` is the FIFA World Cup "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "443faabb-fa8f-4159-bc77-1dd086384a5c",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 8\n",
    "Who are the players who partecipated in more than 4 world's cup editions?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "f90f1898-a8e4-4dda-88e7-afaf0d3bc1a8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('player', 'http://www.wikidata.org/entity/Q186330'), ('name', 'Rafael Márquez'), ('wcs', '5')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q68060'), ('name', 'Gianluigi Buffon'), ('wcs', '5')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q265428'), ('name', 'Antonio Carbajal'), ('wcs', '5')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q36386'), ('name', 'Lothar Matthäus'), ('wcs', '5')]\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# print properties of the players that are not literals\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?player ?name count(*) AS ?wcs\n",
    "WHERE { \n",
    "\n",
    "?player wdt:P106 wd:Q937857;\n",
    "        wdt:P1344 ?wc.\n",
    "?wc wdt:P3450 wd:Q19317.\n",
    "?player sc:name ?name\n",
    "}\n",
    "GROUP BY ?player ?name\n",
    "HAVING (count(*) > 4)\n",
    "ORDER BY DESC (?wcs)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0df24d9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "objs = []\n",
    "for i in x:\n",
    "    f_uri = i[0][1]\n",
    "    f_name = i[1][1]\n",
    "    victories = i[2][1]\n",
    "    obj = {}\n",
    "    obj[\"refers_to\"] = f_uri\n",
    "    obj[\"refers_to_name\"] = f_name\n",
    "    obj[\"check\"] = \"value\"\n",
    "    obj[\"value\"]= victories\n",
    "    objs.append(obj)\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"8\", evaluation.TYPE_REFERRED ,\"value\", objs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bf88d396-8d0f-4ab0-b5d1-3ad62ac25a66",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Task 9\n",
    "For each country who won the FIFA World Cup at least twice find how many players won the ballon d'Or"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "3a664ac5-1fb1-4420-945a-e28c2945fd13",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P793'), ('name', 'significant event')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# verify connections between countries and FIFA World Cup\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?nation wdt:P31 wd:Q6256.\n",
    "?wc wdt:P3450 wd:Q19317.\n",
    "?nation ?prop ?wc.\n",
    "\n",
    "?prop sc:name ?name.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "07c63e09-bed3-4bfe-9efe-8bbaef505349",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4967'), ('name', 'prerequisite')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1132'), ('name', 'number of participants')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1151'), ('name', \"topic's main Wikimedia portal\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P131'), ('name', 'located in the administrative territorial entity')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1346'), ('name', 'winner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1350'), ('name', 'number of matches played/races/starts')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1424'), ('name', \"topic's main template\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P154'), ('name', 'logo image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1546'), ('name', 'motto')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P155'), ('name', 'follows')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1617'), ('name', 'BBC Things ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P18'), ('name', 'image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2013'), ('name', 'Facebook ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2094'), ('name', 'competition class')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P214'), ('name', 'VIAF ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P227'), ('name', 'GND ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P242'), ('name', 'locator map image')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P244'), ('name', 'Library of Congress authority ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2572'), ('name', 'hashtag')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2581'), ('name', 'BabelNet ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2671'), ('name', 'Google Knowledge Graph ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P268'), ('name', 'Bibliothèque nationale de France ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P269'), ('name', 'IdRef ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P276'), ('name', 'location')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P2924'), ('name', 'Great Russian Encyclopedia Online ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P31'), ('name', 'instance of')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3106'), ('name', 'Guardian topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3219'), ('name', 'Encyclopædia Universalis ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3414'), ('name', 'Yle Areena item ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3417'), ('name', 'Quora topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P345'), ('name', 'IMDb ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3450'), ('name', 'sports season of league or competition')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3509'), ('name', 'Dagens Nyheter topic ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P373'), ('name', 'Commons category')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P393'), ('name', 'edition number')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3967'), ('name', 'final event')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P443'), ('name', 'pronunciation audio')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P4431'), ('name', 'Google Doodle')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P454'), ('name', 'Structurae structure ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P527'), ('name', 'has part')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P580'), ('name', 'start time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P582'), ('name', 'end time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P585'), ('name', 'point in time')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P6262'), ('name', 'Fandom article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P641'), ('name', 'sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P646'), ('name', 'Freebase ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P664'), ('name', 'organizer')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P691'), ('name', 'NKCR AUT ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P710'), ('name', 'participant')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7140'), ('name', 'München Wiki article ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7818'), ('name', 'French Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7822'), ('name', 'Italian Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7829'), ('name', 'English Vikidia ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P7859'), ('name', 'WorldCat Identities ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P822'), ('name', 'mascot')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P856'), ('name', 'official website')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P859'), ('name', 'sponsor')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P8885'), ('name', 'Namuwiki ID')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P910'), ('name', \"topic's main category\")]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P9100'), ('name', 'GitHub topic')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P935'), ('name', 'Commons gallery')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P948'), ('name', 'page banner')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1110'), ('name', 'attendance')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1351'), ('name', 'number of points/goals/set scored')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1923'), ('name', 'participating team')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P3279'), ('name', 'statistical leader')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P5162'), ('name', 'OnsOranje tournament ID')]\n",
      "68\n"
     ]
    }
   ],
   "source": [
    "# start from the FIFA World Cup, look at his properties to find something related with the winner\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?wc wdt:P3450 wd:Q19317;\n",
    "    ?prop ?x.\n",
    "?prop sc:name ?name.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "64407f0a-c3d6-4c49-acca-ff0409ae927b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('cup', '1930 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q134916'), ('name', 'Uruguay national football team')]\n",
      "[('cup', '1934 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q676899'), ('name', 'Italy national association football team')]\n",
      "[('cup', '1938 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q676899'), ('name', 'Italy national association football team')]\n",
      "[('cup', '1950 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q134916'), ('name', 'Uruguay national football team')]\n",
      "[('cup', '1954 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q43310'), ('name', 'Germany national association football team')]\n",
      "[('cup', '1958 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q83459'), ('name', 'Brazil national football team')]\n",
      "[('cup', '1962 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q83459'), ('name', 'Brazil national football team')]\n",
      "[('cup', '1966 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q47762'), ('name', 'England national association football team')]\n",
      "[('cup', '1970 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q83459'), ('name', 'Brazil national football team')]\n",
      "[('cup', '1974 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q43310'), ('name', 'Germany national association football team')]\n",
      "[('cup', '1978 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q79800'), ('name', 'Argentina national football team')]\n",
      "[('cup', '1982 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q676899'), ('name', 'Italy national association football team')]\n",
      "[('cup', '1986 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q79800'), ('name', 'Argentina national football team')]\n",
      "[('cup', '1990 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q43310'), ('name', 'Germany national association football team')]\n",
      "[('cup', '1994 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q83459'), ('name', 'Brazil national football team')]\n",
      "[('cup', '1998 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q47774'), ('name', 'France national association football team')]\n",
      "[('cup', '2002 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q83459'), ('name', 'Brazil national football team')]\n",
      "[('cup', '2006 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q676899'), ('name', 'Italy national association football team')]\n",
      "[('cup', '2010 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q42267'), ('name', 'Spain national association football team')]\n",
      "[('cup', '2014 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q43310'), ('name', 'Germany national association football team')]\n",
      "[('cup', '2018 FIFA World Cup'), ('x', 'http://www.wikidata.org/entity/Q47774'), ('name', 'France national association football team')]\n",
      "21\n"
     ]
    }
   ],
   "source": [
    "# use the property winner (P1346) and print some results to understand\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?cup ?x ?name\n",
    "WHERE { \n",
    "\n",
    "?wc wdt:P3450 wd:Q19317;\n",
    "    wdt:P1346 ?x.\n",
    "?x sc:name ?name.\n",
    "?wc sc:name ?cup.\n",
    "}\n",
    "ORDER BY ?cup\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cd977525-814b-479d-a7ed-9ec1e1935d69",
   "metadata": {},
   "source": [
    "I understand that we are talking of national football team. Verify how these teams are related with their country"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "6271fba7-5509-4afe-b720-3d9389f5cefe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P1532'), ('name', 'country for sport')]\n",
      "[('prop', 'http://www.wikidata.org/prop/direct/P17'), ('name', 'country')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "# use the property winner (P1346) and print some results to understand\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?prop ?name\n",
    "WHERE { \n",
    "\n",
    "?wc wdt:P3450 wd:Q19317;\n",
    "    wdt:P1346 ?x.\n",
    "    \n",
    "?country wdt:P31 wd:Q6256.\n",
    "?x ?prop ?country.\n",
    "    \n",
    "?prop sc:name ?name.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "412198b4-f492-4d9b-8aff-c72b8516bc95",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('x', 'http://www.wikidata.org/entity/Q47774'), ('team', 'France national association football team'), ('country', 'http://www.wikidata.org/entity/Q142'), ('cName', 'France')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q47762'), ('team', 'England national association football team'), ('country', 'http://www.wikidata.org/entity/Q145'), ('cName', 'United Kingdom')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q83459'), ('team', 'Brazil national football team'), ('country', 'http://www.wikidata.org/entity/Q155'), ('cName', 'Brazil')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q676899'), ('team', 'Italy national association football team'), ('country', 'http://www.wikidata.org/entity/Q38'), ('cName', 'Italy')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q79800'), ('team', 'Argentina national football team'), ('country', 'http://www.wikidata.org/entity/Q414'), ('cName', 'Argentina')]\n",
      "[('x', 'http://www.wikidata.org/entity/Q134916'), ('team', 'Uruguay national football team'), ('country', 'http://www.wikidata.org/entity/Q77'), ('cName', 'Uruguay')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# use the property country (P17) and print some results to understand\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?x ?team ?country ?cName\n",
    "WHERE { \n",
    "\n",
    "?wc wdt:P3450 wd:Q19317;\n",
    "    wdt:P1346 ?x.\n",
    "    \n",
    "?country wdt:P31 wd:Q6256.\n",
    "?x wdt:P17 ?country.\n",
    "    \n",
    "?country sc:name ?cName.\n",
    "?x sc:name ?team.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "d9fdceed-3373-45ca-a26e-863fe5e23c57",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q38'), ('cName', 'Italy'), ('wcs', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q183'), ('cName', 'Germany'), ('wcs', '4')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q155'), ('cName', 'Brazil'), ('wcs', '5')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q29'), ('cName', 'Spain'), ('wcs', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q414'), ('cName', 'Argentina'), ('wcs', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q142'), ('cName', 'France'), ('wcs', '2')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q145'), ('cName', 'United Kingdom'), ('wcs', '1')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q77'), ('cName', 'Uruguay'), ('wcs', '2')]\n",
      "8\n"
     ]
    }
   ],
   "source": [
    "# print the countries with the number of FIFA World Cup won\n",
    "queryString = \"\"\"\n",
    "SELECT ?country ?cName (COUNT(?wc) AS ?wcs)\n",
    "WHERE { \n",
    "\n",
    "?wc wdt:P3450 wd:Q19317;\n",
    "    wdt:P1346 ?x.\n",
    "    \n",
    "?x wdt:P17 ?country.\n",
    "    \n",
    "?country sc:name ?cName.\n",
    "}\n",
    "GROUP BY ?country ?cName\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "00ac6974-c657-4a16-95ec-bc414082c963",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('player', 'http://www.wikidata.org/entity/Q4457'), ('name', 'Franz Beckenbauer')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q4261'), ('name', 'Michel Platini')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q39444'), ('name', 'Ronaldinho')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q531814'), ('name', 'Kaká')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q13494'), ('name', 'Jean-Pierre Papin')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q102027'), ('name', 'Fabio Cannavaro')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q36386'), ('name', 'Lothar Matthäus')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q123118'), ('name', 'Raymond Kopa')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q43744'), ('name', 'Gerd Müller')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q1835'), ('name', 'Zinedine Zidane')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q230046'), ('name', 'Gianni Rivera')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q220700'), ('name', 'Omar Sívori')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q178628'), ('name', 'Paolo Rossi')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q615'), ('name', 'Lionel Messi')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q483577'), ('name', 'Rivaldo')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q152871'), ('name', 'Karl-Heinz Rummenigge')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q529207'), ('name', 'Ronaldo')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q164546'), ('name', 'Alfredo Di Stéfano')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q67964'), ('name', 'Roberto Baggio')]\n",
      "[('player', 'http://www.wikidata.org/entity/Q57183'), ('name', 'Matthias Sammer')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# print the countries with the number of FIFA World Cup won\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?player ?name\n",
    "WHERE{\n",
    "    {\n",
    "        SELECT ?country \n",
    "        WHERE { \n",
    "            ?wc wdt:P3450 wd:Q19317;\n",
    "                wdt:P1346 ?x.\n",
    "            ?x wdt:P17 ?country.\n",
    "        }\n",
    "        GROUP BY ?country\n",
    "        HAVING (COUNT(DISTINCT ?wc) > 1)\n",
    "    }\n",
    "    \n",
    "    ?player wdt:P106 wd:Q937857;\n",
    "        wdt:P166 wd:Q166177;\n",
    "        wdt:P27 ?country.\n",
    "    ?player sc:name ?name.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x = run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "d463c947-3f75-4874-826d-7a7d45b5e3b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The index of this workflow is: 0_6\n",
      "The path is /locale/data/jupyter/prando/notebook/2022/results/workflow0_6.json\n",
      "JSON object updated\n"
     ]
    }
   ],
   "source": [
    "obj = [{\"uri\":r[0][1],\"name\":r[1][1]} for r in x]\n",
    "evaluation.add_result(evaluation.get_index_workflow(pt),\"9\", evaluation.TYPE_SET ,\"uri\", obj)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "58081bad",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
