{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7034c3bf-6eb0-4418-8687-7b9d2a501103",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "is the BGP returning a human-readable name of a property or a class in Wikidata.\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3605c9d5-5371-49a5-be8d-d66e8f417139",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-84291ccba1-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "       results = sparql.query()\n",
    "       json_results = results.convert()\n",
    "       if len(json_results['results']['bindings'])==0:\n",
    "          print(\"Empty\")\n",
    "          return 0\n",
    "    \n",
    "       for bindings in json_results['results']['bindings']:\n",
    "          print( [ (var, value['value'])  for var, value in bindings.items() ] )\n",
    "\n",
    "       return len(json_results['results']['bindings'])\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-02.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d477a59c-a68c-4c8f-9f97-8ca5294d7d27",
   "metadata": {},
   "source": [
    "# Politics Workflow Series (\"Monarchies\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> You investigating existing and past historical monarchies"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4a45c0ba-f79e-441d-bec5-84401b09db70",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "\n",
    "\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P17`     | country       | predicate |\n",
    "| `wdt:P27`     | citizenship   | predicate |\n",
    "| `wdt:P1366`   | replaced by    | predicate |\n",
    "| `wdt:P122`    | basic form of government    | predicate |\n",
    "| `wd:Q38`      | Italy          | node |\n",
    "| `wd:Q145`     | United Kingdom           | node |\n",
    "| `wd:Q7269`    | monarchy           | node |\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "?p (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269  . \n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **countries that are some instance of a monarchy**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7af439fb-96e4-4dbb-a381-f19afab79f86",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Workload Goals\n",
    "\n",
    "\n",
    "1. Identify the BGP to retrieve states that were monarchies and have been replaced by some other state\n",
    "\n",
    "2. Identify the BGP for obtaining statistical information of monarchies, e.g., poluation or inception date\n",
    "\n",
    "3. Which is or was  the country with the highest population?\n",
    "\n",
    "4. How many countries are or have been monarchies across continents?\n",
    "\n",
    "5. Analyze the number of countries that were monarchies\n",
    " \n",
    "   5.1 How many sub-types of monarchy exist?  How many instances of exist of each one?\n",
    "   \n",
    "   5.2 Are there cities that have been capital of multiple kingdoms?\n",
    "   \n",
    "   5.3 Which are the top-3 monarchies with the earliest inception and still existing?\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "24a853ab-830c-422c-afd3-e9e015b8b8ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "# start your workflow here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ade01416-92e7-4ad7-b9a9-b8fb330750dc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('callret-0', '2344')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT COUNT(*)\n",
    "WHERE { \n",
    "\n",
    "?p (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269  . \n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d95aecf0-9cca-4f9d-9033-e86c01244c87",
   "metadata": {},
   "source": [
    "## Task 1 - Identify the BGP to retrieve states that were monarchies and have been replaced by some other state"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8b011a6-4718-4be2-ab09-0308b9f27b31",
   "metadata": {},
   "source": [
    "#### I inspect Properties of the Monarchies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a0fffeab-5074-4af7-bb30-58d26bdd3943",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used'), ('number', '4945')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of'), ('number', '3785')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('number', '3052')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('number', '2141')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity'), ('number', '1711')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital'), ('number', '1511')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P571'), ('pname', 'inception'), ('number', '1474')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P576'), ('pname', 'dissolved, abolished or demolished date'), ('number', '1332')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P646'), ('pname', 'Freebase ID'), ('number', '1290')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P122'), ('pname', 'basic form of government'), ('number', '1286')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P242'), ('pname', 'locator map image'), ('number', '1099')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source'), ('number', '1053')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P37'), ('pname', 'official language'), ('number', '1028')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('number', '982')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P910'), ('pname', \"topic's main category\"), ('number', '974')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P373'), ('pname', 'Commons category'), ('number', '907')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent'), ('number', '899')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P94'), ('pname', 'coat of arms image'), ('number', '846')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2671'), ('pname', 'Google Knowledge Graph ID'), ('number', '842')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P41'), ('pname', 'flag image'), ('number', '791')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with'), ('number', '748')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces'), ('number', '659')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P214'), ('pname', 'VIAF ID'), ('number', '535')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1366'), ('pname', 'replaced by'), ('number', '534')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency'), ('number', '532')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P140'), ('pname', 'religion'), ('number', '413')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3075'), ('pname', 'official religion'), ('number', '409')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1417'), ('pname', 'Encyclopædia Britannica Online ID'), ('number', '396')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P35'), ('pname', 'head of state'), ('number', '384')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7859'), ('pname', 'WorldCat Identities ID'), ('number', '380')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P227'), ('pname', 'GND ID'), ('number', '369')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P244'), ('pname', 'Library of Congress authority ID'), ('number', '362')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P156'), ('pname', 'followed by'), ('number', '357')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1889'), ('pname', 'different from'), ('number', '353')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('pname', 'population'), ('number', '343')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2046'), ('pname', 'area'), ('number', '339')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of'), ('number', '326')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P155'), ('pname', 'follows'), ('number', '316')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P131'), ('pname', 'located in the administrative territorial entity'), ('number', '313')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P527'), ('pname', 'has part'), ('number', '295')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2924'), ('pname', 'Great Russian Encyclopedia Online ID'), ('number', '286')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3417'), ('pname', 'Quora topic ID'), ('number', '236')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1906'), ('pname', 'office held by head of state'), ('number', '217')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1296'), ('pname', 'Gran Enciclopèdia Catalana ID'), ('number', '214')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P85'), ('pname', 'anthem'), ('number', '212')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P691'), ('pname', 'NKCR AUT ID'), ('number', '209')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P443'), ('pname', 'pronunciation audio'), ('number', '207')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P18'), ('pname', 'image'), ('number', '204')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P421'), ('pname', 'located in time zone'), ('number', '200')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P194'), ('pname', 'legislative body'), ('number', '194')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6404'), ('pname', \"Treccani's Dizionario di Storia ID\"), ('number', '194')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P206'), ('pname', 'located in or next to body of water'), ('number', '194')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8476'), ('pname', 'BTI Governance Index'), ('number', '189')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8477'), ('pname', 'BTI Status Index'), ('number', '186')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday'), ('number', '184')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3219'), ('pname', 'Encyclopædia Universalis ID'), ('number', '180')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P268'), ('pname', 'Bibliothèque nationale de France ID'), ('number', '179')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1549'), ('pname', 'demonym'), ('number', '179')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1464'), ('pname', 'category for people born here'), ('number', '174')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P163'), ('pname', 'flag'), ('number', '173')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1344'), ('pname', 'participant in'), ('number', '171')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2852'), ('pname', 'emergency telephone number'), ('number', '168')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7867'), ('pname', 'category for maps'), ('number', '163')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1792'), ('pname', 'category of associated people'), ('number', '160')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2853'), ('pname', 'electrical plug type'), ('number', '155')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P237'), ('pname', 'coat of arms'), ('number', '154')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6'), ('pname', 'head of government'), ('number', '153')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P856'), ('pname', 'official website'), ('number', '144')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6262'), ('pname', 'Fandom article ID'), ('number', '143')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P172'), ('pname', 'ethnic group'), ('number', '142')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1441'), ('pname', 'present in work'), ('number', '139')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1667'), ('pname', 'Getty Thesaurus of Geographic Names ID'), ('number', '136')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2184'), ('pname', 'history of topic'), ('number', '134')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P793'), ('pname', 'significant event'), ('number', '129')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P7818'), ('pname', 'French Vikidia ID'), ('number', '123')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P138'), ('pname', 'named after'), ('number', '121')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8408'), ('pname', 'KBpedia ID'), ('number', '121')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P935'), ('pname', 'Commons gallery'), ('number', '120')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1465'), ('pname', 'category for people who died here'), ('number', '116')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P948'), ('pname', 'page banner'), ('number', '114')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2959'), ('pname', 'permanent duplicated item'), ('number', '113')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P898'), ('pname', 'IPA transcription'), ('number', '112')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1313'), ('pname', 'office held by head of government'), ('number', '108')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1151'), ('pname', \"topic's main Wikimedia portal\"), ('number', '105')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4839'), ('pname', 'Wolfram Language entity code'), ('number', '105')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8744'), ('pname', 'economy of topic'), ('number', '105')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P269'), ('pname', 'IdRef ID'), ('number', '104')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P998'), ('pname', 'Curlie ID'), ('number', '103')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P5063'), ('pname', 'Interlingual Index ID'), ('number', '103')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P3842'), ('pname', 'located in present-day administrative territorial entity'), ('number', '102')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2347'), ('pname', 'YSO ID'), ('number', '102')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P349'), ('pname', 'National Diet Library ID'), ('number', '102')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1830'), ('pname', 'owner of'), ('number', '101')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P2979'), ('pname', 'maritime identification digits'), ('number', '101')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1566'), ('pname', 'GeoNames ID'), ('number', '100')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8406'), ('pname', 'Grove Art Online ID'), ('number', '99')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P706'), ('pname', 'located in/on physical feature'), ('number', '98')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P4841'), ('pname', 'total fertility rate'), ('number', '97')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P474'), ('pname', 'country calling code'), ('number', '95')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P6766'), ('pname', \"Who's on First ID\"), ('number', '92')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "100"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname (COUNT(?p) AS ?number) WHERE { \n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "     ?p ?obj.\n",
    "    \n",
    "?p <http://schema.org/name> ?pname.\n",
    "} \n",
    "GROUP BY ?p ?pname\n",
    "ORDER BY DESC (?number)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c3f93639-d363-4af1-bda8-64335f0516d7",
   "metadata": {},
   "source": [
    "#### I use \"replaced by\" (wdt:P1366)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "73e9a01a-58e4-415f-9f93-28833a436ab8",
   "metadata": {},
   "outputs": [],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?name ?Replace WHERE { \n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "    wdt:P1366 ?m.\n",
    "    \n",
    "?mon <http://schema.org/name> ?name.\n",
    "?m <http://schema.org/name> ?Replace.\n",
    "\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6e012f6c-8da9-4a05-8f53-5918ae0225c9",
   "metadata": {},
   "source": [
    "## Task 2 - Identify the BGP for obtaining statistical information of monarchies, e.g., population or inception date\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "38edb2de-0f6f-47fd-abf5-0bd355aaf500",
   "metadata": {},
   "source": [
    "#### I use \"inception\"(wdt:P571), \"currency\" (wdt:P38), \"population\" (wdt:P1082), \"area\" (wdt:P2046)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "901b0a96-b9e4-4749-b61f-2bb90ffbcc68",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'groschen'), ('latest_pop', '3500000'), ('area', '930000')]\n",
      "[('name', 'Kingdom of Kongo'), ('inc', '1395-01-01T00:00:00Z'), ('curname', 'Shell money'), ('area', '129400')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'złoty'), ('latest_pop', '3500000'), ('area', '250000')]\n",
      "[('name', 'Thailand'), ('inc', '1768-12-28T00:00:00Z'), ('curname', 'baht'), ('latest_pop', '65931550'), ('area', '513119.5')]\n",
      "[('name', 'Greenland'), ('inc', '1979-01-01T00:00:00Z'), ('curname', 'Danish krone'), ('latest_pop', '56081'), ('area', '2166086')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'Lithuanian long currency'), ('latest_pop', '3500000'), ('area', '320000')]\n",
      "[('name', 'Belize'), ('inc', '1981-09-21T00:00:00Z'), ('curname', 'Belize dollar'), ('latest_pop', '374681'), ('area', '22966')]\n",
      "[('name', 'Principality of Sealand'), ('inc', '1967-09-02T00:00:00Z'), ('curname', 'Coins and postage stamps of Sealand'), ('latest_pop', '27'), ('area', '0.004')]\n",
      "[('name', 'Kingdom of Spain under Joseph Bonaparte'), ('inc', '1808-06-06T00:00:00Z'), ('curname', 'Spanish real')]\n",
      "[('name', 'Saint Vincent and the Grenadines'), ('inc', '1979-01-01T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '109897'), ('area', '389')]\n",
      "[('name', 'Kingdom of Burundi'), ('inc', '1680-01-01T00:00:00Z'), ('curname', 'Congolese franc')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'złoty'), ('latest_pop', '3500000'), ('area', '200000')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1324-01-01T00:00:00Z'), ('curname', 'Piedmontese scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Irish Free State'), ('inc', '1922-12-06T00:00:00Z'), ('curname', 'pound sterling')]\n",
      "[('name', 'Denmark'), ('inc', '0800-01-01T00:00:00Z'), ('curname', 'Danish krone'), ('latest_pop', '5827463'), ('area', '42925.46')]\n",
      "[('name', 'captaincy of Brazil'), ('inc', '1534-01-01T00:00:00Z'), ('curname', 'Portuguese real')]\n",
      "[('name', 'Dominion of New Zealand'), ('inc', '1907-01-01T00:00:00Z'), ('curname', 'New Zealand pound')]\n",
      "[('name', 'West Indies Federation'), ('inc', '1958-01-01T00:00:00Z'), ('curname', 'British West Indies dollar')]\n",
      "[('name', 'Kingdom of Egypt'), ('inc', '1922-02-28T00:00:00Z'), ('curname', 'Egyptian pound'), ('area', '3418400')]\n",
      "[('name', 'Romanov Empire'), ('inc', '2011-07-20T00:00:00Z'), ('curname', 'bitcoin')]\n",
      "[('name', 'Kingdom of Georgia'), ('inc', '1008-01-01T00:00:00Z'), ('curname', 'Georgian lari'), ('latest_pop', '2500000')]\n",
      "[('name', 'State of Malta'), ('inc', '1964-09-21T00:00:00Z'), ('curname', 'Maltese pound'), ('area', '316')]\n",
      "[('name', 'Sunda Kingdom'), ('inc', '0669-01-01T00:00:00Z'), ('curname', 'silver coin')]\n",
      "[('name', 'Mataram Sultanate'), ('inc', '1586-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Kingdom of Serbia'), ('inc', '1882-01-01T00:00:00Z'), ('curname', 'Serbian dinar'), ('area', '92208')]\n",
      "[('name', 'Ancient Carthage'), ('inc', '-813-01-01T00:00:00Z'), ('curname', 'Carthaginian currency'), ('latest_pop', '4300000')]\n",
      "[('name', 'Kingdom of Hungary'), ('inc', '1920-02-29T00:00:00Z'), ('curname', 'Hungarian pengő')]\n",
      "[('name', 'Sunda Kingdom'), ('inc', '0669-01-01T00:00:00Z'), ('curname', 'gold coin')]\n",
      "[('name', 'Malaysia'), ('inc', '1957-01-01T00:00:00Z'), ('curname', 'Malaysian ringgit'), ('latest_pop', '31624264'), ('area', '330290')]\n",
      "[('name', 'Russian Empire'), ('inc', '1721-11-02T00:00:00Z'), ('curname', 'rubles'), ('latest_pop', '181537800'), ('area', '21800251')]\n",
      "[('name', 'South Kasai'), ('inc', '1960-01-01T00:00:00Z'), ('curname', 'Congolese franc'), ('latest_pop', '1000000'), ('area', '30000')]\n",
      "[('name', 'Chagatai Khanate'), ('inc', '1225-01-01T00:00:00Z'), ('curname', 'coin'), ('area', '3500000')]\n",
      "[('name', 'Empire of China'), ('inc', '1915-12-12T00:00:00Z'), ('curname', 'Chinese yuan')]\n",
      "[('name', 'Taungoo Dynasty'), ('inc', '1485-01-01T00:00:00Z'), ('curname', 'kyat'), ('latest_pop', '3000000'), ('area', '750000')]\n",
      "[('name', 'Duchy of Bremen and Verden'), ('inc', '1648-01-01T00:00:00Z'), ('curname', 'Reichsthaler')]\n",
      "[('name', 'Wu'), ('inc', '-900-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'Dominion of India'), ('inc', '1947-08-15T00:00:00Z'), ('curname', 'Indian rupee')]\n",
      "[('name', 'Andorra'), ('inc', '1278-01-01T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '78151'), ('area', '468')]\n",
      "[('name', 'Kingdom of Prussia'), ('inc', '1701-01-18T00:00:00Z'), ('curname', 'Reichsthaler')]\n",
      "[('name', 'Kingdom of the Lombards'), ('inc', '0568-01-01T00:00:00Z'), ('curname', 'Tremissis')]\n",
      "[('name', 'Byzantine Empire'), ('inc', '0395-01-18T00:00:00Z'), ('curname', 'solidus'), ('latest_pop', '17000000')]\n",
      "[('name', 'Kingdom of Sicily'), ('inc', '1848-03-25T00:00:00Z'), ('curname', 'Tornesel')]\n",
      "[('name', 'Ottoman Empire'), ('inc', '1299-08-05T00:00:00Z'), ('curname', 'Akçe'), ('area', '5200000')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1720-01-01T00:00:00Z'), ('curname', 'Sardinian lira'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Zengid dynasty'), ('inc', '1127-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Kingdom of Burundi'), ('inc', '1680-01-01T00:00:00Z'), ('curname', 'Rwanda and Burundi franc')]\n",
      "[('name', 'Muscat and Oman'), ('inc', '1820-01-01T00:00:00Z'), ('curname', 'Gulf rupee')]\n",
      "[('name', 'Captaincy General of the Philippines'), ('inc', '1565-05-17T00:00:00Z'), ('curname', 'spanish dollar')]\n",
      "[('name', 'Roman Empire'), ('curname', 'denarius')]\n",
      "[('name', 'Safavid Empire'), ('inc', '1501-01-01T00:00:00Z'), ('curname', 'Abbasi'), ('latest_pop', '20000000'), ('area', '2850000')]\n",
      "[('name', 'Kingdom of Westphalia'), ('inc', '1807-01-01T00:00:00Z'), ('curname', 'Westphalian frank')]\n",
      "[('name', 'Bahrain'), ('inc', '1971-08-14T00:00:00Z'), ('curname', 'Bahraini dinar'), ('latest_pop', '1492584'), ('area', '785.08')]\n",
      "[('name', 'Bourbon Restoration'), ('inc', '1814-01-01T00:00:00Z'), ('curname', 'French franc')]\n",
      "[('name', 'Carolingian Empire'), ('inc', '0768-01-01T00:00:00Z'), ('curname', 'Catalan peseta')]\n",
      "[('name', 'British Solomon Islands'), ('inc', '1893-03-15T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '196823')]\n",
      "[('name', 'Spain'), ('inc', '1479-01-01T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '46733038'), ('area', '505990')]\n",
      "[('name', 'Kingdom of Italy'), ('inc', '1861-03-17T00:00:00Z'), ('curname', 'Italian lira'), ('latest_pop', '42399000'), ('area', '310196')]\n",
      "[('name', 'Kamakura shogunate'), ('inc', '1200-01-01T00:00:00Z'), ('curname', 'ryō')]\n",
      "[('name', 'Province of North Carolina'), ('inc', '1712-01-24T00:00:00Z'), ('curname', 'North Carolina pound'), ('latest_pop', '197200')]\n",
      "[('name', 'Taifa of Algeciras'), ('inc', '1035-01-01T00:00:00Z'), ('curname', 'dirham')]\n",
      "[('name', 'Kingdom of Naples'), ('inc', '1282-04-06T00:00:00Z'), ('curname', 'Neapolitan piastra')]\n",
      "[('name', 'Yugoslavia'), ('inc', '1918-12-01T00:00:00Z'), ('curname', 'Yugoslav dinar'), ('latest_pop', '23271000'), ('area', '255804')]\n",
      "[('name', 'Chu'), ('inc', '-721-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'Second French Empire'), ('inc', '1852-12-02T00:00:00Z'), ('curname', 'French franc')]\n",
      "[('name', 'Egypt Eyalet'), ('inc', '1517-01-01T00:00:00Z'), ('curname', 'Egyptian piastre')]\n",
      "[('name', 'Zayyanid Dynasty'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Viceroyalty of New Spain'), ('inc', '1535-10-22T00:00:00Z'), ('curname', 'peso'), ('latest_pop', '20000000'), ('area', '7657000')]\n",
      "[('name', 'Qing dynasty'), ('inc', '1636-01-01T00:00:00Z'), ('curname', 'Hubu Guanpiao'), ('latest_pop', '432000000'), ('area', '14700000')]\n",
      "[('name', 'Qi'), ('inc', '-1044-01-01T00:00:00Z'), ('curname', 'Knife money')]\n",
      "[('name', 'Kingdom of Württemberg'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'German Papiermark'), ('latest_pop', '2437574'), ('area', '19508')]\n",
      "[('name', 'Thailand'), ('inc', '1238-01-01T00:00:00Z'), ('curname', 'baht'), ('latest_pop', '65931550'), ('area', '513119.5')]\n",
      "[('name', 'Northern Ireland'), ('inc', '1921-05-08T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '1852168'), ('area', '14130')]\n",
      "[('name', 'Norway'), ('inc', '1814-05-17T00:00:00Z'), ('curname', 'Norwegian krone'), ('latest_pop', '5391369'), ('area', '385207')]\n",
      "[('name', \"Kievan Rus'\"), ('inc', '0860-01-01T00:00:00Z'), ('curname', 'nogata'), ('latest_pop', '5400000'), ('area', '1330000')]\n",
      "[('name', 'Kingdom of Prussia'), ('inc', '1701-01-18T00:00:00Z'), ('curname', 'Prussian thaler')]\n",
      "[('name', 'Dominion of Ceylon'), ('inc', '1948-02-04T00:00:00Z'), ('curname', 'Sri Lankan rupee')]\n",
      "[('name', 'Almohad Caliphate'), ('inc', '1121-01-01T00:00:00Z'), ('curname', 'gold dinar')]\n",
      "[('name', 'Monaco'), ('inc', '1297-01-15T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '38695'), ('area', '2.02')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1720-01-01T00:00:00Z'), ('curname', 'Sardinian scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Kingdom of Lombardy–Venetia'), ('inc', '1815-04-07T00:00:00Z'), ('curname', 'Austro-Hungarian gulden')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'livre tournois')]\n",
      "[('name', 'Jamaica'), ('inc', '1962-01-01T00:00:00Z'), ('curname', 'Jamaican dollar'), ('latest_pop', '2890299'), ('area', '10991.90954')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'Ryūkyū tsūhō')]\n",
      "[('name', 'Austrian Empire'), ('inc', '1804-08-11T00:00:00Z'), ('curname', 'thaler'), ('latest_pop', '21200000'), ('area', '698700')]\n",
      "[('name', 'Karabakh Khanate'), ('inc', '1750-01-01T00:00:00Z'), ('curname', 'Abbasi'), ('area', '17000')]\n",
      "[('name', 'Pasai'), ('inc', '1267-01-01T00:00:00Z'), ('curname', 'dirham')]\n",
      "[('name', 'Qatar'), ('inc', '1870-01-01T00:00:00Z'), ('curname', 'Qatari riyal'), ('latest_pop', '2639211'), ('area', '11437')]\n",
      "[('name', 'Luxembourg'), ('inc', '1815-01-01T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '626108'), ('area', '2586.4')]\n",
      "[('name', 'Dacia'), ('inc', '-059-01-01T00:00:00Z'), ('curname', 'Coson')]\n",
      "[('name', 'Qing dynasty'), ('inc', '1636-01-01T00:00:00Z'), ('curname', 'Sycee'), ('latest_pop', '432000000'), ('area', '14700000')]\n",
      "[('name', \"Kievan Rus'\"), ('inc', '0860-01-01T00:00:00Z'), ('curname', 'kuna'), ('latest_pop', '5400000'), ('area', '1330000')]\n",
      "[('name', 'Kingdom of Burundi'), ('inc', '1680-01-01T00:00:00Z'), ('curname', 'Burundian franc')]\n",
      "[('name', 'East Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'Tremissis')]\n",
      "[('name', 'Principality of Moldavia'), ('inc', '1346-01-01T00:00:00Z'), ('curname', 'thaler')]\n",
      "[('name', 'Sallarid dynasty'), ('inc', '0941-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Federation of Rhodesia and Nyasaland'), ('inc', '1953-01-01T00:00:00Z'), ('curname', 'Rhodesia and Nyasaland pound')]\n",
      "[('name', 'Yue'), ('inc', '-1100-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'Kingdom of Araucanía and Patagonia'), ('inc', '1860-11-17T00:00:00Z'), ('curname', 'peso')]\n",
      "[('name', 'Joseon'), ('inc', '1392-08-13T00:00:00Z'), ('curname', 'Korean mun'), ('latest_pop', '13000000'), ('area', '220000')]\n",
      "[('name', 'Oman'), ('inc', '1970-07-23T00:00:00Z'), ('curname', 'Omani rial'), ('latest_pop', '4829480'), ('area', '309500')]\n",
      "[('name', 'Kingdom of Laos'), ('inc', '1947-01-01T00:00:00Z'), ('curname', 'Lao kip'), ('latest_pop', '3100000'), ('area', '236800')]\n",
      "[('name', 'Southern Rhodesia'), ('inc', '1923-09-12T00:00:00Z'), ('curname', 'Southern Rhodesian pound')]\n",
      "[('name', 'Croatia in personal union with Hungary'), ('inc', '1102-01-01T00:00:00Z'), ('curname', 'Frizatik')]\n",
      "[('name', 'Islamic State of Iraq and the Levant'), ('inc', '2006-01-01T00:00:00Z'), ('curname', 'Islamic State Dinar')]\n",
      "[('name', 'Kingdom of Sikkim'), ('inc', '1642-01-01T00:00:00Z'), ('curname', 'rupee')]\n",
      "[('name', 'Kingdom of Funan'), ('inc', '0068-01-01T00:00:00Z'), ('curname', 'pearl')]\n",
      "[('name', 'German Empire'), ('inc', '1871-01-01T00:00:00Z'), ('curname', 'German gold mark'), ('latest_pop', '67790000'), ('area', '540858')]\n",
      "[('name', 'Kingdom of Hawaiʻi'), ('inc', '1795-01-01T00:00:00Z'), ('curname', 'United States dollar'), ('latest_pop', '1217000'), ('area', '28337')]\n",
      "[('name', 'State of Brazil'), ('inc', '1621-06-13T00:00:00Z'), ('curname', 'Portuguese real')]\n",
      "[('name', 'Great Britain'), ('inc', '1707-05-12T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '10500000'), ('area', '230977')]\n",
      "[('name', 'Volga Bulgaria'), ('inc', '0601-01-01T00:00:00Z'), ('curname', 'dinar'), ('latest_pop', '2000000')]\n",
      "[('name', 'Kingdom of Sicily'), ('inc', '1130-01-01T00:00:00Z'), ('curname', 'Sicilian piastra')]\n",
      "[('name', 'Austria-Hungary'), ('inc', '1867-03-01T00:00:00Z'), ('curname', 'Austro-Hungarian gulden'), ('latest_pop', '52800000'), ('area', '622269.55')]\n",
      "[('name', 'Tuvalu'), ('inc', '1978-01-01T00:00:00Z'), ('curname', 'Australian dollar'), ('latest_pop', '11192'), ('area', '26')]\n",
      "[('name', 'Tibet'), ('inc', '1912-01-01T00:00:00Z'), ('curname', 'Tibetan tangka'), ('area', '1221600')]\n",
      "[('name', 'Tang Empire'), ('inc', '0618-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage'), ('area', '5400000')]\n",
      "[('name', 'Francoist Spain'), ('inc', '1939-04-01T00:00:00Z'), ('curname', 'peseta'), ('latest_pop', '35563535'), ('area', '504030')]\n",
      "[('name', 'Kingdom of Croatia-Slavonia'), ('inc', '1868-01-01T00:00:00Z'), ('curname', 'Austro-Hungarian krone'), ('latest_pop', '2621954'), ('area', '42535.25')]\n",
      "[('name', 'Volga Bulgaria'), ('inc', '0601-01-01T00:00:00Z'), ('curname', 'som'), ('latest_pop', '2000000')]\n",
      "[('name', 'Cutch State'), ('inc', '1147-01-01T00:00:00Z'), ('curname', 'Kutch kori'), ('latest_pop', '488022'), ('area', '45630')]\n",
      "[('name', 'Commonwealth realm of Guyana'), ('inc', '1966-05-26T00:00:00Z'), ('curname', 'Guyanese dollar')]\n",
      "[('name', 'Austria-Hungary'), ('inc', '1867-03-01T00:00:00Z'), ('curname', 'Austro-Hungarian krone'), ('latest_pop', '52800000'), ('area', '676615')]\n",
      "[('name', 'Duchy of Florence'), ('inc', '1532-01-01T00:00:00Z'), ('curname', 'florin')]\n",
      "[('name', 'Khanate of Khiva'), ('inc', '1511-01-01T00:00:00Z'), ('curname', 'Khwarazmi tenga'), ('latest_pop', '800000')]\n",
      "[('name', 'Kingdom of Nepal'), ('inc', '1768-09-25T00:00:00Z'), ('curname', 'Nepalese rupee')]\n",
      "[('name', 'Kingdom of Hanover'), ('inc', '1814-10-12T00:00:00Z'), ('curname', 'Hanoverian thaler')]\n",
      "[('name', 'Kingdom of Cambodia'), ('inc', '1953-11-09T00:00:00Z'), ('curname', 'riel')]\n",
      "[('name', 'Dominion of Newfoundland'), ('inc', '1907-01-01T00:00:00Z'), ('curname', 'Newfoundland dollar')]\n",
      "[('name', 'Kingdom of Saxony'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'Saxon thaler'), ('latest_pop', '4806661'), ('area', '14993')]\n",
      "[('name', 'Mataram Sultanate'), ('inc', '1586-01-01T00:00:00Z'), ('curname', 'Netherlands Indies gulden')]\n",
      "[('name', 'Safavid Empire'), ('inc', '1501-01-01T00:00:00Z'), ('curname', 'Iranian toman'), ('latest_pop', '20000000'), ('area', '2850000')]\n",
      "[('name', 'Holy Roman Empire'), ('inc', '0962-01-01T00:00:00Z'), ('curname', 'ducat'), ('latest_pop', '26265000')]\n",
      "[('name', 'Kingdom of Poland'), ('inc', '1916-01-01T00:00:00Z'), ('curname', 'Polish marka')]\n",
      "[('name', 'Norway'), ('inc', '1905-06-07T00:00:00Z'), ('curname', 'Norwegian krone'), ('latest_pop', '5391369'), ('area', '385207')]\n",
      "[('name', 'Principality of Bulgaria'), ('inc', '1878-03-03T00:00:00Z'), ('curname', 'Bulgarian lev')]\n",
      "[('name', 'Liechtenstein'), ('inc', '1806-07-12T00:00:00Z'), ('curname', 'Swiss franc'), ('latest_pop', '37922'), ('area', '160')]\n",
      "[('name', 'Archbishopric of Bremen'), ('inc', '1180-01-01T00:00:00Z'), ('curname', 'Reichsthaler')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1713-01-01T00:00:00Z'), ('curname', 'Sardinian scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'Sekō Tsūhō')]\n",
      "[('name', 'British Solomon Islands'), ('inc', '1893-03-15T00:00:00Z'), ('curname', 'Solomon Islands pound'), ('latest_pop', '196823')]\n",
      "[('name', 'Saskatchewan'), ('inc', '1905-01-01T00:00:00Z'), ('curname', 'Canadian dollar'), ('latest_pop', '1168057'), ('area', '651900')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'Taise Tsūhō')]\n",
      "[('name', 'Irish Free State'), ('inc', '1922-12-06T00:00:00Z'), ('curname', 'Irish pound')]\n",
      "[('name', 'Hyderabad State'), ('inc', '1724-01-01T00:00:00Z'), ('curname', 'Hyderabadi rupee')]\n",
      "[('name', 'Russian Empire'), ('inc', '1721-11-02T00:00:00Z'), ('curname', 'gold rouble'), ('latest_pop', '181537800'), ('area', '21800251')]\n",
      "[('name', 'Swedish Empire'), ('inc', '1611-01-01T00:00:00Z'), ('curname', 'Swedish riksdaler')]\n",
      "[('name', 'Kingdom of Hawaiʻi'), ('inc', '1795-01-01T00:00:00Z'), ('curname', 'Hawaiian dollar'), ('latest_pop', '1217000'), ('area', '28337')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'Livre parisis')]\n",
      "[('name', 'Bechuanaland Protectorate'), ('inc', '1885-01-01T00:00:00Z'), ('curname', 'South African rand')]\n",
      "[('name', 'Malayan Union'), ('inc', '1946-01-01T00:00:00Z'), ('curname', 'Malayan dollar')]\n",
      "[('name', 'Mongol Empire'), ('inc', '1206-01-01T00:00:00Z'), ('curname', 'Balysh'), ('latest_pop', '160000000'), ('area', '24000000')]\n",
      "[('name', 'Kingdom of Lombardy–Venetia'), ('inc', '1815-04-07T00:00:00Z'), ('curname', 'Lombardy-Venetia pound')]\n",
      "[('name', 'Kingdom of Powys'), ('inc', '0500-01-01T00:00:00Z'), ('curname', 'Ceiniog')]\n",
      "[('name', 'Kuwait'), ('inc', '1991-02-26T00:00:00Z'), ('curname', 'Kuwaiti dinar'), ('latest_pop', '4600000'), ('area', '17818')]\n",
      "[('name', 'United Arab Emirates'), ('inc', '1971-01-01T00:00:00Z'), ('curname', 'United Arab Emirates dirham'), ('latest_pop', '9890400'), ('area', '83600')]\n",
      "[('name', 'Bhutan'), ('inc', '1949-08-08T00:00:00Z'), ('curname', 'ngultrum'), ('latest_pop', '807610'), ('area', '38394')]\n",
      "[('name', 'Ottoman Empire'), ('inc', '1299-08-05T00:00:00Z'), ('curname', 'sultani'), ('area', '5200000')]\n",
      "[('name', 'Crown of Castile'), ('inc', '1230-01-01T00:00:00Z'), ('curname', 'Spanish real'), ('area', '382000')]\n",
      "[('name', 'Duchy of Milan'), ('inc', '1395-05-19T00:00:00Z'), ('curname', 'soldo')]\n",
      "[('name', 'New France'), ('inc', '1534-01-01T00:00:00Z'), ('curname', 'French livre')]\n",
      "[('name', 'Kingdom of Portugal'), ('inc', '1139-07-26T00:00:00Z'), ('curname', 'Portuguese dinheiro'), ('latest_pop', '5400000')]\n",
      "[('name', 'Kingdom of Hungary'), ('inc', '1526-11-21T00:00:00Z'), ('curname', 'Austro-Hungarian gulden')]\n",
      "[('name', 'Kingdom of Dalmatia'), ('inc', '1815-06-22T00:00:00Z'), ('curname', 'Austro-Hungarian gulden'), ('latest_pop', '645666'), ('area', '12831')]\n",
      "[('name', 'Grand Duchy of Oldenburg'), ('inc', '1814-01-01T00:00:00Z'), ('curname', 'thaler')]\n",
      "[('name', 'Union of South Africa'), ('inc', '1910-05-31T00:00:00Z'), ('curname', 'South African pound'), ('latest_pop', '18216000'), ('area', '2045320')]\n",
      "[('name', 'Mongol Empire'), ('inc', '1206-01-01T00:00:00Z'), ('curname', 'Balysh'), ('latest_pop', '160000000'), ('area', '12000000')]\n",
      "[('name', 'Saudi Arabia'), ('inc', '1727-01-01T00:00:00Z'), ('curname', 'Saudi riyal'), ('latest_pop', '33000000'), ('area', '2250000')]\n",
      "[('name', 'Kingdom of Württemberg'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'German gold mark'), ('latest_pop', '2437574'), ('area', '19508')]\n",
      "[('name', 'Solomon Islands'), ('inc', '1978-01-01T00:00:00Z'), ('curname', 'Solomon Islands dollar'), ('latest_pop', '611343'), ('area', '28400')]\n",
      "[('name', 'Viceroyalty of New Spain'), ('inc', '1535-10-22T00:00:00Z'), ('curname', 'Spanish colonial real'), ('latest_pop', '20000000'), ('area', '7657000')]\n",
      "[('name', 'Rhodesia'), ('inc', '1965-11-11T00:00:00Z'), ('curname', 'Rhodesian dollar'), ('latest_pop', '6930000'), ('area', '390580')]\n",
      "[('name', 'Mongol Empire'), ('inc', '1206-01-01T00:00:00Z'), ('curname', 'Balysh'), ('latest_pop', '160000000'), ('area', '23500000')]\n",
      "[('name', 'Kingdom of Sicily'), ('inc', '1130-01-01T00:00:00Z'), ('curname', 'Tarì')]\n",
      "[('name', 'New Zealand'), ('inc', '1907-09-26T00:00:00Z'), ('curname', 'New Zealand dollar'), ('latest_pop', '5112300'), ('area', '268021')]\n",
      "[('name', 'Kingdom of Spain'), ('inc', '1700-01-01T00:00:00Z'), ('curname', 'Spanish real')]\n",
      "[('name', 'Lesotho'), ('inc', '1966-01-01T00:00:00Z'), ('curname', 'South African rand'), ('latest_pop', '2233339'), ('area', '30355')]\n",
      "[('name', 'Austria-Hungary'), ('inc', '1867-03-01T00:00:00Z'), ('curname', 'Austro-Hungarian krone'), ('latest_pop', '52800000'), ('area', '622269.55')]\n",
      "[('name', 'Maratha Empire'), ('inc', '1674-01-01T00:00:00Z'), ('curname', 'rupee')]\n",
      "[('name', 'Kingdom of Powys'), ('inc', '0500-01-01T00:00:00Z'), ('curname', 'denarius')]\n",
      "[('name', 'Eastern Rumelia'), ('inc', '1878-01-01T00:00:00Z'), ('curname', 'Ottoman lira'), ('latest_pop', '975030')]\n",
      "[('name', 'Kingdom of Hungary'), ('inc', '1920-02-29T00:00:00Z'), ('curname', 'Hungarian adópengő')]\n",
      "[('name', 'Duchy of Milan'), ('inc', '1395-05-19T00:00:00Z'), ('curname', 'Milanese scudo')]\n",
      "[('name', 'Grand Duchy of Baden'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'South German gulden')]\n",
      "[('name', 'Rhodesia'), ('inc', '1965-11-11T00:00:00Z'), ('curname', 'Rhodesian pound'), ('latest_pop', '6930000'), ('area', '390580')]\n",
      "[('name', 'Kingdom of Montenegro'), ('inc', '1910-01-01T00:00:00Z'), ('curname', 'Montenegrin perper'), ('latest_pop', '500000')]\n",
      "[('name', 'Marinid Dynasty'), ('inc', '1215-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Kingdom of Scotland'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'pound Scots'), ('latest_pop', '1250000'), ('area', '78782')]\n",
      "[('name', 'Sultanate of Zanzibar'), ('inc', '1856-10-19T00:00:00Z'), ('curname', 'Zanzibari rupee'), ('latest_pop', '300000'), ('area', '1651')]\n",
      "[('name', 'Province of New York'), ('inc', '1664-01-01T00:00:00Z'), ('curname', 'New York pound')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'groschen'), ('latest_pop', '3500000'), ('area', '132000')]\n",
      "[('name', 'Luyag na Kaboloan'), ('inc', '1406-01-01T00:00:00Z'), ('curname', 'silver')]\n",
      "[('name', 'Bogd Khanate'), ('inc', '1911-12-01T00:00:00Z'), ('curname', 'rubles'), ('latest_pop', '542504')]\n",
      "[('name', 'Empire of Japan'), ('inc', '1868-01-03T00:00:00Z'), ('curname', 'Japanese yen'), ('latest_pop', '97770000'), ('area', '7400000')]\n",
      "[('name', 'Mughal Empire'), ('inc', '1526-01-01T00:00:00Z'), ('curname', 'rupee'), ('latest_pop', '150000000'), ('area', '4000000')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'złoty'), ('latest_pop', '3500000'), ('area', '930000')]\n",
      "[('name', 'Austro-Hungarian rule in Bosnia and Herzegovina'), ('inc', '1878-01-01T00:00:00Z'), ('curname', 'Austro-Hungarian krone'), ('latest_pop', '1898044'), ('area', '51082')]\n",
      "[('name', 'United Kingdom'), ('inc', '1927-04-12T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '66022273'), ('area', '242495.406794')]\n",
      "[('name', 'Samanid Empire'), ('inc', '0819-01-01T00:00:00Z'), ('curname', 'dirham'), ('area', '2.85')]\n",
      "[('name', 'Ottoman Empire'), ('inc', '1299-08-05T00:00:00Z'), ('curname', 'kuruş'), ('area', '5200000')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'écu')]\n",
      "[('name', 'Tuvalu'), ('inc', '1978-01-01T00:00:00Z'), ('curname', 'Tuvaluan dollar'), ('latest_pop', '11192'), ('area', '26')]\n",
      "[('name', 'Achaemenid Empire'), ('inc', '-549-01-01T00:00:00Z'), ('curname', 'siglos'), ('latest_pop', '35000000'), ('area', '5500000')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'assignat')]\n",
      "[('name', 'Spanish Empire'), ('inc', '1492-01-01T00:00:00Z'), ('curname', 'peseta'), ('latest_pop', '60000000'), ('area', '20000000')]\n",
      "[('name', 'Duchy of Courland and Semigallia'), ('inc', '1561-01-01T00:00:00Z'), ('curname', 'thaler'), ('latest_pop', '200000'), ('area', '32000')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'groschen'), ('latest_pop', '3500000'), ('area', '200000')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1324-01-01T00:00:00Z'), ('curname', 'Sardinian lira'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Kingdom of Afghanistan'), ('inc', '1926-06-09T00:00:00Z'), ('curname', 'Afghan afghani')]\n",
      "[('name', 'Emirate of Afghanistan'), ('inc', '1823-01-01T00:00:00Z'), ('curname', 'Afghan afghani'), ('latest_pop', '5000000'), ('area', '652225')]\n",
      "[('name', 'Grand Duchy of Tuscany'), ('inc', '1569-09-06T00:00:00Z'), ('curname', 'Tuscan florin')]\n",
      "[('name', 'Kingdom of Gwynedd'), ('curname', 'Ceiniog')]\n",
      "[('name', 'Norway'), ('inc', '0900-01-01T00:00:00Z'), ('curname', 'Norwegian krone'), ('latest_pop', '5391369'), ('area', '385207')]\n",
      "[('name', 'Malacca sultanate'), ('inc', '1400-01-01T00:00:00Z'), ('curname', 'Tin ingot')]\n",
      "[('name', 'Bogd Khanate'), ('inc', '1911-12-01T00:00:00Z'), ('curname', 'tael'), ('latest_pop', '542504')]\n",
      "[('name', 'Australia'), ('inc', '1901-01-01T00:00:00Z'), ('curname', 'Australian dollar'), ('latest_pop', '24511800'), ('area', '7692024')]\n",
      "[('name', 'Kingdom of Naples'), ('inc', '1282-04-06T00:00:00Z'), ('curname', 'Neapolitan lira')]\n",
      "[('name', 'Serbian Empire'), ('inc', '1346-04-24T00:00:00Z'), ('curname', 'Serbian perper')]\n",
      "[('name', 'Shu Han'), ('inc', '0221-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'United Kingdom of Portugal, Brazil and the Algarves'), ('inc', '1815-12-16T00:00:00Z'), ('curname', 'Portuguese real')]\n",
      "[('name', 'East Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'solidus')]\n",
      "[('name', 'Kingdom of Yugoslavia'), ('inc', '1929-10-03T00:00:00Z'), ('curname', 'Yugoslav krone')]\n",
      "[('name', 'Ethiopian Empire'), ('curname', 'birr')]\n",
      "[('name', 'The Bahamas'), ('inc', '1973-01-01T00:00:00Z'), ('curname', 'Bahamian dollar'), ('latest_pop', '395361'), ('area', '13878')]\n",
      "[('name', \"Kievan Rus'\"), ('inc', '0860-01-01T00:00:00Z'), ('curname', 'Grivna'), ('latest_pop', '5400000'), ('area', '1330000')]\n",
      "[('name', 'Principality of Montenegro'), ('inc', '1852-01-01T00:00:00Z'), ('curname', 'Austro-Hungarian krone'), ('latest_pop', '317856'), ('area', '5.4759')]\n",
      "[('name', 'Kingdom of England'), ('inc', '0927-01-01T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '5750000')]\n",
      "[('name', 'Upper Peru'), ('curname', 'peseta')]\n",
      "[('name', 'Papal States'), ('inc', '0754-01-01T00:00:00Z'), ('curname', 'Papal lira'), ('area', '41407')]\n",
      "[('name', 'Zirid dynasty'), ('inc', '0972-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'Lithuanian long currency'), ('latest_pop', '3500000'), ('area', '132000')]\n",
      "[('name', 'Portuguese Empire'), ('inc', '1415-01-01T00:00:00Z'), ('curname', 'escudo')]\n",
      "[('name', 'Emirate of Bukhara'), ('inc', '1785-01-01T00:00:00Z'), ('curname', 'rubles')]\n",
      "[('name', 'West Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'triens')]\n",
      "[('name', 'Captaincy General of Puerto Rico'), ('inc', '1580-01-01T00:00:00Z'), ('curname', 'peseta')]\n",
      "[('name', 'Kingdom of Mercia'), ('inc', '0527-01-01T00:00:00Z'), ('curname', 'Anglo-Saxon pound')]\n",
      "[('name', 'State of Malta'), ('inc', '1964-09-21T00:00:00Z'), ('curname', 'pound sterling'), ('area', '316')]\n",
      "[('name', 'Western Roman Empire (395-476 AD)'), ('inc', '0395-01-18T00:00:00Z'), ('curname', 'Roman currency')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'Eiraku Tsūhō')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'groschen'), ('latest_pop', '3500000'), ('area', '250000')]\n",
      "[('name', 'First Mexican Empire'), ('inc', '1822-05-19T00:00:00Z'), ('curname', 'Mexican real'), ('latest_pop', '6500000'), ('area', '4925283')]\n",
      "[('name', 'Norway'), ('inc', '1905-10-26T00:00:00Z'), ('curname', 'Norwegian krone'), ('latest_pop', '5391369'), ('area', '385207')]\n",
      "[('name', 'Kingdom of Romania'), ('inc', '1881-01-01T00:00:00Z'), ('curname', 'Romanian leu')]\n",
      "[('name', 'Emirate of Bukhara'), ('inc', '1785-01-01T00:00:00Z'), ('curname', 'Bukharan tenga')]\n",
      "[('name', 'Luyag na Kaboloan'), ('inc', '1406-01-01T00:00:00Z'), ('curname', 'barter')]\n",
      "[('name', 'Austria-Hungary'), ('inc', '1867-03-01T00:00:00Z'), ('curname', 'Austro-Hungarian gulden'), ('latest_pop', '52800000'), ('area', '676615')]\n",
      "[('name', 'Kingdom of Castile'), ('inc', '1035-01-01T00:00:00Z'), ('curname', 'Spanish maravedí')]\n",
      "[('name', 'Pahlavi Dynasty'), ('inc', '1925-12-12T00:00:00Z'), ('curname', 'Iranian rial')]\n",
      "[('name', 'Territory of New Guinea'), ('inc', '1919-01-01T00:00:00Z'), ('curname', 'Australian pound')]\n",
      "[('name', 'Morocco'), ('inc', '-399-01-01T00:00:00Z'), ('curname', 'Moroccan dirham'), ('latest_pop', '36029138'), ('area', '710850')]\n",
      "[('name', 'Emirate of Afghanistan'), ('inc', '1823-01-01T00:00:00Z'), ('curname', 'Afghan rupee'), ('latest_pop', '5000000'), ('area', '652225')]\n",
      "[('name', 'Union of South Africa'), ('inc', '1910-05-31T00:00:00Z'), ('curname', 'South African rand'), ('latest_pop', '18216000'), ('area', '2045320')]\n",
      "[('name', 'Timurid Empire'), ('inc', '1370-01-01T00:00:00Z'), ('curname', 'dinar'), ('area', '4400000')]\n",
      "[('name', 'Saint-Domingue'), ('inc', '1626-01-01T00:00:00Z'), ('curname', 'Haitian livre'), ('area', '21550')]\n",
      "[('name', 'Ayyubid dynasty'), ('inc', '1171-01-01T00:00:00Z'), ('curname', 'Islamic Dirham')]\n",
      "[('name', 'Dominion of Pakistan'), ('inc', '1947-01-01T00:00:00Z'), ('curname', 'Pakistani rupee')]\n",
      "[('name', 'United Kingdom of Great Britain and Ireland'), ('inc', '1801-01-01T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '45370530'), ('area', '315093')]\n",
      "[('name', 'Kingdom of Deheubarth'), ('inc', '0920-01-01T00:00:00Z'), ('curname', 'Ceiniog')]\n",
      "[('name', 'Toro Kingdom'), ('inc', '1830-01-01T00:00:00Z'), ('curname', 'Ugandan shilling')]\n",
      "[('name', 'Islamic State of Iraq and the Levant'), ('inc', '1999-01-01T00:00:00Z'), ('curname', 'Islamic State Dinar')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'chuzan-tsuho')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'Lithuanian long currency'), ('latest_pop', '3500000'), ('area', '930000')]\n",
      "[('name', 'Canada'), ('inc', '1867-07-01T00:00:00Z'), ('curname', 'Canadian dollar'), ('latest_pop', '37894799'), ('area', '9984670')]\n",
      "[('name', 'Kingdom of Ireland'), ('inc', '1542-01-01T00:00:00Z'), ('curname', 'Irish pound'), ('area', '84000')]\n",
      "[('name', 'Sweden'), ('inc', '0700-01-01T00:00:00Z'), ('curname', 'Swedish krona'), ('latest_pop', '10409248'), ('area', '528861.06')]\n",
      "[('name', 'Second Mexican Empire'), ('inc', '1864-01-01T00:00:00Z'), ('curname', 'Mexican peso')]\n",
      "[('name', 'Sallarid dynasty'), ('inc', '0941-01-01T00:00:00Z'), ('curname', 'dirham')]\n",
      "[('name', 'Kingdom of Italy'), ('inc', '0476-09-05T00:00:00Z'), ('curname', 'solidus')]\n",
      "[('name', 'Bogd Khanate'), ('inc', '1911-12-01T00:00:00Z'), ('curname', 'Mongolian dollar'), ('latest_pop', '542504')]\n",
      "[('name', 'Roman Empire'), ('curname', 'sestertius')]\n",
      "[('name', 'Tsardom of Russia'), ('inc', '1547-01-01T00:00:00Z'), ('curname', 'rubles'), ('latest_pop', '14000000'), ('area', '3000000')]\n",
      "[('name', 'United Kingdom of the Netherlands'), ('inc', '1815-01-01T00:00:00Z'), ('curname', 'Dutch guilder')]\n",
      "[('name', 'Vatican City'), ('inc', '1929-02-11T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '1000'), ('area', '0.440297')]\n",
      "[('name', 'Parthian Empire'), ('inc', '-246-01-01T00:00:00Z'), ('curname', 'Parthian coins'), ('latest_pop', '20000000')]\n",
      "[('name', 'Taifa of Algeciras'), ('inc', '1035-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Spanish Empire'), ('inc', '1492-01-01T00:00:00Z'), ('curname', 'Spanish real'), ('latest_pop', '60000000'), ('area', '20000000')]\n",
      "[('name', 'Qin'), ('inc', '-904-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'Grand Duchy of Tuscany'), ('inc', '1569-09-06T00:00:00Z'), ('curname', 'Tuscan pound')]\n",
      "[('name', 'Erivan Khanate'), ('inc', '1736-01-01T00:00:00Z'), ('curname', 'Qarapul'), ('latest_pop', '110120'), ('area', '19400')]\n",
      "[('name', 'Almoravid dynasty'), ('inc', '1040-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Goryeo'), ('inc', '0918-01-01T00:00:00Z'), ('curname', 'Korean mun'), ('latest_pop', '2100000'), ('area', '220750')]\n",
      "[('name', 'West Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'solidus')]\n",
      "[('name', 'Kingdom of the Netherlands'), ('inc', '1815-03-16T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '17100715'), ('area', '42201')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'Lithuanian long currency'), ('latest_pop', '3500000'), ('area', '200000')]\n",
      "[('name', 'British Solomon Islands'), ('inc', '1893-03-15T00:00:00Z'), ('curname', 'Australian pound'), ('latest_pop', '196823')]\n",
      "[('name', 'Gay and Lesbian Kingdom of the Coral Sea Islands'), ('inc', '2004-06-14T00:00:00Z'), ('curname', 'euro')]\n",
      "[('name', 'Erivan Khanate'), ('inc', '1736-01-01T00:00:00Z'), ('curname', 'Iranian toman'), ('latest_pop', '110120'), ('area', '19400')]\n",
      "[('name', 'British India'), ('inc', '1858-01-01T00:00:00Z'), ('curname', 'Indian rupee'), ('area', '4917273')]\n",
      "[('name', 'Captaincy General of Puerto Rico'), ('inc', '1580-01-01T00:00:00Z'), ('curname', 'Puerto Rican peso')]\n",
      "[('name', 'Hammadid dynasty'), ('inc', '1014-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Kingdom of Greece'), ('inc', '1832-01-01T00:00:00Z'), ('curname', 'Greek drachma')]\n",
      "[('name', 'Kura Khanate'), ('inc', '1812-01-01T00:00:00Z'), ('curname', 'rubles')]\n",
      "[('name', 'Kingdom of Portugal'), ('inc', '1139-07-26T00:00:00Z'), ('curname', 'Portuguese real'), ('latest_pop', '5400000')]\n",
      "[('name', 'Saint Lucia'), ('inc', '1979-02-22T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '178844'), ('area', '617.012867')]\n",
      "[('name', 'Saint Lucia'), ('inc', '1967-03-01T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '178844'), ('area', '617.012867')]\n",
      "[('name', 'Sultanate of Egypt'), ('inc', '1914-12-19T00:00:00Z'), ('curname', 'Egyptian pound'), ('latest_pop', '12751000'), ('area', '3418400')]\n",
      "[('name', 'Kingdom of France'), ('inc', '1791-09-04T00:00:00Z'), ('curname', 'assignat')]\n",
      "[('name', 'East Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'denarius')]\n",
      "[('name', 'Sultanate of Sulu'), ('inc', '1405-01-01T00:00:00Z'), ('curname', 'barter')]\n",
      "[('name', 'Umayyad Caliphate'), ('inc', '0661-01-01T00:00:00Z'), ('curname', 'Umayyad dinar (currency unit)'), ('latest_pop', '70000000'), ('area', '6000000')]\n",
      "[('name', 'Safavid Empire'), ('inc', '1501-01-01T00:00:00Z'), ('curname', 'dinar'), ('latest_pop', '20000000'), ('area', '2850000')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'złoty'), ('latest_pop', '3500000'), ('area', '132000')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'French franc')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', 'French livre')]\n",
      "[('name', 'Barbados'), ('inc', '1966-11-30T00:00:00Z'), ('curname', 'Barbadian dollar'), ('latest_pop', '285719'), ('area', '439')]\n",
      "[('name', 'New France'), ('inc', '1534-01-01T00:00:00Z'), ('curname', 'New France livre')]\n",
      "[('name', 'Qutb Shahi dynasty'), ('inc', '1518-01-01T00:00:00Z'), ('curname', 'Mohur')]\n",
      "[('name', 'Mongol Empire'), ('inc', '1206-01-01T00:00:00Z'), ('curname', 'Balysh'), ('latest_pop', '160000000'), ('area', '4000000')]\n",
      "[('name', 'Province of South Carolina'), ('inc', '1712-01-24T00:00:00Z'), ('curname', 'South Carolina pound')]\n",
      "[('name', 'Kingdom of Württemberg'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'Württemberg gulden'), ('latest_pop', '2437574'), ('area', '19508')]\n",
      "[('name', 'Empire of Brazil'), ('inc', '1822-09-07T00:00:00Z'), ('curname', 'Brazilian real')]\n",
      "[('name', 'West Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'pfennig')]\n",
      "[('name', 'Saint Kitts and Nevis'), ('inc', '1967-02-27T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '55345'), ('area', '269.358763')]\n",
      "[('name', 'Kingdom of Hejaz'), ('inc', '1916-06-10T00:00:00Z'), ('curname', 'Hejaz riyal'), ('latest_pop', '850000')]\n",
      "[('name', 'Jordan'), ('inc', '1946-01-01T00:00:00Z'), ('curname', 'Jordanian dinar'), ('latest_pop', '10428241'), ('area', '89341')]\n",
      "[('name', 'Duchy of Parma'), ('inc', '1545-01-01T00:00:00Z'), ('curname', 'Parman lira')]\n",
      "[('name', 'Kingdom of Nepal'), ('inc', '1768-09-25T00:00:00Z'), ('curname', 'Nepalese mohar')]\n",
      "[('name', 'Spanish Empire'), ('inc', '1492-01-01T00:00:00Z'), ('curname', 'spanish dollar'), ('latest_pop', '60000000'), ('area', '20000000')]\n",
      "[('name', 'Qing dynasty'), ('inc', '1636-01-01T00:00:00Z'), ('curname', 'tael'), ('latest_pop', '432000000'), ('area', '14700000')]\n",
      "[('name', 'Duchy of Nassau'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'Kronenthaler'), ('latest_pop', '465636'), ('area', '4855')]\n",
      "[('name', 'Ladonia'), ('inc', '1996-06-02T00:00:00Z'), ('curname', 'Örtug')]\n",
      "[('name', 'Bechuanaland Protectorate'), ('inc', '1885-01-01T00:00:00Z'), ('curname', 'pound sterling')]\n",
      "[('name', 'New Zealand'), ('inc', '1986-12-13T00:00:00Z'), ('curname', 'New Zealand dollar'), ('latest_pop', '5112300'), ('area', '268021')]\n",
      "[('name', 'British Solomon Islands'), ('inc', '1893-03-15T00:00:00Z'), ('curname', 'Solomon Islands dollar'), ('latest_pop', '196823')]\n",
      "[('name', 'Mataram Sultanate'), ('inc', '1586-01-01T00:00:00Z'), ('curname', 'dirham')]\n",
      "[('name', 'Almohad Caliphate'), ('inc', '1121-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Danish Realm'), ('inc', '0800-01-01T00:00:00Z'), ('curname', 'Danish krone'), ('latest_pop', '5930987'), ('area', '2220930')]\n",
      "[('name', 'Kingdom of Serbs, Croats and Slovenes'), ('inc', '1918-12-01T00:00:00Z'), ('curname', 'Yugoslav dinar'), ('latest_pop', '11984911'), ('area', '247542')]\n",
      "[('name', 'Kingdom of Sicily'), ('inc', '1848-03-25T00:00:00Z'), ('curname', 'Tarì')]\n",
      "[('name', 'Eswatini'), ('inc', '1968-09-06T00:00:00Z'), ('curname', 'lilangeni'), ('latest_pop', '1124753'), ('area', '17364')]\n",
      "[('name', 'Archbishop of Riga'), ('inc', '1186-01-01T00:00:00Z'), ('curname', 'penny')]\n",
      "[('name', 'Antigua and Barbuda'), ('inc', '1981-11-01T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '102012'), ('area', '440.29')]\n",
      "[('name', 'Kingdom of Tahiti'), ('inc', '1788-01-01T00:00:00Z'), ('curname', 'pound sterling'), ('area', '1193.3')]\n",
      "[('name', 'Belgium'), ('inc', '1830-10-04T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '11431406'), ('area', '30528')]\n",
      "[('name', 'Travancore'), ('inc', '1729-01-01T00:00:00Z'), ('curname', 'Travancore rupee')]\n",
      "[('name', 'Kenmu Restoration'), ('inc', '1333-01-01T00:00:00Z'), ('curname', 'ryō')]\n",
      "[('name', 'Cambodia'), ('inc', '1953-11-09T00:00:00Z'), ('curname', 'riel'), ('latest_pop', '16005373'), ('area', '181035')]\n",
      "[('name', 'Kingdom of Bulgaria'), ('inc', '1908-01-01T00:00:00Z'), ('curname', 'Bulgarian lev'), ('latest_pop', '7029349'), ('area', '153459.6')]\n",
      "[('name', 'Kingdom of Etruria'), ('inc', '1801-03-21T00:00:00Z'), ('curname', 'Tuscan pound')]\n",
      "[('name', 'Bishopric of Brandenburg'), ('inc', '1165-01-01T00:00:00Z'), ('curname', 'Reichsthaler')]\n",
      "[('name', 'July Monarchy'), ('inc', '1830-01-01T00:00:00Z'), ('curname', 'French franc'), ('latest_pop', '34689000')]\n",
      "[('name', 'Javad khanate'), ('inc', '1747-01-01T00:00:00Z'), ('curname', 'Abbasi'), ('latest_pop', '9000'), ('area', '4.956')]\n",
      "[('name', 'Tsardom of Russia'), ('inc', '1547-01-01T00:00:00Z'), ('curname', 'rubles'), ('latest_pop', '14000000'), ('area', '14500000')]\n",
      "[('name', 'Kingdom of Candia'), ('inc', '1205-01-01T00:00:00Z'), ('curname', 'ducat')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'Lithuanian long currency'), ('latest_pop', '3500000'), ('area', '250000')]\n",
      "[('name', 'Lesotho'), ('inc', '1966-01-01T00:00:00Z'), ('curname', 'Lesotho loti'), ('latest_pop', '2233339'), ('area', '30355')]\n",
      "[('name', 'Congo Free State'), ('inc', '1885-01-01T00:00:00Z'), ('curname', 'Congolese franc'), ('area', '2345410')]\n",
      "[('name', 'Swedish overseas colonies'), ('inc', '1638-01-01T00:00:00Z'), ('curname', 'Swedish riksdaler')]\n",
      "[('name', 'Kingdom of the Algarve'), ('inc', '1242-01-01T00:00:00Z'), ('curname', 'Portuguese dinheiro')]\n",
      "[('name', 'Netherlands'), ('inc', '1954-12-15T00:00:00Z'), ('curname', 'euro'), ('latest_pop', '17282163'), ('area', '41543')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'złoty'), ('latest_pop', '3500000'), ('area', '320000')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1713-01-01T00:00:00Z'), ('curname', 'Piedmontese scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Kingdom of Iraq'), ('inc', '1921-01-01T00:00:00Z'), ('curname', 'Iraqi dinar'), ('latest_pop', '6488000'), ('area', '4370722')]\n",
      "[('name', 'Kingdom of Bavaria'), ('inc', '1806-01-01T00:00:00Z'), ('curname', 'Bavarian gulden'), ('latest_pop', '3231570'), ('area', '1636.5')]\n",
      "[('name', 'Kingdom of Croatia-Slavonia'), ('inc', '1868-01-01T00:00:00Z'), ('curname', 'Austro-Hungarian gulden'), ('latest_pop', '2621954'), ('area', '42535.25')]\n",
      "[('name', 'Kingdom of Wessex'), ('inc', '0519-01-01T00:00:00Z'), ('curname', 'sceat')]\n",
      "[('name', 'Congo Free State'), ('inc', '1885-01-01T00:00:00Z'), ('curname', 'Belgian franc'), ('area', '2345410')]\n",
      "[('name', 'Byzantine Empire'), ('inc', '0395-01-18T00:00:00Z'), ('curname', 'ducat'), ('latest_pop', '17000000')]\n",
      "[('name', 'British India'), ('inc', '1858-01-01T00:00:00Z'), ('curname', 'Indian rupee'), ('area', '4238773')]\n",
      "[('name', 'Papua New Guinea'), ('inc', '1975-01-01T00:00:00Z'), ('curname', 'kina'), ('latest_pop', '8935000'), ('area', '462840')]\n",
      "[('name', 'Duchy of Lucca'), ('inc', '1815-01-01T00:00:00Z'), ('curname', 'Luccan pound')]\n",
      "[('name', 'Umayyad Caliphate'), ('inc', '0661-01-01T00:00:00Z'), ('curname', 'Umayyad dirham (currency unit)'), ('latest_pop', '70000000'), ('area', '6000000')]\n",
      "[('name', 'Roman Empire'), ('curname', 'Roman currency')]\n",
      "[('name', 'Colony of Natal'), ('inc', '1843-01-01T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '1108754'), ('area', '91610')]\n",
      "[('name', 'Central African Empire'), ('inc', '1976-12-04T00:00:00Z'), ('curname', 'Central African CFA franc'), ('latest_pop', '3000000'), ('area', '622984')]\n",
      "[('name', 'Tibet'), ('inc', '1912-01-01T00:00:00Z'), ('curname', 'Tibetan srang'), ('area', '1221600')]\n",
      "[('name', 'British Empire'), ('inc', '1583-01-01T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '680000000')]\n",
      "[('name', 'Qajar Iran'), ('inc', '1785-01-01T00:00:00Z'), ('curname', 'Iranian qiran')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1713-01-01T00:00:00Z'), ('curname', 'Sardinian lira'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inc', '1236-01-01T00:00:00Z'), ('curname', 'groschen'), ('latest_pop', '3500000'), ('area', '320000')]\n",
      "[('name', 'Kingdom of Spain'), ('inc', '1700-01-01T00:00:00Z'), ('curname', 'Spanish maravedí')]\n",
      "[('name', 'Kingdom of Hungary'), ('inc', '1920-02-29T00:00:00Z'), ('curname', 'Hungarian korona')]\n",
      "[('name', 'Kingdom of Albania'), ('inc', '1928-09-01T00:00:00Z'), ('curname', 'Franga'), ('latest_pop', '1003097')]\n",
      "[('name', 'Kingdom of Sikkim'), ('inc', '1642-01-01T00:00:00Z'), ('curname', 'paisa')]\n",
      "[('name', 'Kingdom of Libya'), ('inc', '1951-12-24T00:00:00Z'), ('curname', 'Libyan pound'), ('latest_pop', '1091830'), ('area', '1759530')]\n",
      "[('name', 'Islands of Refreshment'), ('inc', '1811-02-04T00:00:00Z'), ('curname', 'spanish dollar')]\n",
      "[('name', 'Kingdom of Spain'), ('inc', '1700-01-01T00:00:00Z'), ('curname', 'Spanish escudo')]\n",
      "[('name', 'Kingdom of Sicily'), ('inc', '1848-03-25T00:00:00Z'), ('curname', 'Carlino')]\n",
      "[('name', 'Ottoman Empire'), ('inc', '1299-08-05T00:00:00Z'), ('curname', 'Ottoman lira'), ('area', '5200000')]\n",
      "[('name', 'East Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'pfennig')]\n",
      "[('name', 'Brunei'), ('inc', '1984-01-01T00:00:00Z'), ('curname', 'Brunei dollar'), ('latest_pop', '428697'), ('area', '5765.313533')]\n",
      "[('name', 'Dominion of Fiji'), ('inc', '1970-01-01T00:00:00Z'), ('curname', 'Fijian dollar'), ('latest_pop', '588068'), ('area', '18.274')]\n",
      "[('name', 'Sui dynasty'), ('inc', '0581-01-01T00:00:00Z'), ('curname', 'ancient Chinese coinage')]\n",
      "[('name', 'Aro Confederacy'), ('inc', '1690-01-01T00:00:00Z'), ('curname', 'Manilla')]\n",
      "[('name', 'Kushan Empire'), ('inc', '0030-01-01T00:00:00Z'), ('curname', 'Kushan coinage')]\n",
      "[('name', 'Qajar Iran'), ('inc', '1785-01-01T00:00:00Z'), ('curname', 'Iranian toman')]\n",
      "[('name', 'Papal States'), ('inc', '0754-01-01T00:00:00Z'), ('curname', 'Roman scudo'), ('area', '41407')]\n",
      "[('name', 'Achaemenid Empire'), ('inc', '-549-01-01T00:00:00Z'), ('curname', 'Persian daric'), ('latest_pop', '35000000'), ('area', '5500000')]\n",
      "[('name', 'Umayyad Caliphate'), ('inc', '0661-01-01T00:00:00Z'), ('curname', 'Umayyad fals (currency unit)'), ('latest_pop', '70000000'), ('area', '6000000')]\n",
      "[('name', 'German Empire of 1848/1849'), ('inc', '1848-06-28T00:00:00Z'), ('curname', 'Reichsthaler')]\n",
      "[('name', 'Habsburg Spain'), ('inc', '1516-01-01T00:00:00Z'), ('curname', 'Spanish real')]\n",
      "[('name', 'Grenada'), ('inc', '1974-01-01T00:00:00Z'), ('curname', 'Eastern Caribbean dollar'), ('latest_pop', '107825'), ('area', '348.5')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1720-01-01T00:00:00Z'), ('curname', 'Piedmontese scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Ayyubid dynasty'), ('inc', '1171-01-01T00:00:00Z'), ('curname', 'gold dinar')]\n",
      "[('name', 'Kingdom of Slavonia'), ('inc', '1699-01-01T00:00:00Z'), ('curname', 'Austro-Hungarian gulden')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inc', '1324-01-01T00:00:00Z'), ('curname', 'Sardinian scudo'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Margraviate of Baden-Durlach'), ('inc', '1515-01-01T00:00:00Z'), ('curname', 'guilder'), ('latest_pop', '90000')]\n",
      "[('name', 'West Francia'), ('inc', '0843-01-01T00:00:00Z'), ('curname', 'denarius')]\n",
      "[('name', 'Japan'), ('inc', '1947-05-03T00:00:00Z'), ('curname', 'Japanese yen'), ('latest_pop', '126434565'), ('area', '377972.28')]\n",
      "[('name', 'Province of New York'), ('inc', '1664-01-01T00:00:00Z'), ('curname', 'pound sterling')]\n",
      "[('name', 'Sultanate of Maguindanao'), ('inc', '1300-01-01T00:00:00Z'), ('curname', 'barter')]\n",
      "[('name', 'Raj of Sarawak'), ('inc', '1841-09-24T00:00:00Z'), ('curname', 'Sarawak dollar')]\n",
      "[('name', 'Upper Peru'), ('curname', 'Spanish escudo')]\n",
      "[('name', 'Xia dynasty'), ('inc', '-2069-01-01T00:00:00Z'), ('curname', 'Cypraea')]\n",
      "[('name', 'Emirate of Cyrenaica'), ('inc', '1949-01-01T00:00:00Z'), ('curname', 'Egyptian pound')]\n",
      "[('name', 'Grand Duchy of Finland'), ('inc', '1809-01-01T00:00:00Z'), ('curname', 'Swedish riksdaler'), ('area', '360000')]\n",
      "[('name', 'Kingdom of Cappadocia'), ('inc', '-320-01-01T00:00:00Z'), ('curname', 'Drachma')]\n",
      "[('name', 'British Solomon Islands'), ('inc', '1893-03-15T00:00:00Z'), ('curname', 'Australian dollar'), ('latest_pop', '196823')]\n",
      "[('name', 'Netherlands Antilles'), ('inc', '1954-12-15T00:00:00Z'), ('curname', 'Netherlands Antillean guilder'), ('latest_pop', '197041'), ('area', '800')]\n",
      "[('name', 'Khedivate of Egypt'), ('inc', '1867-06-08T00:00:00Z'), ('curname', 'Egyptian pound'), ('area', '1001449')]\n",
      "[('name', 'Sultanate of Zanzibar'), ('inc', '1856-10-19T00:00:00Z'), ('curname', 'East African shilling'), ('latest_pop', '300000'), ('area', '1651')]\n",
      "[('name', 'Kingdom of Burundi'), ('inc', '1680-01-01T00:00:00Z'), ('curname', 'German East African rupie')]\n",
      "[('name', 'Grand Duchy of Finland'), ('inc', '1809-01-01T00:00:00Z'), ('curname', 'Finnish markka'), ('area', '360000')]\n",
      "[('name', 'Ryukyu Kingdom'), ('inc', '1429-01-01T00:00:00Z'), ('curname', 'kanamaru-seiho')]\n",
      "[('name', 'Byzantine Empire'), ('inc', '0395-01-18T00:00:00Z'), ('curname', 'Byzantine coinage'), ('latest_pop', '17000000')]\n",
      "[('name', 'Zhou dynasty'), ('inc', '-1045-01-01T00:00:00Z'), ('curname', 'Spade money')]\n",
      "[('name', 'Qing dynasty'), ('inc', '1636-01-01T00:00:00Z'), ('curname', 'Dà Qīng Bǎo Chāo'), ('latest_pop', '432000000'), ('area', '14700000')]\n",
      "[('name', 'Jersey'), ('inc', '1651-12-12T00:00:00Z'), ('curname', 'pound sterling'), ('latest_pop', '105500'), ('area', '118.2')]\n",
      "[('name', 'Tulunid emirate'), ('inc', '0868-01-01T00:00:00Z'), ('curname', 'dinar')]\n",
      "[('name', 'Jersey'), ('inc', '1651-12-12T00:00:00Z'), ('curname', 'Jersey pound'), ('latest_pop', '105500'), ('area', '118.2')]\n",
      "[('name', 'Saint Christopher-Nevis-Anguilla'), ('inc', '1958-01-01T00:00:00Z'), ('curname', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Danish Realm'), ('inc', '0800-01-01T00:00:00Z'), ('curname', 'Faroese króna'), ('latest_pop', '5930987'), ('area', '2220930')]\n",
      "[('name', 'Malaya'), ('inc', '1948-01-01T00:00:00Z'), ('curname', 'Malaya and British Borneo dollar'), ('area', '1323642')]\n",
      "[('name', 'Kingdom of France'), ('inc', '0987-01-01T00:00:00Z'), ('curname', \"Louis d'or\")]\n",
      "[('name', 'Ashikaga shogunate'), ('inc', '1338-01-01T00:00:00Z'), ('curname', 'Japanese mon')]\n",
      "[('name', 'Kingdom of Tahiti'), ('inc', '1788-01-01T00:00:00Z'), ('curname', 'French franc'), ('area', '1193.3')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "425"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?name ?inc ?curname (MAX(?pop) AS ?latest_pop) ?area WHERE { \n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269.\n",
    "\n",
    "OPTIONAL{?mon wdt:P571 ?inc.}\n",
    "OPTIONAL{?mon wdt:P38 ?cur.}\n",
    "OPTIONAL{?mon wdt:P1082 ?pop.}\n",
    "OPTIONAL{?mon wdt:P2046 ?area.}\n",
    "    \n",
    "?mon <http://schema.org/name> ?name.\n",
    "?cur <http://schema.org/name> ?curname.\n",
    "} \n",
    "GROUP BY ?name ?inc ?curname ?area\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9309ff57-228e-4c6e-9d62-c07f1eae58cd",
   "metadata": {},
   "source": [
    "#### I see that there are a lot of repetitions as some monarchies have more inception dates, so i clean the results to get the oldest inception date and latest measurement of the population"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "35c0214c-3f40-4f9e-811b-ad6db42474ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Bahrain'), ('date', '1971-08-14T00:00:00Z'), ('latest_pop', '1492584'), ('currencies', 'Bahraini dinar')]\n",
      "[('name', 'United Kingdom of Great Britain and Ireland'), ('date', '1801-01-01T00:00:00Z'), ('latest_pop', '45370530'), ('currencies', 'pound sterling')]\n",
      "[('name', 'Kingdom of Italy'), ('date', '1861-03-17T00:00:00Z'), ('latest_pop', '42399000'), ('currencies', 'Italian lira')]\n",
      "[('name', 'Saint Vincent and the Grenadines'), ('date', '1979-01-01T00:00:00Z'), ('latest_pop', '109897'), ('currencies', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Malaysia'), ('date', '1957-01-01T00:00:00Z'), ('latest_pop', '31624264'), ('currencies', 'Malaysian ringgit')]\n",
      "[('name', 'Saint Kitts and Nevis'), ('date', '1967-02-27T00:00:00Z'), ('latest_pop', '55345'), ('currencies', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Byzantine Empire'), ('date', '0395-01-18T00:00:00Z'), ('latest_pop', '17000000'), ('currencies', 'Byzantine coinage,ducat,solidus')]\n",
      "[('name', 'Bogd Khanate'), ('date', '1911-12-01T00:00:00Z'), ('latest_pop', '542504'), ('currencies', 'rubles,tael,Mongolian dollar')]\n",
      "[('name', 'Union of South Africa'), ('date', '1910-05-31T00:00:00Z'), ('latest_pop', '18216000'), ('currencies', 'South African rand,South African pound')]\n",
      "[('name', 'Austro-Hungarian rule in Bosnia and Herzegovina'), ('date', '1878-01-01T00:00:00Z'), ('latest_pop', '1898044'), ('currencies', 'Austro-Hungarian krone')]\n",
      "[('name', 'Taungoo Dynasty'), ('date', '1485-01-01T00:00:00Z'), ('latest_pop', '3000000'), ('currencies', 'kyat')]\n",
      "[('name', 'Kingdom of England'), ('date', '0927-01-01T00:00:00Z'), ('latest_pop', '5750000'), ('currencies', 'pound sterling')]\n",
      "[('name', 'Margraviate of Baden-Durlach'), ('date', '1515-01-01T00:00:00Z'), ('latest_pop', '90000'), ('currencies', 'guilder')]\n",
      "[('name', 'Kingdom of Scotland'), ('date', '0843-01-01T00:00:00Z'), ('latest_pop', '1250000'), ('currencies', 'pound Scots')]\n",
      "[('name', 'Colony of Natal'), ('date', '1843-01-01T00:00:00Z'), ('latest_pop', '1108754'), ('currencies', 'pound sterling')]\n",
      "[('name', 'Austria-Hungary'), ('date', '1867-03-01T00:00:00Z'), ('latest_pop', '52800000'), ('currencies', 'Austro-Hungarian krone,Austro-Hungarian gulden')]\n",
      "[('name', 'Kingdom of Libya'), ('date', '1951-12-24T00:00:00Z'), ('latest_pop', '1091830'), ('currencies', 'Libyan pound')]\n",
      "[('name', 'Sultanate of Zanzibar'), ('date', '1856-10-19T00:00:00Z'), ('latest_pop', '300000'), ('currencies', 'East African shilling,Zanzibari rupee')]\n",
      "[('name', 'Kingdom of Albania'), ('date', '1928-09-01T00:00:00Z'), ('latest_pop', '1003097'), ('currencies', 'Franga')]\n",
      "[('name', 'Liechtenstein'), ('date', '1806-07-12T00:00:00Z'), ('latest_pop', '37922'), ('currencies', 'Swiss franc')]\n",
      "[('name', 'Dominion of Fiji'), ('date', '1970-01-01T00:00:00Z'), ('latest_pop', '588068'), ('currencies', 'Fijian dollar')]\n",
      "[('name', 'Francoist Spain'), ('date', '1939-04-01T00:00:00Z'), ('latest_pop', '35563535'), ('currencies', 'peseta')]\n",
      "[('name', 'Umayyad Caliphate'), ('date', '0661-01-01T00:00:00Z'), ('latest_pop', '70000000'), ('currencies', 'Umayyad fals (currency unit),Umayyad dinar (currency unit),Umayyad dirham (currency unit)')]\n",
      "[('name', 'Joseon'), ('date', '1392-08-13T00:00:00Z'), ('latest_pop', '13000000'), ('currencies', 'Korean mun')]\n",
      "[('name', 'Kingdom of Georgia'), ('date', '1008-01-01T00:00:00Z'), ('latest_pop', '2500000'), ('currencies', 'Georgian lari')]\n",
      "[('name', 'Northern Ireland'), ('date', '1921-05-08T00:00:00Z'), ('latest_pop', '1852168'), ('currencies', 'pound sterling')]\n",
      "[('name', 'Kingdom of Sardinia'), ('date', '1324-01-01T00:00:00Z'), ('latest_pop', '5167000'), ('currencies', 'Sardinian lira,Piedmontese scudo,Sardinian scudo')]\n",
      "[('name', 'Danish Realm'), ('date', '0800-01-01T00:00:00Z'), ('latest_pop', '5930987'), ('currencies', 'Danish krone,Faroese króna')]\n",
      "[('name', 'Tuvalu'), ('date', '1978-01-01T00:00:00Z'), ('latest_pop', '11192'), ('currencies', 'Australian dollar,Tuvaluan dollar')]\n",
      "[('name', 'Norway'), ('date', '0900-01-01T00:00:00Z'), ('latest_pop', '5391369'), ('currencies', 'Norwegian krone')]\n",
      "[('name', 'Japan'), ('date', '1947-05-03T00:00:00Z'), ('latest_pop', '126434565'), ('currencies', 'Japanese yen')]\n",
      "[('name', 'First Mexican Empire'), ('date', '1822-05-19T00:00:00Z'), ('latest_pop', '6500000'), ('currencies', 'Mexican real')]\n",
      "[('name', 'Denmark'), ('date', '0800-01-01T00:00:00Z'), ('latest_pop', '5827463'), ('currencies', 'Danish krone')]\n",
      "[('name', 'Kuwait'), ('date', '1991-02-26T00:00:00Z'), ('latest_pop', '4600000'), ('currencies', 'Kuwaiti dinar')]\n",
      "[('name', 'Erivan Khanate'), ('date', '1736-01-01T00:00:00Z'), ('latest_pop', '110120'), ('currencies', 'Iranian toman,Qarapul')]\n",
      "[('name', 'Tsardom of Russia'), ('date', '1547-01-01T00:00:00Z'), ('latest_pop', '14000000'), ('currencies', 'rubles')]\n",
      "[('name', 'Kingdom of Serbs, Croats and Slovenes'), ('date', '1918-12-01T00:00:00Z'), ('latest_pop', '11984911'), ('currencies', 'Yugoslav dinar')]\n",
      "[('name', 'Safavid Empire'), ('date', '1501-01-01T00:00:00Z'), ('latest_pop', '20000000'), ('currencies', 'Abbasi,dinar,Iranian toman')]\n",
      "[('name', 'Canada'), ('date', '1867-07-01T00:00:00Z'), ('latest_pop', '37894799'), ('currencies', 'Canadian dollar')]\n",
      "[('name', 'Duchy of Nassau'), ('date', '1806-01-01T00:00:00Z'), ('latest_pop', '465636'), ('currencies', 'Kronenthaler')]\n",
      "[('name', 'Jamaica'), ('date', '1962-01-01T00:00:00Z'), ('latest_pop', '2890299'), ('currencies', 'Jamaican dollar')]\n",
      "[('name', 'Netherlands Antilles'), ('date', '1954-12-15T00:00:00Z'), ('latest_pop', '197041'), ('currencies', 'Netherlands Antillean guilder')]\n",
      "[('name', 'South Kasai'), ('date', '1960-01-01T00:00:00Z'), ('latest_pop', '1000000'), ('currencies', 'Congolese franc')]\n",
      "[('name', 'Kingdom of Laos'), ('date', '1947-01-01T00:00:00Z'), ('latest_pop', '3100000'), ('currencies', 'Lao kip')]\n",
      "[('name', \"Kievan Rus'\"), ('date', '0860-01-01T00:00:00Z'), ('latest_pop', '5400000'), ('currencies', 'nogata,Grivna,kuna')]\n",
      "[('name', 'Goryeo'), ('date', '0918-01-01T00:00:00Z'), ('latest_pop', '2100000'), ('currencies', 'Korean mun')]\n",
      "[('name', 'United Arab Emirates'), ('date', '1971-01-01T00:00:00Z'), ('latest_pop', '9890400'), ('currencies', 'United Arab Emirates dirham')]\n",
      "[('name', 'Principality of Sealand'), ('date', '1967-09-02T00:00:00Z'), ('latest_pop', '27'), ('currencies', 'Coins and postage stamps of Sealand')]\n",
      "[('name', 'Sultanate of Egypt'), ('date', '1914-12-19T00:00:00Z'), ('latest_pop', '12751000'), ('currencies', 'Egyptian pound')]\n",
      "[('name', 'Spanish Empire'), ('date', '1492-01-01T00:00:00Z'), ('latest_pop', '60000000'), ('currencies', 'Spanish real,peseta,spanish dollar')]\n",
      "[('name', 'Kingdom of Iraq'), ('date', '1921-01-01T00:00:00Z'), ('latest_pop', '6488000'), ('currencies', 'Iraqi dinar')]\n",
      "[('name', 'Duchy of Courland and Semigallia'), ('date', '1561-01-01T00:00:00Z'), ('latest_pop', '200000'), ('currencies', 'thaler')]\n",
      "[('name', 'Bhutan'), ('date', '1949-08-08T00:00:00Z'), ('latest_pop', '807610'), ('currencies', 'ngultrum')]\n",
      "[('name', 'Province of North Carolina'), ('date', '1712-01-24T00:00:00Z'), ('latest_pop', '197200'), ('currencies', 'North Carolina pound')]\n",
      "[('name', 'Luxembourg'), ('date', '1815-01-01T00:00:00Z'), ('latest_pop', '626108'), ('currencies', 'euro')]\n",
      "[('name', 'Ancient Carthage'), ('date', '-813-01-01T00:00:00Z'), ('latest_pop', '4300000'), ('currencies', 'Carthaginian currency')]\n",
      "[('name', 'Australia'), ('date', '1901-01-01T00:00:00Z'), ('latest_pop', '24511800'), ('currencies', 'Australian dollar')]\n",
      "[('name', 'Spain'), ('date', '1479-01-01T00:00:00Z'), ('latest_pop', '46733038'), ('currencies', 'euro')]\n",
      "[('name', 'Russian Empire'), ('date', '1721-11-02T00:00:00Z'), ('latest_pop', '181537800'), ('currencies', 'rubles,gold rouble')]\n",
      "[('name', 'Kingdom of Saxony'), ('date', '1806-01-01T00:00:00Z'), ('latest_pop', '4806661'), ('currencies', 'Saxon thaler')]\n",
      "[('name', 'Oman'), ('date', '1970-07-23T00:00:00Z'), ('latest_pop', '4829480'), ('currencies', 'Omani rial')]\n",
      "[('name', 'Antigua and Barbuda'), ('date', '1981-11-01T00:00:00Z'), ('latest_pop', '102012'), ('currencies', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Rhodesia'), ('date', '1965-11-11T00:00:00Z'), ('latest_pop', '6930000'), ('currencies', 'Rhodesian pound,Rhodesian dollar')]\n",
      "[('name', 'Principality of Montenegro'), ('date', '1852-01-01T00:00:00Z'), ('latest_pop', '317856'), ('currencies', 'Austro-Hungarian krone')]\n",
      "[('name', 'Kingdom of Portugal'), ('date', '1139-07-26T00:00:00Z'), ('latest_pop', '5400000'), ('currencies', 'Portuguese dinheiro,Portuguese real')]\n",
      "[('name', 'Barbados'), ('date', '1966-11-30T00:00:00Z'), ('latest_pop', '285719'), ('currencies', 'Barbadian dollar')]\n",
      "[('name', 'United Kingdom'), ('date', '1927-04-12T00:00:00Z'), ('latest_pop', '66022273'), ('currencies', 'pound sterling')]\n",
      "[('name', 'German Empire'), ('date', '1871-01-01T00:00:00Z'), ('latest_pop', '67790000'), ('currencies', 'German gold mark')]\n",
      "[('name', 'Great Britain'), ('date', '1707-05-12T00:00:00Z'), ('latest_pop', '10500000'), ('currencies', 'pound sterling')]\n",
      "[('name', 'British Solomon Islands'), ('date', '1893-03-15T00:00:00Z'), ('latest_pop', '196823'), ('currencies', 'Australian pound,Australian dollar,Solomon Islands dollar,pound sterling,Solomon Islands pound')]\n",
      "[('name', 'Yugoslavia'), ('date', '1918-12-01T00:00:00Z'), ('latest_pop', '23271000'), ('currencies', 'Yugoslav dinar')]\n",
      "[('name', 'Thailand'), ('date', '1238-01-01T00:00:00Z'), ('latest_pop', '65931550'), ('currencies', 'baht')]\n",
      "[('name', 'Greenland'), ('date', '1979-01-01T00:00:00Z'), ('latest_pop', '56081'), ('currencies', 'Danish krone')]\n",
      "[('name', 'Belgium'), ('date', '1830-10-04T00:00:00Z'), ('latest_pop', '11431406'), ('currencies', 'euro')]\n",
      "[('name', 'Qing dynasty'), ('date', '1636-01-01T00:00:00Z'), ('latest_pop', '432000000'), ('currencies', 'Sycee,Hubu Guanpiao,tael,Dà Qīng Bǎo Chāo')]\n",
      "[('name', 'Volga Bulgaria'), ('date', '0601-01-01T00:00:00Z'), ('latest_pop', '2000000'), ('currencies', 'dinar,som')]\n",
      "[('name', 'Emirate of Afghanistan'), ('date', '1823-01-01T00:00:00Z'), ('latest_pop', '5000000'), ('currencies', 'Afghan afghani,Afghan rupee')]\n",
      "[('name', 'Belize'), ('date', '1981-09-21T00:00:00Z'), ('latest_pop', '374681'), ('currencies', 'Belize dollar')]\n",
      "[('name', 'Papua New Guinea'), ('date', '1975-01-01T00:00:00Z'), ('latest_pop', '8935000'), ('currencies', 'kina')]\n",
      "[('name', 'Qatar'), ('date', '1870-01-01T00:00:00Z'), ('latest_pop', '2639211'), ('currencies', 'Qatari riyal')]\n",
      "[('name', 'British Empire'), ('date', '1583-01-01T00:00:00Z'), ('latest_pop', '680000000'), ('currencies', 'pound sterling')]\n",
      "[('name', 'Central African Empire'), ('date', '1976-12-04T00:00:00Z'), ('latest_pop', '3000000'), ('currencies', 'Central African CFA franc')]\n",
      "[('name', 'Kingdom of Bavaria'), ('date', '1806-01-01T00:00:00Z'), ('latest_pop', '3231570'), ('currencies', 'Bavarian gulden')]\n",
      "[('name', 'Vatican City'), ('date', '1929-02-11T00:00:00Z'), ('latest_pop', '1000'), ('currencies', 'euro')]\n",
      "[('name', 'Sweden'), ('date', '0700-01-01T00:00:00Z'), ('latest_pop', '10409248'), ('currencies', 'Swedish krona')]\n",
      "[('name', 'Grenada'), ('date', '1974-01-01T00:00:00Z'), ('latest_pop', '107825'), ('currencies', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Lesotho'), ('date', '1966-01-01T00:00:00Z'), ('latest_pop', '2233339'), ('currencies', 'South African rand,Lesotho loti')]\n",
      "[('name', 'Cutch State'), ('date', '1147-01-01T00:00:00Z'), ('latest_pop', '488022'), ('currencies', 'Kutch kori')]\n",
      "[('name', 'Cambodia'), ('date', '1953-11-09T00:00:00Z'), ('latest_pop', '16005373'), ('currencies', 'riel')]\n",
      "[('name', 'Saudi Arabia'), ('date', '1727-01-01T00:00:00Z'), ('latest_pop', '33000000'), ('currencies', 'Saudi riyal')]\n",
      "[('name', 'Kingdom of Hejaz'), ('date', '1916-06-10T00:00:00Z'), ('latest_pop', '850000'), ('currencies', 'Hejaz riyal')]\n",
      "[('name', 'Jordan'), ('date', '1946-01-01T00:00:00Z'), ('latest_pop', '10428241'), ('currencies', 'Jordanian dinar')]\n",
      "[('name', 'Andorra'), ('date', '1278-01-01T00:00:00Z'), ('latest_pop', '78151'), ('currencies', 'euro')]\n",
      "[('name', 'Saint Lucia'), ('date', '1967-03-01T00:00:00Z'), ('latest_pop', '178844'), ('currencies', 'Eastern Caribbean dollar')]\n",
      "[('name', 'Parthian Empire'), ('date', '-246-01-01T00:00:00Z'), ('latest_pop', '20000000'), ('currencies', 'Parthian coins')]\n",
      "[('name', 'Khanate of Khiva'), ('date', '1511-01-01T00:00:00Z'), ('latest_pop', '800000'), ('currencies', 'Khwarazmi tenga')]\n",
      "[('name', 'Holy Roman Empire'), ('date', '0962-01-01T00:00:00Z'), ('latest_pop', '26265000'), ('currencies', 'ducat')]\n",
      "[('name', 'Kingdom of Montenegro'), ('date', '1910-01-01T00:00:00Z'), ('latest_pop', '500000'), ('currencies', 'Montenegrin perper')]\n",
      "[('name', 'Morocco'), ('date', '-399-01-01T00:00:00Z'), ('latest_pop', '36029138'), ('currencies', 'Moroccan dirham')]\n",
      "[('name', 'Jersey'), ('date', '1651-12-12T00:00:00Z'), ('latest_pop', '105500'), ('currencies', 'pound sterling,Jersey pound')]\n",
      "[('name', 'July Monarchy'), ('date', '1830-01-01T00:00:00Z'), ('latest_pop', '34689000'), ('currencies', 'French franc')]\n",
      "[('name', 'Mughal Empire'), ('date', '1526-01-01T00:00:00Z'), ('latest_pop', '150000000'), ('currencies', 'rupee')]\n",
      "[('name', 'Kingdom of Dalmatia'), ('date', '1815-06-22T00:00:00Z'), ('latest_pop', '645666'), ('currencies', 'Austro-Hungarian gulden')]\n",
      "[('name', 'Kingdom of the Netherlands'), ('date', '1815-03-16T00:00:00Z'), ('latest_pop', '17100715'), ('currencies', 'euro')]\n",
      "[('name', 'Kingdom of Croatia-Slavonia'), ('date', '1868-01-01T00:00:00Z'), ('latest_pop', '2621954'), ('currencies', 'Austro-Hungarian krone,Austro-Hungarian gulden')]\n",
      "[('name', 'Austrian Empire'), ('date', '1804-08-11T00:00:00Z'), ('latest_pop', '21200000'), ('currencies', 'thaler')]\n",
      "[('name', 'Eastern Rumelia'), ('date', '1878-01-01T00:00:00Z'), ('latest_pop', '975030'), ('currencies', 'Ottoman lira')]\n",
      "[('name', 'Javad khanate'), ('date', '1747-01-01T00:00:00Z'), ('latest_pop', '9000'), ('currencies', 'Abbasi')]\n",
      "[('name', 'Netherlands'), ('date', '1954-12-15T00:00:00Z'), ('latest_pop', '17282163'), ('currencies', 'euro')]\n",
      "[('name', 'Monaco'), ('date', '1297-01-15T00:00:00Z'), ('latest_pop', '38695'), ('currencies', 'euro')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('date', '1236-01-01T00:00:00Z'), ('latest_pop', '3500000'), ('currencies', 'złoty,groschen,Lithuanian long currency')]\n",
      "[('name', 'Viceroyalty of New Spain'), ('date', '1535-10-22T00:00:00Z'), ('latest_pop', '20000000'), ('currencies', 'peso,Spanish colonial real')]\n",
      "[('name', 'The Bahamas'), ('date', '1973-01-01T00:00:00Z'), ('latest_pop', '395361'), ('currencies', 'Bahamian dollar')]\n",
      "[('name', 'Achaemenid Empire'), ('date', '-549-01-01T00:00:00Z'), ('latest_pop', '35000000'), ('currencies', 'siglos,Persian daric')]\n",
      "[('name', 'Mongol Empire'), ('date', '1206-01-01T00:00:00Z'), ('latest_pop', '160000000'), ('currencies', 'Balysh')]\n",
      "[('name', 'New Zealand'), ('date', '1907-09-26T00:00:00Z'), ('latest_pop', '5112300'), ('currencies', 'New Zealand dollar')]\n",
      "[('name', 'Empire of Japan'), ('date', '1868-01-03T00:00:00Z'), ('latest_pop', '97770000'), ('currencies', 'Japanese yen')]\n",
      "[('name', 'Saskatchewan'), ('date', '1905-01-01T00:00:00Z'), ('latest_pop', '1168057'), ('currencies', 'Canadian dollar')]\n",
      "[('name', 'Kingdom of Bulgaria'), ('date', '1908-01-01T00:00:00Z'), ('latest_pop', '7029349'), ('currencies', 'Bulgarian lev')]\n",
      "[('name', 'Kingdom of Württemberg'), ('date', '1806-01-01T00:00:00Z'), ('latest_pop', '2437574'), ('currencies', 'German gold mark,Württemberg gulden,German Papiermark')]\n",
      "[('name', 'Brunei'), ('date', '1984-01-01T00:00:00Z'), ('latest_pop', '428697'), ('currencies', 'Brunei dollar')]\n",
      "[('name', 'Solomon Islands'), ('date', '1978-01-01T00:00:00Z'), ('latest_pop', '611343'), ('currencies', 'Solomon Islands dollar')]\n",
      "[('name', 'Eswatini'), ('date', '1968-09-06T00:00:00Z'), ('latest_pop', '1124753'), ('currencies', 'lilangeni')]\n",
      "[('name', 'Kingdom of Hawaiʻi'), ('date', '1795-01-01T00:00:00Z'), ('latest_pop', '1217000'), ('currencies', 'United States dollar,Hawaiian dollar')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "124"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?name ?date ?latest_pop (GROUP_CONCAT(?curname;separator=\",\") as ?currencies)  WHERE { \n",
    "\n",
    "?mon wdt:P38 ?cur.\n",
    "#OPTIONAL{?mon wdt:P2046 ?area.}\n",
    "\n",
    "#Subquery to find the oldest inception date\n",
    "{SELECT ?mon (MIN(?inc) AS ?date) WHERE {\n",
    "        ?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "             wdt:P571 ?inc.\n",
    "}GROUP BY ?mon\n",
    "}\n",
    "\n",
    "#Subquery to find the latest population\n",
    "{SELECT ?mon2 (MAX(?pop) AS ?latest_pop) WHERE {\n",
    "        ?mon2 (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "               wdt:P1082 ?pop.\n",
    "}GROUP BY ?mon2\n",
    "}\n",
    "\n",
    "?mon <http://schema.org/name> ?name.\n",
    "?cur <http://schema.org/name> ?curname.\n",
    "FILTER(?mon=?mon2)\n",
    "} \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1846ac0-6924-40b9-bf17-da165ba567ed",
   "metadata": {},
   "source": [
    "#### I find for each monarchy inception(wdt:P571), population(wdt:P1082) and area(wdt:P2046)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "5fffd389-4b56-41d5-ab19-19da9c34d50d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('name', 'Kingdom of the Netherlands'), ('inception', '1815-03-16T00:00:00Z'), ('latest_pop', '17100715'), ('area', '42201')]\n",
      "[('name', 'Austro-Hungarian rule in Bosnia and Herzegovina'), ('inception', '1878-01-01T00:00:00Z'), ('latest_pop', '1898044'), ('area', '51082')]\n",
      "[('name', 'Kingdom of Libya'), ('inception', '1951-12-24T00:00:00Z'), ('latest_pop', '1091830'), ('area', '1759530')]\n",
      "[('name', 'Principality of Sealand'), ('inception', '1967-09-02T00:00:00Z'), ('latest_pop', '27'), ('area', '0.004')]\n",
      "[('name', 'Saskatchewan'), ('inception', '1905-01-01T00:00:00Z'), ('latest_pop', '1168057'), ('area', '651900')]\n",
      "[('name', 'Emirate of Ras Al Khaimah'), ('inception', '1869-01-01T00:00:00Z'), ('latest_pop', '241000'), ('area', '1684')]\n",
      "[('name', 'Austria-Hungary'), ('inception', '1867-03-01T00:00:00Z'), ('latest_pop', '52800000'), ('area', '676615')]\n",
      "[('name', 'First Toungoo Empire'), ('inception', '1510-10-26T00:00:00Z'), ('latest_pop', '6000000'), ('area', '1550000')]\n",
      "[('name', 'Belize'), ('inception', '1981-09-21T00:00:00Z'), ('latest_pop', '374681'), ('area', '22966')]\n",
      "[('name', 'Schaumburg-Lippe'), ('inception', '1643-01-01T00:00:00Z'), ('latest_pop', '43132'), ('area', '340.2')]\n",
      "[('name', 'Bijawar State'), ('inception', '1765-01-01T00:00:00Z'), ('latest_pop', '110500'), ('area', '2520')]\n",
      "[('name', 'Waldeck'), ('inception', '1180-01-01T00:00:00Z'), ('latest_pop', '59000'), ('area', '1121')]\n",
      "[('name', 'Banswara State'), ('inception', '1497-01-01T00:00:00Z'), ('latest_pop', '165350'), ('area', '4160')]\n",
      "[('name', 'Principality of Montenegro'), ('inception', '1852-01-01T00:00:00Z'), ('latest_pop', '317856'), ('area', '5.4759')]\n",
      "[('name', 'Rajpipla State'), ('inception', '1340-01-01T00:00:00Z'), ('latest_pop', '249032'), ('area', '3929')]\n",
      "[('name', 'Duchy of Courland and Semigallia'), ('inception', '1561-01-01T00:00:00Z'), ('latest_pop', '200000'), ('area', '32000')]\n",
      "[('name', 'Kingdom of Dalmatia'), ('inception', '1815-06-22T00:00:00Z'), ('latest_pop', '645666'), ('area', '12831')]\n",
      "[('name', 'Polish–Lithuanian Commonwealth'), ('inception', '1569-06-21T00:00:00Z'), ('latest_pop', '12300000'), ('area', '878000')]\n",
      "[('name', 'Malaysia'), ('inception', '1957-01-01T00:00:00Z'), ('latest_pop', '31624264'), ('area', '330290')]\n",
      "[('name', 'Tenochtitlan'), ('inception', '1325-03-21T00:00:00Z'), ('latest_pop', '212500'), ('area', '1350')]\n",
      "[('name', 'Spain'), ('inception', '1479-01-01T00:00:00Z'), ('latest_pop', '46733038'), ('area', '505990')]\n",
      "[('name', 'Jersey'), ('inception', '1651-12-12T00:00:00Z'), ('latest_pop', '105500'), ('area', '118.2')]\n",
      "[('name', 'Jordan'), ('inception', '1946-01-01T00:00:00Z'), ('latest_pop', '10428241'), ('area', '89341')]\n",
      "[('name', 'Sweden'), ('inception', '0700-01-01T00:00:00Z'), ('latest_pop', '10409248'), ('area', '528861.06')]\n",
      "[('name', 'Kingdom of Croatia-Slavonia'), ('inception', '1868-01-01T00:00:00Z'), ('latest_pop', '2621954'), ('area', '42535.25')]\n",
      "[('name', 'Duchy of Anhalt'), ('inception', '1863-01-01T00:00:00Z'), ('latest_pop', '351045'), ('area', '2.299')]\n",
      "[('name', 'Safavid Empire'), ('inception', '1501-01-01T00:00:00Z'), ('latest_pop', '20000000'), ('area', '2850000')]\n",
      "[('name', 'Grand Duchy of Lithuania'), ('inception', '1236-01-01T00:00:00Z'), ('latest_pop', '3500000'), ('area', '930000')]\n",
      "[('name', 'Kingdom of Bavaria'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '3231570'), ('area', '1636.5')]\n",
      "[('name', 'Western Xia'), ('inception', '1038-01-01T00:00:00Z'), ('latest_pop', '3000000'), ('area', '1000000')]\n",
      "[('name', 'Grand Duchy of Hesse'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '1282051'), ('area', '7688.3')]\n",
      "[('name', 'Oman'), ('inception', '1970-07-23T00:00:00Z'), ('latest_pop', '4829480'), ('area', '309500')]\n",
      "[('name', 'Grand Duchy of Berg'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '878157'), ('area', '17500')]\n",
      "[('name', 'Benares State'), ('inception', '1770-01-01T00:00:00Z'), ('latest_pop', '115773'), ('area', '2266')]\n",
      "[('name', 'Bahrain'), ('inception', '1971-08-14T00:00:00Z'), ('latest_pop', '1492584'), ('area', '785.08')]\n",
      "[('name', 'Mughal Empire'), ('inception', '1526-01-01T00:00:00Z'), ('latest_pop', '150000000'), ('area', '4000000')]\n",
      "[('name', 'Duchy of Brunswick'), ('inception', '1815-01-01T00:00:00Z'), ('latest_pop', '494339'), ('area', '3690')]\n",
      "[('name', 'Schwarzburg-Sondershausen'), ('inception', '1599-01-01T00:00:00Z'), ('latest_pop', '89917'), ('area', '862')]\n",
      "[('name', 'South Kasai'), ('inception', '1960-01-01T00:00:00Z'), ('latest_pop', '1000000'), ('area', '30000')]\n",
      "[('name', 'Greenland'), ('inception', '1979-01-01T00:00:00Z'), ('latest_pop', '56081'), ('area', '2166086')]\n",
      "[('name', 'Jhalawar State'), ('inception', '1838-01-01T00:00:00Z'), ('latest_pop', '90175'), ('area', '2106')]\n",
      "[('name', 'Tuvalu'), ('inception', '1978-01-01T00:00:00Z'), ('latest_pop', '11192'), ('area', '26')]\n",
      "[('name', 'Thailand'), ('inception', '1238-01-01T00:00:00Z'), ('latest_pop', '65931550'), ('area', '513119.5')]\n",
      "[('name', 'Taungoo Dynasty'), ('inception', '1485-01-01T00:00:00Z'), ('latest_pop', '3000000'), ('area', '750000')]\n",
      "[('name', 'Tsardom of Russia'), ('inception', '1547-01-01T00:00:00Z'), ('latest_pop', '14000000'), ('area', '14500000')]\n",
      "[('name', 'Principality of Reuss-Gera'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '144600'), ('area', '827')]\n",
      "[('name', 'New Zealand'), ('inception', '1907-09-26T00:00:00Z'), ('latest_pop', '5112300'), ('area', '268021')]\n",
      "[('name', 'Lippe'), ('inception', '1123-01-01T00:00:00Z'), ('latest_pop', '138952'), ('area', '1222')]\n",
      "[('name', 'Russian Empire'), ('inception', '1721-11-02T00:00:00Z'), ('latest_pop', '181537800'), ('area', '21800251')]\n",
      "[('name', 'Bhutan'), ('inception', '1949-08-08T00:00:00Z'), ('latest_pop', '807610'), ('area', '38394')]\n",
      "[('name', 'Junagadh State'), ('inception', '1748-01-01T00:00:00Z'), ('latest_pop', '465493'), ('area', '8643')]\n",
      "[('name', 'Jind State'), ('inception', '1763-01-01T00:00:00Z'), ('latest_pop', '324676'), ('area', '3460')]\n",
      "[('name', 'Roman Catholic Archdiocese of Riga'), ('inception', '1918-01-01T00:00:00Z'), ('latest_pop', '1201975'), ('area', '23587')]\n",
      "[('name', 'Danish Realm'), ('inception', '0800-01-01T00:00:00Z'), ('latest_pop', '5930987'), ('area', '2220930')]\n",
      "[('name', 'Barbados'), ('inception', '1966-11-30T00:00:00Z'), ('latest_pop', '285719'), ('area', '439')]\n",
      "[('name', 'Hesse-Homburg'), ('inception', '1622-01-01T00:00:00Z'), ('latest_pop', '27563'), ('area', '221')]\n",
      "[('name', 'Javad khanate'), ('inception', '1747-01-01T00:00:00Z'), ('latest_pop', '9000'), ('area', '4.956')]\n",
      "[('name', 'Brunei'), ('inception', '1984-01-01T00:00:00Z'), ('latest_pop', '428697'), ('area', '5765.313533')]\n",
      "[('name', 'Sirohi State'), ('inception', '1405-01-01T00:00:00Z'), ('latest_pop', '216528'), ('area', '5164')]\n",
      "[('name', 'Sikh Empire'), ('inception', '1733-01-01T00:00:00Z'), ('latest_pop', '1500000'), ('area', '491.464')]\n",
      "[('name', 'Faridkot State'), ('inception', '1803-01-01T00:00:00Z'), ('latest_pop', '97034'), ('area', '1652')]\n",
      "[('name', 'Sultanate of Egypt'), ('inception', '1914-12-19T00:00:00Z'), ('latest_pop', '12751000'), ('area', '3418400')]\n",
      "[('name', 'Solomon Islands'), ('inception', '1978-01-01T00:00:00Z'), ('latest_pop', '611343'), ('area', '28400')]\n",
      "[('name', 'Sultanate of Zanzibar'), ('inception', '1856-10-19T00:00:00Z'), ('latest_pop', '300000'), ('area', '1651')]\n",
      "[('name', 'Grand Duchy of Mecklenburg-Strelitz'), ('inception', '1815-01-01T00:00:00Z'), ('latest_pop', '102602'), ('area', '2929')]\n",
      "[('name', 'Tarascan State'), ('inception', '1300-01-01T00:00:00Z'), ('latest_pop', '1500000'), ('area', '75000')]\n",
      "[('name', 'Sasanian Empire'), ('inception', '0226-01-01T00:00:00Z'), ('latest_pop', '40000000'), ('area', '3500000')]\n",
      "[('name', 'Kingdom of Italy'), ('inception', '1861-03-17T00:00:00Z'), ('latest_pop', '42399000'), ('area', '310196')]\n",
      "[('name', 'Morocco'), ('inception', '-399-01-01T00:00:00Z'), ('latest_pop', '36029138'), ('area', '710850')]\n",
      "[('name', 'Francoist Spain'), ('inception', '1939-04-01T00:00:00Z'), ('latest_pop', '35563535'), ('area', '504030')]\n",
      "[('name', 'The Bahamas'), ('inception', '1973-01-01T00:00:00Z'), ('latest_pop', '395361'), ('area', '13878')]\n",
      "[('name', 'Kingdom of Iceland'), ('inception', '1918-12-01T00:00:00Z'), ('latest_pop', '127791'), ('area', '103000')]\n",
      "[('name', 'Qatar'), ('inception', '1870-01-01T00:00:00Z'), ('latest_pop', '2639211'), ('area', '11437')]\n",
      "[('name', 'Kingdom of Iraq'), ('inception', '1921-01-01T00:00:00Z'), ('latest_pop', '6488000'), ('area', '4370722')]\n",
      "[('name', 'Union of South Africa'), ('inception', '1910-05-31T00:00:00Z'), ('latest_pop', '18216000'), ('area', '2045320')]\n",
      "[('name', 'New South Wales'), ('inception', '1788-01-01T00:00:00Z'), ('latest_pop', '7480228'), ('area', '801150')]\n",
      "[('name', 'Norway'), ('inception', '0900-01-01T00:00:00Z'), ('latest_pop', '5391369'), ('area', '385207')]\n",
      "[('name', 'Tabasaran Principality'), ('inception', '0901-01-01T00:00:00Z'), ('latest_pop', '10000'), ('area', '1500')]\n",
      "[('name', 'Goryeo'), ('inception', '0918-01-01T00:00:00Z'), ('latest_pop', '2100000'), ('area', '220750')]\n",
      "[('name', 'Han dynasty'), ('inception', '-205-01-01T00:00:00Z'), ('latest_pop', '59594978'), ('area', '6000000')]\n",
      "[('name', 'Lesotho'), ('inception', '1966-01-01T00:00:00Z'), ('latest_pop', '2233339'), ('area', '30355')]\n",
      "[('name', 'Denmark'), ('inception', '0800-01-01T00:00:00Z'), ('latest_pop', '5827463'), ('area', '42925.46')]\n",
      "[('name', 'Tripura'), ('inception', '1809-01-01T00:00:00Z'), ('latest_pop', '513000'), ('area', '10660')]\n",
      "[('name', 'Mongol Empire'), ('inception', '1206-01-01T00:00:00Z'), ('latest_pop', '160000000'), ('area', '24000000')]\n",
      "[('name', 'United Kingdom of Great Britain and Ireland'), ('inception', '1801-01-01T00:00:00Z'), ('latest_pop', '45370530'), ('area', '315093')]\n",
      "[('name', 'Bhavnagar State'), ('inception', '1723-01-01T00:00:00Z'), ('latest_pop', '464671'), ('area', '7669')]\n",
      "[('name', 'Barwani State'), ('inception', '0836-01-01T00:00:00Z'), ('latest_pop', '176666'), ('area', '3051.02')]\n",
      "[('name', 'Alwar State'), ('inception', '1770-01-01T00:00:00Z'), ('latest_pop', '682926'), ('area', '8547')]\n",
      "[('name', 'Kingdom of the Two Sicilies'), ('inception', '1738-01-01T00:00:00Z'), ('latest_pop', '8703000'), ('area', '111900')]\n",
      "[('name', 'Vatican City'), ('inception', '1929-02-11T00:00:00Z'), ('latest_pop', '1000'), ('area', '0.440297')]\n",
      "[('name', 'Andorra'), ('inception', '1278-01-01T00:00:00Z'), ('latest_pop', '78151'), ('area', '468')]\n",
      "[('name', 'Kingdom of Laos'), ('inception', '1947-01-01T00:00:00Z'), ('latest_pop', '3100000'), ('area', '236800')]\n",
      "[('name', 'Duchy of Warsaw'), ('inception', '1807-01-01T00:00:00Z'), ('latest_pop', '4300000'), ('area', '155000')]\n",
      "[('name', 'United Arab Emirates'), ('inception', '1971-01-01T00:00:00Z'), ('latest_pop', '9890400'), ('area', '83600')]\n",
      "[('name', 'South Australia'), ('inception', '1836-12-28T00:00:00Z'), ('latest_pop', '1676653'), ('area', '984321')]\n",
      "[('name', 'Prussia'), ('inception', '1525-01-01T00:00:00Z'), ('latest_pop', '41915040'), ('area', '297007')]\n",
      "[('name', 'Grand Duchy of Mecklenburg-Schwerin'), ('inception', '1815-01-01T00:00:00Z'), ('latest_pop', '607770'), ('area', '13161')]\n",
      "[('name', 'Japan'), ('inception', '1947-05-03T00:00:00Z'), ('latest_pop', '126434565'), ('area', '377972.28')]\n",
      "[('name', 'Seleucid Empire'), ('inception', '-311-01-01T00:00:00Z'), ('latest_pop', '35000000'), ('area', '4000000')]\n",
      "[('name', 'Liechtenstein'), ('inception', '1806-07-12T00:00:00Z'), ('latest_pop', '37922'), ('area', '160')]\n",
      "[('name', 'Central African Empire'), ('inception', '1976-12-04T00:00:00Z'), ('latest_pop', '3000000'), ('area', '622984')]\n",
      "[('name', 'Joseon'), ('inception', '1392-08-13T00:00:00Z'), ('latest_pop', '13000000'), ('area', '220000')]\n",
      "[('name', 'Janjira State'), ('inception', '1489-01-01T00:00:00Z'), ('latest_pop', '110389'), ('area', '839')]\n",
      "[('name', 'Schwarzburg-Rudolstadt'), ('inception', '1599-01-01T00:00:00Z'), ('latest_pop', '93000'), ('area', '940.7')]\n",
      "[('name', 'Luxembourg'), ('inception', '1815-01-01T00:00:00Z'), ('latest_pop', '626108'), ('area', '2586.4')]\n",
      "[('name', 'Kingdom of Württemberg'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '2437574'), ('area', '19508')]\n",
      "[('name', 'United Kingdom'), ('inception', '1927-04-12T00:00:00Z'), ('latest_pop', '66022273'), ('area', '242495.406794')]\n",
      "[('name', 'Roman Catholic Diocese of Metz'), ('inception', '0201-01-01T00:00:00Z'), ('latest_pop', '1046873'), ('area', '6226')]\n",
      "[('name', 'Porbandar State'), ('inception', '1193-01-01T00:00:00Z'), ('latest_pop', '115673'), ('area', '1647')]\n",
      "[('name', 'Kuwait'), ('inception', '1991-02-26T00:00:00Z'), ('latest_pop', '4600000'), ('area', '17818')]\n",
      "[('name', 'Pratapgarh State'), ('inception', '1775-01-01T00:00:00Z'), ('latest_pop', '52025'), ('area', '2303')]\n",
      "[('name', 'Emirate of Fujairah'), ('inception', '1953-01-01T00:00:00Z'), ('latest_pop', '256256'), ('area', '1165')]\n",
      "[('name', 'Umayyad Caliphate'), ('inception', '0661-01-01T00:00:00Z'), ('latest_pop', '70000000'), ('area', '6000000')]\n",
      "[('name', 'Yugoslavia'), ('inception', '1918-12-01T00:00:00Z'), ('latest_pop', '23271000'), ('area', '255804')]\n",
      "[('name', 'Kingdom of Bulgaria'), ('inception', '1908-01-01T00:00:00Z'), ('latest_pop', '7029349'), ('area', '153459.6')]\n",
      "[('name', 'Belgium'), ('inception', '1830-10-04T00:00:00Z'), ('latest_pop', '11431406'), ('area', '30528')]\n",
      "[('name', 'Grenada'), ('inception', '1974-01-01T00:00:00Z'), ('latest_pop', '107825'), ('area', '348.5')]\n",
      "[('name', 'First Mexican Empire'), ('inception', '1822-05-19T00:00:00Z'), ('latest_pop', '6500000'), ('area', '4925283')]\n",
      "[('name', 'Principality of Reuss-Greiz'), ('inception', '1778-01-01T00:00:00Z'), ('latest_pop', '70590'), ('area', '317')]\n",
      "[('name', 'Spanish Empire'), ('inception', '1492-01-01T00:00:00Z'), ('latest_pop', '60000000'), ('area', '20000000')]\n",
      "[('name', 'Netherlands'), ('inception', '1954-12-15T00:00:00Z'), ('latest_pop', '17282163'), ('area', '41543')]\n",
      "[('name', 'Saudi Arabia'), ('inception', '1727-01-01T00:00:00Z'), ('latest_pop', '33000000'), ('area', '2250000')]\n",
      "[('name', 'Erivan Khanate'), ('inception', '1736-01-01T00:00:00Z'), ('latest_pop', '110120'), ('area', '19400')]\n",
      "[('name', 'Kingdom of Scotland'), ('inception', '0843-01-01T00:00:00Z'), ('latest_pop', '1250000'), ('area', '78782')]\n",
      "[('name', 'Roman Catholic Diocese of Bolzano-Brixen'), ('inception', '0600-01-01T00:00:00Z'), ('latest_pop', '525092'), ('area', '7400')]\n",
      "[('name', 'Aerican Empire'), ('inception', '1987-05-08T00:00:00Z'), ('latest_pop', '181'), ('area', '90000000000')]\n",
      "[('name', 'Netherlands Antilles'), ('inception', '1954-12-15T00:00:00Z'), ('latest_pop', '197041'), ('area', '800')]\n",
      "[('name', 'Great Britain'), ('inception', '1707-05-12T00:00:00Z'), ('latest_pop', '10500000'), ('area', '230977')]\n",
      "[('name', 'Ratlam State'), ('inception', '1652-01-01T00:00:00Z'), ('latest_pop', '83773'), ('area', '2336')]\n",
      "[('name', 'Prince-Bishopric of Paderborn'), ('inception', '1281-01-01T00:00:00Z'), ('latest_pop', '96000'), ('area', '1700')]\n",
      "[('name', 'Achaemenid Empire'), ('inception', '-549-01-01T00:00:00Z'), ('latest_pop', '35000000'), ('area', '5500000')]\n",
      "[('name', 'Kingdom of Hawaiʻi'), ('inception', '1795-01-01T00:00:00Z'), ('latest_pop', '1217000'), ('area', '28337')]\n",
      "[('name', 'Cambodia'), ('inception', '1953-11-09T00:00:00Z'), ('latest_pop', '16005373'), ('area', '181035')]\n",
      "[('name', 'Antigua and Barbuda'), ('inception', '1981-11-01T00:00:00Z'), ('latest_pop', '102012'), ('area', '440.29')]\n",
      "[('name', 'Ashanti kingdom'), ('inception', '1670-01-01T00:00:00Z'), ('latest_pop', '3000000'), ('area', '259000')]\n",
      "[('name', 'Austrian Empire'), ('inception', '1804-08-11T00:00:00Z'), ('latest_pop', '21200000'), ('area', '698700')]\n",
      "[('name', 'Saint Kitts and Nevis'), ('inception', '1967-02-27T00:00:00Z'), ('latest_pop', '55345'), ('area', '269.358763')]\n",
      "[('name', 'Jamaica'), ('inception', '1962-01-01T00:00:00Z'), ('latest_pop', '2890299'), ('area', '10991.90954')]\n",
      "[('name', 'Monaco'), ('inception', '1297-01-15T00:00:00Z'), ('latest_pop', '38695'), ('area', '2.02')]\n",
      "[('name', 'Saint Lucia'), ('inception', '1967-03-01T00:00:00Z'), ('latest_pop', '178844'), ('area', '617.012867')]\n",
      "[('name', 'Rhodesia'), ('inception', '1965-11-11T00:00:00Z'), ('latest_pop', '6930000'), ('area', '390580')]\n",
      "[('name', 'Australia'), ('inception', '1901-01-01T00:00:00Z'), ('latest_pop', '24511800'), ('area', '7692024')]\n",
      "[('name', 'Saxe-Meiningen'), ('inception', '1675-01-01T00:00:00Z'), ('latest_pop', '268859'), ('area', '2468')]\n",
      "[('name', 'Kapurthala State'), ('inception', '1772-01-01T00:00:00Z'), ('latest_pop', '314341'), ('area', '352')]\n",
      "[('name', 'Kingdom of Serbs, Croats and Slovenes'), ('inception', '1918-12-01T00:00:00Z'), ('latest_pop', '11984911'), ('area', '247542')]\n",
      "[('name', 'Eswatini'), ('inception', '1968-09-06T00:00:00Z'), ('latest_pop', '1124753'), ('area', '17364')]\n",
      "[('name', 'Kingdom of Sardinia'), ('inception', '1324-01-01T00:00:00Z'), ('latest_pop', '5167000'), ('area', '73810')]\n",
      "[('name', 'Roman Catholic Diocese of Fulda'), ('inception', '1752-10-05T00:00:00Z'), ('latest_pop', '1721000'), ('area', '10318')]\n",
      "[('name', 'Jaora State'), ('inception', '1817-01-01T00:00:00Z'), ('latest_pop', '84202'), ('area', '1471')]\n",
      "[('name', 'Jaisalmer State'), ('inception', '1156-01-01T00:00:00Z'), ('latest_pop', '76255'), ('area', '41600')]\n",
      "[('name', 'Colony of Natal'), ('inception', '1843-01-01T00:00:00Z'), ('latest_pop', '1108754'), ('area', '91610')]\n",
      "[('name', 'Papua New Guinea'), ('inception', '1975-01-01T00:00:00Z'), ('latest_pop', '8935000'), ('area', '462840')]\n",
      "[('name', 'Emirate of Afghanistan'), ('inception', '1823-01-01T00:00:00Z'), ('latest_pop', '5000000'), ('area', '652225')]\n",
      "[('name', 'Dhrangadhra State'), ('inception', '1742-01-01T00:00:00Z'), ('latest_pop', '100000'), ('area', '3023')]\n",
      "[('name', 'German Empire'), ('inception', '1871-01-01T00:00:00Z'), ('latest_pop', '67790000'), ('area', '540858')]\n",
      "[('name', 'Emirate of Sharjah'), ('inception', '1793-12-02T00:00:00Z'), ('latest_pop', '1405843'), ('area', '2590')]\n",
      "[('name', 'Saint Vincent and the Grenadines'), ('inception', '1979-01-01T00:00:00Z'), ('latest_pop', '109897'), ('area', '389')]\n",
      "[('name', 'Kingdom of Saxony'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '4806661'), ('area', '14993')]\n",
      "[('name', 'Northern Ireland'), ('inception', '1921-05-08T00:00:00Z'), ('latest_pop', '1852168'), ('area', '14130')]\n",
      "[('name', 'duchy of Saxe-Coburg and Gotha'), ('inception', '1826-01-01T00:00:00Z'), ('latest_pop', '242000'), ('area', '1977')]\n",
      "[('name', 'Kangra-Lambagraon'), ('inception', '1400-01-01T00:00:00Z'), ('latest_pop', '1625000'), ('area', '324')]\n",
      "[('name', 'Canada'), ('inception', '1867-07-01T00:00:00Z'), ('latest_pop', '37894799'), ('area', '9984670')]\n",
      "[('name', 'Empire of Japan'), ('inception', '1868-01-03T00:00:00Z'), ('latest_pop', '97770000'), ('area', '7400000')]\n",
      "[('name', 'Viceroyalty of New Spain'), ('inception', '1535-10-22T00:00:00Z'), ('latest_pop', '20000000'), ('area', '7657000')]\n",
      "[('name', 'Cutch State'), ('inception', '1147-01-01T00:00:00Z'), ('latest_pop', '488022'), ('area', '45630')]\n",
      "[('name', 'Dominion of Fiji'), ('inception', '1970-01-01T00:00:00Z'), ('latest_pop', '588068'), ('area', '18.274')]\n",
      "[('name', \"Kievan Rus'\"), ('inception', '0860-01-01T00:00:00Z'), ('latest_pop', '5400000'), ('area', '1330000')]\n",
      "[('name', 'Qing dynasty'), ('inception', '1636-01-01T00:00:00Z'), ('latest_pop', '432000000'), ('area', '14700000')]\n",
      "[('name', 'Duchy of Nassau'), ('inception', '1806-01-01T00:00:00Z'), ('latest_pop', '465636'), ('area', '4855')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "169"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?name ?inception ?latest_pop ?area WHERE { \n",
    "\n",
    "#Subquery to find the oldest inception date\n",
    "{SELECT ?mon (MIN(?inc) AS ?inception) WHERE {\n",
    "        ?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "             wdt:P571 ?inc.\n",
    "}GROUP BY ?mon\n",
    "}\n",
    "\n",
    "#Subquery to find the latest population\n",
    "{SELECT ?mon2 (MAX(?pop) AS ?latest_pop) WHERE {\n",
    "        ?mon2 (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "               wdt:P1082 ?pop.\n",
    "}GROUP BY ?mon2\n",
    "}\n",
    "\n",
    "#Subquery to find the maximum area\n",
    "{SELECT ?mon3 (MAX(?a) AS ?area) WHERE {\n",
    "        ?mon3 (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "               wdt:P2046 ?a.\n",
    "}GROUP BY ?mon3\n",
    "}\n",
    "\n",
    "?mon <http://schema.org/name> ?name.\n",
    "FILTER(?mon=?mon2 && ?mon2=?mon3)\n",
    "} \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "255580be-6307-484c-9e7a-3270597794d4",
   "metadata": {},
   "source": [
    "## Task 3 -Which is or was the country with the highest population?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "730d5f9b-0dc1-4193-9572-460ccf5da625",
   "metadata": {},
   "source": [
    "#### I reuse one query found before"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "b2407daf-5419-4e2e-8ad2-35921d75cd08",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'British Empire'), ('pop', '680000000')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "#Subquery to find the latest population\n",
    "SELECT ?country ?pop WHERE {\n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "      wdt:P1082 ?pop.\n",
    "\n",
    "?mon <http://schema.org/name> ?country.\n",
    "}\n",
    "ORDER BY DESC (?pop)\n",
    "LIMIT 1\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de52ca74-0129-4111-9bb4-592a8073810c",
   "metadata": {},
   "source": [
    "#### Plausible as the British Empire ruled from Canada to Australia"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "26f78f12-5f70-40dc-8545-617a534e1c06",
   "metadata": {},
   "source": [
    "## Task 4 - How many countries are or have been monarchies across continents?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "63663231-bd24-4c90-8879-d652c6b65b0d",
   "metadata": {},
   "source": [
    "#### From the initial search i notice the property \"continent\" (wdt:P30), let's see some values"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a496db4c-478c-4338-a946-96ae03e76849",
   "metadata": {},
   "outputs": [],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT ?country ?continent WHERE {\n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "      wdt:P30 ?con.\n",
    "\n",
    "?mon <http://schema.org/name> ?country.\n",
    "?con <http://schema.org/name> ?continent.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "73824e19-4b5e-477e-bc7c-0504deb33eb8",
   "metadata": {},
   "source": [
    "#### Perfect, i count them grouping by continent"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "53a9d62a-c769-4efc-a094-6b81c463ece5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('continent', 'Europe'), ('number', '361')]\n",
      "[('continent', 'Asia'), ('number', '173')]\n",
      "[('continent', 'Africa'), ('number', '63')]\n",
      "[('continent', 'North America'), ('number', '31')]\n",
      "[('continent', 'Eurasia'), ('number', '14')]\n",
      "[('continent', 'Insular Oceania'), ('number', '13')]\n",
      "[('continent', 'Hyboria'), ('number', '13')]\n",
      "[('continent', 'South America'), ('number', '8')]\n",
      "[('continent', 'The Continent'), ('number', '7')]\n",
      "[('continent', 'Thuria'), ('number', '6')]\n",
      "[('continent', 'Americas'), ('number', '5')]\n",
      "[('continent', 'Central America'), ('number', '2')]\n",
      "[('continent', 'Australia'), ('number', '2')]\n",
      "[('continent', 'Antarctica'), ('number', '1')]\n",
      "[('continent', 'Northern America and Mexico'), ('number', '1')]\n",
      "[('continent', 'Caribbean'), ('number', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "16"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT ?continent (COUNT(DISTINCT ?mon) AS ?number) WHERE {\n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "      wdt:P30 ?con.\n",
    "\n",
    "?mon <http://schema.org/name> ?country.\n",
    "?con <http://schema.org/name> ?continent.\n",
    "\n",
    "}\n",
    "GROUP BY ?continent\n",
    "ORDER BY DESC (?number)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e4682073-0ec2-47bf-b469-f6e6a38ba2ae",
   "metadata": {},
   "source": [
    "#### Now i want to try to count how many ACTUAL countries are or have been monarchies"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad704539-7255-4ac8-9261-2933bb6e4bfa",
   "metadata": {},
   "source": [
    "#### I start by listing  the entities that are instance of \"country\"(wdt:P17) to check if the entities are only countries that exists nowadays"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "2abf73fe-22eb-45a6-987c-95224e43b610",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "###WRONG QUERY, COUNTRY IS A PREDICATE NOT AN ENTITY\n",
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname WHERE {\n",
    "\n",
    "?country wdt:P31 wd:P17.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d31a9391-3565-4080-a7b1-b76058efb9ed",
   "metadata": {},
   "source": [
    "#### Let's try to get all \"instance of\" of Italy to search for the country class"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "232dd7b7-b962-4109-b205-27aaabf09ed5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q3624078'), ('objname', 'sovereign state')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q6256'), ('objname', 'country')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "2"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?obj ?objname WHERE {\n",
    "\n",
    "wd:Q38 wdt:P31 ?obj.\n",
    "\n",
    "?obj <http://schema.org/name> ?objname.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e90a8b4-dc09-4aab-82c2-e2e8c1e377f8",
   "metadata": {},
   "source": [
    "#### Let's print all entities that are instance of the found \"country\"(wd:Q6256)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "9abd0fd4-becd-40c0-ab1d-b880176203f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'Northern Mariana Islands')]\n",
      "[('countryname', 'Pahlavi Dynasty')]\n",
      "[('countryname', 'Danish Realm')]\n",
      "[('countryname', 'Dominican Republic')]\n",
      "[('countryname', 'Transnistria')]\n",
      "[('countryname', 'Republic of Artsakh')]\n",
      "[('countryname', 'The Gambia')]\n",
      "[('countryname', 'Guinea')]\n",
      "[('countryname', 'Guinea-Bissau')]\n",
      "[('countryname', 'Ivory Coast')]\n",
      "[('countryname', 'Cameroon')]\n",
      "[('countryname', 'Cape Verde')]\n",
      "[('countryname', 'Lesotho')]\n",
      "[('countryname', 'Liberia')]\n",
      "[('countryname', 'Libya')]\n",
      "[('countryname', 'Madagascar')]\n",
      "[('countryname', 'Malawi')]\n",
      "[('countryname', 'Mauritania')]\n",
      "[('countryname', 'Mauritius')]\n",
      "[('countryname', 'Morocco')]\n",
      "[('countryname', 'Mozambique')]\n",
      "[('countryname', 'Namibia')]\n",
      "[('countryname', 'Niger')]\n",
      "[('countryname', 'Nigeria')]\n",
      "[('countryname', 'Uganda')]\n",
      "[('countryname', 'Rwanda')]\n",
      "[('countryname', 'São Tomé and Príncipe')]\n",
      "[('countryname', 'Senegal')]\n",
      "[('countryname', 'Seychelles')]\n",
      "[('countryname', 'Sierra Leone')]\n",
      "[('countryname', 'Somalia')]\n",
      "[('countryname', 'Sudan')]\n",
      "[('countryname', 'Kenya')]\n",
      "[('countryname', 'Ethiopia')]\n",
      "[('countryname', 'Ghana')]\n",
      "[('countryname', 'France')]\n",
      "[('countryname', 'United Kingdom')]\n",
      "[('countryname', \"People's Republic of China\")]\n",
      "[('countryname', 'Brazil')]\n",
      "[('countryname', 'Canada')]\n",
      "[('countryname', 'American Samoa')]\n",
      "[('countryname', 'Japan')]\n",
      "[('countryname', 'Belarus')]\n",
      "[('countryname', 'Trucial States')]\n",
      "[('countryname', 'Norway')]\n",
      "[('countryname', 'Latvia')]\n",
      "[('countryname', 'Aruba')]\n",
      "[('countryname', 'Czech Republic')]\n",
      "[('countryname', 'Slovakia')]\n",
      "[('countryname', 'Romania')]\n",
      "[('countryname', 'Bulgaria')]\n",
      "[('countryname', 'Albania')]\n",
      "[('countryname', 'Croatia')]\n",
      "[('countryname', 'Andorra')]\n",
      "[('countryname', 'Electoral Palatinate')]\n",
      "[('countryname', 'Cyprus')]\n",
      "[('countryname', 'Kazakhstan')]\n",
      "[('countryname', 'Malta')]\n",
      "[('countryname', 'Montenegro')]\n",
      "[('countryname', 'Cuba')]\n",
      "[('countryname', 'Barbados')]\n",
      "[('countryname', 'Wales')]\n",
      "[('countryname', 'Indonesia')]\n",
      "[('countryname', 'South Africa')]\n",
      "[('countryname', 'Algeria')]\n",
      "[('countryname', 'Sint Maarten')]\n",
      "[('countryname', 'Uzbekistan')]\n",
      "[('countryname', 'Cook Islands')]\n",
      "[('countryname', 'Ireland')]\n",
      "[('countryname', 'Hungary')]\n",
      "[('countryname', 'Chile')]\n",
      "[('countryname', 'Kingdom of the Netherlands')]\n",
      "[('countryname', 'United States of America')]\n",
      "[('countryname', 'Finland')]\n",
      "[('countryname', 'Singapore')]\n",
      "[('countryname', 'Sweden')]\n",
      "[('countryname', 'Niue')]\n",
      "[('countryname', 'Liechtenstein')]\n",
      "[('countryname', 'Denmark')]\n",
      "[('countryname', 'Poland')]\n",
      "[('countryname', 'Italy')]\n",
      "[('countryname', 'Switzerland')]\n",
      "[('countryname', 'Galicia')]\n",
      "[('countryname', 'Bahrain')]\n",
      "[('countryname', 'Austria')]\n",
      "[('countryname', 'Australia')]\n",
      "[('countryname', 'Greece')]\n",
      "[('countryname', 'Argentina')]\n",
      "[('countryname', 'Peru')]\n",
      "[('countryname', 'North Korea')]\n",
      "[('countryname', 'Cambodia')]\n",
      "[('countryname', 'Turkey')]\n",
      "[('countryname', 'Portugal')]\n",
      "[('countryname', 'Netherlands')]\n",
      "[('countryname', 'East Timor')]\n",
      "[('countryname', 'Chad')]\n",
      "[('countryname', 'New Zealand')]\n",
      "[('countryname', 'India')]\n",
      "[('countryname', 'Tuvalu')]\n",
      "[('countryname', 'Samoa')]\n",
      "[('countryname', 'Solomon Islands')]\n",
      "[('countryname', 'Vanuatu')]\n",
      "[('countryname', 'Papua New Guinea')]\n",
      "[('countryname', 'Palau')]\n",
      "[('countryname', 'Nauru')]\n",
      "[('countryname', 'Federated States of Micronesia')]\n",
      "[('countryname', 'Marshall Islands')]\n",
      "[('countryname', 'Kiribati')]\n",
      "[('countryname', 'Mongolia')]\n",
      "[('countryname', 'Fiji')]\n",
      "[('countryname', 'Venezuela')]\n",
      "[('countryname', 'Paraguay')]\n",
      "[('countryname', 'Guyana')]\n",
      "[('countryname', 'Ecuador')]\n",
      "[('countryname', 'Colombia')]\n",
      "[('countryname', 'Bolivia')]\n",
      "[('countryname', 'Trinidad and Tobago')]\n",
      "[('countryname', 'Saint Vincent and the Grenadines')]\n",
      "[('countryname', 'Saint Lucia')]\n",
      "[('countryname', 'Saint Kitts and Nevis')]\n",
      "[('countryname', 'Jamaica')]\n",
      "[('countryname', 'Grenada')]\n",
      "[('countryname', 'Uruguay')]\n",
      "[('countryname', 'Guatemala')]\n",
      "[('countryname', 'The Bahamas')]\n",
      "[('countryname', 'Antigua and Barbuda')]\n",
      "[('countryname', 'Honduras')]\n",
      "[('countryname', 'Dominica')]\n",
      "[('countryname', 'Egypt')]\n",
      "[('countryname', 'Haiti')]\n",
      "[('countryname', 'El Salvador')]\n",
      "[('countryname', 'Iran')]\n",
      "[('countryname', 'Iraq')]\n",
      "[('countryname', 'Costa Rica')]\n",
      "[('countryname', 'Israel')]\n",
      "[('countryname', 'Yemen')]\n",
      "[('countryname', 'Jordan')]\n",
      "[('countryname', 'Nicaragua')]\n",
      "[('countryname', 'Kyrgyzstan')]\n",
      "[('countryname', 'Laos')]\n",
      "[('countryname', 'Lebanon')]\n",
      "[('countryname', 'Maldives')]\n",
      "[('countryname', 'Malaysia')]\n",
      "[('countryname', 'Myanmar')]\n",
      "[('countryname', 'Nepal')]\n",
      "[('countryname', 'Oman')]\n",
      "[('countryname', 'Pakistan')]\n",
      "[('countryname', 'Qatar')]\n",
      "[('countryname', 'Saudi Arabia')]\n",
      "[('countryname', 'Sri Lanka')]\n",
      "[('countryname', 'Syria')]\n",
      "[('countryname', 'Tajikistan')]\n",
      "[('countryname', 'Taiwan')]\n",
      "[('countryname', 'Thailand')]\n",
      "[('countryname', 'Turkmenistan')]\n",
      "[('countryname', 'United Arab Emirates')]\n",
      "[('countryname', 'Vietnam')]\n",
      "[('countryname', 'South Korea')]\n",
      "[('countryname', 'Afghanistan')]\n",
      "[('countryname', 'Bangladesh')]\n",
      "[('countryname', 'Mali')]\n",
      "[('countryname', 'Angola')]\n",
      "[('countryname', 'Bhutan')]\n",
      "[('countryname', 'Brunei')]\n",
      "[('countryname', 'Tanzania')]\n",
      "[('countryname', 'Philippines')]\n",
      "[('countryname', 'Central African Republic')]\n",
      "[('countryname', 'Togo')]\n",
      "[('countryname', 'Tunisia')]\n",
      "[('countryname', 'Zambia')]\n",
      "[('countryname', 'Zimbabwe')]\n",
      "[('countryname', 'South Sudan')]\n",
      "[('countryname', 'Mexico')]\n",
      "[('countryname', 'Benin')]\n",
      "[('countryname', 'Botswana')]\n",
      "[('countryname', 'Burkina Faso')]\n",
      "[('countryname', 'Burundi')]\n",
      "[('countryname', 'Comoros')]\n",
      "[('countryname', 'Republic of the Congo')]\n",
      "[('countryname', 'Democratic Republic of the Congo')]\n",
      "[('countryname', 'Djibouti')]\n",
      "[('countryname', 'Eritrea')]\n",
      "[('countryname', 'Somaliland')]\n",
      "[('countryname', 'Pahlavi Iran')]\n",
      "[('countryname', 'Gagauzia')]\n",
      "[('countryname', 'First Hellenic Republic')]\n",
      "[('countryname', 'State of Somaliland')]\n",
      "[('countryname', 'Principality of Masserano')]\n",
      "[('countryname', 'Kingdom of Africa')]\n",
      "[('countryname', 'Bulawayo')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "190"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ebd048b2-28bb-4341-9c9c-6acd04a63c2c",
   "metadata": {},
   "source": [
    "#### I inspect their properties to try to remove the little noise in these data (countries that doesn't exists anymore)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "33c738ff-095d-4397-9d07-b195154d9d7d",
   "metadata": {},
   "outputs": [],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?p ?pname (COUNT(?p) AS ?number) WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         ?p ?obj.\n",
    "\n",
    "?p <http://schema.org/name> ?pname.\n",
    "}\n",
    "GROUP BY ?p ?pname\n",
    "ORDER BY DESC(?number)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b7ef809-a355-41bb-a672-70e0324afa7d",
   "metadata": {},
   "source": [
    "#### I found \"dissolved, abolished or demolished state\"(wd:P576),so i exclude them from the list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "910fee17-1778-454f-822a-2df76d09828f",
   "metadata": {},
   "outputs": [],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af9eba95-0d49-4f55-b893-40ef42349026",
   "metadata": {},
   "source": [
    "#### Subquery, i try to retrieve current country that are monarchies right now (so they don't have the \"dissolved...\" property)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "f20f8617-72e5-42b0-ae86-6f23c66c0fe0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'Danish Realm')]\n",
      "[('countryname', 'Lesotho')]\n",
      "[('countryname', 'Morocco')]\n",
      "[('countryname', 'United Kingdom')]\n",
      "[('countryname', 'Canada')]\n",
      "[('countryname', 'Japan')]\n",
      "[('countryname', 'Norway')]\n",
      "[('countryname', 'Andorra')]\n",
      "[('countryname', 'Kingdom of the Netherlands')]\n",
      "[('countryname', 'Sweden')]\n",
      "[('countryname', 'Liechtenstein')]\n",
      "[('countryname', 'Denmark')]\n",
      "[('countryname', 'Bahrain')]\n",
      "[('countryname', 'Australia')]\n",
      "[('countryname', 'Cambodia')]\n",
      "[('countryname', 'Netherlands')]\n",
      "[('countryname', 'New Zealand')]\n",
      "[('countryname', 'Papua New Guinea')]\n",
      "[('countryname', 'Saint Vincent and the Grenadines')]\n",
      "[('countryname', 'Saint Lucia')]\n",
      "[('countryname', 'Saint Kitts and Nevis')]\n",
      "[('countryname', 'The Bahamas')]\n",
      "[('countryname', 'Jordan')]\n",
      "[('countryname', 'Malaysia')]\n",
      "[('countryname', 'Oman')]\n",
      "[('countryname', 'Qatar')]\n",
      "[('countryname', 'Saudi Arabia')]\n",
      "[('countryname', 'Thailand')]\n",
      "[('countryname', 'United Arab Emirates')]\n",
      "[('countryname', 'Bhutan')]\n",
      "[('countryname', 'Brunei')]\n",
      "[('countryname', 'Kingdom of Africa')]\n",
      "[('countryname', 'Barbados')]\n",
      "[('countryname', 'Tuvalu')]\n",
      "[('countryname', 'Solomon Islands')]\n",
      "[('countryname', 'Jamaica')]\n",
      "[('countryname', 'Grenada')]\n",
      "[('countryname', 'Antigua and Barbuda')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "38"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba31b789-f843-46c7-adfc-f927e5fffab4",
   "metadata": {},
   "source": [
    "#### Now i try to get countries that now are not monarchies but they were in the past, by using \"replaced by\"(wdt:P1366)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b1dc9006-e327-43b7-9433-5908aa381a1c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', \"People's Republic of China\")]\n",
      "[('countryname', 'Japan')]\n",
      "[('countryname', 'Croatia')]\n",
      "[('countryname', 'Andorra')]\n",
      "[('countryname', 'Montenegro')]\n",
      "[('countryname', 'Hungary')]\n",
      "[('countryname', 'Liechtenstein')]\n",
      "[('countryname', 'Italy')]\n",
      "[('countryname', 'Turkey')]\n",
      "[('countryname', 'Taiwan')]\n",
      "[('countryname', 'India')]\n",
      "[('countryname', 'Haiti')]\n",
      "[('countryname', 'Iran')]\n",
      "[('countryname', 'United Arab Emirates')]\n",
      "[('countryname', 'Portugal')]\n",
      "[('countryname', 'Uzbekistan')]\n",
      "[('countryname', 'Tajikistan')]\n",
      "[('countryname', 'Turkmenistan')]\n",
      "[('countryname', 'United Kingdom')]\n",
      "[('countryname', 'Brazil')]\n",
      "[('countryname', 'Ireland')]\n",
      "[('countryname', 'Pakistan')]\n",
      "[('countryname', 'Tanzania')]\n",
      "[('countryname', 'Libya')]\n",
      "[('countryname', 'Albania')]\n",
      "[('countryname', 'Malta')]\n",
      "[('countryname', 'Indonesia')]\n",
      "[('countryname', 'South Africa')]\n",
      "[('countryname', 'Finland')]\n",
      "[('countryname', 'Denmark')]\n",
      "[('countryname', 'Bahrain')]\n",
      "[('countryname', 'Netherlands')]\n",
      "[('countryname', 'New Zealand')]\n",
      "[('countryname', 'Solomon Islands')]\n",
      "[('countryname', 'Fiji')]\n",
      "[('countryname', 'Guyana')]\n",
      "[('countryname', 'Bolivia')]\n",
      "[('countryname', 'Egypt')]\n",
      "[('countryname', 'Nicaragua')]\n",
      "[('countryname', 'Nepal')]\n",
      "[('countryname', 'Saudi Arabia')]\n",
      "[('countryname', 'Sri Lanka')]\n",
      "[('countryname', 'Zimbabwe')]\n",
      "[('countryname', 'Vietnam')]\n",
      "[('countryname', 'Cyprus')]\n",
      "[('countryname', 'Galicia')]\n",
      "[('countryname', 'Mongolia')]\n",
      "[('countryname', 'North Korea')]\n",
      "[('countryname', 'Burundi')]\n",
      "[('countryname', 'Guinea')]\n",
      "[('countryname', 'Ivory Coast')]\n",
      "[('countryname', 'Mauritania')]\n",
      "[('countryname', 'Niger')]\n",
      "[('countryname', 'Senegal')]\n",
      "[('countryname', 'Mali')]\n",
      "[('countryname', 'Benin')]\n",
      "[('countryname', 'Burkina Faso')]\n",
      "[('countryname', 'Sierra Leone')]\n",
      "[('countryname', 'Israel')]\n",
      "[('countryname', 'Jordan')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "60"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname WHERE {\n",
    "\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "      wdt:P1366+ ?country.     \n",
    "\n",
    "?country wdt:P31 wd:Q6256.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6410bab0-d26b-4df9-aaa5-cc0ab3a19d99",
   "metadata": {},
   "source": [
    "#### Now i fuse the two subqueries and aggregate the country by continent"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "4836f189-7915-409f-be11-84f84ebfd76a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('continent', 'Asia'), ('number', '30')]\n",
      "[('continent', 'Europe'), ('number', '20')]\n",
      "[('continent', 'Africa'), ('number', '18')]\n",
      "[('continent', 'North America'), ('number', '13')]\n",
      "[('continent', 'Insular Oceania'), ('number', '7')]\n",
      "[('continent', 'South America'), ('number', '3')]\n",
      "[('continent', 'Central America'), ('number', '2')]\n",
      "[('continent', 'Eurasia'), ('number', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "8"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?continent (COUNT(?country) AS ?number) WHERE {\n",
    "\n",
    "?country wdt:P30 ?con.\n",
    "\n",
    "#Subquery for finding the countries\n",
    "{\n",
    "SELECT DISTINCT ?country WHERE {\n",
    "{\n",
    "?mon (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "      wdt:P1366+ ?country.     \n",
    "?country wdt:P31 wd:Q6256.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "UNION\n",
    "{\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "}\n",
    "}\n",
    "?con <http://schema.org/name> ?continent.\n",
    "}\n",
    "GROUP BY ?continent\n",
    "ORDER BY DESC (?number)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b401cf7-6585-4da3-91e3-507aa00e6604",
   "metadata": {},
   "source": [
    "## Task 5.1 How many sub-types of monarchy exist? How many instances of exist of each one?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bd55fa2a-40d6-4ae5-a022-a8ab617efa6f",
   "metadata": {},
   "source": [
    "#### Let's try to get all subclasses of the monarchy government type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "fa7b24a6-7637-4524-b33a-bdeed5383a52",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('subname', 'patrimonialism')]\n",
      "[('subname', 'feudal monarchy')]\n",
      "[('subname', 'despotism')]\n",
      "[('subname', 'elective monarchy')]\n",
      "[('subname', 'hereditary monarchy')]\n",
      "[('subname', 'absolute monarchy')]\n",
      "[('subname', 'federal monarchy')]\n",
      "[('subname', 'parliamentary monarchy')]\n",
      "[('subname', 'constitutional monarchy')]\n",
      "[('subname', 'monarchy')]\n",
      "[('subname', 'kingdom')]\n",
      "[('subname', 'polysynodal regime')]\n",
      "[('subname', 'principality')]\n",
      "[('subname', 'Bourbon Reforms')]\n",
      "[('subname', 'regency')]\n",
      "[('subname', 'parliamentary coprincipality')]\n",
      "[('subname', 'Tanistry')]\n",
      "[('subname', 'composite monarchy')]\n",
      "[('subname', 'abbey-principality')]\n",
      "[('subname', 'Electoral Principate')]\n",
      "[('subname', 'ecclesiastical principality')]\n",
      "[('subname', 'crown land of the Austrian Empire')]\n",
      "[('subname', 'Hochstift')]\n",
      "[('subname', 'duchy')]\n",
      "[('subname', 'petty kingdom')]\n",
      "[('subname', 'list of Indonesian monarchies')]\n",
      "[('subname', 'part principality')]\n",
      "[('subname', 'grand duchy')]\n",
      "[('subname', 'Duchies of Silesia')]\n",
      "[('subname', 'emirate of the United Arab Emirates')]\n",
      "[('subname', 'empire')]\n",
      "[('subname', 'Khaganate')]\n",
      "[('subname', 'self-proclaimed monarchy')]\n",
      "[('subname', 'royal elections in Poland')]\n",
      "[('subname', 'Aramean (disambiguation)')]\n",
      "[('subname', 'ducado')]\n",
      "[('subname', 'Commonwealth realm')]\n",
      "[('subname', 'Pflegamt')]\n",
      "[('subname', 'Upper Oka Principalities')]\n",
      "[('subname', 'Swabian Circle')]\n",
      "[('subname', 'Ernestine duchies')]\n",
      "[('subname', 'Sheikhdom')]\n",
      "[('subname', 'stem duchy')]\n",
      "[('subname', 'Saeristavo')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "44"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?subname WHERE { \n",
    "\n",
    "?p (wdt:P31|wdt:P122) ?o.\n",
    " ?o wdt:P279* wd:Q7269. \n",
    "\n",
    "?o <http://schema.org/name> ?subname.\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db4c8309-baf1-45fd-b96a-3455a8a125a2",
   "metadata": {},
   "source": [
    "#### I try to get only the last step, to see if results are better"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3d71ea64-7763-4538-ba1a-bd255343a2fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('subname', 'patrimonialism')]\n",
      "[('subname', 'feudal monarchy')]\n",
      "[('subname', 'despotism')]\n",
      "[('subname', 'elective monarchy')]\n",
      "[('subname', 'hereditary monarchy')]\n",
      "[('subname', 'absolute monarchy')]\n",
      "[('subname', 'federal monarchy')]\n",
      "[('subname', 'constitutional monarchy')]\n",
      "[('subname', 'duchy')]\n",
      "[('subname', 'kingdom')]\n",
      "[('subname', 'list of Indonesian monarchies')]\n",
      "[('subname', 'monarchy of Barbados')]\n",
      "[('subname', 'principality')]\n",
      "[('subname', 'empire')]\n",
      "[('subname', 'self-proclaimed monarchy')]\n",
      "[('subname', 'regency')]\n",
      "[('subname', 'emperor system')]\n",
      "[('subname', 'tsarism')]\n",
      "[('subname', 'Monarchy of Liechtenstein')]\n",
      "[('subname', 'divine rights monarchy')]\n",
      "[('subname', 'monarchies in Europe')]\n",
      "[('subname', 'Tanistry')]\n",
      "[('subname', 'composite monarchy')]\n",
      "[('subname', 'Semi-constitutional monarchy')]\n",
      "[('subname', 'Monarchies in Africa')]\n",
      "[('subname', 'Pre-modern Korea')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "26"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?subname WHERE { \n",
    "\n",
    " ?o wdt:P279 wd:Q7269. \n",
    "\n",
    "?o <http://schema.org/name> ?subname.\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e23a5c3-cd68-4096-aec6-4c368486e4ed",
   "metadata": {},
   "source": [
    "#### A better subset, let's count them...I reuse a query for last task to get countries that are monarchies right now and let's count by their type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7420aae6-7058-4a68-97e0-47e540e16de1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('type', 'constitutional monarchy'), ('number', '34')]\n",
      "[('type', 'kingdom'), ('number', '19')]\n",
      "[('type', 'absolute monarchy'), ('number', '4')]\n",
      "[('type', 'federal monarchy'), ('number', '3')]\n",
      "[('type', 'elective monarchy'), ('number', '1')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?type (COUNT(?country) AS ?number) WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* ?o.\n",
    "\n",
    "?o wdt:P279 wd:Q7269. \n",
    "?o <http://schema.org/name> ?type.\n",
    "\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "GROUP BY(?type)\n",
    "ORDER BY DESC (?number)\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bcfdcaf2-3cd2-4a9b-9b55-e8efa49488a0",
   "metadata": {},
   "source": [
    "#### We notice that right now the majority of the monarchies are constitutionals one."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67e6f7e9-b60c-4ba1-9988-a39ac0cf29e6",
   "metadata": {},
   "source": [
    "### Task - 5.2 Are there cities that have been capital of multiple kingdoms?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa6b36e2-bc4b-4e18-98b4-0645d40a7b48",
   "metadata": {},
   "source": [
    "#### I use the property \"capital\" (wdt:P36) found at the beginning"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "054a38b5-106d-4e14-b85f-67ee8fad233e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('capitalname', 'London'), ('kingdoms', '8')]\n",
      "[('capitalname', 'Kutaisi'), ('kingdoms', '7')]\n",
      "[('capitalname', 'Madrid'), ('kingdoms', '7')]\n",
      "[('capitalname', 'Rio de Janeiro'), ('kingdoms', '7')]\n",
      "[('capitalname', 'Vienna'), ('kingdoms', '6')]\n",
      "[('capitalname', 'Paris'), ('kingdoms', '6')]\n",
      "[('capitalname', 'Cairo'), ('kingdoms', '6')]\n",
      "[('capitalname', 'Prague'), ('kingdoms', '5')]\n",
      "[('capitalname', 'Belgrade'), ('kingdoms', '5')]\n",
      "[('capitalname', 'Riyadh'), ('kingdoms', '5')]\n",
      "[('capitalname', 'Berlin'), ('kingdoms', '5')]\n",
      "[('capitalname', 'Bago'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Naples'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Vilnius'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Palermo'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Kraków'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Turin'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Rome'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Florence'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Tbilisi'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Lahore'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Copenhagen'), ('kingdoms', '4')]\n",
      "[('capitalname', 'Pavia'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Baghdad'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Stockholm'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Dresden'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Tabriz'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Brunswick'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Valladolid'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Bukhara'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Budapest'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Königsberg'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Tirana'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Moscow'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Hyderabad'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Gotha'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Cetinje'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Jerusalem'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Cape Town'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Stari Ras'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Luxembourg'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Riga'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Isfahan'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Toledo'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Kassel'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Ravenna'), ('kingdoms', '3')]\n",
      "[('capitalname', \"Chang'an\"), ('kingdoms', '3')]\n",
      "[('capitalname', 'Damascus'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Babylon'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Mexico City'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Stuttgart'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Buda'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Herat'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Vientiane'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Constantinople'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Milan'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Kashgar City'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Düsseldorf'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Delhi'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Hanover'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Amsterdam'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Kuala Lumpur'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Bucharest'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Muscat'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Kabul'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Zagreb'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Warsaw'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Harare'), ('kingdoms', '3')]\n",
      "[('capitalname', 'City of Brussels'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Karlsruhe'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Tehran'), ('kingdoms', '3')]\n",
      "[('capitalname', 'Benghazi'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Sinop'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Thessaloniki'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Detmold'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Magdeburg'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Kyoto'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Pretoria'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Halych'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Konya'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Aachen'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Bridgetown'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Luang Prabang'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Thanjavur'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Weimar'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Melfi'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Montreal'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Phnom Penh'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Saint Petersburg'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Kyiv'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Diriyah'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Lisbon'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Samarkand'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Ctesiphon'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Tiaret'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Ecbatana'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Regensburg'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Salvador'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Frankfurt am Main'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Edessa'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Taungoo'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Bangkok'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Helsinki'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Eutin'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Burgos'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Cap-Haïtien'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Zeila'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Lviv'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Turquoise Mountain'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Golkonda'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Aleppo'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Honiara'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Bolgar'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Abu Dhabi'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Sofia'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Salerno'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Zadar'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Pyongyang'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Carthage'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Worms'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Susa'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Wellington'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Tokyo'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Biograd na Moru'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Dublin'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Boston'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Bloemfontein'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Winchester'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Brandenburg an der Havel'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Ray'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Ljubljana'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Gniezno'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Luoyang'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Tunis'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Port-au-Prince'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Munich'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Darmstadt'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Athens'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Manama'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Wrocław'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Skopje'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Opava'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Marrakesh'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Karakorum'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Takam'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Alba Iulia'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Seville'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Basseterre'), ('kingdoms', '2')]\n",
      "[('capitalname', \"Saint John's\"), ('kingdoms', '2')]\n",
      "[('capitalname', 'Xianyang'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Cologne'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Barda'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Parma'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Coimbra'), ('kingdoms', '2')]\n",
      "[('capitalname', \"St. George's\"), ('kingdoms', '2')]\n",
      "[('capitalname', 'Trento'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Khanbaliq'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Seleucia'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Lhasa'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Oslo'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Lucca'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Dessau'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Nicaea'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Lutherstadt Wittenberg'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Krujë'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Zaslaŭje'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Metz'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Mahdia'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Valletta'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Opole'), ('kingdoms', '2')]\n",
      "[('capitalname', 'Pataliputra'), ('kingdoms', '2')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "171"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?capitalname (COUNT (DISTINCT ?p) AS ?kingdoms) WHERE{\n",
    "\n",
    "?p (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "   wdt:P36 ?capital.\n",
    "\n",
    "?capital <http://schema.org/name> ?capitalname.  \n",
    "}GROUP BY (?capitalname)\n",
    "HAVING ((COUNT (DISTINCT ?p)) > 1)\n",
    "ORDER BY DESC (?kingdoms)\n",
    "\n",
    "\"\"\"\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1844c91f-21f4-4184-ac08-bafeb487d78b",
   "metadata": {},
   "source": [
    "### Task - 5.3 Which are the top-3 monarchies with the earliest inception and still existing?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85522d02-39bc-44e0-b16e-7f456b559097",
   "metadata": {},
   "source": [
    "#### I reuse a country made before to obtain the countries that are monarchies right now and i pick the oldest one by using the property found at the beginning \"inception\" (wdt:P571)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "7945d967-3cf4-4f7d-9191-f7a1d82b00b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'Danish Realm'), ('inception', '0800-01-01T00:00:00Z')]\n",
      "[('countryname', 'Lesotho'), ('inception', '1966-01-01T00:00:00Z')]\n",
      "[('countryname', 'Morocco'), ('inception', '-399-01-01T00:00:00Z')]\n",
      "[('countryname', 'United Kingdom'), ('inception', '1927-04-12T00:00:00Z')]\n",
      "[('countryname', 'Canada'), ('inception', '1867-07-01T00:00:00Z')]\n",
      "[('countryname', 'Japan'), ('inception', '1947-05-03T00:00:00Z')]\n",
      "[('countryname', 'Norway'), ('inception', '0900-01-01T00:00:00Z')]\n",
      "[('countryname', 'Norway'), ('inception', '1814-05-17T00:00:00Z')]\n",
      "[('countryname', 'Norway'), ('inception', '1905-06-07T00:00:00Z')]\n",
      "[('countryname', 'Norway'), ('inception', '1905-10-26T00:00:00Z')]\n",
      "[('countryname', 'Andorra'), ('inception', '1278-01-01T00:00:00Z')]\n",
      "[('countryname', 'Kingdom of the Netherlands'), ('inception', '1815-03-16T00:00:00Z')]\n",
      "[('countryname', 'Sweden'), ('inception', '0700-01-01T00:00:00Z')]\n",
      "[('countryname', 'Liechtenstein'), ('inception', '1806-07-12T00:00:00Z')]\n",
      "[('countryname', 'Denmark'), ('inception', '0800-01-01T00:00:00Z')]\n",
      "[('countryname', 'Bahrain'), ('inception', '1971-08-14T00:00:00Z')]\n",
      "[('countryname', 'Australia'), ('inception', '1901-01-01T00:00:00Z')]\n",
      "[('countryname', 'Cambodia'), ('inception', '1953-11-09T00:00:00Z')]\n",
      "[('countryname', 'Netherlands'), ('inception', '1954-12-15T00:00:00Z')]\n",
      "[('countryname', 'New Zealand'), ('inception', '1907-09-26T00:00:00Z')]\n",
      "[('countryname', 'New Zealand'), ('inception', '1986-12-13T00:00:00Z')]\n",
      "[('countryname', 'Papua New Guinea'), ('inception', '1975-01-01T00:00:00Z')]\n",
      "[('countryname', 'Saint Vincent and the Grenadines'), ('inception', '1979-01-01T00:00:00Z')]\n",
      "[('countryname', 'Saint Lucia'), ('inception', '1967-03-01T00:00:00Z')]\n",
      "[('countryname', 'Saint Lucia'), ('inception', '1979-02-22T00:00:00Z')]\n",
      "[('countryname', 'Saint Kitts and Nevis'), ('inception', '1967-02-27T00:00:00Z')]\n",
      "[('countryname', 'The Bahamas'), ('inception', '1973-01-01T00:00:00Z')]\n",
      "[('countryname', 'Jordan'), ('inception', '1946-01-01T00:00:00Z')]\n",
      "[('countryname', 'Malaysia'), ('inception', '1957-01-01T00:00:00Z')]\n",
      "[('countryname', 'Oman'), ('inception', '1970-07-23T00:00:00Z')]\n",
      "[('countryname', 'Qatar'), ('inception', '1870-01-01T00:00:00Z')]\n",
      "[('countryname', 'Saudi Arabia'), ('inception', '1727-01-01T00:00:00Z')]\n",
      "[('countryname', 'Thailand'), ('inception', '1238-01-01T00:00:00Z')]\n",
      "[('countryname', 'Thailand'), ('inception', '1768-12-28T00:00:00Z')]\n",
      "[('countryname', 'United Arab Emirates'), ('inception', '1971-01-01T00:00:00Z')]\n",
      "[('countryname', 'Bhutan'), ('inception', '1949-08-08T00:00:00Z')]\n",
      "[('countryname', 'Brunei'), ('inception', '1984-01-01T00:00:00Z')]\n",
      "[('countryname', 'Kingdom of Africa'), ('inception', '2020-05-25T00:00:00Z')]\n",
      "[('countryname', 'Barbados'), ('inception', '1966-11-30T00:00:00Z')]\n",
      "[('countryname', 'Tuvalu'), ('inception', '1978-01-01T00:00:00Z')]\n",
      "[('countryname', 'Solomon Islands'), ('inception', '1978-01-01T00:00:00Z')]\n",
      "[('countryname', 'Jamaica'), ('inception', '1962-01-01T00:00:00Z')]\n",
      "[('countryname', 'Grenada'), ('inception', '1974-01-01T00:00:00Z')]\n",
      "[('countryname', 'Antigua and Barbuda'), ('inception', '1981-11-01T00:00:00Z')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "44"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?countryname ?inception WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "         wdt:P571 ?inception.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "0d214520-b013-444c-a6e4-5062cf46cd81",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryname', 'Sweden')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q756617'), ('countryname', 'Danish Realm')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryname', 'Denmark')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?country ?countryname  WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "         wdt:P571 ?inception.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER NOT EXISTS{?country wdt:P576 ?obj.}\n",
    "}\n",
    "ORDER BY ASC (?inception)\n",
    "LIMIT 3\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6af6ae33-ca95-4366-b561-3113a0da43c2",
   "metadata": {},
   "source": [
    "#### I remove one instance of Denmark to have 3 different countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "a0cd9090-7368-4ac1-bda3-d6660337f37e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('country', 'http://www.wikidata.org/entity/Q34'), ('countryname', 'Sweden')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q35'), ('countryname', 'Denmark')]\n",
      "[('country', 'http://www.wikidata.org/entity/Q20'), ('countryname', 'Norway')]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "queryString= \"\"\"\n",
    "SELECT DISTINCT ?country ?countryname  WHERE {\n",
    "\n",
    "?country wdt:P31 wd:Q6256;\n",
    "         (wdt:P31|wdt:P122)/wdt:P279* wd:Q7269;\n",
    "         wdt:P571 ?inception.\n",
    "\n",
    "?country <http://schema.org/name> ?countryname.\n",
    "FILTER (NOT EXISTS{?country wdt:P576 ?obj.} && ?country!=wd:Q756617)\n",
    "}\n",
    "ORDER BY ASC (?inception)\n",
    "LIMIT 3\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7a89994d-a1fe-4357-ad7b-fe3dd4c551f3",
   "metadata": {},
   "source": [
    "#### Se we see that the oldest monarchies reported are 3 countries from northern Europe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d6d2bf4-2369-410b-9e80-580b1b0e0609",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
