{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "866bb340",
   "metadata": {},
   "source": [
    "# General instructions\n",
    "\n",
    "The goal of the project is to materialize a set of **exploratory workloads** over a real-world, large-scale,  open-domain KG: [WikiData](https://www.wikidata.org/wiki/Wikidata:Main_Page)\n",
    "\n",
    "An exploratory workload  is composed by a set of queries, where each query is related to the information obtained previously.\n",
    "\n",
    "An exploratory workload starts with a usually vague, open ended question, and does not assume the person issuing the workload has a clear understanding of the data contained in the target database or its structure.\n",
    "\n",
    "Remeber that:\n",
    "\n",
    "1. All the queries must run in the python notebook\n",
    "2. You can use classes and properties only if you find them via a SPARQL query that must be present in the notebook\n",
    "3. You do not delete useless queries. Keep everything that is synthatically valid \n",
    "\n",
    "```\n",
    "?p <http://schema.org/name> ?name .\n",
    "```\n",
    "    \n",
    "    is the BGP returning a human-readable name of a property or a class in Wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "19143fea",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SETUP used later\n",
    "\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "\n",
    "prefixString = \"\"\"\n",
    "##-5e12566aa5-##\n",
    "PREFIX wd: <http://www.wikidata.org/entity/> \n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/> \n",
    "PREFIX sc: <http://schema.org/>\n",
    "\"\"\"\n",
    "\n",
    "# select and construct queries\n",
    "def run_query(queryString,verbose = True):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        results = sparql.query()\n",
    "        json_results = results.convert()\n",
    "        if len(json_results['results']['bindings'])==0:\n",
    "            print(\"Empty\")\n",
    "            return []\n",
    "        array = []\n",
    "        for bindings in json_results['results']['bindings']:\n",
    "            app =  [ (var, value['value'])  for var, value in bindings.items() ] \n",
    "            if verbose:\n",
    "                print( app)\n",
    "            array.append(app)\n",
    "        if verbose:\n",
    "            print(len(array))\n",
    "        return array\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)\n",
    "    \n",
    "# ASk queries\n",
    "def run_ask_query(queryString):\n",
    "    to_run = prefixString + \"\\n\" + queryString\n",
    "\n",
    "    sparql = SPARQLWrapper(\"http://a256-gc1-03.srv.aau.dk:5820/sparql\")\n",
    "    sparql.setTimeout(300)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    sparql.setQuery(to_run)\n",
    "\n",
    "    try :\n",
    "        return sparql.query().convert()\n",
    "\n",
    "    except Exception as e :\n",
    "        print(\"The operation failed\", e)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b74994a",
   "metadata": {},
   "source": [
    "# History Workflow Series (\"Euro explorative search\") \n",
    "\n",
    "Consider the following exploratory information need:\n",
    "\n",
    "> investigate the Euro currency, which are the countries that currently use the Euro and which were their currencies before the Euro. Take a look also to other currencies and find which are the most used."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8ff5e0d",
   "metadata": {},
   "source": [
    "## Useful URIs for the current workflow\n",
    "The following are given:\n",
    "\n",
    "| IRI           | Description   | Role      |\n",
    "| -----------   | -----------   |-----------|\n",
    "| `wdt:P1647`   | subproperty   | predicate |\n",
    "| `wdt:P31`     | instance of   | predicate |\n",
    "| `wdt:P106`    | occupation    | predicate | \n",
    "| `wdt:P279`    | subclass      | predicate |\n",
    "| `wdt:P27`     | nationality   | predicate |\n",
    "| `wd:Q5`| Human       | node |\n",
    "| `wd:Q38`| Italy   | node |\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5cccfbc4",
   "metadata": {},
   "source": [
    "\n",
    "\n",
    "\n",
    "Also consider\n",
    "\n",
    "```\n",
    "wd:Q38 ?p ?obj .\n",
    "```\n",
    "\n",
    "is the BGP to retrieve all **properties of Italy**\n",
    "\n",
    "Please consider that when you return a resource, you should return the IRI and the label of the resource. In particular, when the task require you to identify a BGP the result set must always be a list of couples IRI - label.\n",
    "\n",
    "\n",
    "\n",
    "The workload should:\n",
    "\n",
    "\n",
    "1. Identify the BGP for currency\n",
    "\n",
    "2. Return the countries which currently use Euro\n",
    "\n",
    "3. Return the countries belonging to the European Union, with a currency different from the Euro (return also their currency).\n",
    "\n",
    "4. For each country that now uses Euro return which was the currencies used before\n",
    "\n",
    "5. Return all types of dollar in the world (US Dollar, Australian Dollar, ecc...)\n",
    "\n",
    "6. Return the currencies used in at least 2 different countries (return also the number of countries using each currency).\n",
    "\n",
    "7. Consider the currencies obtained in task 6, for each currency return the number of people using that currency (hint: consider the maximum popolation available for each country)."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c7edcda8",
   "metadata": {},
   "source": [
    "## Task 1\n",
    "Identify the BGP for currency"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "d3366ced",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q488981'), ('oname', 'European Bank for Reconstruction and Development'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33973'), ('oname', 'Sicilian'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7791'), ('oname', 'history of Italy'), ('p', 'http://www.wikidata.org/prop/direct/P2184'), ('pname', 'history of topic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q42876'), ('oname', 'flag of Italy'), ('p', 'http://www.wikidata.org/prop/direct/P163'), ('pname', 'flag')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1273'), ('oname', 'Tuscany'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33845'), ('oname', 'Neapolitan'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1153087'), ('oname', 'Inter-American Development Bank'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1237'), ('oname', 'Trentino-South Tyrol'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33441'), ('oname', 'Friulian'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q848633'), ('oname', 'International Chamber of Commerce'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3919890'), ('oname', 'Category:Italian people'), ('p', 'http://www.wikidata.org/prop/direct/P1792'), ('pname', 'category of associated people')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1016'), ('oname', 'Libya'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1043527'), ('oname', 'Multilateral Investment Guarantee Agency'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1045'), ('oname', 'Somalia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1061257'), ('oname', '112'), ('p', 'http://www.wikidata.org/prop/direct/P2852'), ('pname', 'emergency telephone number')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1065'), ('oname', 'United Nations'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1072120'), ('oname', 'Missile Technology Control Regime'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1123613'), ('oname', 'Schuko'), ('p', 'http://www.wikidata.org/prop/direct/P2853'), ('pname', 'electrical plug type')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q114'), ('oname', 'Kenya'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q115'), ('oname', 'Ethiopia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1210'), ('oname', 'Lombardy'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1216'), ('oname', 'Piedmont'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1222'), ('oname', 'Aosta Valley'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q123209'), ('oname', 'Latin Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1243'), ('oname', 'Veneto'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1246'), ('oname', 'Kosovo'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q125761'), ('oname', 'International Civil Aviation Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1263'), ('oname', 'Emilia-Romagna'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13196750'), ('oname', 'left'), ('p', 'http://www.wikidata.org/prop/direct/P5658'), ('pname', 'railway traffic side')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1377612'), ('oname', 'European Payments Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1378312'), ('oname', 'Europlug'), ('p', 'http://www.wikidata.org/prop/direct/P2853'), ('pname', 'electrical plug type')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q13924'), ('oname', 'Adriatic Sea'), ('p', 'http://www.wikidata.org/prop/direct/P206'), ('pname', 'located in or next to body of water')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q141720'), ('oname', 'European Air Transport Command'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q142'), ('oname', 'France'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q142'), ('oname', 'France'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q145'), ('oname', 'United Kingdom'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1452'), ('oname', 'Basilicata'), ('p', 'http://www.wikidata.org/prop/direct/P150'), ('pname', 'contains administrative territorial entity')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q14565199'), ('oname', 'right'), ('p', 'http://www.wikidata.org/prop/direct/P1622'), ('pname', 'driving side')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q148'), ('oname', \"People's Republic of China\"), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1480793'), ('oname', 'Nuclear Suppliers Group'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q150'), ('oname', 'French'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q151991'), ('oname', 'European Southern Observatory'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1520890'), ('oname', 'Type L'), ('p', 'http://www.wikidata.org/prop/direct/P2853'), ('pname', 'electrical plug type')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q155'), ('oname', 'Brazil'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q159'), ('oname', 'Russia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q159583'), ('oname', 'Holy See'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16'), ('oname', 'Canada'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q161549'), ('oname', 'European Coal and Steel Community'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q17'), ('oname', 'Japan'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q170424'), ('oname', 'World Meteorological Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172579'), ('oname', 'Kingdom of Italy'), ('p', 'http://www.wikidata.org/prop/direct/P1365'), ('pname', 'replaces')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172579'), ('oname', 'Kingdom of Italy'), ('p', 'http://www.wikidata.org/prop/direct/P155'), ('pname', 'follows')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q17495'), ('oname', 'Universal Postal Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q177773'), ('oname', 'World Intellectual Property Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q183'), ('oname', 'Germany'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q184'), ('oname', 'Belarus'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q188'), ('oname', 'German'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q188822'), ('oname', 'Asian Development Bank'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q189'), ('oname', 'Iceland'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q189946'), ('oname', 'Western European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q191'), ('oname', 'Estonia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q191384'), ('oname', 'International Bank for Reconstruction and Development'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19180675'), ('oname', 'Small Brockhaus and Efron Encyclopedic Dictionary'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q192177'), ('oname', 'Union for the Mediterranean'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1928989'), ('oname', 'Treaty on Open Skies'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q196627'), ('oname', \"New Year's Day\"), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1969730'), ('oname', 'Schengen Area'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19771'), ('oname', 'G20'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19809'), ('oname', 'Christmas'), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q20'), ('oname', 'Norway'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q201054'), ('oname', 'International Maritime Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q209663'), ('oname', 'Easter Monday'), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q211'), ('oname', 'Latvia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q212'), ('oname', 'Ukraine'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q213'), ('oname', 'Czech Republic'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q214'), ('oname', 'Slovakia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q215'), ('oname', 'Slovenia'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q215'), ('oname', 'Slovenia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q217'), ('oname', 'Moldova'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q218'), ('oname', 'Romania'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q219'), ('oname', 'Bulgaria'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q220'), ('oname', 'Rome'), ('p', 'http://www.wikidata.org/prop/direct/P36'), ('pname', 'capital')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q221'), ('oname', 'North Macedonia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q222'), ('oname', 'Albania'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q224'), ('oname', 'Croatia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q225'), ('oname', 'Bosnia and Herzegovina'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q227'), ('oname', 'Azerbaijan'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q228'), ('oname', 'Andorra'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q229'), ('oname', 'Cyprus'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q230'), ('oname', 'Georgia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q233'), ('oname', 'Malta'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q233'), ('oname', 'Malta'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q233611'), ('oname', 'International Hydrographic Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q235'), ('oname', 'Monaco'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q236'), ('oname', 'Montenegro'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q237'), ('oname', 'Vatican City'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q238'), ('oname', 'San Marino'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q238'), ('oname', 'San Marino'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q252'), ('oname', 'Indonesia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25648804'), ('oname', '113'), ('p', 'http://www.wikidata.org/prop/direct/P2852'), ('pname', 'emergency telephone number')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q25648805'), ('oname', '115'), ('p', 'http://www.wikidata.org/prop/direct/P2852'), ('pname', 'emergency telephone number')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q258'), ('oname', 'South Africa'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2657718'), ('oname', 'Armenian Soviet Encyclopedia'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q27'), ('oname', 'Ireland'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q28'), ('oname', 'Hungary'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q29'), ('oname', 'Spain'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q298'), ('oname', 'Chile'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q30'), ('oname', 'United States of America'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q302556'), ('oname', 'Catholic Encyclopedia'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q31'), ('oname', 'Belgium'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3174312'), ('oname', 'free country'), ('p', 'http://www.wikidata.org/prop/direct/P1552'), ('pname', 'has quality')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q32'), ('oname', 'Luxembourg'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33'), ('oname', 'Finland'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q332711'), ('oname', 'President of Italy'), ('p', 'http://www.wikidata.org/prop/direct/P1906'), ('pname', 'office held by head of state')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q33976'), ('oname', 'Sardinian'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q34'), ('oname', 'Sweden'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q340195'), ('oname', 'African Development Bank'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q347'), ('oname', 'Liechtenstein'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q35'), ('oname', 'Denmark'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36'), ('oname', 'Poland'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3624078'), ('oname', 'sovereign state'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q36704'), ('oname', 'Yugoslavia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q37'), ('oname', 'Lithuania'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q37143'), ('oname', 'G8'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q376150'), ('oname', 'International Telecommunication Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3772571'), ('oname', 'Caribbean Development Bank'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q38'), ('oname', 'Italy'), ('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q386120'), ('oname', 'United Nations Industrial Development Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3866537'), ('oname', 'Movement Coordination Centre Europe'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q39'), ('oname', 'Switzerland'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q39'), ('oname', 'Switzerland'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q399'), ('oname', 'Armenia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q40'), ('oname', 'Austria'), ('p', 'http://www.wikidata.org/prop/direct/P47'), ('pname', 'shares border with')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q40'), ('oname', 'Austria'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q403'), ('oname', 'Serbia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q408'), ('oname', 'Australia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4086271'), ('oname', 'Bible Encyclopedia of Archimandrite Nicephorus'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41'), ('oname', 'Greece'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4114391'), ('oname', 'Sytin Military Encyclopedia'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q414'), ('oname', 'Argentina'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41550'), ('oname', 'Organisation for Economic Cooperation and Development'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4173137'), ('oname', 'Jewish Encyclopedia of Brockhaus and Efron'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q419'), ('oname', 'Peru'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q41984'), ('oname', 'International Atomic Energy Agency'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4198907'), ('oname', 'parliamentary republic'), ('p', 'http://www.wikidata.org/prop/direct/P122'), ('pname', 'basic form of government')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q42262'), ('oname', 'European Space Agency'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q423'), ('oname', 'North Korea'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q42944'), ('oname', 'CERN'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q43'), ('oname', 'Turkey'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q45'), ('oname', 'Portugal'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q45177'), ('oname', 'Visa Waiver Program'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q46'), ('oname', 'Europe'), ('p', 'http://www.wikidata.org/prop/direct/P30'), ('pname', 'continent')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q46'), ('oname', 'Europe'), ('p', 'http://www.wikidata.org/prop/direct/P361'), ('pname', 'part of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q47488'), ('oname', 'International Criminal Court'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q47499'), ('oname', \"International Workers' Day\"), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('pname', 'currency')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4918'), ('oname', 'Mediterranean Sea'), ('p', 'http://www.wikidata.org/prop/direct/P206'), ('pname', 'located in or next to body of water')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q521227'), ('oname', 'Organisation for Joint Armament Cooperation'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q54129'), ('oname', 'International Labour Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q54439832'), ('oname', 'WikiProject Zika Corpus'), ('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5460604'), ('oname', 'Wikipedia:Vital articles'), ('p', 'http://www.wikidata.org/prop/direct/P5008'), ('pname', 'on focus list of Wikimedia project')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q55'), ('oname', 'Netherlands'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q5611262'), ('oname', 'Group on Earth Observations'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q587'), ('oname', \"All Saints' Day\"), ('p', 'http://www.wikidata.org/prop/direct/P832'), ('pname', 'public holiday')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q602358'), ('oname', 'Brockhaus and Efron Encyclopedic Dictionary'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q61923'), ('oname', 'World Tourism Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q6256'), ('oname', 'country'), ('p', 'http://www.wikidata.org/prop/direct/P31'), ('pname', 'instance of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q652'), ('oname', 'Italian'), ('p', 'http://www.wikidata.org/prop/direct/P2936'), ('pname', 'language used')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q652'), ('oname', 'Italian'), ('p', 'http://www.wikidata.org/prop/direct/P37'), ('pname', 'official language')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q656801'), ('oname', 'International Finance Corporation'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q663492'), ('oname', 'Eurocontrol'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q664'), ('oname', 'New Zealand'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q668'), ('oname', 'India'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q689859'), ('oname', 'International Fund for Agricultural Development'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7184'), ('oname', 'NATO'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q733'), ('oname', 'Paraguay'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q739'), ('oname', 'Colombia'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q77'), ('oname', 'Uruguay'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7804'), ('oname', 'International Monetary Fund'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7809'), ('oname', 'UNESCO'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7817'), ('oname', 'World Health Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7825'), ('oname', 'World Trade Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q782942'), ('oname', 'Australia Group'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q79'), ('oname', 'Egypt'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q794'), ('oname', 'Iran'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q796'), ('oname', 'Iraq'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q801'), ('oname', 'Israel'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q805'), ('oname', 'Yemen'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q81299'), ('oname', 'Organization for Security and Co-operation in Europe'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q82151'), ('oname', 'Food and Agriculture Organization'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q822'), ('oname', 'Lebanon'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q826700'), ('oname', 'International Energy Agency'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q827525'), ('oname', 'International Development Association'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q842490'), ('oname', 'Organisation for the Prohibition of Chemical Weapons'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q843'), ('oname', 'Pakistan'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8475'), ('oname', 'Interpol'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q865'), ('oname', 'Taiwan'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q867541'), ('oname', 'Encyclopædia Britannica 11th edition'), ('p', 'http://www.wikidata.org/prop/direct/P1343'), ('pname', 'described by source')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q869'), ('oname', 'Thailand'), ('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation')]\n",
      "200\n"
     ]
    }
   ],
   "source": [
    "# query example\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname ?p ?pname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?o .\n",
    "   # get the label\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname.      \n",
    "}\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "55501ed2-bde4-4d8e-b7c8-34c2aa5ebb0d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'software version identifier'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'tabular software version'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'has edition or translation'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Fonsi Nieto'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', \"Al Stewart's albums in chronological order\"), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Category:Adelina Lopes Vieira'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Lubomír Stoklásek'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Ciudad Vieja'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Echániz'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "[('obj', 'http://www.wikidata.org/entity/Q4916'), ('curname', 'Natuna'), ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# searching for the same thing with filtering \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?obj ?curname ?p ?name \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q38 ?p ?obj .\n",
    "   # get the label\n",
    "   ?o sc:name ?curname .\n",
    "   ?p sc:name ?name.\n",
    "   \n",
    "   \n",
    "   FILTER(REGEX(?name ,\"currency*\"^^xsd:string))\n",
    "      \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "5c13d9e1-9cad-4842-a2df-72533a8eeefe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q1628531'), ('sname', 'Quintanar de la Orden')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q673727'), ('sname', 'Neudau')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q28124876'), ('sname', 'Ilmspan')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q11959'), ('sname', 'Alicante')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q25362'), ('sname', 'Saint Barthélemy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q17054'), ('sname', 'Martinique')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q656699'), ('sname', 'Montsoreau')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q624511'), ('sname', 'Aracena')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q1246'), ('sname', 'Kosovo')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q126125'), ('sname', 'Saint Martin (French part)')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q129003'), ('sname', 'French Southern and Antarctic Lands')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q13116'), ('sname', 'Benelux')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q1943433'), ('sname', 'Molenwaard')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q212429'), ('sname', 'Metropolitan France')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q228'), ('sname', 'Andorra')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q229'), ('sname', 'Cyprus')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q233'), ('sname', 'Malta')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q235'), ('sname', 'Monaco')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q236'), ('sname', 'Montenegro')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q237'), ('sname', 'Vatican City')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q238'), ('sname', 'San Marino')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q25263'), ('sname', 'Azores')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q27'), ('sname', 'Ireland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q29'), ('sname', 'Spain')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q29999'), ('sname', 'Kingdom of the Netherlands')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q31'), ('sname', 'Belgium')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q32'), ('sname', 'Luxembourg')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q33'), ('sname', 'Finland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q37'), ('sname', 'Lithuania')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q3769'), ('sname', 'French Guiana')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q40'), ('sname', 'Austria')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q41'), ('sname', 'Greece')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q45'), ('sname', 'Portugal')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q458'), ('sname', 'European Union')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q55'), ('sname', 'Netherlands')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q5705'), ('sname', 'Catalonia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q67585'), ('sname', 'Münchringen')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q720507'), ('sname', 'economy of the European Union')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q8062'), ('sname', 'economy of the Republic of Ireland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q8268'), ('sname', 'Eurozone')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q869882'), ('sname', 'Noyales')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q12258'), ('sname', 'Sabadell')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro'), ('s', 'http://www.wikidata.org/entity/Q17012'), ('sname', 'Guadeloupe')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER(REGEX(?oname ,\"euro*\"^^xsd:string))   \n",
    "      \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bc2f9705",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "823e9262",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q8428168'), ('oname', 'stored-value card'), ('s', 'http://www.wikidata.org/entity/Q7296276'), ('sname', 'Rav-Kav')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4591'), ('oname', 'Cape Verdean escudo'), ('s', 'http://www.wikidata.org/entity/Q1011'), ('sname', 'Cape Verde')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4591'), ('oname', 'Cape Verdean escudo'), ('s', 'http://www.wikidata.org/entity/Q4393598'), ('sname', 'Republic of the Cape Verde Islands')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q22907080'), ('oname', 'Carthaginian currency'), ('s', 'http://www.wikidata.org/entity/Q2429397'), ('sname', 'Ancient Carthage')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1246307'), ('oname', 'Tornesel'), ('s', 'http://www.wikidata.org/entity/Q30890672'), ('sname', 'Kingdom of Sicily')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1542162'), ('oname', 'Tarì'), ('s', 'http://www.wikidata.org/entity/Q30890672'), ('sname', 'Kingdom of Sicily')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1542162'), ('oname', 'Tarì'), ('s', 'http://www.wikidata.org/entity/Q188586'), ('sname', 'Kingdom of Sicily')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3658911'), ('oname', 'Carlino'), ('s', 'http://www.wikidata.org/entity/Q30890672'), ('sname', 'Kingdom of Sicily')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q383187'), ('oname', 'notgeld'), ('s', 'http://www.wikidata.org/entity/Q694858'), ('sname', 'Free State Bottleneck')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q503370'), ('oname', 'Kraków złoty'), ('s', 'http://www.wikidata.org/entity/Q501303'), ('sname', 'Free City of Kraków')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7567738'), ('oname', 'South Korean won'), ('s', 'http://www.wikidata.org/entity/Q491559'), ('sname', 'First Republic of South Korea')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7567738'), ('oname', 'South Korean won'), ('s', 'http://www.wikidata.org/entity/Q484370'), ('sname', \"People's Republic of Korea\")]\n",
      "[('o', 'http://www.wikidata.org/entity/Q7567738'), ('oname', 'South Korean won'), ('s', 'http://www.wikidata.org/entity/Q484104'), ('sname', 'United States Army Military Government in Korea')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8047970'), ('oname', 'Korean won'), ('s', 'http://www.wikidata.org/entity/Q498735'), ('sname', 'division of Korea')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8047970'), ('oname', 'Korean won'), ('s', 'http://www.wikidata.org/entity/Q28233'), ('sname', 'Korean Empire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q8047970'), ('oname', 'Korean won'), ('s', 'http://www.wikidata.org/entity/Q28278'), ('sname', 'Provisional Government of the Republic of Korea')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q16957'), ('sname', 'German Democratic Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q713750'), ('sname', 'West Germany')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q1150680'), ('sname', 'Republic of Montenegro')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q37024'), ('sname', 'Serbia and Montenegro')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q150981'), ('sname', 'North German Confederation')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q61928556'), ('sname', 'Rauenberg')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q39486995'), ('sname', 'DEM/GBP')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q39487002'), ('sname', 'DEM/JPY')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16068'), ('oname', 'Deutsche Mark'), ('s', 'http://www.wikidata.org/entity/Q39486994'), ('sname', 'USD/DEM')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q550050'), ('sname', 'Belgrade Stock Exchange')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q241748'), ('sname', 'Kingdom of Serbia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q403'), ('sname', 'Serbia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q37024'), ('sname', 'Serbia and Montenegro')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q934644'), ('sname', 'Republic of Serbia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q1261763'), ('sname', 'economy of Serbia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q701914'), ('sname', 'Territory of the Military Commander in Serbia')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q1060479'), ('sname', 'North Kosovo')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q172524'), ('oname', 'Serbian dinar'), ('s', 'http://www.wikidata.org/entity/Q2041762'), ('sname', 'Bojnik')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4241612'), ('oname', 'Fiume krone'), ('s', 'http://www.wikidata.org/entity/Q1423581'), ('sname', 'Italian Regency of Carnaro')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4241612'), ('oname', 'Fiume krone'), ('s', 'http://www.wikidata.org/entity/Q548114'), ('sname', 'Free State of Fiume')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q596214'), ('sname', 'Reichskommissariat Niederlande')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q7646305'), ('sname', 'Surinam')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q15864'), ('sname', 'United Kingdom of the Netherlands')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q170072'), ('sname', 'Dutch Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q188553'), ('sname', 'Batavian Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q25396'), ('sname', 'Bonaire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q788472'), ('oname', 'Dutch guilder'), ('s', 'http://www.wikidata.org/entity/Q212278'), ('sname', 'Kingdom of Holland')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency'), ('s', 'http://www.wikidata.org/entity/Q2277'), ('sname', 'Roman Empire')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency'), ('s', 'http://www.wikidata.org/entity/Q42834'), ('sname', 'Western Roman Empire (395-476 AD)')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency'), ('s', 'http://www.wikidata.org/entity/Q17167'), ('sname', 'Roman Republic')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q952064'), ('oname', 'Roman currency'), ('s', 'http://www.wikidata.org/entity/Q1247508'), ('sname', 'Domain of Soissons')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2299665'), ('oname', 'French Indian rupee'), ('s', 'http://www.wikidata.org/entity/Q646374'), ('sname', 'French India')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q244696'), ('oname', 'peso'), ('s', 'http://www.wikidata.org/entity/Q2748388'), ('sname', 'Province of Tierra Firme')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q244696'), ('oname', 'peso'), ('s', 'http://www.wikidata.org/entity/Q2077243'), ('sname', 'Captaincy General of Guatemala')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "506b767e",
   "metadata": {},
   "source": [
    "## Task 2\n",
    "Return the countries which currently use Euro"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "9c57f8c2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q1628531'), ('sname', 'Quintanar de la Orden'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q673727'), ('sname', 'Neudau'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28124876'), ('sname', 'Ilmspan'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q11959'), ('sname', 'Alicante'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25362'), ('sname', 'Saint Barthélemy'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17054'), ('sname', 'Martinique'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q656699'), ('sname', 'Montsoreau'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q624511'), ('sname', 'Aracena'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1246'), ('sname', 'Kosovo'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q126125'), ('sname', 'Saint Martin (French part)'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q129003'), ('sname', 'French Southern and Antarctic Lands'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q13116'), ('sname', 'Benelux'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1943433'), ('sname', 'Molenwaard'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q212429'), ('sname', 'Metropolitan France'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q228'), ('sname', 'Andorra'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q229'), ('sname', 'Cyprus'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q233'), ('sname', 'Malta'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q235'), ('sname', 'Monaco'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q236'), ('sname', 'Montenegro'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q237'), ('sname', 'Vatican City'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q238'), ('sname', 'San Marino'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25263'), ('sname', 'Azores'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q27'), ('sname', 'Ireland'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29'), ('sname', 'Spain'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29999'), ('sname', 'Kingdom of the Netherlands'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31'), ('sname', 'Belgium'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q32'), ('sname', 'Luxembourg'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q33'), ('sname', 'Finland'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37'), ('sname', 'Lithuania'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3769'), ('sname', 'French Guiana'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q40'), ('sname', 'Austria'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41'), ('sname', 'Greece'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q45'), ('sname', 'Portugal'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q458'), ('sname', 'European Union'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q55'), ('sname', 'Netherlands'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q5705'), ('sname', 'Catalonia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q67585'), ('sname', 'Münchringen'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q720507'), ('sname', 'economy of the European Union'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8062'), ('sname', 'economy of the Republic of Ireland'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8268'), ('sname', 'Eurozone'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q869882'), ('sname', 'Noyales'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q12258'), ('sname', 'Sabadell'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17012'), ('sname', 'Guadeloupe'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17070'), ('sname', 'Réunion'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q5689'), ('sname', 'Åland'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q936563'), ('sname', 'Italian Bourse'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q649612'), ('sname', 'Coca'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1150680'), ('sname', 'Republic of Montenegro'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4513926'), ('sname', 'Montenegro Stock Exchange'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1771153'), ('sname', 'Albuixech'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4502305'), ('sname', 'Huma'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17063'), ('sname', 'Mayotte'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37024'), ('sname', 'Serbia and Montenegro'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34617'), ('sname', 'Saint Pierre and Miquelon'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2982948'), ('sname', 'European Collectivity of Alsace'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q755341'), ('sname', 'Athens Exchange'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q686790'), ('sname', 'Mediona'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1444150'), ('sname', 'Alboloduy'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q917883'), ('sname', 'Molina de Segura'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1726029'), ('sname', 'canton of Lézardrieux'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1631311'), ('sname', 'Cuéllar'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1769772'), ('sname', 'Bierge / Biarche'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q628991'), ('sname', 'Tamariz de Campos'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q3777251'), ('sname', 'Leap card'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q112558'), ('sname', 'Republic of Saugeais'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34234153'), ('sname', 'Liberapay'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8050'), ('sname', 'economy of Spain'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8057'), ('sname', 'economy of France'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28124877'), ('sname', 'Schönfeld'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q61928556'), ('sname', 'Rauenberg'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28124875'), ('sname', 'Gerchsheim'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q8085'), ('sname', 'economy of Austria'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q7942521'), ('sname', 'Voyvodovo, Haskovo Province'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q138837'), ('sname', 'Catalan Republic'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q190571'), ('sname', 'Scattered Islands in the Indian Ocean'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1644430'), ('sname', 'Monreal del Campo'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q39486975'), ('sname', 'EUR/USD'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q39486982'), ('sname', 'EUR/JPY'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1026524'), ('sname', 'Hivange'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1299355'), ('sname', 'economy of Slovenia'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q9031607'), ('sname', 'BME Growth'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q73330139'), ('sname', 'Verdis'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q98834701'), ('sname', 'Adriatic Bank'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q39486984'), ('sname', 'EUR/GBP'), ('oname', 'euro')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1423680'), ('sname', 'Gay and Lesbian Kingdom of the Coral Sea Islands'), ('oname', 'euro')]\n",
      "92\n"
     ]
    }
   ],
   "source": [
    "# here it's returned the cities and towns which use euro\n",
    "# ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?oname  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER(REGEX(?oname ,\"euro*\"^^xsd:string))   \n",
    "      \n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4cf8534b-fb98-4600-9f3d-e64fa17d20b3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1005'), ('oname', 'The Gambia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P208'), ('pname', 'executive body'), ('o', 'http://www.wikidata.org/entity/Q1005903'), ('oname', 'federal level of Germany')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1008'), ('oname', 'Ivory Coast')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1011'), ('oname', 'Cape Verde')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1013'), ('oname', 'Lesotho')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1014'), ('oname', 'Liberia')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1020'), ('oname', 'Malawi')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1025'), ('oname', 'Mauritania')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1027'), ('oname', 'Mauritius')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1028'), ('oname', 'Morocco')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1029'), ('oname', 'Mozambique')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1033'), ('oname', 'Nigeria')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1036'), ('oname', 'Uganda')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1037'), ('oname', 'Rwanda')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1039'), ('oname', 'São Tomé and Príncipe')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1041'), ('oname', 'Senegal')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of'), ('o', 'http://www.wikidata.org/entity/Q1043527'), ('oname', 'Multilateral Investment Guarantee Agency')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1044'), ('oname', 'Sierra Leone')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1049'), ('oname', 'Sudan')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P530'), ('pname', 'diplomatic relation'), ('o', 'http://www.wikidata.org/entity/Q1050'), ('oname', 'Eswatini')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#not relevant \n",
    "# [('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany'), ('oname', 'euro')]\n",
    "# [('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o ?oname  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   wd:Q183 ?p ?o .\n",
    "   ?p sc:name ?pname .\n",
    "   ?o sc:name ?oname .    \n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "1cc51130-bfb5-455b-b94a-5db2983cca3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1532'), ('pname', 'country for sport')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P205'), ('pname', 'basin country')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P27'), ('pname', 'country of citizenship')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P495'), ('pname', 'country of origin')]\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P8047'), ('pname', 'country of registry')]\n",
      "6\n"
     ]
    }
   ],
   "source": [
    "# [('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany'), ('oname', 'euro')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s ?p wd:Q183 .\n",
    "   ?p sc:name ?pname .\n",
    "   ?s sc:name ?sname .    \n",
    "\n",
    "   FILTER(REGEX(?pname ,\"country*\"^^xsd:string)) \n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "9e99601e-40ae-4312-8525-7d1f47c7f19e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q2535173'), ('sname', 'South Vietnam Air Force'), ('o', 'http://www.wikidata.org/entity/Q180573'), ('oname', 'South Vietnam')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q16171015'), ('sname', 'Arshamuni'), ('o', 'http://www.wikidata.org/entity/Q2981019'), ('oname', 'Ostikanate of Arminiya')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q10889269'), ('sname', 'Aolai'), ('o', 'http://www.wikidata.org/entity/Q10889269'), ('oname', 'Aolai')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17029014'), ('sname', 'Mount Huaguo'), ('o', 'http://www.wikidata.org/entity/Q10889269'), ('oname', 'Aolai')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6207845'), ('sname', 'Jodhpur State'), ('o', 'http://www.wikidata.org/entity/Q6124144'), ('oname', 'Jaipur State')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q21000095'), ('sname', 'Plaisance'), ('o', 'http://www.wikidata.org/entity/Q7646305'), ('oname', 'Surinam')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1247214'), ('sname', 'Soba'), ('o', 'http://www.wikidata.org/entity/Q449639'), ('oname', 'Alodia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q156418'), ('sname', 'Kingdom of Hawaiʻi'), ('o', 'http://www.wikidata.org/entity/Q156418'), ('oname', 'Kingdom of Hawaiʻi')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q180573'), ('sname', 'South Vietnam'), ('o', 'http://www.wikidata.org/entity/Q180573'), ('oname', 'South Vietnam')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q235030'), ('sname', 'Principality of Antioch'), ('o', 'http://www.wikidata.org/entity/Q235030'), ('oname', 'Principality of Antioch')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q2996516'), ('sname', 'Kamsarakan'), ('o', 'http://www.wikidata.org/entity/Q2981019'), ('oname', 'Ostikanate of Arminiya')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q601505'), ('sname', 'House of Kamehameha'), ('o', 'http://www.wikidata.org/entity/Q156418'), ('oname', 'Kingdom of Hawaiʻi')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q693980'), ('sname', 'Duchy of Swabia'), ('o', 'http://www.wikidata.org/entity/Q153080'), ('oname', 'East Francia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q18917'), ('sname', 'Army of the Republic of Vietnam'), ('o', 'http://www.wikidata.org/entity/Q180573'), ('oname', 'South Vietnam')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q435'), ('sname', 'Library of Alexandria'), ('o', 'http://www.wikidata.org/entity/Q202311'), ('oname', 'Egypt')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q503370'), ('sname', 'Kraków złoty'), ('o', 'http://www.wikidata.org/entity/Q501303'), ('oname', 'Free City of Kraków')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q6733257'), ('sname', 'Maharaja of Patiala'), ('o', 'http://www.wikidata.org/entity/Q917553'), ('oname', 'Patiala State')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q212056'), ('sname', \"Mongolian People's Republic\"), ('o', 'http://www.wikidata.org/entity/Q212056'), ('oname', \"Mongolian People's Republic\")]\n",
      "[('s', 'http://www.wikidata.org/entity/Q4241612'), ('sname', 'Fiume krone'), ('o', 'http://www.wikidata.org/entity/Q548114'), ('oname', 'Free State of Fiume')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q208169'), ('sname', 'Republic of Ragusa'), ('o', 'http://www.wikidata.org/entity/Q208169'), ('oname', 'Republic of Ragusa')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#not relevant\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?o ?oname\n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P17 ?o .\n",
    "   ?o sc:name ?oname .\n",
    "   ?s sc:name ?sname .    \n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "bcfde08d-4fd1-4e03-ae6e-b4c7fddb18cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q1628531'), ('sname', 'Quintanar de la Orden')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q673727'), ('sname', 'Neudau')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28124876'), ('sname', 'Ilmspan')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q11959'), ('sname', 'Alicante')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q25362'), ('sname', 'Saint Barthélemy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q17054'), ('sname', 'Martinique')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q656699'), ('sname', 'Montsoreau')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q624511'), ('sname', 'Aracena')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1246'), ('sname', 'Kosovo')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q126125'), ('sname', 'Saint Martin (French part)')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#again returned cities\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 wd:Q4916 ;\n",
    "      sc:name ?sname .\n",
    "FILTER EXISTS {\n",
    "  # bind something\n",
    "   ?s wdt:P17 ?o .\n",
    "}      \n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "ca3d11f3-0823-4f5b-b02c-f0f8ebc26b59",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sname', 'Alicante')]\n",
      "[('sname', 'Saint Barthélemy')]\n",
      "[('sname', 'Martinique')]\n",
      "[('sname', 'Kosovo')]\n",
      "[('sname', 'Saint Martin (French part)')]\n",
      "[('sname', 'French Southern and Antarctic Lands')]\n",
      "[('sname', 'France')]\n",
      "[('sname', 'Germany')]\n",
      "[('sname', 'Estonia')]\n",
      "[('sname', 'Latvia')]\n",
      "[('sname', 'Slovakia')]\n",
      "[('sname', 'Slovenia')]\n",
      "[('sname', 'Andorra')]\n",
      "[('sname', 'Cyprus')]\n",
      "[('sname', 'Malta')]\n",
      "[('sname', 'Monaco')]\n",
      "[('sname', 'Montenegro')]\n",
      "[('sname', 'Vatican City')]\n",
      "[('sname', 'San Marino')]\n",
      "[('sname', 'Ireland')]\n",
      "[('sname', 'Spain')]\n",
      "[('sname', 'Kingdom of the Netherlands')]\n",
      "[('sname', 'Belgium')]\n",
      "[('sname', 'Luxembourg')]\n",
      "[('sname', 'Finland')]\n",
      "[('sname', 'Lithuania')]\n",
      "[('sname', 'French Guiana')]\n",
      "[('sname', 'Italy')]\n",
      "[('sname', 'Austria')]\n",
      "[('sname', 'Greece')]\n",
      "[('sname', 'Portugal')]\n",
      "[('sname', 'European Union')]\n",
      "[('sname', 'Netherlands')]\n",
      "[('sname', 'Guadeloupe')]\n",
      "[('sname', 'Réunion')]\n",
      "[('sname', 'Åland')]\n",
      "[('sname', 'Serbia and Montenegro')]\n",
      "[('sname', 'Saint Pierre and Miquelon')]\n",
      "[('sname', 'Catalan Republic')]\n",
      "[('sname', 'Verdis')]\n",
      "40\n"
     ]
    }
   ],
   "source": [
    "# Changed the ?s to ?o \n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?o wdt:P38 wd:Q4916 ;\n",
    "      sc:name ?sname .\n",
    "FILTER EXISTS {\n",
    "  # bind something\n",
    "   ?s wdt:P17 ?o .\n",
    "}      \n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "4e9fe307-5d2e-4005-80ba-32f4960c0a78",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q229'), ('sname', 'Cyprus')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q233'), ('sname', 'Malta')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q27'), ('sname', 'Ireland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29'), ('sname', 'Spain')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29999'), ('sname', 'Kingdom of the Netherlands')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31'), ('sname', 'Belgium')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q32'), ('sname', 'Luxembourg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q33'), ('sname', 'Finland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37'), ('sname', 'Lithuania')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q40'), ('sname', 'Austria')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41'), ('sname', 'Greece')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q45'), ('sname', 'Portugal')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# get the info from the first query task_1\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 wd:Q4916 ;\n",
    "      sc:name ?sname .\n",
    "FILTER EXISTS {\n",
    "  # bind something\n",
    "   ?s wdt:P463 wd:Q458 .\n",
    "}      \n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bbae3f28",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "722e2b93",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q229'), ('sname', 'Cyprus')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q233'), ('sname', 'Malta')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q27'), ('sname', 'Ireland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29'), ('sname', 'Spain')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29999'), ('sname', 'Kingdom of the Netherlands')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31'), ('sname', 'Belgium')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q32'), ('sname', 'Luxembourg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q33'), ('sname', 'Finland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37'), ('sname', 'Lithuania')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q40'), ('sname', 'Austria')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41'), ('sname', 'Greece')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q45'), ('sname', 'Portugal')]\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#countries which currently use euro\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname \n",
    "WHERE {\n",
    "   # country which currency euro\n",
    "   ?s wdt:P38 wd:Q4916 ;\n",
    "      sc:name ?sname .\n",
    "      \n",
    "FILTER EXISTS {\n",
    "  # country which is the member of EU\n",
    "   ?s wdt:P463 wd:Q458 .\n",
    "    }  \n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5805a74d",
   "metadata": {},
   "source": [
    "## Task 3\n",
    "Return the countries belonging to the European Union, with a currency different from the Euro (return also their currency)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "d8d3efc2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany'), ('o', 'http://www.wikidata.org/entity/Q189946'), ('oname', 'Western European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy'), ('o', 'http://www.wikidata.org/entity/Q189946'), ('oname', 'Western European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q145'), ('sname', 'United Kingdom'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q213'), ('sname', 'Czech Republic'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia'), ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# get the info from the first query task_1\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?o ?oname  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P463 ?o ;\n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER(REGEX(?oname ,\"European Union*\"^^xsd:string))   \n",
    "      \n",
    "}\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "59e82fd4-98b2-4010-8c25-7bc308f42b17",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q142'), ('sname', 'France')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q145'), ('sname', 'United Kingdom')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q183'), ('sname', 'Germany')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q191'), ('sname', 'Estonia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q211'), ('sname', 'Latvia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q213'), ('sname', 'Czech Republic')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q214'), ('sname', 'Slovakia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q215'), ('sname', 'Slovenia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q218'), ('sname', 'Romania')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q219'), ('sname', 'Bulgaria')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q224'), ('sname', 'Croatia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q229'), ('sname', 'Cyprus')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q233'), ('sname', 'Malta')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q27'), ('sname', 'Ireland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28'), ('sname', 'Hungary')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29'), ('sname', 'Spain')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q29999'), ('sname', 'Kingdom of the Netherlands')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q31'), ('sname', 'Belgium')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q32'), ('sname', 'Luxembourg')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q33'), ('sname', 'Finland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34'), ('sname', 'Sweden')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q35'), ('sname', 'Denmark')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36'), ('sname', 'Poland')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q37'), ('sname', 'Lithuania')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q38'), ('sname', 'Italy')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q40'), ('sname', 'Austria')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q41'), ('sname', 'Greece')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q45'), ('sname', 'Portugal')]\n",
      "28\n"
     ]
    }
   ],
   "source": [
    "# ('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union')]\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P463 wd:Q458 ;\n",
    "      sc:name ?sname .\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "f8e613c5-feb6-4399-9bf0-6f5385196a1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "# ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname  \n",
    "WHERE {\n",
    "   # bind something\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "   ?o sc:name ?oname .\n",
    "   \n",
    "   FILTER(REGEX(?oname ,\"euro*\"^^xsd:string))   \n",
    "      \n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "66121844-791c-49d3-bc52-4a8d271d10cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q145'), ('sname', 'United Kingdom')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q213'), ('sname', 'Czech Republic')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q218'), ('sname', 'Romania')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q219'), ('sname', 'Bulgaria')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q224'), ('sname', 'Croatia')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28'), ('sname', 'Hungary')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34'), ('sname', 'Sweden')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q35'), ('sname', 'Denmark')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q36'), ('sname', 'Poland')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# Countries that are in Europian Union and not using euro currency \n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname  \n",
    "WHERE {\n",
    "    {\n",
    "   # bind something\n",
    "   ?s wdt:P463 wd:Q458 ;\n",
    "      sc:name ?sname   \n",
    "      \n",
    "}\n",
    "\n",
    "MINUS{\n",
    "  # bind something\n",
    "   ?s wdt:P38 wd:Q4916  \n",
    "}\n",
    "}\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "a3a7b9dd-cb82-47cc-a950-7189a91e9935",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q36'), ('sname', 'Poland'), ('oname', 'złoty')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q219'), ('sname', 'Bulgaria'), ('oname', 'Bulgarian lev')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28'), ('sname', 'Hungary'), ('oname', 'forint')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q218'), ('sname', 'Romania'), ('oname', 'Romanian leu')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q145'), ('sname', 'United Kingdom'), ('oname', 'pound sterling')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q224'), ('sname', 'Croatia'), ('oname', 'Croatian kuna')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q213'), ('sname', 'Czech Republic'), ('oname', 'Czech koruna')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q35'), ('sname', 'Denmark'), ('oname', 'Danish krone')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34'), ('sname', 'Sweden'), ('oname', 'Swedish krona')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?oname\n",
    "WHERE {\n",
    "    \n",
    "   # bind something\n",
    "   ?s wdt:P463 wd:Q458 ;\n",
    "      sc:name ?sname .  \n",
    "      \n",
    "FILTER NOT EXISTS {\n",
    "    ?s wdt:P38 wd:Q4916 \n",
    "}\n",
    "OPTIONAL{\n",
    "    ?s wdt:P38 ?o .\n",
    "    ?o sc:name ?oname\n",
    "    \n",
    "}\n",
    "\n",
    "\n",
    "\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9912e89d",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "068fe002",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q36'), ('sname', 'Poland'), ('oname', 'złoty'), ('o', 'http://www.wikidata.org/entity/Q123213')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q219'), ('sname', 'Bulgaria'), ('oname', 'Bulgarian lev'), ('o', 'http://www.wikidata.org/entity/Q172540')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q28'), ('sname', 'Hungary'), ('oname', 'forint'), ('o', 'http://www.wikidata.org/entity/Q47190')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q218'), ('sname', 'Romania'), ('oname', 'Romanian leu'), ('o', 'http://www.wikidata.org/entity/Q131645')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q145'), ('sname', 'United Kingdom'), ('oname', 'pound sterling'), ('o', 'http://www.wikidata.org/entity/Q25224')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q224'), ('sname', 'Croatia'), ('oname', 'Croatian kuna'), ('o', 'http://www.wikidata.org/entity/Q26360')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q213'), ('sname', 'Czech Republic'), ('oname', 'Czech koruna'), ('o', 'http://www.wikidata.org/entity/Q131016')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q35'), ('sname', 'Denmark'), ('oname', 'Danish krone'), ('o', 'http://www.wikidata.org/entity/Q25417')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q34'), ('sname', 'Sweden'), ('oname', 'Swedish krona'), ('o', 'http://www.wikidata.org/entity/Q122922')]\n",
      "9\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#countries belonging to the European Union, with a currency different from the Euro \n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?oname ?o\n",
    "WHERE {\n",
    "   # country member of EU\n",
    "   ?s wdt:P463 wd:Q458 ;\n",
    "      sc:name ?sname .  \n",
    "      \n",
    "FILTER NOT EXISTS {\n",
    "    #country currency euro\n",
    "    ?s wdt:P38 wd:Q4916 \n",
    "    }\n",
    "\n",
    "OPTIONAL{\n",
    "    #looking which country uses which currency\n",
    "    ?s wdt:P38 ?o .\n",
    "    ?o sc:name ?oname\n",
    "    }\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62b60a8c",
   "metadata": {},
   "source": [
    "## Task 4\n",
    "For each country that now uses Euro return which was the currencies used before"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "43afc3c3-9af9-4735-997c-e84f06736cfb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "The operation failed EndPointInternalError: endpoint returned code 500 and response. \n",
      "\n",
      "Response:\n",
      "b'Virtuoso 42S22 Error SQ149: The column \\'oname\\' was specified multiple times for \\'s_25_6_rbc\\'\\n\\nSPARQL query:\\ndefine sql:big-data-const 0\\n#output-format:application/sparql-results+json\\n\\n##-5e12566aa5-##\\nPREFIX wd: <http://www.wikidata.org/entity/> \\nPREFIX wdt: <http://www.wikidata.org/prop/direct/> \\nPREFIX sc: <http://schema.org/>\\n\\n\\nSELECT DISTINCT ?o ?oname ?pname ?oname\\nWHERE {\\n   # country which currency euro\\n   wd:Q29 ?p ?o .\\n      ?p sc:name ?pname .\\n      ?o sc:name ?oname .\\n      \\n      FILTER(REGEX(?pname ,\"currencies used before*\"^^xsd:string))   \\n\\n}\\n\\n\\nLIMIT 20\\n'\n"
     ]
    }
   ],
   "source": [
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname ?pname ?oname\n",
    "WHERE {\n",
    "   # country which currency euro\n",
    "   wd:Q29 ?p ?o .\n",
    "      ?p sc:name ?pname .\n",
    "      ?o sc:name ?oname .\n",
    "      \n",
    "      FILTER(REGEX(?pname ,\"currencies used before*\"^^xsd:string))   \n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "81cc60df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('l', 'http://www.wikidata.org/entity/Q3658911'), ('noteuro', 'Malta'), ('pname', 'Carlino')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q3658911'), ('noteuro', 'Italy'), ('pname', 'Carlino')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q16068'), ('noteuro', 'Germany'), ('pname', 'Deutsche Mark')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q203354'), ('noteuro', 'Finland'), ('pname', 'Finnish markka')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q214393'), ('noteuro', 'France'), ('pname', 'CFP Franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q2356117'), ('noteuro', 'France'), ('pname', 'New Caledonian franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q2356178'), ('noteuro', 'France'), ('pname', 'French Polynesian franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'France'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Germany'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Estonia'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Latvia'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Slovakia'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Slovenia'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Andorra'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Cyprus'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Malta'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Monaco'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Vatican City'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'San Marino'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Ireland'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Spain'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Belgium'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Luxembourg'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Finland'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Lithuania'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Italy'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Austria'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Greece'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Portugal'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q4916'), ('noteuro', 'Netherlands'), ('pname', 'euro')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q184172'), ('noteuro', 'France'), ('pname', 'French franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q184172'), ('noteuro', 'Andorra'), ('pname', 'French franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q184172'), ('noteuro', 'Monaco'), ('pname', 'French franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q189097'), ('noteuro', 'Andorra'), ('pname', 'peseta')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q189097'), ('noteuro', 'Spain'), ('pname', 'peseta')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q468474'), ('noteuro', 'Portugal'), ('pname', 'Portuguese escudo')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q1380156'), ('noteuro', 'Greece'), ('pname', 'Greek phoenix')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q1546443'), ('noteuro', 'Greece'), ('pname', 'Greek drachma')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q133011'), ('noteuro', 'Latvia'), ('pname', 'Latvian lats')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q174467'), ('noteuro', 'Malta'), ('pname', 'Maltese lira')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q15634537'), ('noteuro', 'Spain'), ('pname', 'Spanish Guinea peseta')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q183354'), ('noteuro', 'Vatican City'), ('pname', 'Vatican lira')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q129983'), ('noteuro', 'Estonia'), ('pname', 'Estonian kroon')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q213940'), ('noteuro', 'Luxembourg'), ('pname', 'Luxembourg franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q2616592'), ('noteuro', 'France'), ('pname', 'French West African franc')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q1130620'), ('noteuro', 'Lithuania'), ('pname', 'Lithuanian talonas')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q25627'), ('noteuro', 'Lithuania'), ('pname', 'Lithuanian litas')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q193716'), ('noteuro', 'Cyprus'), ('pname', 'Cypriot pound')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q1620502'), ('noteuro', 'Spain'), ('pname', 'Catalan peseta')]\n",
      "[('l', 'http://www.wikidata.org/entity/Q232415'), ('noteuro', 'Belgium'), ('pname', 'Belgian franc')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#| `wdt:P31`     | instance of \n",
    "# wd:Q8142 -> Currency\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?l ?noteuro ?pname \n",
    "#?pname  ?currencyname ?ins ?incname ?noteuro\n",
    "WHERE {\n",
    "  # country that used different currencies from now\n",
    "     wd:Q4916 wdt:P17 ?p .\n",
    "     #?p wdt:P38 ?cur.\n",
    "     ?l wdt:P31 wd:Q8142;\n",
    "         wdt:P17 ?p.\n",
    "     \n",
    "     \n",
    "    #?cur sc:name ?currencyname .\n",
    "    #?ins sc:name ?incname.\n",
    "    ?l sc:name ?pname.\n",
    "    ?p sc:name ?noteuro.\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ab8b627",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "5b3d574e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2356178'), ('country', 'France'), ('prev_currency', 'French Polynesian franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q214393'), ('country', 'France'), ('prev_currency', 'CFP Franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2616592'), ('country', 'France'), ('prev_currency', 'French West African franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2356117'), ('country', 'France'), ('prev_currency', 'New Caledonian franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q184172'), ('country', 'France'), ('prev_currency', 'French franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q16068'), ('country', 'Germany'), ('prev_currency', 'Deutsche Mark')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q129983'), ('country', 'Estonia'), ('prev_currency', 'Estonian kroon')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q133011'), ('country', 'Latvia'), ('prev_currency', 'Latvian lats')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q178874'), ('country', 'Slovakia'), ('prev_currency', 'Slovak koruna')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q208133'), ('country', 'Slovenia'), ('prev_currency', 'Slovenian tolar')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q189097'), ('country', 'Andorra'), ('prev_currency', 'peseta')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q184172'), ('country', 'Andorra'), ('prev_currency', 'French franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q193716'), ('country', 'Cyprus'), ('prev_currency', 'Cypriot pound')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3658911'), ('country', 'Malta'), ('prev_currency', 'Carlino')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q174467'), ('country', 'Malta'), ('prev_currency', 'Maltese lira')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1047040'), ('country', 'Monaco'), ('prev_currency', 'Monegasque franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q184172'), ('country', 'Monaco'), ('prev_currency', 'French franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q183354'), ('country', 'Vatican City'), ('prev_currency', 'Vatican lira')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1063029'), ('country', 'San Marino'), ('prev_currency', 'Sammarinese lira')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2836792'), ('country', 'Spain'), ('prev_currency', 'bora')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1402037'), ('country', 'Spain'), ('prev_currency', 'Spanish dinero')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q15634537'), ('country', 'Spain'), ('prev_currency', 'Spanish Guinea peseta')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1620502'), ('country', 'Spain'), ('prev_currency', 'Catalan peseta')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q189097'), ('country', 'Spain'), ('prev_currency', 'peseta')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q232415'), ('country', 'Belgium'), ('prev_currency', 'Belgian franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q13437153'), ('country', 'Belgium'), ('prev_currency', 'Belga')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q213940'), ('country', 'Luxembourg'), ('prev_currency', 'Luxembourg franc')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q203354'), ('country', 'Finland'), ('prev_currency', 'Finnish markka')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1130620'), ('country', 'Lithuania'), ('prev_currency', 'Lithuanian talonas')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25627'), ('country', 'Lithuania'), ('prev_currency', 'Lithuanian litas')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3658911'), ('country', 'Italy'), ('prev_currency', 'Carlino')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q208730'), ('country', 'Austria'), ('prev_currency', 'Austrian schilling')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1380156'), ('country', 'Greece'), ('prev_currency', 'Greek phoenix')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1546443'), ('country', 'Greece'), ('prev_currency', 'Greek drachma')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q468474'), ('country', 'Portugal'), ('prev_currency', 'Portuguese escudo')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1474367'), ('country', 'Portugal'), ('prev_currency', 'Moidore')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q836242'), ('country', 'Netherlands'), ('prev_currency', 'Albus')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q17434517'), ('country', 'Netherlands'), ('prev_currency', 'Flynt')]\n",
      "38\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "# write your queries\n",
    "# [('o', 'http://www.wikidata.org/entity/Q458'), ('oname', 'European Union'), ('p', 'http://www.wikidata.org/prop/direct/P463'), ('pname', 'member of')]\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#| `wdt:P31`     | instance of \n",
    "# wd:Q8142 -> Currency\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?country ?prev_currency\n",
    "#?pname  ?currencyname ?ins ?prev_currency ?country\n",
    "WHERE {\n",
    "  # country that used different currencies from now\n",
    "     wd:Q4916 wdt:P17 ?p .\n",
    "     #?p wdt:P38 ?cur.\n",
    "     ?IRI wdt:P31 wd:Q8142;\n",
    "         wdt:P17 ?p.\n",
    "     \n",
    "     \n",
    "    #?cur sc:name ?currencyname .\n",
    "    #?ins sc:name ?incname.\n",
    "    ?IRI sc:name ?prev_currency.\n",
    "    ?p sc:name ?country.\n",
    "    \n",
    "    Filter(str(?prev_currency) != \"euro\")\n",
    "    \n",
    "}\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e71386be",
   "metadata": {},
   "source": [
    "## Task 5\n",
    "Return all types of dollar in the world (US Dollar, Australian Dollar, ecc...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "b0aa5a14",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('s', 'http://www.wikidata.org/entity/Q170588'), ('sname', 'Republic of Texas'), ('o', 'http://www.wikidata.org/entity/Q3712659'), ('oname', 'Texas Dollar')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q1123960'), ('sname', 'Conch Republic'), ('o', 'http://www.wikidata.org/entity/Q19831166'), ('oname', 'Conch Dollar')]\n",
      "[('s', 'http://www.wikidata.org/entity/Q106827'), ('sname', 'Second Life'), ('o', 'http://www.wikidata.org/entity/Q100966169'), ('oname', 'Linden Dollar')]\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "#[ ('p', 'http://www.wikidata.org/prop/direct/P38'), ('name', 'currency')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?s ?sname ?o ?oname\n",
    "WHERE {\n",
    "   #\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "      ?o sc:name ?oname .\n",
    "      \n",
    "    FILTER(REGEX(?oname ,\"Dollar*\"^^xsd:string)) \n",
    "    \n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "e24e9a5c-66ca-4190-86c9-1caf7cd73b96",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q4917'), ('oname', 'United States dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2328868'), ('oname', 'Hawaiian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q686163'), ('oname', 'Confederate States dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q261447'), ('oname', 'Straits dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15039722'), ('oname', 'spanish dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q259502'), ('oname', 'Australian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1607372'), ('oname', 'Kiautschou dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2344772'), ('oname', 'Malayan dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q392858'), ('oname', 'Rhodesian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q209792'), ('oname', 'Jamaican dollar')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname \n",
    "WHERE {\n",
    "   #\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "      ?o sc:name ?oname .\n",
    "\n",
    "    FILTER(REGEX(?oname ,\"dollar*\"^^xsd:string)) \n",
    "    \n",
    "OPTIONAL {\n",
    "    #only country\n",
    "    ?s wdt:P17 ?o ;\n",
    "        sc:name ?sname .\n",
    "    }\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e1d512e4",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b1f51247",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('o', 'http://www.wikidata.org/entity/Q4917'), ('oname', 'United States dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2328868'), ('oname', 'Hawaiian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q686163'), ('oname', 'Confederate States dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q261447'), ('oname', 'Straits dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q15039722'), ('oname', 'spanish dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q259502'), ('oname', 'Australian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1607372'), ('oname', 'Kiautschou dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q3712659'), ('oname', 'Texas Dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2344772'), ('oname', 'Malayan dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q392858'), ('oname', 'Rhodesian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q209792'), ('oname', 'Jamaican dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q650834'), ('oname', 'Japanese government-issued dollar in Singapore, Malaya, North Borneo, Sarawak and Brunei')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2407759'), ('oname', 'Malaya and British Borneo dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1104069'), ('oname', 'Canadian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2411666'), ('oname', 'Newfoundland dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q26365'), ('oname', 'Eastern Caribbean dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q242988'), ('oname', 'Liberian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q202462'), ('oname', 'Namibian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q31015'), ('oname', 'Hong Kong dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q206319'), ('oname', 'Brunei dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q210478'), ('oname', 'Bermudian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q275112'), ('oname', 'Belize dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q194351'), ('oname', 'Barbadian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1472704'), ('oname', 'New Zealand dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q507737'), ('oname', 'Cook Islands dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q190951'), ('oname', 'Singapore dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4165057'), ('oname', 'Niue dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4165058'), ('oname', 'Pitcairn Islands dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q319885'), ('oname', 'Cayman Islands dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4406'), ('oname', 'Tuvaluan dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4597'), ('oname', 'Solomon Islands dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1049963'), ('oname', 'Kiribati dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q4592'), ('oname', 'Fijian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q202036'), ('oname', 'Surinamese dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q213005'), ('oname', 'Guyanese dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q242890'), ('oname', 'Trinidad and Tobago dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q194339'), ('oname', 'Bahamian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q208526'), ('oname', 'New Taiwan dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q352796'), ('oname', 'trade dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q942092'), ('oname', 'British West Indies dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2414453'), ('oname', 'Sarawak dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q19831166'), ('oname', 'Conch Dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q16080864'), ('oname', 'Province of Canada dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q2296365'), ('oname', 'British North Borneo dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1323382'), ('oname', 'New Brunswick dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q726666'), ('oname', 'Mongolian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q1934986'), ('oname', 'Nova Scotian dollar')]\n",
      "[('o', 'http://www.wikidata.org/entity/Q100966169'), ('oname', 'Linden Dollar')]\n",
      "48\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?o ?oname \n",
    "WHERE {\n",
    "   #currency\n",
    "   ?s wdt:P38 ?o ;\n",
    "      sc:name ?sname .\n",
    "      ?o sc:name ?oname .\n",
    "\n",
    "    FILTER(REGEX(?oname ,\"[Dd]ollar*\"^^xsd:string)) \n",
    "    \n",
    "OPTIONAL {\n",
    "    #only country\n",
    "    ?s wdt:P17 ?o ;\n",
    "        sc:name ?sname .\n",
    "    }\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "24c46262",
   "metadata": {},
   "source": [
    "## Task 6\n",
    "Return the currencies used in at least 2 different countries (return also the number of countries using each currency)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ea06eecb-996f-4be0-b69c-53839dcabb91",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('sname', 'South Vietnam Air Force'), ('oname', 'South Vietnam')]\n",
      "[('sname', 'religion in Greenland'), ('oname', 'Greenland')]\n",
      "[('sname', 'Freedom and Reform Party'), ('oname', 'Turkish Republic of Northern Cyprus')]\n",
      "[('sname', 'Military of Northern Cyprus'), ('oname', 'Turkish Republic of Northern Cyprus')]\n",
      "[('sname', 'flora of the Dominican Republic'), ('oname', 'Dominican Republic')]\n",
      "[('sname', 'Dominican Republic at the Pan American Games'), ('oname', 'Dominican Republic')]\n",
      "[('sname', 'ambassador of France to Guinea-Bissau'), ('oname', 'Guinea-Bissau')]\n",
      "[('sname', 'Alliance for Democracy and Development'), ('oname', 'Cameroon')]\n",
      "[('sname', '1997 in Cape Verde'), ('oname', 'Cape Verde')]\n",
      "[('sname', '2000 in Cape Verde'), ('oname', 'Cape Verde')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "##from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sname ?oname \n",
    "WHERE {\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?o ;\n",
    "      sc:name ?sname .\n",
    "      ?o sc:name ?oname .\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "38b6c029-6a55-4c28-9579-76f089fad909",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'First Republic of South Korea'), ('currencyname', 'South Korean won')]\n",
      "[('countryname', 'Nyasaland'), ('currencyname', 'Southern Rhodesian pound')]\n",
      "[('countryname', 'Fourth Republic of South Korea'), ('currencyname', 'South Korean won')]\n",
      "[('countryname', 'Bophuthatswana'), ('currencyname', 'South African rand')]\n",
      "[('countryname', 'East Francia'), ('currencyname', 'solidus')]\n",
      "[('countryname', 'East Francia'), ('currencyname', 'Tremissis')]\n",
      "[('countryname', 'East Francia'), ('currencyname', 'denarius')]\n",
      "[('countryname', 'East Francia'), ('currencyname', 'pfennig')]\n",
      "[('countryname', 'Kingdom of Hawaiʻi'), ('currencyname', 'Hawaiian dollar')]\n",
      "[('countryname', 'Kingdom of Hawaiʻi'), ('currencyname', 'United States dollar')]\n",
      "[('countryname', 'South Vietnam'), ('currencyname', 'South Vietnamese đồng')]\n",
      "[('countryname', \"People's Republic of Korea\"), ('currencyname', 'South Korean won')]\n",
      "[('countryname', 'Uzbek Soviet Socialist Republic'), ('currencyname', 'Soviet ruble')]\n",
      "[('countryname', 'Free City of Kraków'), ('currencyname', 'Kraków złoty')]\n",
      "[('countryname', 'Free City of Kraków'), ('currencyname', 'złoty')]\n",
      "[('countryname', 'Kingdom of Lombardy–Venetia'), ('currencyname', 'Austro-Hungarian gulden')]\n",
      "[('countryname', 'Kingdom of Lombardy–Venetia'), ('currencyname', 'Lombardy-Venetia pound')]\n",
      "[('countryname', 'Chechen Republic of Ichkeria'), ('currencyname', 'Chechen naxar')]\n",
      "[('countryname', 'Chechen Republic of Ichkeria'), ('currencyname', 'Russian ruble')]\n",
      "[('countryname', \"Mongolian People's Republic\"), ('currencyname', 'tugrik')]\n",
      "[('countryname', 'Straits Settlements'), ('currencyname', 'Straits dollar')]\n",
      "[('countryname', 'Timurid Empire'), ('currencyname', 'dinar')]\n",
      "[('countryname', 'Free State of Fiume'), ('currencyname', 'Italian lira')]\n",
      "[('countryname', 'Free State of Fiume'), ('currencyname', 'Fiume krone')]\n",
      "[('countryname', 'Sui dynasty'), ('currencyname', 'ancient Chinese coinage')]\n",
      "[('countryname', \"Tuvan People's Republic\"), ('currencyname', 'Tuvan akşa')]\n",
      "[('countryname', 'Francoist Spain'), ('currencyname', 'peseta')]\n",
      "[('countryname', 'Republic of Ragusa'), ('currencyname', 'Artiluc')]\n",
      "[('countryname', 'Somali Democratic Republic'), ('currencyname', 'Somali shilling')]\n",
      "[('countryname', 'French Indochina'), ('currencyname', 'French Indochinese piastre')]\n",
      "[('countryname', 'Surinam'), ('currencyname', 'Surinamese guilder')]\n",
      "[('countryname', 'Surinam'), ('currencyname', 'Dutch guilder')]\n",
      "[('countryname', 'Chagatai Khanate'), ('currencyname', 'coin')]\n",
      "[('countryname', 'Mataram Sultanate'), ('currencyname', 'dinar')]\n",
      "[('countryname', 'Mataram Sultanate'), ('currencyname', 'Netherlands Indies gulden')]\n",
      "[('countryname', 'Mataram Sultanate'), ('currencyname', 'dirham')]\n",
      "[('countryname', 'French India'), ('currencyname', 'French Indian rupee')]\n",
      "[('countryname', 'SimNation'), ('currencyname', 'Simoleon')]\n",
      "[('countryname', 'Siberian Republic'), ('currencyname', 'Banknotes of Siberian Provisional Government')]\n",
      "[('countryname', 'French Union'), ('currencyname', 'French franc')]\n",
      "[('countryname', 'United States of Colombia'), ('currencyname', 'Colombian peso')]\n",
      "[('countryname', 'Malacca sultanate'), ('currencyname', 'Tin ingot')]\n",
      "[('countryname', 'Song'), ('currencyname', 'ancient Chinese coinage')]\n",
      "[('countryname', 'Kingdom of Tahiti'), ('currencyname', 'French franc')]\n",
      "[('countryname', 'Kingdom of Tahiti'), ('currencyname', 'pound sterling')]\n",
      "[('countryname', 'Danish India'), ('currencyname', 'Danish Indian rupee')]\n",
      "[('countryname', 'Liberland'), ('currencyname', 'Merit')]\n",
      "[('countryname', 'Russian Republic'), ('currencyname', 'Kerenka')]\n",
      "[('countryname', 'Russian Republic'), ('currencyname', 'rubles')]\n",
      "[('countryname', 'Ukrainian State'), ('currencyname', 'Ukrainian karbovanets')]\n",
      "50\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# binding the country and currency properties\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?countryname ?currencyname \n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 50\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "13361318-8386-474d-8b90-f86fadc36359",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '3645924')]\n",
      "[('currencyname', 'United States dollar'), ('countryCount', '1483878')]\n",
      "[('currencyname', 'pound sterling'), ('countryCount', '1016077')]\n",
      "[('currencyname', 'renminbi'), ('countryCount', '895554')]\n",
      "[('currencyname', 'Indian rupee'), ('countryCount', '764912')]\n",
      "[('currencyname', 'Russian ruble'), ('countryCount', '409701')]\n",
      "[('currencyname', 'Norwegian krone'), ('countryCount', '400320')]\n",
      "[('currencyname', 'Swedish krona'), ('countryCount', '389610')]\n",
      "[('currencyname', 'Canadian dollar'), ('countryCount', '379924')]\n",
      "[('currencyname', 'Mexican peso'), ('countryCount', '360834')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# counting the contries using the same currency\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?currencyname (COUNT(?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "d20eb094-4a5a-4d22-8f95-1b0d5dfdbf53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'Verdis'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Montenegro'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Latvia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Monaco'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Catalan Republic'), ('currencyname', 'euro')]\n",
      "[('countryname', 'France'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Belgium'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Greece'), ('currencyname', 'euro')]\n",
      "[('countryname', 'French Southern and Antarctic Lands'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Slovakia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Malta'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Austria'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Martinique'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Kosovo'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Estonia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Andorra'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Kingdom of the Netherlands'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Guadeloupe'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Åland'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Alicante'), ('currencyname', 'euro')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "#want to check is the query really represents only countries are using euro or something else too \n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?countryname ?currencyname #(COUNT(?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 wd:Q4916 ;\n",
    "      sc:name ?countryname .\n",
    "      wd:Q4916 sc:name ?currencyname .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "#ORDER BY DESC (?countryCount)\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "260558b8-94c1-4abb-82ab-d9643b578f84",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country'), ('oname', 'Italy')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "#double checking the predicate country, maybe there any others\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?oname \n",
    "WHERE {\n",
    "   #looking for properties of country predicate\n",
    "   wd:Q38 ?p ?o .\n",
    "     ?p sc:name ?pname .\n",
    "     ?o sc:name ?oname .\n",
    "     \n",
    "FILTER(REGEX(?pname , \"[Cc]ountry*\"^^xsd:string)) .\n",
    "\n",
    "}\n",
    "\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "44fb9559-813c-47e0-b650-e647760b82be",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('countryname', 'Verdis'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Montenegro'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Monaco'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Latvia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Catalan Republic'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Belgium'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Greece'), ('currencyname', 'euro')]\n",
      "[('countryname', 'France'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Austria'), ('currencyname', 'euro')]\n",
      "[('countryname', 'French Southern and Antarctic Lands'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Slovakia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Malta'), ('currencyname', 'euro')]\n",
      "[('countryname', 'European Economic Community'), ('currencyname', 'European Currency Unit')]\n",
      "[('countryname', 'Martinique'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Kosovo'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Guadeloupe'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Åland'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Kingdom of the Netherlands'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Estonia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Andorra'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Vatican City'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Spain'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Finland'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Netherlands'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Alicante'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Germany'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Réunion'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Saint Pierre and Miquelon'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Portugal'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Slovenia'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Lithuania'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Italy'), ('currencyname', 'euro')]\n",
      "[('countryname', 'European Union'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Serbia and Montenegro'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Saint Barthélemy'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Saint Martin (French part)'), ('currencyname', 'euro')]\n",
      "[('countryname', 'San Marino'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Ireland'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Luxembourg'), ('currencyname', 'euro')]\n",
      "[('countryname', 'French Guiana'), ('currencyname', 'euro')]\n",
      "[('countryname', 'Cyprus'), ('currencyname', 'euro')]\n",
      "41\n"
     ]
    }
   ],
   "source": [
    "#checking how many countries using euro\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?countryname ?currencyname #(COUNT(?country) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?city wdt:P17 ?country .\n",
    "   #looking for properties of currency predicate\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "      \n",
    "FILTER(REGEX(?currencyname , \"[Ee]uro*\"^^xsd:string)) .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "#ORDER BY DESC (?countryCount)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1e50f773",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '40')]\n",
      "[('currencyname', 'European Currency Unit'), ('countryCount', '1')]\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "#added distinct to the countries for the quiry not to count repeated names of the countries\n",
    "#[('o', 'http://www.wikidata.org/entity/Q4916'), ('oname', 'euro')\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currencyname (COUNT(distinct ?country) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?city wdt:P17 ?country .\n",
    "   #looking for properties of currency predicate\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "      \n",
    "FILTER(REGEX(?currencyname , \"[Ee]uro*\"^^xsd:string)) .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "3d92e583-4733-4813-942e-61a3d3113363",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '40')]\n",
      "[('currencyname', 'pound sterling'), ('countryCount', '28')]\n",
      "[('currencyname', 'United States dollar'), ('countryCount', '22')]\n",
      "[('currencyname', 'Soviet ruble'), ('countryCount', '20')]\n",
      "[('currencyname', 'French franc'), ('countryCount', '18')]\n",
      "[('currencyname', 'dinar'), ('countryCount', '13')]\n",
      "[('currencyname', 'peseta'), ('countryCount', '11')]\n",
      "[('currencyname', 'Egyptian pound'), ('countryCount', '11')]\n",
      "[('currencyname', 'Canadian dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'ancient Chinese coinage'), ('countryCount', '10')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# counting the contries using the same currency\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?currencyname (COUNT(distinct ?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "d9de8303-cf42-48c6-881f-c53e65cd5b59",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '40')]\n",
      "[('currencyname', 'pound sterling'), ('countryCount', '28')]\n",
      "[('currencyname', 'United States dollar'), ('countryCount', '22')]\n",
      "[('currencyname', 'Soviet ruble'), ('countryCount', '20')]\n",
      "[('currencyname', 'French franc'), ('countryCount', '18')]\n",
      "[('currencyname', 'dinar'), ('countryCount', '13')]\n",
      "[('currencyname', 'peseta'), ('countryCount', '11')]\n",
      "[('currencyname', 'Egyptian pound'), ('countryCount', '11')]\n",
      "[('currencyname', 'Canadian dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'ancient Chinese coinage'), ('countryCount', '10')]\n",
      "[('currencyname', 'Russian ruble'), ('countryCount', '10')]\n",
      "[('currencyname', 'Eastern Caribbean dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'West African CFA franc'), ('countryCount', '9')]\n",
      "[('currencyname', 'Yugoslav dinar'), ('countryCount', '8')]\n",
      "[('currencyname', 'Australian dollar'), ('countryCount', '8')]\n",
      "[('currencyname', 'Central African CFA franc'), ('countryCount', '8')]\n",
      "[('currencyname', 'East African shilling'), ('countryCount', '8')]\n",
      "[('currencyname', 'dirham'), ('countryCount', '7')]\n",
      "[('currencyname', 'Spanish real'), ('countryCount', '7')]\n",
      "[('currencyname', 'South African rand'), ('countryCount', '7')]\n",
      "[('currencyname', 'Afghan afghani'), ('countryCount', '7')]\n",
      "[('currencyname', 'Indian rupee'), ('countryCount', '6')]\n",
      "[('currencyname', 'denarius'), ('countryCount', '6')]\n",
      "[('currencyname', 'South Korean won'), ('countryCount', '6')]\n",
      "[('currencyname', 'Czechoslovak koruna'), ('countryCount', '6')]\n",
      "[('currencyname', 'Congolese franc'), ('countryCount', '6')]\n",
      "[('currencyname', 'Reichsmark'), ('countryCount', '6')]\n",
      "[('currencyname', 'Iraqi dinar'), ('countryCount', '6')]\n",
      "[('currencyname', 'złoty'), ('countryCount', '6')]\n",
      "[('currencyname', 'Dutch guilder'), ('countryCount', '6')]\n",
      "[('currencyname', 'British West African pound'), ('countryCount', '5')]\n",
      "[('currencyname', 'Netherlands Antillean guilder'), ('countryCount', '5')]\n",
      "[('currencyname', 'French Indochinese piastre'), ('countryCount', '5')]\n",
      "[('currencyname', 'Austro-Hungarian gulden'), ('countryCount', '5')]\n",
      "[('currencyname', 'Syrian pound'), ('countryCount', '5')]\n",
      "[('currencyname', 'Reichsthaler'), ('countryCount', '5')]\n",
      "[('currencyname', 'New Zealand dollar'), ('countryCount', '5')]\n",
      "[('currencyname', 'Austro-Hungarian krone'), ('countryCount', '5')]\n",
      "[('currencyname', 'CFA franc'), ('countryCount', '5')]\n",
      "[('currencyname', 'Italian lira'), ('countryCount', '5')]\n",
      "[('currencyname', 'Ottoman lira'), ('countryCount', '4')]\n",
      "[('currencyname', 'Iranian toman'), ('countryCount', '4')]\n",
      "[('currencyname', 'Japanese yen'), ('countryCount', '4')]\n",
      "[('currencyname', 'Bulgarian lev'), ('countryCount', '4')]\n",
      "[('currencyname', 'Portuguese real'), ('countryCount', '4')]\n",
      "[('currencyname', 'rubles'), ('countryCount', '4')]\n",
      "[('currencyname', 'solidus'), ('countryCount', '4')]\n",
      "[('currencyname', 'new shekel'), ('countryCount', '4')]\n",
      "[('currencyname', 'German Papiermark'), ('countryCount', '4')]\n",
      "[('currencyname', 'Turkish lira'), ('countryCount', '4')]\n",
      "[('currencyname', 'thaler'), ('countryCount', '4')]\n",
      "[('currencyname', 'peso'), ('countryCount', '4')]\n",
      "[('currencyname', 'Colombian peso'), ('countryCount', '4')]\n",
      "[('currencyname', 'forint'), ('countryCount', '4')]\n",
      "[('currencyname', 'Deutsche Mark'), ('countryCount', '4')]\n",
      "[('currencyname', 'Greek drachma'), ('countryCount', '4')]\n",
      "[('currencyname', 'rupee'), ('countryCount', '4')]\n",
      "[('currencyname', 'Serbian dinar'), ('countryCount', '4')]\n",
      "[('currencyname', 'birr'), ('countryCount', '4')]\n",
      "[('currencyname', 'Romanian leu'), ('countryCount', '4')]\n",
      "[('currencyname', 'German gold mark'), ('countryCount', '4')]\n",
      "[('currencyname', 'hryvnia'), ('countryCount', '3')]\n",
      "[('currencyname', 'pfennig'), ('countryCount', '3')]\n",
      "[('currencyname', 'riel'), ('countryCount', '3')]\n",
      "[('currencyname', 'Roman currency'), ('countryCount', '3')]\n",
      "[('currencyname', 'Georgian lari'), ('countryCount', '3')]\n",
      "[('currencyname', 'Guyanese dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Somali shilling'), ('countryCount', '3')]\n",
      "[('currencyname', 'convertible mark'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hong Kong dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Straits dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'spanish dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Milanese scudo'), ('countryCount', '3')]\n",
      "[('currencyname', 'Libyan dinar'), ('countryCount', '3')]\n",
      "[('currencyname', 'French livre'), ('countryCount', '3')]\n",
      "[('currencyname', 'Roman scudo'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hawaiian dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Danish krone'), ('countryCount', '3')]\n",
      "[('currencyname', 'barter'), ('countryCount', '3')]\n",
      "[('currencyname', 'East African rupee'), ('countryCount', '3')]\n",
      "[('currencyname', 'Korean mun'), ('countryCount', '3')]\n",
      "[('currencyname', 'Chinese yuan'), ('countryCount', '3')]\n",
      "[('currencyname', 'British West Indies dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Jordanian dinar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Polish marka'), ('countryCount', '3')]\n",
      "[('currencyname', 'Southern Rhodesian pound'), ('countryCount', '3')]\n",
      "[('currencyname', 'Azerbaijani manat'), ('countryCount', '3')]\n",
      "[('currencyname', 'Moroccan dirham'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hungarian korona'), ('countryCount', '3')]\n",
      "[('currencyname', 'Vietnamese dong'), ('countryCount', '3')]\n",
      "[('currencyname', 'Malaysian ringgit'), ('countryCount', '3')]\n",
      "[('currencyname', 'Pakistani rupee'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hungarian pengő'), ('countryCount', '2')]\n",
      "[('currencyname', 'Aruban florin'), ('countryCount', '2')]\n",
      "[('currencyname', 'Parman lira'), ('countryCount', '2')]\n",
      "[('currencyname', 'South German gulden'), ('countryCount', '2')]\n",
      "[('currencyname', 'Serbian perper'), ('countryCount', '2')]\n",
      "[('currencyname', 'Swiss franc'), ('countryCount', '2')]\n",
      "[('currencyname', 'Nigerian pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Italian Somaliland somalo'), ('countryCount', '2')]\n",
      "100\n"
     ]
    }
   ],
   "source": [
    "# counting the contries using the same currency and filering those which currency used less than 2 times \n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currencyname (COUNT(distinct ?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency .\n",
    "   ?currency sc:name ?currencyname.\n",
    "    ?country sc:name ?countryname .   \n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "HAVING(COUNT(distinct ?countryname)>=2)\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6bcb961e",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "4c9a1a2a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '40')]\n",
      "[('currencyname', 'pound sterling'), ('countryCount', '28')]\n",
      "[('currencyname', 'United States dollar'), ('countryCount', '22')]\n",
      "[('currencyname', 'Soviet ruble'), ('countryCount', '20')]\n",
      "[('currencyname', 'French franc'), ('countryCount', '18')]\n",
      "[('currencyname', 'dinar'), ('countryCount', '13')]\n",
      "[('currencyname', 'peseta'), ('countryCount', '11')]\n",
      "[('currencyname', 'Egyptian pound'), ('countryCount', '11')]\n",
      "[('currencyname', 'Canadian dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'ancient Chinese coinage'), ('countryCount', '10')]\n",
      "[('currencyname', 'Russian ruble'), ('countryCount', '10')]\n",
      "[('currencyname', 'Eastern Caribbean dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'West African CFA franc'), ('countryCount', '9')]\n",
      "[('currencyname', 'Yugoslav dinar'), ('countryCount', '8')]\n",
      "[('currencyname', 'Australian dollar'), ('countryCount', '8')]\n",
      "[('currencyname', 'Central African CFA franc'), ('countryCount', '8')]\n",
      "[('currencyname', 'East African shilling'), ('countryCount', '8')]\n",
      "[('currencyname', 'dirham'), ('countryCount', '7')]\n",
      "[('currencyname', 'Spanish real'), ('countryCount', '7')]\n",
      "[('currencyname', 'South African rand'), ('countryCount', '7')]\n",
      "[('currencyname', 'Afghan afghani'), ('countryCount', '7')]\n",
      "[('currencyname', 'Indian rupee'), ('countryCount', '6')]\n",
      "[('currencyname', 'denarius'), ('countryCount', '6')]\n",
      "[('currencyname', 'South Korean won'), ('countryCount', '6')]\n",
      "[('currencyname', 'Czechoslovak koruna'), ('countryCount', '6')]\n",
      "[('currencyname', 'Congolese franc'), ('countryCount', '6')]\n",
      "[('currencyname', 'Reichsmark'), ('countryCount', '6')]\n",
      "[('currencyname', 'Iraqi dinar'), ('countryCount', '6')]\n",
      "[('currencyname', 'złoty'), ('countryCount', '6')]\n",
      "[('currencyname', 'Dutch guilder'), ('countryCount', '6')]\n",
      "[('currencyname', 'British West African pound'), ('countryCount', '5')]\n",
      "[('currencyname', 'Netherlands Antillean guilder'), ('countryCount', '5')]\n",
      "[('currencyname', 'French Indochinese piastre'), ('countryCount', '5')]\n",
      "[('currencyname', 'Austro-Hungarian gulden'), ('countryCount', '5')]\n",
      "[('currencyname', 'Syrian pound'), ('countryCount', '5')]\n",
      "[('currencyname', 'Reichsthaler'), ('countryCount', '5')]\n",
      "[('currencyname', 'New Zealand dollar'), ('countryCount', '5')]\n",
      "[('currencyname', 'Austro-Hungarian krone'), ('countryCount', '5')]\n",
      "[('currencyname', 'CFA franc'), ('countryCount', '5')]\n",
      "[('currencyname', 'Italian lira'), ('countryCount', '5')]\n",
      "[('currencyname', 'Ottoman lira'), ('countryCount', '4')]\n",
      "[('currencyname', 'Iranian toman'), ('countryCount', '4')]\n",
      "[('currencyname', 'Japanese yen'), ('countryCount', '4')]\n",
      "[('currencyname', 'Bulgarian lev'), ('countryCount', '4')]\n",
      "[('currencyname', 'Portuguese real'), ('countryCount', '4')]\n",
      "[('currencyname', 'rubles'), ('countryCount', '4')]\n",
      "[('currencyname', 'solidus'), ('countryCount', '4')]\n",
      "[('currencyname', 'new shekel'), ('countryCount', '4')]\n",
      "[('currencyname', 'German Papiermark'), ('countryCount', '4')]\n",
      "[('currencyname', 'Turkish lira'), ('countryCount', '4')]\n",
      "[('currencyname', 'thaler'), ('countryCount', '4')]\n",
      "[('currencyname', 'peso'), ('countryCount', '4')]\n",
      "[('currencyname', 'Colombian peso'), ('countryCount', '4')]\n",
      "[('currencyname', 'forint'), ('countryCount', '4')]\n",
      "[('currencyname', 'Deutsche Mark'), ('countryCount', '4')]\n",
      "[('currencyname', 'Greek drachma'), ('countryCount', '4')]\n",
      "[('currencyname', 'rupee'), ('countryCount', '4')]\n",
      "[('currencyname', 'Serbian dinar'), ('countryCount', '4')]\n",
      "[('currencyname', 'birr'), ('countryCount', '4')]\n",
      "[('currencyname', 'Romanian leu'), ('countryCount', '4')]\n",
      "[('currencyname', 'German gold mark'), ('countryCount', '4')]\n",
      "[('currencyname', 'hryvnia'), ('countryCount', '3')]\n",
      "[('currencyname', 'pfennig'), ('countryCount', '3')]\n",
      "[('currencyname', 'riel'), ('countryCount', '3')]\n",
      "[('currencyname', 'Roman currency'), ('countryCount', '3')]\n",
      "[('currencyname', 'Georgian lari'), ('countryCount', '3')]\n",
      "[('currencyname', 'Guyanese dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Somali shilling'), ('countryCount', '3')]\n",
      "[('currencyname', 'convertible mark'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hong Kong dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Straits dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'spanish dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Milanese scudo'), ('countryCount', '3')]\n",
      "[('currencyname', 'Libyan dinar'), ('countryCount', '3')]\n",
      "[('currencyname', 'French livre'), ('countryCount', '3')]\n",
      "[('currencyname', 'Roman scudo'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hawaiian dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Danish krone'), ('countryCount', '3')]\n",
      "[('currencyname', 'barter'), ('countryCount', '3')]\n",
      "[('currencyname', 'East African rupee'), ('countryCount', '3')]\n",
      "[('currencyname', 'Korean mun'), ('countryCount', '3')]\n",
      "[('currencyname', 'Chinese yuan'), ('countryCount', '3')]\n",
      "[('currencyname', 'British West Indies dollar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Jordanian dinar'), ('countryCount', '3')]\n",
      "[('currencyname', 'Polish marka'), ('countryCount', '3')]\n",
      "[('currencyname', 'Southern Rhodesian pound'), ('countryCount', '3')]\n",
      "[('currencyname', 'Azerbaijani manat'), ('countryCount', '3')]\n",
      "[('currencyname', 'Moroccan dirham'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hungarian korona'), ('countryCount', '3')]\n",
      "[('currencyname', 'Vietnamese dong'), ('countryCount', '3')]\n",
      "[('currencyname', 'Malaysian ringgit'), ('countryCount', '3')]\n",
      "[('currencyname', 'Pakistani rupee'), ('countryCount', '3')]\n",
      "[('currencyname', 'Hungarian pengő'), ('countryCount', '2')]\n",
      "[('currencyname', 'Aruban florin'), ('countryCount', '2')]\n",
      "[('currencyname', 'Parman lira'), ('countryCount', '2')]\n",
      "[('currencyname', 'South German gulden'), ('countryCount', '2')]\n",
      "[('currencyname', 'Serbian perper'), ('countryCount', '2')]\n",
      "[('currencyname', 'Swiss franc'), ('countryCount', '2')]\n",
      "[('currencyname', 'Nigerian pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Italian Somaliland somalo'), ('countryCount', '2')]\n",
      "[('currencyname', 'Zairean zaire'), ('countryCount', '2')]\n",
      "[('currencyname', 'Knife money'), ('countryCount', '2')]\n",
      "[('currencyname', 'tugrik'), ('countryCount', '2')]\n",
      "[('currencyname', 'Gulf rupee'), ('countryCount', '2')]\n",
      "[('currencyname', 'Khwarazmi tenga'), ('countryCount', '2')]\n",
      "[('currencyname', 'Fijian dollar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Libyan pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Abbasi'), ('countryCount', '2')]\n",
      "[('currencyname', 'Grivna'), ('countryCount', '2')]\n",
      "[('currencyname', 'assignat'), ('countryCount', '2')]\n",
      "[('currencyname', 'Surinamese guilder'), ('countryCount', '2')]\n",
      "[('currencyname', 'Solomon Islands dollar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Netherlands Indies gulden'), ('countryCount', '2')]\n",
      "[('currencyname', 'Hungarian adópengő'), ('countryCount', '2')]\n",
      "[('currencyname', 'German East African rupie'), ('countryCount', '2')]\n",
      "[('currencyname', 'Armenian dram'), ('countryCount', '2')]\n",
      "[('currencyname', 'Iranian rial'), ('countryCount', '2')]\n",
      "[('currencyname', 'German Rentenmark'), ('countryCount', '2')]\n",
      "[('currencyname', 'Tremissis'), ('countryCount', '2')]\n",
      "[('currencyname', 'Tuscan pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Korean won'), ('countryCount', '2')]\n",
      "[('currencyname', 'Austrian krone'), ('countryCount', '2')]\n",
      "[('currencyname', 'Rhodesian dollar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Saar franc'), ('countryCount', '2')]\n",
      "[('currencyname', 'Malaya and British Borneo dollar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Sri Lankan rupee'), ('countryCount', '2')]\n",
      "[('currencyname', 'Sahrawi peseta'), ('countryCount', '2')]\n",
      "[('currencyname', 'Swedish riksdaler'), ('countryCount', '2')]\n",
      "[('currencyname', 'Canadian pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Albanian lek'), ('countryCount', '2')]\n",
      "[('currencyname', 'florin'), ('countryCount', '2')]\n",
      "[('currencyname', 'Spanish escudo'), ('countryCount', '2')]\n",
      "[('currencyname', 'Brazilian real'), ('countryCount', '2')]\n",
      "[('currencyname', 'Nepalese rupee'), ('countryCount', '2')]\n",
      "[('currencyname', 'Lao kip'), ('countryCount', '2')]\n",
      "[('currencyname', 'Faroese króna'), ('countryCount', '2')]\n",
      "[('currencyname', 'Algerian dinar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Mexican peso'), ('countryCount', '2')]\n",
      "[('currencyname', 'Sudanese pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Moldovan leu'), ('countryCount', '2')]\n",
      "[('currencyname', 'Sycee'), ('countryCount', '2')]\n",
      "[('currencyname', 'Finnish markka'), ('countryCount', '2')]\n",
      "[('currencyname', 'South African pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Djiboutian franc'), ('countryCount', '2')]\n",
      "[('currencyname', 'Latinum'), ('countryCount', '2')]\n",
      "[('currencyname', 'Chinese cash'), ('countryCount', '2')]\n",
      "[('currencyname', 'Kuwaiti dinar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Irish pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'Spade money'), ('countryCount', '2')]\n",
      "[('currencyname', 'Spanish maravedí'), ('countryCount', '2')]\n",
      "[('currencyname', 'Cuban peso'), ('countryCount', '2')]\n",
      "[('currencyname', 'kyat'), ('countryCount', '2')]\n",
      "[('currencyname', 'Mauritanian ouguiya'), ('countryCount', '2')]\n",
      "[('currencyname', 'guilder'), ('countryCount', '2')]\n",
      "[('currencyname', 'Ionian gazeta'), ('countryCount', '2')]\n",
      "[('currencyname', 'tael'), ('countryCount', '2')]\n",
      "[('currencyname', 'Shell money'), ('countryCount', '2')]\n",
      "[('currencyname', 'kuruş'), ('countryCount', '2')]\n",
      "[('currencyname', 'gold dinar'), ('countryCount', '2')]\n",
      "[('currencyname', 'Burundian franc'), ('countryCount', '2')]\n",
      "[('currencyname', 'Luccan pound'), ('countryCount', '2')]\n",
      "[('currencyname', 'South Vietnamese đồng'), ('countryCount', '2')]\n",
      "[('currencyname', 'gold rouble'), ('countryCount', '2')]\n",
      "[('currencyname', 'ducat'), ('countryCount', '2')]\n",
      "[('currencyname', 'Philippine peso'), ('countryCount', '2')]\n",
      "[('currencyname', 'North Yemeni rial'), ('countryCount', '2')]\n",
      "166\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?currencyname (COUNT(distinct ?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency .\n",
    "   ?currency sc:name ?currencyname.\n",
    "    ?country sc:name ?countryname .   \n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "HAVING(COUNT(distinct ?countryname)>=2)\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 200\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9aaca2a",
   "metadata": {},
   "source": [
    "## Task 7\n",
    "Consider the currencies obtained in task 6, for each currency return the number of people using that currency (hint: consider the maximum popolation available for each country)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "b3289592-37c3-4b48-a028-48b9bdfbd22f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('pname', 'population'), ('o', '60317000')]\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?p ?pname ?o\n",
    "WHERE {\n",
    "\n",
    "   #looking for the population of Italy\n",
    "     wd:Q38 ?p ?o .\n",
    "   ?p sc:name ?pname .\n",
    "    FILTER(REGEX(?pname, \"[Pp]opulation*\"^^xsd:string))\n",
    "\n",
    "}\n",
    "\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "e106441e-66ed-43d6-b85c-35b5507ab06b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "Empty\n"
     ]
    }
   ],
   "source": [
    "#[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('pname', 'population'), ('o', '60317000')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?sname ?oname\n",
    "WHERE {\n",
    "  ?s wdt:P1082 ?o ;\n",
    "      sc:name ?sname .\n",
    "      ?o sc:name ?oname \n",
    "\n",
    "}\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "e9aee903",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('currencyname', 'euro'), ('countryCount', '40')]\n",
      "[('currencyname', 'pound sterling'), ('countryCount', '28')]\n",
      "[('currencyname', 'United States dollar'), ('countryCount', '22')]\n",
      "[('currencyname', 'Soviet ruble'), ('countryCount', '20')]\n",
      "[('currencyname', 'French franc'), ('countryCount', '18')]\n",
      "[('currencyname', 'dinar'), ('countryCount', '13')]\n",
      "[('currencyname', 'peseta'), ('countryCount', '11')]\n",
      "[('currencyname', 'Egyptian pound'), ('countryCount', '11')]\n",
      "[('currencyname', 'Canadian dollar'), ('countryCount', '10')]\n",
      "[('currencyname', 'ancient Chinese coinage'), ('countryCount', '10')]\n",
      "10\n"
     ]
    }
   ],
   "source": [
    "# write your queries\n",
    "# counting the contries using the same currency\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT  ?currencyname (COUNT(distinct ?countryname) AS ?countryCount) #counting in how many countries the currency used\n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?s wdt:P17 ?country .\n",
    "   ?country wdt:P38 ?currency ;\n",
    "      sc:name ?countryname .\n",
    "      ?currency sc:name ?currencyname .\n",
    "\n",
    "}\n",
    "\n",
    "GROUP BY ?currencyname\n",
    "\n",
    "ORDER BY DESC (?countryCount)\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62875498",
   "metadata": {},
   "source": [
    "Final query for this task"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "c1516a46",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q184172'), ('Currency', 'French franc'), ('Population', '67180549')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3778763'), ('Currency', 'assignation ruble'), ('Population', '485556621')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q25344'), ('Currency', 'Swiss franc'), ('Population', '8503939')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q718954'), ('Currency', 'Old Taiwan dollar'), ('Population', '23593794')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2273865'), ('Currency', 'Italian Somaliland somalo'), ('Population', '11031386')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1620502'), ('Currency', 'Catalan peseta'), ('Population', '46733038')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q2273855'), ('Currency', 'Italian Somaliland rupia'), ('Population', '100426000')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q56302633'), ('Currency', 'Ouguiya (1973-2017)'), ('Population', '5542397')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3935770'), ('Currency', 'Danish West Indian rigsdaler'), ('Population', '27000')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q232415'), ('Currency', 'Belgian franc'), ('Population', '11431406')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q39099'), ('Currency', 'renminbi'), ('Population', '1443497378')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q106615827'), ('Currency', 'reis brancos'), ('Population', '20966000')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q599170'), ('Currency', 'Antoninianus'), ('Population', '50000000')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q1148329'), ('Currency', 'SUCRE'), ('Population', '28515829')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q897424'), ('Currency', 'Hungarian korona'), ('Population', '9769526')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q73016560'), ('Currency', 'Unidad de Valor Real'), ('Population', '49065615')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q15634537'), ('Currency', 'Spanish Guinea peseta'), ('Population', '46733038')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q203567'), ('Currency', 'Nigerian naira'), ('Population', '190886311')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q3973271'), ('Currency', 'Palestine pound'), ('Population', '10857520')]\n",
      "[('IRI', 'http://www.wikidata.org/entity/Q208730'), ('Currency', 'Austrian schilling'), ('Population', '8809212')]\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "# write your final query\n",
    "\n",
    "\n",
    "# write your queries\n",
    "# counting the contries using the same currency\n",
    "# wd:Q8142 -> Currency\n",
    "#from task 2 [('p', 'http://www.wikidata.org/prop/direct/P17'), ('pname', 'country')]\n",
    "#[('p', 'http://www.wikidata.org/prop/direct/P1082'), ('pname', 'population'), ('o', '60317000')]\n",
    "\n",
    "queryString = \"\"\"\n",
    "SELECT DISTINCT ?IRI ?Currency  (SUM(?pop) AS ?Population) #counting in how many people use the currency \n",
    "WHERE {\n",
    "\n",
    "   #looking for properties of country predicate\n",
    "   ?IRI wdt:P31 wd:Q8142;\n",
    "        wdt:P17 ?country.\n",
    "        \n",
    "   ?country wdt:P1082 ?pop . \n",
    "   \n",
    "   ?IRI sc:name ?Currency.\n",
    "\n",
    "}\n",
    "\n",
    "Group by ?Currency ?IRI\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "print(\"Results\")\n",
    "x=run_query(queryString)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "af7937d9-64b0-4454-a125-4b6c43c639b9",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
